; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/metal.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/metal.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_metal_device = type opaque
%struct.halide_metal_command_queue = type opaque
%"class.Halide::Internal::GPUCompilationCache" = type { %struct.halide_mutex, i32, %"struct.Halide::Internal::GPUCompilationCache<halide_metal_device *, Halide::Runtime::Internal::Metal::mtl_library *>::CachedCompilation"*, i32, i32 }
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Internal::GPUCompilationCache<halide_metal_device *, Halide::Runtime::Internal::Metal::mtl_library *>::CachedCompilation" = type { %struct.halide_metal_device*, %"struct.Halide::Runtime::Internal::Metal::mtl_library"*, i32, i32 }
%"struct.Halide::Runtime::Internal::Metal::mtl_library" = type opaque
%"struct.Halide::Runtime::Internal::Metal::command_buffer_completed_handler_block_descriptor_1" = type { i32, i32 }
%struct.ObjectiveCClass = type opaque
%"struct.Halide::Runtime::Internal::Metal::command_buffer_completed_handler_block_literal" = type { i8*, i32, i32, void (%"struct.Halide::Runtime::Internal::Metal::command_buffer_completed_handler_block_literal"*, %"struct.Halide::Runtime::Internal::Metal::mtl_command_buffer"*)*, %"struct.Halide::Runtime::Internal::Metal::command_buffer_completed_handler_block_descriptor_1"* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "thread_lock", linkageName: "_ZN6Halide7Runtime8Internal5Metal11thread_lockE", scope: !2, file: !6, line: 283, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Metal", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/metal.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !10, file: !9, line: 11, baseType: !22)
!9 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !9, line: 9, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !11, identifier: "_ZTSN6Halide7Runtime8Internal14ScopedSpinLockE")
!11 = !{!12, !15, !19}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !10, file: !9, line: 13, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!15 = !DISubprogram(name: "ScopedSpinLock", scope: !10, file: !9, line: 15, type: !16, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !14}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!19 = !DISubprogram(name: "~ScopedSpinLock", scope: !10, file: !9, line: 22, type: !20, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !18}
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "device", linkageName: "_ZN6Halide7Runtime8Internal5Metal6deviceE", scope: !2, file: !6, line: 284, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtl_device", scope: !2, file: !6, line: 24, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_metal_device", file: !28, line: 73, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS19halide_metal_device")
!28 = !DIFile(filename: "src/runtime/HalideRuntimeMetal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "queue", linkageName: "_ZN6Halide7Runtime8Internal5Metal5queueE", scope: !2, file: !6, line: 285, type: !31, isLocal: false, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtl_command_queue", scope: !2, file: !6, line: 25, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_metal_command_queue", file: !28, line: 74, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS26halide_metal_command_queue")
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "_ZN6Halide7Runtime8Internal5Metal17compilation_cacheE", scope: !2, file: !6, line: 292, type: !36, isLocal: false, isDefinition: true)
!36 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<halide_metal_device *, Halide::Runtime::Internal::Metal::mtl_library *>", scope: !38, file: !37, line: 8, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !39, templateParams: !105, identifier: "_ZTSN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEEE")
!37 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!38 = !DINamespace(name: "Internal", scope: !5)
!39 = !{!40, !52, !55, !58, !59, !74, !75, !77, !78, !79, !82, !89, !94, !99, !102}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !36, file: !37, line: 22, baseType: !41, size: 32)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !42, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !43, identifier: "_ZTS12halide_mutex")
!42 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!43 = !{!44}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !41, file: !42, line: 121, baseType: !45, size: 32)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !50)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !47, line: 68, baseType: !48)
!47 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 12, baseType: !49)
!49 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !36, file: !37, line: 24, baseType: !53, flags: DIFlagStaticMember, extraData: float 5.000000e-01)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !36, file: !37, line: 25, baseType: !56, flags: DIFlagStaticMember, extraData: i32 7)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !36, file: !37, line: 26, baseType: !57, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !36, file: !37, line: 27, baseType: !60, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !36, file: !37, line: 9, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !62, identifier: "_ZTSN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE17CachedCompilationE")
!62 = !{!63, !65, !68, !69, !70}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !61, file: !37, line: 10, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !61, file: !37, line: 11, baseType: !66, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_library", scope: !2, file: !6, line: 31, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal11mtl_libraryE")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !61, file: !37, line: 12, baseType: !48, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !61, file: !37, line: 13, baseType: !48, size: 32, offset: 96)
!70 = !DISubprogram(name: "CachedCompilation", scope: !61, file: !37, line: 15, type: !71, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !64, !66, !48, !48}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !36, file: !37, line: 28, baseType: !57, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !36, file: !37, line: 30, baseType: !76, flags: DIFlagStaticMember, extraData: i32 0)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !36, file: !37, line: 31, baseType: !76, flags: DIFlagStaticMember, extraData: i32 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !36, file: !37, line: 33, baseType: !48, size: 32, offset: 128)
!79 = !DISubprogram(name: "kernel_hash", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE11kernel_hashES3_jj", scope: !36, file: !37, line: 36, type: !80, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!80 = !DISubroutineType(types: !81)
!81 = !{!46, !64, !48, !48}
!82 = !DISubprogram(name: "insert", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE6insertERKNS9_17CachedCompilationE", scope: !36, file: !37, line: 47, type: !83, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !86, !87}
!85 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!87 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!89 = !DISubprogram(name: "find_internal", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE13find_internalES3_jRPS8_i", scope: !36, file: !37, line: 73, type: !90, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{!85, !86, !64, !48, !92, !57}
!92 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!94 = !DISubprogram(name: "lookup", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE6lookupES3_PvRS8_", scope: !36, file: !37, line: 97, type: !95, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!95 = !DISubroutineType(types: !96)
!96 = !{!85, !86, !64, !97, !98}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !66, size: 32)
!99 = !DISubprogram(name: "resize_table", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE12resize_tableEi", scope: !36, file: !37, line: 108, type: !100, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!100 = !DISubroutineType(types: !101)
!101 = !{!85, !86, !57}
!102 = !DISubprogram(name: "release_hold", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIP19halide_metal_devicePNS_7Runtime8Internal5Metal11mtl_libraryEE12release_holdEPvS3_SA_", scope: !36, file: !37, line: 211, type: !103, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !86, !97, !64, !97}
!105 = !{!106, !107}
!106 = !DITemplateTypeParameter(name: "ContextT", type: !64)
!107 = !DITemplateTypeParameter(name: "ModuleStateT", type: !66)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "metal_api_supports_set_bytes", linkageName: "_ZN6Halide7Runtime8Internal5Metal28metal_api_supports_set_bytesE", scope: !2, file: !6, line: 296, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "metal_api_checked_device", linkageName: "_ZN6Halide7Runtime8Internal5Metal24metal_api_checked_deviceE", scope: !2, file: !6, line: 297, type: !25, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "command_buffer_completed_handler_descriptor", linkageName: "_ZN6Halide7Runtime8Internal5Metal43command_buffer_completed_handler_descriptorE", scope: !2, file: !6, line: 436, type: !114, isLocal: false, isDefinition: true)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command_buffer_completed_handler_block_descriptor_1", scope: !2, file: !6, line: 423, size: 64, flags: DIFlagTypePassByValue, elements: !115, identifier: "_ZTSN6Halide7Runtime8Internal5Metal51command_buffer_completed_handler_block_descriptor_1E")
!115 = !{!116, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !114, file: !6, line: 424, baseType: !117, size: 32)
!117 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !114, file: !6, line: 425, baseType: !117, size: 32, offset: 32)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "command_buffer_completed_handler_block", linkageName: "_ZN6Halide7Runtime8Internal5Metal38command_buffer_completed_handler_blockE", scope: !2, file: !6, line: 447, type: !121, isLocal: false, isDefinition: true)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command_buffer_completed_handler_block_literal", scope: !2, file: !6, line: 428, size: 160, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTSN6Halide7Runtime8Internal5Metal46command_buffer_completed_handler_block_literalE")
!122 = !{!123, !124, !125, !126, !133}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !121, file: !6, line: 429, baseType: !97, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !6, line: 430, baseType: !57, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !121, file: !6, line: 431, baseType: !57, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !121, file: !6, line: 432, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130, !131}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_command_buffer", scope: !2, file: !6, line: 27, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal18mtl_command_bufferE")
!133 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !121, file: !6, line: 433, baseType: !134, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "metal_device_interface", linkageName: "_ZN6Halide7Runtime8Internal5Metal22metal_device_interfaceE", scope: !2, file: !6, line: 1164, type: !137, isLocal: false, isDefinition: true)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !42, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !138, identifier: "_ZTS25halide_device_interface_t")
!138 = !{!139, !262, !266, !267, !271, !272, !273, !274, !275, !279, !284, !288, !289, !293, !294, !299}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !137, file: !42, line: 724, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!57, !97, !143, !150}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !42, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !145, identifier: "_ZTS15halide_buffer_t")
!145 = !{!146, !149, !152, !156, !157, !197, !199, !222, !223, !233, !237, !240, !241, !244, !245, !249, !252, !253, !254, !258, !261}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !144, file: !42, line: 1425, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 10, baseType: !148)
!148 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !144, file: !42, line: 1428, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !144, file: !42, line: 1433, baseType: !153, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 16, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !42, line: 1436, baseType: !147, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !42, line: 1439, baseType: !158, size: 32, offset: 192)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !42, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !159, identifier: "_ZTS13halide_type_t")
!159 = !{!160, !169, !170, !173, !177, !180, !185, !189, !190, !191, !194}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !158, file: !42, line: 434, baseType: !161, size: 8, align: 8)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !42, line: 413, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !42, line: 403, baseType: !154, size: 8, elements: !163, identifier: "_ZTS18halide_type_code_t")
!163 = !{!164, !165, !166, !167, !168}
!164 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!165 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!166 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!167 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!168 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !158, file: !42, line: 442, baseType: !154, size: 8, align: 8, offset: 8)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !158, file: !42, line: 446, baseType: !171, size: 16, align: 16, offset: 16)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !47, line: 14, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DISubprogram(name: "halide_type_t", scope: !158, file: !42, line: 453, type: !174, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !176, !161, !154, !171}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!177 = !DISubprogram(name: "halide_type_t", scope: !158, file: !42, line: 459, type: !178, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !176}
!180 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !158, file: !42, line: 463, type: !181, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubroutineType(types: !182)
!182 = !{!158, !183, !171}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!185 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !158, file: !42, line: 468, type: !186, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubroutineType(types: !187)
!187 = !{!85, !183, !188}
!188 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !184, size: 32)
!189 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !158, file: !42, line: 472, type: !186, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!190 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !158, file: !42, line: 476, type: !186, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!191 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !158, file: !42, line: 481, type: !192, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{!57, !183}
!194 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !158, file: !42, line: 485, type: !195, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubroutineType(types: !196)
!196 = !{!48, !183}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !144, file: !42, line: 1442, baseType: !198, size: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !47, line: 11, baseType: !57)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !144, file: !42, line: 1446, baseType: !200, size: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !42, line: 1409, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !42, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !203, identifier: "_ZTS18halide_dimension_t")
!203 = !{!204, !205, !206, !207, !208, !212, !215, !221}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !202, file: !42, line: 1383, baseType: !198, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !202, file: !42, line: 1383, baseType: !198, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !202, file: !42, line: 1383, baseType: !198, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !202, file: !42, line: 1386, baseType: !48, size: 32, offset: 96)
!208 = !DISubprogram(name: "halide_dimension_t", scope: !202, file: !42, line: 1388, type: !209, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!212 = !DISubprogram(name: "halide_dimension_t", scope: !202, file: !42, line: 1389, type: !213, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !211, !198, !198, !198, !48}
!215 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !202, file: !42, line: 1393, type: !216, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubroutineType(types: !217)
!217 = !{!85, !218, !220}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!220 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !219, size: 32)
!221 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !202, file: !42, line: 1400, type: !216, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !144, file: !42, line: 1449, baseType: !97, size: 32, offset: 288)
!223 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !144, file: !42, line: 1454, type: !224, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!224 = !DISubroutineType(types: !225)
!225 = !{!85, !226, !228}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !42, line: 1416, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 1415, baseType: !49, size: 32, elements: !230, identifier: "_ZTS19halide_buffer_flags")
!230 = !{!231, !232}
!231 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!232 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!233 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !144, file: !42, line: 1458, type: !234, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !236, !228, !85}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!237 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !144, file: !42, line: 1466, type: !238, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{!85, !226}
!240 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !144, file: !42, line: 1470, type: !238, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !144, file: !42, line: 1474, type: !242, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !236, !85}
!244 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !144, file: !42, line: 1478, type: !242, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!245 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !144, file: !42, line: 1485, type: !246, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !226}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 27, baseType: !49)
!249 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !144, file: !42, line: 1495, type: !250, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!153, !226}
!252 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !144, file: !42, line: 1506, type: !250, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !144, file: !42, line: 1518, type: !246, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !144, file: !42, line: 1523, type: !255, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!153, !226, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!258 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !144, file: !42, line: 1534, type: !259, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{!57, !236, !97}
!261 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !144, file: !42, line: 1545, type: !238, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !137, file: !42, line: 726, baseType: !263, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DISubroutineType(types: !265)
!265 = !{!57, !97, !143}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !137, file: !42, line: 727, baseType: !263, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !137, file: !42, line: 728, baseType: !268, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !97, !150}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !137, file: !42, line: 730, baseType: !263, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !137, file: !42, line: 731, baseType: !140, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !137, file: !42, line: 733, baseType: !140, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !137, file: !42, line: 735, baseType: !263, size: 32, offset: 224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !137, file: !42, line: 736, baseType: !276, size: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{!57, !97, !143, !150, !143}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !137, file: !42, line: 738, baseType: !280, size: 32, offset: 288)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DISubroutineType(types: !282)
!282 = !{!57, !97, !283, !143}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !137, file: !42, line: 740, baseType: !285, size: 32, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{!57, !97, !283, !57, !57, !143}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !137, file: !42, line: 742, baseType: !263, size: 32, offset: 352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !137, file: !42, line: 743, baseType: !290, size: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{!57, !97, !143, !147, !150}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !137, file: !42, line: 745, baseType: !263, size: 32, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !137, file: !42, line: 746, baseType: !295, size: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!57, !97, !298, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !137, file: !42, line: 747, baseType: !300, size: 32, offset: 480)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !303, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !304, identifier: "_ZTS30halide_device_interface_impl_t")
!303 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!304 = !{!305, !309, !310, !311, !312, !313, !317, !318, !319, !320, !321, !322, !323, !324, !325, !329}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !302, file: !303, line: 16, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DISubroutineType(types: !308)
!308 = !{null}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !302, file: !303, line: 17, baseType: !306, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !302, file: !303, line: 18, baseType: !263, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !302, file: !303, line: 19, baseType: !263, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !302, file: !303, line: 20, baseType: !263, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !302, file: !303, line: 21, baseType: !314, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DISubroutineType(types: !316)
!316 = !{!57, !97}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !302, file: !303, line: 22, baseType: !263, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !302, file: !303, line: 23, baseType: !263, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !302, file: !303, line: 24, baseType: !263, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !302, file: !303, line: 25, baseType: !263, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !302, file: !303, line: 26, baseType: !276, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !302, file: !303, line: 28, baseType: !280, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !302, file: !303, line: 31, baseType: !285, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !302, file: !303, line: 35, baseType: !263, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !302, file: !303, line: 37, baseType: !326, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DISubroutineType(types: !328)
!328 = !{!57, !97, !143, !147}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !302, file: !303, line: 38, baseType: !263, size: 32, offset: 480)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "total_dispatches", scope: !332, file: !6, line: 865, type: !198, isLocal: true, isDefinition: true)
!332 = distinct !DISubprogram(name: "halide_metal_run", scope: !6, file: !6, line: 723, type: !333, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !926)
!333 = !DISubroutineType(types: !334)
!334 = !{!57, !97, !97, !335, !57, !57, !57, !57, !57, !57, !57, !337, !338, !339, !57, !342, !57, !57}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !47, line: 15, baseType: !341)
!341 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!343 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !344, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !345, retainedTypes: !393, globals: !918, imports: !921, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/metal.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!345 = !{!162, !229, !346}
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !42, line: 990, baseType: !57, size: 32, elements: !347, identifier: "_ZTS19halide_error_code_t")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!348 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!349 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!350 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!351 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!352 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!353 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!354 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!355 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!356 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!357 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!358 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!359 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!360 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!361 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!362 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!363 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!364 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!365 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!366 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!367 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!368 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!369 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!370 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!371 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!372 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!373 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!374 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!375 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!376 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!377 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!378 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!379 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!380 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!381 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!382 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!383 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!384 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!385 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!386 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!387 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!388 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!389 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!390 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!391 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!392 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!393 = !{!97, !394, !147, !475, !488, !495, !500, !505, !515, !519, !532, !31, !542, !131, !554, !561, !572, !579, !583, !592, !596, !604, !622, !632, !640, !650, !665, !676, !687, !695, !710, !717, !725, !738, !743, !748, !762, !248, !775, !788, !800, !807, !812, !822, !25, !829, !480, !843, !910, !418, !400, !915, !153, !523, !46, !916, !917, !60, !48, !36}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !396, file: !395, line: 203, baseType: !397)
!395 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!396 = !DINamespace(scope: !3)
!397 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !396, file: !395, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !398, templateParams: !472)
!398 = !{!399, !401, !402, !403, !404, !405, !407, !411, !415, !420, !423, !426, !429, !433, !436, !441, !445, !448, !454, !457, !460, !465, !466, !469, !470, !471}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !397, file: !395, line: 32, baseType: !400, size: 32, flags: DIFlagPublic)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !397, file: !395, line: 32, baseType: !400, size: 32, offset: 32, flags: DIFlagPublic)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !397, file: !395, line: 32, baseType: !400, size: 32, offset: 64, flags: DIFlagPublic)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !397, file: !395, line: 33, baseType: !97, size: 32, offset: 96, flags: DIFlagPublic)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !397, file: !395, line: 34, baseType: !85, size: 8, offset: 128, flags: DIFlagPublic)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !397, file: !395, line: 35, baseType: !406, size: 8, offset: 136, flags: DIFlagPublic)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !50)
!407 = !DISubprogram(name: "Printer", scope: !397, file: !395, line: 37, type: !408, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410, !97, !400}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!411 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !397, file: !395, line: 57, type: !412, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !410, !335}
!414 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !397, size: 32)
!415 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !397, file: !395, line: 67, type: !416, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!416 = !DISubroutineType(types: !417)
!417 = !{!414, !410, !418}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !47, line: 9, baseType: !419)
!419 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!420 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !397, file: !395, line: 72, type: !421, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{!414, !410, !198}
!423 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !397, file: !395, line: 77, type: !424, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubroutineType(types: !425)
!425 = !{!414, !410, !147}
!426 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !397, file: !395, line: 82, type: !427, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DISubroutineType(types: !428)
!428 = !{!414, !410, !48}
!429 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !397, file: !395, line: 87, type: !430, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!430 = !DISubroutineType(types: !431)
!431 = !{!414, !410, !432}
!432 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!433 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !397, file: !395, line: 92, type: !434, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!414, !410, !54}
!436 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !397, file: !395, line: 97, type: !437, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubroutineType(types: !438)
!438 = !{!414, !410, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!441 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !397, file: !395, line: 102, type: !442, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!414, !410, !444}
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!445 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !397, file: !395, line: 108, type: !446, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubroutineType(types: !447)
!447 = !{!414, !410, !188}
!448 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !397, file: !395, line: 113, type: !449, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!414, !410, !451}
!451 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !42, line: 1550, baseType: !144)
!454 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !397, file: !395, line: 119, type: !455, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubroutineType(types: !456)
!456 = !{!335, !410}
!457 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !397, file: !395, line: 131, type: !458, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !410}
!460 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !397, file: !395, line: 139, type: !461, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!461 = !DISubroutineType(types: !462)
!462 = !{!147, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!465 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !397, file: !395, line: 143, type: !461, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !397, file: !395, line: 148, type: !467, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !410, !57}
!469 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !397, file: !395, line: 158, type: !455, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !397, file: !395, line: 162, type: !458, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DISubprogram(name: "~Printer", scope: !397, file: !395, line: 166, type: !458, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !{!473, !474}
!473 = !DITemplateValueParameter(name: "type", type: !57, value: i32 0)
!474 = !DITemplateValueParameter(name: "length", type: !148, value: i64 1024)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "pool_method", scope: !477, file: !476, line: 43, baseType: !484)
!476 = !DIFile(filename: "src/runtime/objc_support.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!477 = distinct !DISubprogram(name: "create_autorelease_pool", linkageName: "_ZN6Halide7Runtime8Internal23create_autorelease_poolEv", scope: !3, file: !476, line: 42, type: !478, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !481)
!478 = !DISubroutineType(types: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "objc_id", file: !476, line: 5, baseType: !97)
!481 = !{!482, !483}
!482 = !DILocalVariable(name: "method", scope: !477, file: !476, line: 44, type: !475)
!483 = !DILocalVariable(name: "pool", scope: !477, file: !476, line: 45, type: !480)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DISubroutineType(types: !486)
!486 = !{!480, !480, !487}
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "objc_sel", file: !476, line: 6, baseType: !97)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "drain_method", scope: !489, file: !476, line: 51, baseType: !484)
!489 = distinct !DISubprogram(name: "drain_autorelease_pool", linkageName: "_ZN6Halide7Runtime8Internal22drain_autorelease_poolEPv", scope: !3, file: !476, line: 50, type: !490, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !480}
!492 = !{!493, !494}
!493 = !DILocalVariable(name: "pool", arg: 1, scope: !489, file: !476, line: 50, type: !480)
!494 = !DILocalVariable(name: "method", scope: !489, file: !476, line: 52, type: !488)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "retain_method", scope: !496, file: !476, line: 57, baseType: !484)
!496 = distinct !DISubprogram(name: "retain_ns_object", linkageName: "_ZN6Halide7Runtime8Internal16retain_ns_objectEPv", scope: !3, file: !476, line: 56, type: !490, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !497)
!497 = !{!498, !499}
!498 = !DILocalVariable(name: "obj", arg: 1, scope: !496, file: !476, line: 56, type: !480)
!499 = !DILocalVariable(name: "method", scope: !496, file: !476, line: 58, type: !495)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "release_method", scope: !501, file: !476, line: 63, baseType: !484)
!501 = distinct !DISubprogram(name: "release_ns_object", linkageName: "_ZN6Halide7Runtime8Internal17release_ns_objectEPv", scope: !3, file: !476, line: 62, type: !490, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !502)
!502 = !{!503, !504}
!503 = !DILocalVariable(name: "obj", arg: 1, scope: !501, file: !476, line: 62, type: !480)
!504 = !DILocalVariable(name: "method", scope: !501, file: !476, line: 64, type: !500)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_method", scope: !506, file: !476, line: 70, baseType: !484)
!506 = distinct !DISubprogram(name: "wrap_string_as_ns_string", linkageName: "_ZN6Halide7Runtime8Internal24wrap_string_as_ns_stringEPKcj", scope: !3, file: !476, line: 68, type: !507, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!480, !335, !248}
!509 = !{!510, !511, !512, !513, !514}
!510 = !DILocalVariable(name: "string", arg: 1, scope: !506, file: !476, line: 68, type: !335)
!511 = !DILocalVariable(name: "length", arg: 2, scope: !506, file: !476, line: 68, type: !248)
!512 = !DILocalVariable(name: "method1", scope: !506, file: !476, line: 71, type: !505)
!513 = !DILocalVariable(name: "ns_string", scope: !506, file: !476, line: 72, type: !480)
!514 = !DILocalVariable(name: "method", scope: !506, file: !476, line: 73, type: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "init_with_bytes_no_copy_method", scope: !506, file: !476, line: 69, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DISubroutineType(types: !518)
!518 = !{!480, !480, !487, !335, !248, !248, !154}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "new_buffer_method", scope: !520, file: !6, line: 36, baseType: !529)
!520 = distinct !DISubprogram(name: "new_buffer", linkageName: "_ZN6Halide7Runtime8Internal5Metal10new_bufferEP19halide_metal_devicej", scope: !2, file: !6, line: 35, type: !521, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !525)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !25, !248}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_buffer", scope: !2, file: !6, line: 26, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal10mtl_bufferE")
!525 = !{!526, !527, !528}
!526 = !DILocalVariable(name: "device", arg: 1, scope: !520, file: !6, line: 35, type: !25)
!527 = !DILocalVariable(name: "length", arg: 2, scope: !520, file: !6, line: 35, type: !248)
!528 = !DILocalVariable(name: "method", scope: !520, file: !6, line: 37, type: !519)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DISubroutineType(types: !531)
!531 = !{!523, !480, !487, !248, !248}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "new_command_queue_method", scope: !533, file: !6, line: 43, baseType: !539)
!533 = distinct !DISubprogram(name: "new_command_queue", linkageName: "_ZN6Halide7Runtime8Internal5Metal17new_command_queueEP19halide_metal_device", scope: !2, file: !6, line: 42, type: !534, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!31, !25}
!536 = !{!537, !538}
!537 = !DILocalVariable(name: "device", arg: 1, scope: !533, file: !6, line: 42, type: !25)
!538 = !DILocalVariable(name: "method", scope: !533, file: !6, line: 44, type: !532)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{!31, !480, !487}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "new_command_buffer_method", scope: !543, file: !6, line: 51, baseType: !558)
!543 = distinct !DISubprogram(name: "new_command_buffer", linkageName: "_ZN6Halide7Runtime8Internal5Metal18new_command_bufferEP26halide_metal_command_queuePKcj", scope: !2, file: !6, line: 48, type: !544, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!131, !31, !335, !248}
!546 = !{!547, !548, !549, !550, !551, !552, !553}
!547 = !DILocalVariable(name: "queue", arg: 1, scope: !543, file: !6, line: 48, type: !31)
!548 = !DILocalVariable(name: "label", arg: 2, scope: !543, file: !6, line: 48, type: !335)
!549 = !DILocalVariable(name: "label_len", arg: 3, scope: !543, file: !6, line: 48, type: !248)
!550 = !DILocalVariable(name: "label_str", scope: !543, file: !6, line: 49, type: !480)
!551 = !DILocalVariable(name: "method", scope: !543, file: !6, line: 52, type: !542)
!552 = !DILocalVariable(name: "command_buffer", scope: !543, file: !6, line: 53, type: !131)
!553 = !DILocalVariable(name: "method1", scope: !543, file: !6, line: 56, type: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_label_method", scope: !543, file: !6, line: 55, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !480, !487, !480}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{!131, !480, !487}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "add_completed_handler_method", scope: !562, file: !6, line: 64, baseType: !569)
!562 = distinct !DISubprogram(name: "add_command_buffer_completed_handler", linkageName: "_ZN6Halide7Runtime8Internal5Metal36add_command_buffer_completed_handlerEPNS2_18mtl_command_bufferEPNS2_46command_buffer_completed_handler_block_literalE", scope: !2, file: !6, line: 63, type: !563, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !131, !130}
!565 = !{!566, !567, !568}
!566 = !DILocalVariable(name: "command_buffer", arg: 1, scope: !562, file: !6, line: 63, type: !131)
!567 = !DILocalVariable(name: "handler", arg: 2, scope: !562, file: !6, line: 63, type: !130)
!568 = !DILocalVariable(name: "method", scope: !562, file: !6, line: 65, type: !561)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !480, !487, !130}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "error_method", scope: !573, file: !6, line: 70, baseType: !484)
!573 = distinct !DISubprogram(name: "command_buffer_error", linkageName: "_ZN6Halide7Runtime8Internal5Metal20command_buffer_errorEPNS2_18mtl_command_bufferE", scope: !2, file: !6, line: 69, type: !574, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!480, !131}
!576 = !{!577, !578}
!577 = !DILocalVariable(name: "buffer", arg: 1, scope: !573, file: !6, line: 69, type: !131)
!578 = !DILocalVariable(name: "method", scope: !573, file: !6, line: 71, type: !572)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "compute_command_encoder_method", scope: !580, file: !6, line: 76, baseType: !589)
!580 = distinct !DISubprogram(name: "new_compute_command_encoder", linkageName: "_ZN6Halide7Runtime8Internal5Metal27new_compute_command_encoderEPNS2_18mtl_command_bufferE", scope: !2, file: !6, line: 75, type: !581, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !586)
!581 = !DISubroutineType(types: !582)
!582 = !{!583, !131}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_compute_command_encoder", scope: !2, file: !585, line: 11, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal27mtl_compute_command_encoderE")
!585 = !DIFile(filename: "src/runtime/metal_objc_platform_dependent.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!586 = !{!587, !588}
!587 = !DILocalVariable(name: "buffer", arg: 1, scope: !580, file: !6, line: 75, type: !131)
!588 = !DILocalVariable(name: "method", scope: !580, file: !6, line: 77, type: !579)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!583, !480, !487}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "blit_command_encoder_method", scope: !593, file: !6, line: 82, baseType: !601)
!593 = distinct !DISubprogram(name: "new_blit_command_encoder", linkageName: "_ZN6Halide7Runtime8Internal5Metal24new_blit_command_encoderEPNS2_18mtl_command_bufferE", scope: !2, file: !6, line: 81, type: !594, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !598)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !131}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_blit_command_encoder", scope: !2, file: !6, line: 29, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal24mtl_blit_command_encoderE")
!598 = !{!599, !600}
!599 = !DILocalVariable(name: "buffer", arg: 1, scope: !593, file: !6, line: 81, type: !131)
!600 = !DILocalVariable(name: "method", scope: !593, file: !6, line: 83, type: !592)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DISubroutineType(types: !603)
!603 = !{!596, !480, !487}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "new_compute_pipeline_state_method", scope: !605, file: !6, line: 89, baseType: !618)
!605 = distinct !DISubprogram(name: "new_compute_pipeline_state_with_function", linkageName: "_ZN6Halide7Runtime8Internal5Metal40new_compute_pipeline_state_with_functionEP19halide_metal_devicePNS2_12mtl_functionE", scope: !2, file: !6, line: 87, type: !606, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !612)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !25, !610}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_compute_pipeline_state", scope: !2, file: !6, line: 30, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal26mtl_compute_pipeline_stateE")
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtl_function", scope: !2, file: !6, line: 32, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal5Metal12mtl_functionE")
!612 = !{!613, !614, !615, !616, !617}
!613 = !DILocalVariable(name: "device", arg: 1, scope: !605, file: !6, line: 87, type: !25)
!614 = !DILocalVariable(name: "function", arg: 2, scope: !605, file: !6, line: 87, type: !610)
!615 = !DILocalVariable(name: "error_return", scope: !605, file: !6, line: 88, type: !480)
!616 = !DILocalVariable(name: "method", scope: !605, file: !6, line: 91, type: !604)
!617 = !DILocalVariable(name: "result", scope: !605, file: !6, line: 92, type: !608)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DISubroutineType(types: !620)
!620 = !{!608, !480, !487, !480, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_max_total_threads_per_threadgroup_method", scope: !623, file: !6, line: 102, baseType: !629)
!623 = distinct !DISubprogram(name: "get_max_total_threads_per_threadgroup", linkageName: "_ZN6Halide7Runtime8Internal5Metal37get_max_total_threads_per_threadgroupEPNS2_26mtl_compute_pipeline_stateE", scope: !2, file: !6, line: 101, type: !624, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!117, !608}
!626 = !{!627, !628}
!627 = !DILocalVariable(name: "pipeline_state", arg: 1, scope: !623, file: !6, line: 101, type: !608)
!628 = !DILocalVariable(name: "method", scope: !623, file: !6, line: 103, type: !622)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DISubroutineType(types: !631)
!631 = !{!117, !480, !487}
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_compute_pipeline_state_method", scope: !633, file: !6, line: 108, baseType: !555)
!633 = distinct !DISubprogram(name: "set_compute_pipeline_state", linkageName: "_ZN6Halide7Runtime8Internal5Metal26set_compute_pipeline_stateEPNS2_27mtl_compute_command_encoderEPNS2_26mtl_compute_pipeline_stateE", scope: !2, file: !6, line: 107, type: !634, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !583, !608}
!636 = !{!637, !638, !639}
!637 = !DILocalVariable(name: "encoder", arg: 1, scope: !633, file: !6, line: 107, type: !583)
!638 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !633, file: !6, line: 107, type: !608)
!639 = !DILocalVariable(name: "method", scope: !633, file: !6, line: 109, type: !632)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "end_encoding_method", scope: !641, file: !6, line: 114, baseType: !647)
!641 = distinct !DISubprogram(name: "end_encoding", linkageName: "_ZN6Halide7Runtime8Internal5Metal12end_encodingEPNS2_27mtl_compute_command_encoderE", scope: !2, file: !6, line: 113, type: !642, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !583}
!644 = !{!645, !646}
!645 = !DILocalVariable(name: "encoder", arg: 1, scope: !641, file: !6, line: 113, type: !583)
!646 = !DILocalVariable(name: "method", scope: !641, file: !6, line: 115, type: !640)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !480, !487}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "did_modify_range_method", scope: !651, file: !6, line: 125, baseType: !662)
!651 = distinct !DISubprogram(name: "did_modify_range", linkageName: "_ZN6Halide7Runtime8Internal5Metal16did_modify_rangeEPNS2_10mtl_bufferENS2_7NSRangeE", scope: !2, file: !6, line: 124, type: !652, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !658)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !523, !654}
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NSRange", scope: !2, file: !6, line: 119, size: 64, flags: DIFlagTypePassByValue, elements: !655, identifier: "_ZTSN6Halide7Runtime8Internal5Metal7NSRangeE")
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !654, file: !6, line: 120, baseType: !248, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !654, file: !6, line: 121, baseType: !248, size: 32, offset: 32)
!658 = !{!659, !660, !661}
!659 = !DILocalVariable(name: "buffer", arg: 1, scope: !651, file: !6, line: 124, type: !523)
!660 = !DILocalVariable(name: "range", arg: 2, scope: !651, file: !6, line: 124, type: !654)
!661 = !DILocalVariable(name: "method", scope: !651, file: !6, line: 126, type: !650)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !480, !487, !654}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "synchronize_resource_method", scope: !666, file: !6, line: 131, baseType: !673)
!666 = distinct !DISubprogram(name: "synchronize_resource", linkageName: "_ZN6Halide7Runtime8Internal5Metal20synchronize_resourceEPNS2_24mtl_blit_command_encoderEPNS2_10mtl_bufferE", scope: !2, file: !6, line: 130, type: !667, scopeLine: 130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !596, !523}
!669 = !{!670, !671, !672}
!670 = !DILocalVariable(name: "encoder", arg: 1, scope: !666, file: !6, line: 130, type: !596)
!671 = !DILocalVariable(name: "buffer", arg: 2, scope: !666, file: !6, line: 130, type: !523)
!672 = !DILocalVariable(name: "method", scope: !666, file: !6, line: 132, type: !665)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !480, !487, !523}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "responds_to_selector_method", scope: !677, file: !6, line: 137, baseType: !692)
!677 = distinct !DISubprogram(name: "is_buffer_managed", linkageName: "_ZN6Halide7Runtime8Internal5Metal17is_buffer_managedEPNS2_10mtl_bufferE", scope: !2, file: !6, line: 136, type: !678, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!85, !523}
!680 = !{!681, !682, !683, !684, !691}
!681 = !DILocalVariable(name: "buffer", arg: 1, scope: !677, file: !6, line: 136, type: !523)
!682 = !DILocalVariable(name: "method1", scope: !677, file: !6, line: 138, type: !676)
!683 = !DILocalVariable(name: "storage_mode_sel", scope: !677, file: !6, line: 139, type: !487)
!684 = !DILocalVariable(name: "method", scope: !685, file: !6, line: 142, type: !687)
!685 = distinct !DILexicalBlock(scope: !686, file: !6, line: 140, column: 82)
!686 = distinct !DILexicalBlock(scope: !677, file: !6, line: 140, column: 9)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "storage_mode_method", scope: !677, file: !6, line: 141, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{!57, !480, !487}
!691 = !DILocalVariable(name: "storage_mode", scope: !685, file: !6, line: 143, type: !57)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DISubroutineType(types: !694)
!694 = !{!85, !480, !487, !487}
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "copy_from_buffer_method", scope: !696, file: !6, line: 153, baseType: !707)
!696 = distinct !DISubprogram(name: "buffer_to_buffer_1d_copy", linkageName: "_ZN6Halide7Runtime8Internal5Metal24buffer_to_buffer_1d_copyEPNS2_24mtl_blit_command_encoderEPNS2_10mtl_bufferEjS6_jj", scope: !2, file: !6, line: 149, type: !697, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !596, !523, !248, !523, !248, !248}
!699 = !{!700, !701, !702, !703, !704, !705, !706}
!700 = !DILocalVariable(name: "encoder", arg: 1, scope: !696, file: !6, line: 149, type: !596)
!701 = !DILocalVariable(name: "from", arg: 2, scope: !696, file: !6, line: 150, type: !523)
!702 = !DILocalVariable(name: "from_offset", arg: 3, scope: !696, file: !6, line: 150, type: !248)
!703 = !DILocalVariable(name: "to", arg: 4, scope: !696, file: !6, line: 151, type: !523)
!704 = !DILocalVariable(name: "to_offset", arg: 5, scope: !696, file: !6, line: 151, type: !248)
!705 = !DILocalVariable(name: "size", arg: 6, scope: !696, file: !6, line: 152, type: !248)
!706 = !DILocalVariable(name: "method", scope: !696, file: !6, line: 155, type: !695)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !480, !487, !480, !248, !480, !248, !248}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "end_encoding_method", scope: !711, file: !6, line: 161, baseType: !647)
!711 = distinct !DISubprogram(name: "end_encoding", linkageName: "_ZN6Halide7Runtime8Internal5Metal12end_encodingEPNS2_24mtl_blit_command_encoderE", scope: !2, file: !6, line: 160, type: !712, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !596}
!714 = !{!715, !716}
!715 = !DILocalVariable(name: "encoder", arg: 1, scope: !711, file: !6, line: 160, type: !596)
!716 = !DILocalVariable(name: "method", scope: !711, file: !6, line: 162, type: !710)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "responds_to_selector_method", scope: !718, file: !6, line: 167, baseType: !692)
!718 = distinct !DISubprogram(name: "buffer_supports_set_bytes", linkageName: "_ZN6Halide7Runtime8Internal5Metal25buffer_supports_set_bytesEPNS2_27mtl_compute_command_encoderE", scope: !2, file: !6, line: 166, type: !719, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!85, !583}
!721 = !{!722, !723, !724}
!722 = !DILocalVariable(name: "encoder", arg: 1, scope: !718, file: !6, line: 166, type: !583)
!723 = !DILocalVariable(name: "method1", scope: !718, file: !6, line: 168, type: !717)
!724 = !DILocalVariable(name: "set_bytes_sel", scope: !718, file: !6, line: 169, type: !487)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "options_method", scope: !726, file: !6, line: 177, baseType: !484)
!726 = distinct !DISubprogram(name: "new_library_with_source", linkageName: "_ZN6Halide7Runtime8Internal5Metal23new_library_with_sourceEP19halide_metal_devicePKcj", scope: !2, file: !6, line: 173, type: !727, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{!66, !25, !335, !248}
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !742, !747}
!730 = !DILocalVariable(name: "device", arg: 1, scope: !726, file: !6, line: 173, type: !25)
!731 = !DILocalVariable(name: "source", arg: 2, scope: !726, file: !6, line: 173, type: !335)
!732 = !DILocalVariable(name: "source_len", arg: 3, scope: !726, file: !6, line: 173, type: !248)
!733 = !DILocalVariable(name: "error_return", scope: !726, file: !6, line: 174, type: !480)
!734 = !DILocalVariable(name: "source_str", scope: !726, file: !6, line: 175, type: !480)
!735 = !DILocalVariable(name: "method", scope: !726, file: !6, line: 178, type: !725)
!736 = !DILocalVariable(name: "options", scope: !726, file: !6, line: 180, type: !480)
!737 = !DILocalVariable(name: "method1", scope: !726, file: !6, line: 183, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_fast_math_method", scope: !726, file: !6, line: 182, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !480, !487, !154}
!742 = !DILocalVariable(name: "method2", scope: !726, file: !6, line: 187, type: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "new_library_with_source_method", scope: !726, file: !6, line: 186, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!66, !480, !487, !480, !480, !621}
!747 = !DILocalVariable(name: "result", scope: !726, file: !6, line: 188, type: !66)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "new_function_with_name_method", scope: !749, file: !6, line: 203, baseType: !759)
!749 = distinct !DISubprogram(name: "new_function_with_name", linkageName: "_ZN6Halide7Runtime8Internal5Metal22new_function_with_nameEPNS2_11mtl_libraryEPKcj", scope: !2, file: !6, line: 201, type: !750, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!610, !66, !335, !248}
!752 = !{!753, !754, !755, !756, !757, !758}
!753 = !DILocalVariable(name: "library", arg: 1, scope: !749, file: !6, line: 201, type: !66)
!754 = !DILocalVariable(name: "name", arg: 2, scope: !749, file: !6, line: 201, type: !335)
!755 = !DILocalVariable(name: "name_len", arg: 3, scope: !749, file: !6, line: 201, type: !248)
!756 = !DILocalVariable(name: "name_str", scope: !749, file: !6, line: 202, type: !480)
!757 = !DILocalVariable(name: "method", scope: !749, file: !6, line: 204, type: !748)
!758 = !DILocalVariable(name: "result", scope: !749, file: !6, line: 205, type: !610)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{!610, !480, !487, !480}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_buffer_method", scope: !763, file: !6, line: 211, baseType: !772)
!763 = distinct !DISubprogram(name: "set_input_buffer", linkageName: "_ZN6Halide7Runtime8Internal5Metal16set_input_bufferEPNS2_27mtl_compute_command_encoderEPNS2_10mtl_bufferEyj", scope: !2, file: !6, line: 210, type: !764, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !583, !523, !147, !48}
!766 = !{!767, !768, !769, !770, !771}
!767 = !DILocalVariable(name: "encoder", arg: 1, scope: !763, file: !6, line: 210, type: !583)
!768 = !DILocalVariable(name: "input_buffer", arg: 2, scope: !763, file: !6, line: 210, type: !523)
!769 = !DILocalVariable(name: "offset", arg: 3, scope: !763, file: !6, line: 210, type: !147)
!770 = !DILocalVariable(name: "index", arg: 4, scope: !763, file: !6, line: 210, type: !48)
!771 = !DILocalVariable(name: "method", scope: !763, file: !6, line: 213, type: !762)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !480, !487, !523, !248, !248}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_bytes_method", scope: !776, file: !6, line: 219, baseType: !785)
!776 = distinct !DISubprogram(name: "set_input_buffer_from_bytes", linkageName: "_ZN6Halide7Runtime8Internal5Metal27set_input_buffer_from_bytesEPNS2_27mtl_compute_command_encoderEPhjj", scope: !2, file: !6, line: 218, type: !777, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !583, !153, !48, !48}
!779 = !{!780, !781, !782, !783, !784}
!780 = !DILocalVariable(name: "encoder", arg: 1, scope: !776, file: !6, line: 218, type: !583)
!781 = !DILocalVariable(name: "input_buffer", arg: 2, scope: !776, file: !6, line: 218, type: !153)
!782 = !DILocalVariable(name: "length", arg: 3, scope: !776, file: !6, line: 218, type: !48)
!783 = !DILocalVariable(name: "index", arg: 4, scope: !776, file: !6, line: 218, type: !48)
!784 = !DILocalVariable(name: "method", scope: !776, file: !6, line: 221, type: !775)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !480, !487, !97, !248, !248}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "set_threadgroup_memory_length_method", scope: !789, file: !6, line: 227, baseType: !797)
!789 = distinct !DISubprogram(name: "set_threadgroup_memory_length", linkageName: "_ZN6Halide7Runtime8Internal5Metal29set_threadgroup_memory_lengthEPNS2_27mtl_compute_command_encoderEjj", scope: !2, file: !6, line: 226, type: !790, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !583, !48, !48}
!792 = !{!793, !794, !795, !796}
!793 = !DILocalVariable(name: "encoder", arg: 1, scope: !789, file: !6, line: 226, type: !583)
!794 = !DILocalVariable(name: "length", arg: 2, scope: !789, file: !6, line: 226, type: !48)
!795 = !DILocalVariable(name: "index", arg: 3, scope: !789, file: !6, line: 226, type: !48)
!796 = !DILocalVariable(name: "method", scope: !789, file: !6, line: 229, type: !788)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !480, !487, !248, !248}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "commit_method", scope: !801, file: !6, line: 235, baseType: !647)
!801 = distinct !DISubprogram(name: "commit_command_buffer", linkageName: "_ZN6Halide7Runtime8Internal5Metal21commit_command_bufferEPNS2_18mtl_command_bufferE", scope: !2, file: !6, line: 234, type: !802, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !804)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !131}
!804 = !{!805, !806}
!805 = !DILocalVariable(name: "buffer", arg: 1, scope: !801, file: !6, line: 234, type: !131)
!806 = !DILocalVariable(name: "method", scope: !801, file: !6, line: 236, type: !800)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_until_completed_method", scope: !808, file: !6, line: 241, baseType: !647)
!808 = distinct !DISubprogram(name: "wait_until_completed", linkageName: "_ZN6Halide7Runtime8Internal5Metal20wait_until_completedEPNS2_18mtl_command_bufferE", scope: !2, file: !6, line: 240, type: !802, scopeLine: 240, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !809)
!809 = !{!810, !811}
!810 = !DILocalVariable(name: "buffer", arg: 1, scope: !808, file: !6, line: 240, type: !131)
!811 = !DILocalVariable(name: "method", scope: !808, file: !6, line: 242, type: !807)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "contents_method", scope: !813, file: !6, line: 247, baseType: !819)
!813 = distinct !DISubprogram(name: "buffer_contents", linkageName: "_ZN6Halide7Runtime8Internal5Metal15buffer_contentsEPNS2_10mtl_bufferE", scope: !2, file: !6, line: 246, type: !814, scopeLine: 246, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{!97, !523}
!816 = !{!817, !818}
!817 = !DILocalVariable(name: "buffer", arg: 1, scope: !813, file: !6, line: 246, type: !523)
!818 = !DILocalVariable(name: "method", scope: !813, file: !6, line: 248, type: !812)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!97, !480, !487}
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "nsarray_first_object_method", scope: !823, file: !6, line: 253, baseType: !484)
!823 = distinct !DISubprogram(name: "nsarray_first_object", linkageName: "_ZN6Halide7Runtime8Internal5Metal20nsarray_first_objectEPv", scope: !2, file: !6, line: 252, type: !824, scopeLine: 252, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!97, !480}
!826 = !{!827, !828}
!827 = !DILocalVariable(name: "arr", arg: 1, scope: !823, file: !6, line: 252, type: !480)
!828 = !DILocalVariable(name: "method", scope: !823, file: !6, line: 254, type: !822)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "mtl_copy_all_devices_method", scope: !830, file: !6, line: 270, baseType: !842)
!830 = distinct !DISubprogram(name: "get_default_mtl_device", linkageName: "_ZN6Halide7Runtime8Internal5Metal22get_default_mtl_deviceEv", scope: !2, file: !6, line: 262, type: !831, scopeLine: 262, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!25}
!833 = !{!834, !835, !838, !841}
!834 = !DILocalVariable(name: "device", scope: !830, file: !6, line: 263, type: !25)
!835 = !DILocalVariable(name: "handle", scope: !836, file: !6, line: 268, type: !97)
!836 = distinct !DILexicalBlock(scope: !837, file: !6, line: 264, column: 28)
!837 = distinct !DILexicalBlock(scope: !830, file: !6, line: 264, column: 9)
!838 = !DILocalVariable(name: "method", scope: !839, file: !6, line: 271, type: !829)
!839 = distinct !DILexicalBlock(scope: !840, file: !6, line: 269, column: 32)
!840 = distinct !DILexicalBlock(scope: !836, file: !6, line: 269, column: 13)
!841 = !DILocalVariable(name: "devices", scope: !839, file: !6, line: 272, type: !480)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !396, file: !395, line: 199, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !396, file: !395, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !845, templateParams: !908)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !856, !860, !863, !866, !869, !872, !875, !878, !881, !884, !887, !890, !893, !896, !901, !902, !905, !906, !907}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !844, file: !395, line: 32, baseType: !400, size: 32, flags: DIFlagPublic)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !844, file: !395, line: 32, baseType: !400, size: 32, offset: 32, flags: DIFlagPublic)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !844, file: !395, line: 32, baseType: !400, size: 32, offset: 64, flags: DIFlagPublic)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !844, file: !395, line: 33, baseType: !97, size: 32, offset: 96, flags: DIFlagPublic)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !844, file: !395, line: 34, baseType: !85, size: 8, offset: 128, flags: DIFlagPublic)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !844, file: !395, line: 35, baseType: !406, size: 8, offset: 136, flags: DIFlagPublic)
!852 = !DISubprogram(name: "Printer", scope: !844, file: !395, line: 37, type: !853, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !855, !97, !400}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!856 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !844, file: !395, line: 57, type: !857, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !855, !335}
!859 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !844, size: 32)
!860 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !844, file: !395, line: 67, type: !861, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DISubroutineType(types: !862)
!862 = !{!859, !855, !418}
!863 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !844, file: !395, line: 72, type: !864, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!864 = !DISubroutineType(types: !865)
!865 = !{!859, !855, !198}
!866 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !844, file: !395, line: 77, type: !867, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!867 = !DISubroutineType(types: !868)
!868 = !{!859, !855, !147}
!869 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !844, file: !395, line: 82, type: !870, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!870 = !DISubroutineType(types: !871)
!871 = !{!859, !855, !48}
!872 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !844, file: !395, line: 87, type: !873, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!873 = !DISubroutineType(types: !874)
!874 = !{!859, !855, !432}
!875 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !844, file: !395, line: 92, type: !876, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!876 = !DISubroutineType(types: !877)
!877 = !{!859, !855, !54}
!878 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !844, file: !395, line: 97, type: !879, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!879 = !DISubroutineType(types: !880)
!880 = !{!859, !855, !439}
!881 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !844, file: !395, line: 102, type: !882, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!882 = !DISubroutineType(types: !883)
!883 = !{!859, !855, !444}
!884 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !844, file: !395, line: 108, type: !885, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!885 = !DISubroutineType(types: !886)
!886 = !{!859, !855, !188}
!887 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !844, file: !395, line: 113, type: !888, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!888 = !DISubroutineType(types: !889)
!889 = !{!859, !855, !451}
!890 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !844, file: !395, line: 119, type: !891, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!891 = !DISubroutineType(types: !892)
!892 = !{!335, !855}
!893 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !844, file: !395, line: 131, type: !894, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !855}
!896 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !844, file: !395, line: 139, type: !897, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!897 = !DISubroutineType(types: !898)
!898 = !{!147, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!901 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !844, file: !395, line: 143, type: !897, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!902 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !844, file: !395, line: 148, type: !903, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !855, !57}
!905 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !844, file: !395, line: 158, type: !891, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!906 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !844, file: !395, line: 162, type: !894, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!907 = !DISubprogram(name: "~Printer", scope: !844, file: !395, line: 166, type: !894, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!908 = !{!909, !474}
!909 = !DITemplateValueParameter(name: "type", type: !57, value: i32 1)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_handle", scope: !2, file: !6, line: 287, size: 128, flags: DIFlagTypePassByValue, elements: !912, identifier: "_ZTSN6Halide7Runtime8Internal5Metal13device_handleE")
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !911, file: !6, line: 288, baseType: !523, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !911, file: !6, line: 289, baseType: !147, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !47, line: 28, baseType: !57)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!918 = !{!0, !23, !29, !34, !108, !110, !112, !119, !330, !919, !135}
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "metal_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal5Metal27metal_device_interface_implE", scope: !2, file: !6, line: 1146, type: !302, isLocal: false, isDefinition: true)
!921 = !{!922, !923, !924, !925}
!922 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !343, entity: !3, file: !47, line: 225)
!923 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !343, entity: !3, file: !6, line: 327)
!924 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !343, entity: !2, file: !6, line: 328)
!925 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !343, entity: !2, file: !6, line: 458)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !962, !963, !964, !965, !966, !967, !968, !969, !970, !972, !973, !976, !980, !981, !982, !983, !985, !987, !992}
!927 = !DILocalVariable(name: "user_context", arg: 1, scope: !332, file: !6, line: 723, type: !97)
!928 = !DILocalVariable(name: "state_ptr", arg: 2, scope: !332, file: !6, line: 724, type: !97)
!929 = !DILocalVariable(name: "entry_name", arg: 3, scope: !332, file: !6, line: 725, type: !335)
!930 = !DILocalVariable(name: "blocksX", arg: 4, scope: !332, file: !6, line: 726, type: !57)
!931 = !DILocalVariable(name: "blocksY", arg: 5, scope: !332, file: !6, line: 726, type: !57)
!932 = !DILocalVariable(name: "blocksZ", arg: 6, scope: !332, file: !6, line: 726, type: !57)
!933 = !DILocalVariable(name: "threadsX", arg: 7, scope: !332, file: !6, line: 727, type: !57)
!934 = !DILocalVariable(name: "threadsY", arg: 8, scope: !332, file: !6, line: 727, type: !57)
!935 = !DILocalVariable(name: "threadsZ", arg: 9, scope: !332, file: !6, line: 727, type: !57)
!936 = !DILocalVariable(name: "shared_mem_bytes", arg: 10, scope: !332, file: !6, line: 728, type: !57)
!937 = !DILocalVariable(name: "arg_sizes", arg: 11, scope: !332, file: !6, line: 729, type: !337)
!938 = !DILocalVariable(name: "args", arg: 12, scope: !332, file: !6, line: 730, type: !338)
!939 = !DILocalVariable(name: "arg_is_buffer", arg: 13, scope: !332, file: !6, line: 731, type: !339)
!940 = !DILocalVariable(name: "num_attributes", arg: 14, scope: !332, file: !6, line: 732, type: !57)
!941 = !DILocalVariable(name: "vertex_buffer", arg: 15, scope: !332, file: !6, line: 733, type: !342)
!942 = !DILocalVariable(name: "num_coords_dim0", arg: 16, scope: !332, file: !6, line: 734, type: !57)
!943 = !DILocalVariable(name: "num_coords_dim1", arg: 17, scope: !332, file: !6, line: 735, type: !57)
!944 = !DILocalVariable(name: "t_before", scope: !332, file: !6, line: 737, type: !147)
!945 = !DILocalVariable(name: "metal_context", scope: !332, file: !6, line: 740, type: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "MetalContextHolder", scope: !2, file: !6, line: 391, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !947, identifier: "_ZTSN6Halide7Runtime8Internal5Metal18MetalContextHolderE")
!947 = !{!948, !949, !950, !951, !952, !953, !957, !960, !961}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !946, file: !6, line: 392, baseType: !480, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !946, file: !6, line: 393, baseType: !97, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !946, file: !6, line: 400, baseType: !25, size: 32, offset: 64, flags: DIFlagPublic)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !946, file: !6, line: 401, baseType: !31, size: 32, offset: 96, flags: DIFlagPublic)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !946, file: !6, line: 402, baseType: !57, size: 32, offset: 128, flags: DIFlagPublic)
