; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cuda.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cuda.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::Cuda::CUctx_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUmod_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUfunc_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUDA_MEMCPY3D_st" = type { i32, i32, i32, i32, i32, i8*, i32, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i32, i32, i32, i32, i32, i32, i32, i8*, i32, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i32, i32, i32, i32, i32 }
%"struct.Halide::Runtime::Internal::Cuda::CUarray_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUstream_st" = type opaque
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::Cuda::FreeListItem" = type { i32, %"struct.Halide::Runtime::Internal::Cuda::CUctx_st"*, %"struct.Halide::Runtime::Internal::Cuda::CUstream_st"*, i32, %"struct.Halide::Runtime::Internal::Cuda::FreeListItem"* }
%"class.Halide::Internal::GPUCompilationCache" = type { %struct.halide_mutex, i32, %"struct.Halide::Internal::GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *, Halide::Runtime::Internal::Cuda::CUmod_st *>::CachedCompilation"*, i32, i32 }

!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "CUstream_st", scope: !2, file: !11, line: 25, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal4Cuda11CUstream_stE")
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "cuCtxSynchronize", linkageName: "_ZN6Halide7Runtime8Internal4Cuda16cuCtxSynchronizeE", scope: !2, file: !6, line: 41, type: !214, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "cuCtxPushCurrent", linkageName: "_ZN6Halide7Runtime8Internal4Cuda16cuCtxPushCurrentE", scope: !2, file: !6, line: 43, type: !209, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "cuCtxPopCurrent", linkageName: "_ZN6Halide7Runtime8Internal4Cuda15cuCtxPopCurrentE", scope: !2, file: !6, line: 44, type: !327, isLocal: false, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{!10, !203}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "cuPointerGetAttribute", linkageName: "_ZN6Halide7Runtime8Internal4Cuda21cuPointerGetAttributeE", scope: !2, file: !6, line: 46, type: !332, isLocal: false, isDefinition: true)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DISubroutineType(types: !334)
!334 = !{!10, !260, !76, !283}
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "cuStreamSynchronize", linkageName: "_ZN6Halide7Runtime8Internal4Cuda19cuStreamSynchronizeE", scope: !2, file: !6, line: 48, type: !337, isLocal: false, isDefinition: true)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!10, !318}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "lib_cuda", linkageName: "_ZN6Halide7Runtime8Internal4Cuda8lib_cudaE", scope: !2, file: !342, line: 31, type: !260, isLocal: false, isDefinition: true)
!342 = !DIFile(filename: "src/runtime/cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "lib_cuda_lock", linkageName: "_ZN6Halide7Runtime8Internal4Cuda13lib_cuda_lockE", scope: !2, file: !342, line: 32, type: !345, isLocal: false, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !348, file: !347, line: 11, baseType: !189)
!347 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !347, line: 9, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !349, identifier: "_ZTSN6Halide7Runtime8Internal14ScopedSpinLockE")
!349 = !{!350, !353, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !347, line: 13, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!353 = !DISubprogram(name: "ScopedSpinLock", scope: !348, file: !347, line: 15, type: !354, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !356, !352}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!357 = !DISubprogram(name: "~ScopedSpinLock", scope: !348, file: !347, line: 22, type: !358, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !356}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "context", linkageName: "_ZN6Halide7Runtime8Internal4Cuda7contextE", scope: !2, file: !342, line: 106, type: !204, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "context_lock", linkageName: "_ZN6Halide7Runtime8Internal4Cuda12context_lockE", scope: !2, file: !342, line: 108, type: !364, isLocal: false, isDefinition: true)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !365, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !366, identifier: "_ZTS12halide_mutex")
!365 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !364, file: !365, line: 121, baseType: !368, size: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 32, elements: !371)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !197, line: 68, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !197, line: 12, baseType: !13)
!371 = !{!372}
!372 = !DISubrange(count: 1)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "free_list", linkageName: "_ZN6Halide7Runtime8Internal4Cuda9free_listE", scope: !2, file: !342, line: 117, type: !375, isLocal: false, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreeListItem", scope: !2, file: !342, line: 111, size: 160, flags: DIFlagTypePassByValue, elements: !377, identifier: "_ZTSN6Halide7Runtime8Internal4Cuda12FreeListItemE")
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !376, file: !342, line: 112, baseType: !283, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !376, file: !342, line: 113, baseType: !204, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !376, file: !342, line: 114, baseType: !318, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !342, line: 115, baseType: !196, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !342, line: 116, baseType: !375, size: 32, offset: 128)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "free_list_lock", linkageName: "_ZN6Halide7Runtime8Internal4Cuda14free_list_lockE", scope: !2, file: !342, line: 118, type: !364, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "_ZN6Halide7Runtime8Internal4Cuda17compilation_cacheE", scope: !2, file: !342, line: 248, type: !387, isLocal: false, isDefinition: true)
!387 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *, Halide::Runtime::Internal::Cuda::CUmod_st *>", scope: !389, file: !388, line: 8, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !390, templateParams: !440, identifier: "_ZTSN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEEE")
!388 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!389 = !DINamespace(name: "Internal", scope: !5)
!390 = !{!391, !392, !395, !397, !398, !410, !411, !413, !414, !415, !418, !425, !430, !434, !437}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !387, file: !388, line: 22, baseType: !364, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !387, file: !388, line: 24, baseType: !393, flags: DIFlagStaticMember, extraData: float 5.000000e-01)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !387, file: !388, line: 25, baseType: !396, flags: DIFlagStaticMember, extraData: i32 7)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !387, file: !388, line: 26, baseType: !76, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !387, file: !388, line: 27, baseType: !399, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !387, file: !388, line: 9, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !401, identifier: "_ZTSN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE17CachedCompilationE")
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !400, file: !388, line: 10, baseType: !205, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !400, file: !388, line: 11, baseType: !235, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !400, file: !388, line: 12, baseType: !370, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !400, file: !388, line: 13, baseType: !370, size: 32, offset: 96)
!406 = !DISubprogram(name: "CachedCompilation", scope: !400, file: !388, line: 15, type: !407, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409, !205, !235, !370, !370}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !387, file: !388, line: 28, baseType: !76, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !387, file: !388, line: 30, baseType: !412, flags: DIFlagStaticMember, extraData: i32 0)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !387, file: !388, line: 31, baseType: !412, flags: DIFlagStaticMember, extraData: i32 1)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !387, file: !388, line: 33, baseType: !370, size: 32, offset: 128)
!415 = !DISubprogram(name: "kernel_hash", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE11kernel_hashES6_jj", scope: !387, file: !388, line: 36, type: !416, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!416 = !DISubroutineType(types: !417)
!417 = !{!369, !205, !370, !370}
!418 = !DISubprogram(name: "insert", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE6insertERKNS9_17CachedCompilationE", scope: !387, file: !388, line: 47, type: !419, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !422, !423}
!421 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!423 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!425 = !DISubprogram(name: "find_internal", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE13find_internalES6_jRPS8_i", scope: !387, file: !388, line: 73, type: !426, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(types: !427)
!427 = !{!421, !422, !205, !370, !428, !76}
!428 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!430 = !DISubprogram(name: "lookup", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE6lookupES6_PvRS8_", scope: !387, file: !388, line: 97, type: !431, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{!421, !422, !205, !260, !433}
!433 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !235, size: 32)
!434 = !DISubprogram(name: "resize_table", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE12resize_tableEi", scope: !387, file: !388, line: 108, type: !435, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{!421, !422, !76}
!437 = !DISubprogram(name: "release_hold", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE12release_holdEPvS6_SA_", scope: !387, file: !388, line: 211, type: !438, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !422, !260, !205, !260}
!440 = !{!441, !442}
!441 = !DITemplateTypeParameter(name: "ContextT", type: !205)
!442 = !DITemplateTypeParameter(name: "ModuleStateT", type: !235)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "cuda_allocation_pool", scope: !3, file: !342, line: 569, type: !445, isLocal: false, isDefinition: true)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_allocation_pool", file: !365, line: 1887, size: 64, flags: DIFlagTypePassByValue, elements: !446, identifier: "_ZTS29halide_device_allocation_pool")
!446 = !{!447, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "release_unused", scope: !445, file: !365, line: 1888, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DISubroutineType(types: !450)
!450 = !{!76, !260}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !365, line: 1889, baseType: !452, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "cuda_device_interface", linkageName: "_ZN6Halide7Runtime8Internal4Cuda21cuda_device_interfaceE", scope: !2, file: !342, line: 1405, type: !455, isLocal: false, isDefinition: true)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !365, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !456, identifier: "_ZTS25halide_device_interface_t")
!456 = !{!457, !579, !583, !584, !588, !589, !590, !591, !592, !596, !601, !605, !606, !610, !611, !615}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !455, file: !365, line: 724, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DISubroutineType(types: !460)
!460 = !{!76, !260, !461, !468}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !365, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !463, identifier: "_ZTS15halide_buffer_t")
!463 = !{!464, !467, !470, !474, !475, !515, !517, !540, !541, !551, !555, !558, !559, !562, !563, !566, !569, !570, !571, !575, !578}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !462, file: !365, line: 1425, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !197, line: 10, baseType: !466)
!466 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !462, file: !365, line: 1428, baseType: !468, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !462, file: !365, line: 1433, baseType: !471, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !197, line: 16, baseType: !473)
!473 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !462, file: !365, line: 1436, baseType: !465, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !365, line: 1439, baseType: !476, size: 32, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !365, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !477, identifier: "_ZTS13halide_type_t")
!477 = !{!478, !487, !488, !491, !495, !498, !503, !507, !508, !509, !512}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !476, file: !365, line: 434, baseType: !479, size: 8, align: 8)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !365, line: 413, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !365, line: 403, baseType: !472, size: 8, elements: !481, identifier: "_ZTS18halide_type_code_t")
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!483 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!484 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!485 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!486 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !476, file: !365, line: 442, baseType: !472, size: 8, align: 8, offset: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !476, file: !365, line: 446, baseType: !489, size: 16, align: 16, offset: 16)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !197, line: 14, baseType: !490)
!490 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!491 = !DISubprogram(name: "halide_type_t", scope: !476, file: !365, line: 453, type: !492, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494, !479, !472, !489}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!495 = !DISubprogram(name: "halide_type_t", scope: !476, file: !365, line: 459, type: !496, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !494}
!498 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !476, file: !365, line: 463, type: !499, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(types: !500)
!500 = !{!476, !501, !489}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!503 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !476, file: !365, line: 468, type: !504, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{!421, !501, !506}
!506 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !502, size: 32)
!507 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !476, file: !365, line: 472, type: !504, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !476, file: !365, line: 476, type: !504, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !476, file: !365, line: 481, type: !510, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(types: !511)
!511 = !{!76, !501}
!512 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !476, file: !365, line: 485, type: !513, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!513 = !DISubroutineType(types: !514)
!514 = !{!370, !501}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !462, file: !365, line: 1442, baseType: !516, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !197, line: 11, baseType: !76)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !462, file: !365, line: 1446, baseType: !518, size: 32, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !365, line: 1409, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !365, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !521, identifier: "_ZTS18halide_dimension_t")
!521 = !{!522, !523, !524, !525, !526, !530, !533, !539}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !520, file: !365, line: 1383, baseType: !516, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !520, file: !365, line: 1383, baseType: !516, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !520, file: !365, line: 1383, baseType: !516, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !520, file: !365, line: 1386, baseType: !370, size: 32, offset: 96)
!526 = !DISubprogram(name: "halide_dimension_t", scope: !520, file: !365, line: 1388, type: !527, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!530 = !DISubprogram(name: "halide_dimension_t", scope: !520, file: !365, line: 1389, type: !531, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !529, !516, !516, !516, !370}
!533 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !520, file: !365, line: 1393, type: !534, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!421, !536, !538}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!538 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !537, size: 32)
!539 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !520, file: !365, line: 1400, type: !534, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !462, file: !365, line: 1449, baseType: !260, size: 32, offset: 288)
!541 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !462, file: !365, line: 1454, type: !542, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DISubroutineType(types: !543)
!543 = !{!421, !544, !546}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !365, line: 1416, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 1415, baseType: !13, size: 32, elements: !548, identifier: "_ZTS19halide_buffer_flags")
!548 = !{!549, !550}
!549 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!550 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!551 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !462, file: !365, line: 1458, type: !552, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !554, !546, !421}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!555 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !462, file: !365, line: 1466, type: !556, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(types: !557)
!557 = !{!421, !544}
!558 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !462, file: !365, line: 1470, type: !556, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !462, file: !365, line: 1474, type: !560, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !554, !421}
!562 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !462, file: !365, line: 1478, type: !560, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !462, file: !365, line: 1485, type: !564, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubroutineType(types: !565)
!565 = !{!196, !544}
!566 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !462, file: !365, line: 1495, type: !567, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DISubroutineType(types: !568)
!568 = !{!471, !544}
!569 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !462, file: !365, line: 1506, type: !567, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !462, file: !365, line: 1518, type: !564, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !462, file: !365, line: 1523, type: !572, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubroutineType(types: !573)
!573 = !{!471, !544, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!575 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !462, file: !365, line: 1534, type: !576, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!576 = !DISubroutineType(types: !577)
!577 = !{!76, !554, !260}
!578 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !462, file: !365, line: 1545, type: !556, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !455, file: !365, line: 726, baseType: !580, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!76, !260, !461}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !455, file: !365, line: 727, baseType: !580, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !455, file: !365, line: 728, baseType: !585, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !260, !468}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !455, file: !365, line: 730, baseType: !580, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !455, file: !365, line: 731, baseType: !458, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !455, file: !365, line: 733, baseType: !458, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !455, file: !365, line: 735, baseType: !580, size: 32, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !455, file: !365, line: 736, baseType: !593, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{!76, !260, !461, !468, !461}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !455, file: !365, line: 738, baseType: !597, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!76, !260, !600, !461}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !455, file: !365, line: 740, baseType: !602, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{!76, !260, !600, !76, !76, !461}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !455, file: !365, line: 742, baseType: !580, size: 32, offset: 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !455, file: !365, line: 743, baseType: !607, size: 32, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!76, !260, !461, !465, !468}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !455, file: !365, line: 745, baseType: !580, size: 32, offset: 416)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !455, file: !365, line: 746, baseType: !612, size: 32, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{!76, !260, !75, !75}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !455, file: !365, line: 747, baseType: !616, size: 32, offset: 480)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !619, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !620, identifier: "_ZTS30halide_device_interface_impl_t")
!619 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!620 = !{!621, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !642}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !618, file: !619, line: 16, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{null}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !618, file: !619, line: 17, baseType: !622, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !618, file: !619, line: 18, baseType: !580, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !618, file: !619, line: 19, baseType: !580, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !618, file: !619, line: 20, baseType: !580, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !618, file: !619, line: 21, baseType: !448, size: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !618, file: !619, line: 22, baseType: !580, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !618, file: !619, line: 23, baseType: !580, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !618, file: !619, line: 24, baseType: !580, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !618, file: !619, line: 25, baseType: !580, size: 32, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !618, file: !619, line: 26, baseType: !593, size: 32, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !618, file: !619, line: 28, baseType: !597, size: 32, offset: 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !618, file: !619, line: 31, baseType: !602, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !618, file: !619, line: 35, baseType: !580, size: 32, offset: 416)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !618, file: !619, line: 37, baseType: !639, size: 32, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{!76, !260, !461, !465}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !618, file: !619, line: 38, baseType: !580, size: 32, offset: 480)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "cuda_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal4Cuda26cuda_device_interface_implE", scope: !2, file: !342, line: 1386, type: !618, isLocal: false, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !646, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !647, retainedTypes: !695, globals: !919, imports: !920, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!647 = !{!480, !547, !12, !90, !246, !648}
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !365, line: 990, baseType: !76, size: 32, elements: !649, identifier: "_ZTS19halide_error_code_t")
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!650 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!651 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!652 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!653 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!654 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!655 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!656 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!657 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!658 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!659 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!660 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!661 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!662 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!663 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!664 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!665 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!666 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!667 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!668 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!669 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!670 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!671 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!672 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!673 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!674 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!675 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!676 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!677 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!678 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!679 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!680 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!681 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!682 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!683 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!684 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!685 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!686 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!687 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!688 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!689 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!690 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!691 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!692 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!693 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!694 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!695 = !{!260, !696, !465, !774, !76, !369, !283, !375, !259, !841, !842, !196, !843, !719, !188, !844, !847, !850, !853, !856, !859, !862, !866, !869, !872, !875, !878, !882, !885, !889, !892, !895, !898, !901, !906, !909, !912, !915, !918, !399, !370, !387}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !698, file: !697, line: 203, baseType: !699)
!697 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!698 = !DINamespace(scope: !3)
!699 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !698, file: !697, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !700, templateParams: !771)
!700 = !{!701, !702, !703, !704, !705, !706, !708, !712, !716, !721, !724, !727, !730, !734, !737, !740, !744, !747, !753, !756, !759, !764, !765, !768, !769, !770}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !699, file: !697, line: 32, baseType: !188, size: 32, flags: DIFlagPublic)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !699, file: !697, line: 32, baseType: !188, size: 32, offset: 32, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !699, file: !697, line: 32, baseType: !188, size: 32, offset: 64, flags: DIFlagPublic)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !699, file: !697, line: 33, baseType: !260, size: 32, offset: 96, flags: DIFlagPublic)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !699, file: !697, line: 34, baseType: !421, size: 8, offset: 128, flags: DIFlagPublic)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !699, file: !697, line: 35, baseType: !707, size: 8, offset: 136, flags: DIFlagPublic)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !371)
!708 = !DISubprogram(name: "Printer", scope: !699, file: !697, line: 37, type: !709, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !711, !260, !188}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!712 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !699, file: !697, line: 57, type: !713, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !711, !275}
!715 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !699, size: 32)
!716 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !699, file: !697, line: 67, type: !717, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!717 = !DISubroutineType(types: !718)
!718 = !{!715, !711, !719}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !197, line: 9, baseType: !720)
!720 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!721 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !699, file: !697, line: 72, type: !722, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(types: !723)
!723 = !{!715, !711, !516}
!724 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !699, file: !697, line: 77, type: !725, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(types: !726)
!726 = !{!715, !711, !465}
!727 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !699, file: !697, line: 82, type: !728, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{!715, !711, !370}
!730 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !699, file: !697, line: 87, type: !731, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!731 = !DISubroutineType(types: !732)
!732 = !{!715, !711, !733}
!733 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!734 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !699, file: !697, line: 92, type: !735, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DISubroutineType(types: !736)
!736 = !{!715, !711, !394}
!737 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !699, file: !697, line: 97, type: !738, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(types: !739)
!739 = !{!715, !711, !237}
!740 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !699, file: !697, line: 102, type: !741, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!741 = !DISubroutineType(types: !742)
!742 = !{!715, !711, !743}
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!744 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !699, file: !697, line: 108, type: !745, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!745 = !DISubroutineType(types: !746)
!746 = !{!715, !711, !506}
!747 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !699, file: !697, line: 113, type: !748, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DISubroutineType(types: !749)
!749 = !{!715, !711, !750}
!750 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !365, line: 1550, baseType: !462)
!753 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !699, file: !697, line: 119, type: !754, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(types: !755)
!755 = !{!275, !711}
!756 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !699, file: !697, line: 131, type: !757, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !711}
!759 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !699, file: !697, line: 139, type: !760, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubroutineType(types: !761)
!761 = !{!465, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!764 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !699, file: !697, line: 143, type: !760, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !699, file: !697, line: 148, type: !766, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !711, !76}
!768 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !699, file: !697, line: 158, type: !754, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!769 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !699, file: !697, line: 162, type: !757, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubprogram(name: "~Printer", scope: !699, file: !697, line: 166, type: !757, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !{!772, !773}
!772 = !DITemplateValueParameter(name: "type", type: !76, value: i32 0)
!773 = !DITemplateValueParameter(name: "length", type: !466, value: i64 1024)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !698, file: !697, line: 199, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !698, file: !697, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !776, templateParams: !839)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !787, !791, !794, !797, !800, !803, !806, !809, !812, !815, !818, !821, !824, !827, !832, !833, !836, !837, !838}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !775, file: !697, line: 32, baseType: !188, size: 32, flags: DIFlagPublic)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !775, file: !697, line: 32, baseType: !188, size: 32, offset: 32, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !775, file: !697, line: 32, baseType: !188, size: 32, offset: 64, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !775, file: !697, line: 33, baseType: !260, size: 32, offset: 96, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !775, file: !697, line: 34, baseType: !421, size: 8, offset: 128, flags: DIFlagPublic)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !775, file: !697, line: 35, baseType: !707, size: 8, offset: 136, flags: DIFlagPublic)
!783 = !DISubprogram(name: "Printer", scope: !775, file: !697, line: 37, type: !784, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !786, !260, !188}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!787 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !775, file: !697, line: 57, type: !788, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!788 = !DISubroutineType(types: !789)
!789 = !{!790, !786, !275}
!790 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !775, size: 32)
!791 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !775, file: !697, line: 67, type: !792, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!790, !786, !719}
!794 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !775, file: !697, line: 72, type: !795, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!795 = !DISubroutineType(types: !796)
!796 = !{!790, !786, !516}
!797 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !775, file: !697, line: 77, type: !798, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!798 = !DISubroutineType(types: !799)
!799 = !{!790, !786, !465}
!800 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !775, file: !697, line: 82, type: !801, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DISubroutineType(types: !802)
!802 = !{!790, !786, !370}
!803 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !775, file: !697, line: 87, type: !804, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!804 = !DISubroutineType(types: !805)
!805 = !{!790, !786, !733}
!806 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !775, file: !697, line: 92, type: !807, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubroutineType(types: !808)
!808 = !{!790, !786, !394}
!809 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !775, file: !697, line: 97, type: !810, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubroutineType(types: !811)
!811 = !{!790, !786, !237}
!812 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !775, file: !697, line: 102, type: !813, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!813 = !DISubroutineType(types: !814)
!814 = !{!790, !786, !743}
!815 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !775, file: !697, line: 108, type: !816, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(types: !817)
!817 = !{!790, !786, !506}
!818 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !775, file: !697, line: 113, type: !819, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubroutineType(types: !820)
!820 = !{!790, !786, !750}
!821 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !775, file: !697, line: 119, type: !822, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!822 = !DISubroutineType(types: !823)
!823 = !{!275, !786}
!824 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !775, file: !697, line: 131, type: !825, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !786}
!827 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !775, file: !697, line: 139, type: !828, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!465, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!832 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !775, file: !697, line: 143, type: !828, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !775, file: !697, line: 148, type: !834, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !786, !76}
!836 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !775, file: !697, line: 158, type: !822, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !775, file: !697, line: 162, type: !825, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubprogram(name: "~Printer", scope: !775, file: !697, line: 166, type: !825, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !{!840, !773}
!840 = !DITemplateValueParameter(name: "type", type: !76, value: i32 1)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !197, line: 28, baseType: !76)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{!12, !13}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{!12, !75}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(types: !852)
!852 = !{!12, !75, !76}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DISubroutineType(types: !855)
!855 = !{!12, !75, !90, !76}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!12, !188, !76, !76}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(types: !861)
!861 = !{!12, !222, !76}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(types: !864)
!864 = !{!12, !865, !13, !76}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!12, !205}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{!12}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(types: !874)
!874 = !{!12, !205, !222}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DISubroutineType(types: !877)
!877 = !{!12, !429, !237}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DISubroutineType(types: !880)
!880 = !{!12, !429, !237, !13, !881, !259}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(types: !884)
!884 = !{!12, !235}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!12, !888, !235, !275}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{!12, !222, !13}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{!12, !13, !237, !13}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{!12, !260, !13, !13}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!12, !13, !13, !13}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!12, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!12, !273, !13, !13, !13, !13, !13, !13, !13, !319, !259, !259}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!12, !865}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!12, !260, !76, !13}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DISubroutineType(types: !917)
!917 = !{!12, !319}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!919 = !{!0, !70, !77, !84, !183, !190, !198, !207, !212, !217, !223, !228, !239, !261, !266, !277, !284, !289, !294, !299, !304, !313, !321, !323, !325, !330, !335, !340, !343, !360, !362, !373, !383, !385, !443, !643, !453}
!920 = !{!921, !922, !923}
!921 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !645, entity: !3, file: !197, line: 225)
!922 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !645, entity: !3, file: !342, line: 125)
!923 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !645, entity: !2, file: !342, line: 126)
!924 = !{i32 7, !"Dwarf Version", i32 4}
!925 = !{i32 2, !"Debug Info Version", i32 3}
!926 = !{i32 1, !"wchar_size", i32 4}
!927 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!928 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !929, line: 47, type: !930, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !946)
!929 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!930 = !DISubroutineType(types: !931)
!931 = !{null, !932, !76, !719, !719}
!932 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !929, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !935, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!935 = !{!936, !937, !938, !939, !943, !944, !945}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !934, file: !929, line: 35, baseType: !465, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !934, file: !929, line: 35, baseType: !465, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !934, file: !929, line: 37, baseType: !465, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !934, file: !929, line: 39, baseType: !940, size: 1024, offset: 192)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 1024, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !934, file: !929, line: 41, baseType: !940, size: 1024, offset: 1216)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !934, file: !929, line: 42, baseType: !940, size: 1024, offset: 2240)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !934, file: !929, line: 44, baseType: !465, size: 64, offset: 3264)
!946 = !{!947, !948, !949, !950, !951, !954, !955}
!947 = !DILocalVariable(name: "copy", arg: 1, scope: !928, file: !929, line: 47, type: !932)
!948 = !DILocalVariable(name: "d", arg: 2, scope: !928, file: !929, line: 47, type: !76)
!949 = !DILocalVariable(name: "src_off", arg: 3, scope: !928, file: !929, line: 47, type: !719)
!950 = !DILocalVariable(name: "dst_off", arg: 4, scope: !928, file: !929, line: 47, type: !719)
!951 = !DILocalVariable(name: "from", scope: !952, file: !929, line: 54, type: !237)
!952 = distinct !DILexicalBlock(scope: !953, file: !929, line: 53, column: 18)
!953 = distinct !DILexicalBlock(scope: !928, file: !929, line: 53, column: 9)
!954 = !DILocalVariable(name: "to", scope: !952, file: !929, line: 55, type: !260)
!955 = !DILocalVariable(name: "i", scope: !956, file: !929, line: 58, type: !465)
!956 = distinct !DILexicalBlock(scope: !957, file: !929, line: 58, column: 9)
!957 = distinct !DILexicalBlock(scope: !953, file: !929, line: 57, column: 12)
!958 = !DILocation(line: 0, scope: !928)
!959 = !DILocation(line: 49, column: 14, scope: !928)
!960 = !DILocation(line: 49, column: 19, scope: !928)
!961 = !DILocation(line: 49, column: 22, scope: !928)
!962 = !{!963, !963, i64 0}
!963 = !{!"long long", !964, i64 0}
!964 = !{!"omnipotent char", !965, i64 0}
!965 = !{!"Simple C++ TBAA"}
!966 = !DILocation(line: 49, column: 37, scope: !928)
!967 = !DILocation(line: 49, column: 5, scope: !928)
!968 = !DILocation(line: 50, column: 10, scope: !969)
!969 = distinct !DILexicalBlock(scope: !928, file: !929, line: 49, column: 43)
!970 = distinct !{!970, !967, !971, !972}
!971 = !DILocation(line: 51, column: 5, scope: !928)
!972 = !{!"llvm.loop.mustprogress"}
!973 = !DILocation(line: 53, column: 11, scope: !953)
!974 = !DILocation(line: 53, column: 9, scope: !928)
!975 = !DILocation(line: 0, scope: !956)
!976 = !DILocation(line: 58, column: 34, scope: !977)
!977 = distinct !DILexicalBlock(scope: !956, file: !929, line: 58, column: 9)
!978 = !DILocation(line: 58, column: 32, scope: !977)
!979 = !DILocation(line: 58, column: 9, scope: !956)
!980 = !DILocation(line: 54, column: 42, scope: !952)
!981 = !{!982, !963, i64 0}
!982 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !963, i64 0, !963, i64 8, !963, i64 16, !964, i64 24, !964, i64 152, !964, i64 280, !963, i64 408}
!983 = !DILocation(line: 54, column: 46, scope: !952)
!984 = !DILocation(line: 54, column: 28, scope: !952)
!985 = !DILocation(line: 0, scope: !952)
!986 = !DILocation(line: 55, column: 34, scope: !952)
!987 = !{!982, !963, i64 8}
!988 = !DILocation(line: 55, column: 38, scope: !952)
!989 = !DILocation(line: 55, column: 20, scope: !952)
!990 = !DILocation(line: 56, column: 31, scope: !952)
!991 = !{!982, !963, i64 408}
!992 = !DILocation(line: 56, column: 26, scope: !952)
!993 = !DILocation(line: 56, column: 9, scope: !952)
!994 = !DILocation(line: 57, column: 5, scope: !952)
!995 = !DILocation(line: 59, column: 13, scope: !996)
!996 = distinct !DILexicalBlock(scope: !977, file: !929, line: 58, column: 55)
!997 = !DILocation(line: 60, column: 24, scope: !996)
!998 = !DILocation(line: 60, column: 21, scope: !996)
!999 = !DILocation(line: 61, column: 24, scope: !996)
!1000 = !DILocation(line: 61, column: 21, scope: !996)
!1001 = !DILocation(line: 58, column: 51, scope: !977)
!1002 = distinct !{!1002, !979, !1003, !972}
!1003 = !DILocation(line: 62, column: 9, scope: !956)
!1004 = !DILocation(line: 64, column: 1, scope: !928)
!1005 = !DISubprogram(name: "memcpy", scope: !197, file: !197, line: 94, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1008)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!260, !260, !237, !13}
!1008 = !{}
!1009 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !929, line: 66, type: !1010, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !932, !260}
!1012 = !{!1013, !1014}
!1013 = !DILocalVariable(name: "copy", arg: 1, scope: !1009, file: !929, line: 66, type: !932)
!1014 = !DILocalVariable(name: "user_context", arg: 2, scope: !1009, file: !929, line: 66, type: !260)
!1015 = !DILocation(line: 0, scope: !1009)
!1016 = !DILocation(line: 68, column: 14, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1009, file: !929, line: 68, column: 9)
!1018 = !DILocation(line: 68, column: 26, scope: !1017)
!1019 = !DILocation(line: 68, column: 18, scope: !1017)
!1020 = !DILocation(line: 68, column: 9, scope: !1009)
!1021 = !DILocation(line: 69, column: 58, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !929, line: 68, column: 31)
!1023 = !{!982, !963, i64 16}
!1024 = !DILocation(line: 69, column: 9, scope: !1022)
!1025 = !DILocation(line: 70, column: 5, scope: !1022)
!1026 = !DILocalVariable(name: "this", arg: 1, scope: !1027, type: !1031, flags: DIFlagArtificial | DIFlagObjectPointer)
!1027 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !699, file: !697, line: 37, type: !709, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !708, retainedNodes: !1028)
!1028 = !{!1026, !1029, !1030}
!1029 = !DILocalVariable(name: "ctx", arg: 2, scope: !1027, file: !697, line: 37, type: !260)
!1030 = !DILocalVariable(name: "mem", arg: 3, scope: !1027, file: !697, line: 37, type: !188)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!1032 = !DILocation(line: 0, scope: !1027, inlinedAt: !1033)
!1033 = distinct !DILocation(line: 71, column: 9, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1017, file: !929, line: 70, column: 12)
!1035 = !DILocation(line: 44, column: 27, scope: !1036, inlinedAt: !1033)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !697, line: 43, column: 16)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !697, line: 41, column: 20)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !697, line: 39, column: 13)
!1039 = distinct !DILexicalBlock(scope: !1027, file: !697, line: 38, column: 54)
!1040 = !DILocation(line: 48, column: 13, scope: !1041, inlinedAt: !1033)
!1041 = distinct !DILexicalBlock(scope: !1039, file: !697, line: 48, column: 13)
!1042 = !DILocation(line: 48, column: 13, scope: !1039, inlinedAt: !1033)
!1043 = !DILocalVariable(name: "this", arg: 1, scope: !1044, type: !1031, flags: DIFlagArtificial | DIFlagObjectPointer)
!1044 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !699, file: !697, line: 57, type: !713, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !712, retainedNodes: !1045)
!1045 = !{!1043, !1046}
!1046 = !DILocalVariable(name: "arg", arg: 2, scope: !1044, file: !697, line: 57, type: !275)
!1047 = !DILocation(line: 0, scope: !1044, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 71, column: 29, scope: !1034)
!1049 = !DILocation(line: 62, column: 19, scope: !1050, inlinedAt: !1048)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !697, line: 61, column: 16)
!1051 = distinct !DILexicalBlock(scope: !1044, file: !697, line: 59, column: 13)
!1052 = !DILocalVariable(name: "this", arg: 1, scope: !1053, type: !1031, flags: DIFlagArtificial | DIFlagObjectPointer)
!1053 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !699, file: !697, line: 166, type: !757, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !770, retainedNodes: !1054)
!1054 = !{!1052}
!1055 = !DILocation(line: 0, scope: !1053, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 71, column: 9, scope: !1034)
!1057 = !DILocation(line: 168, column: 13, scope: !1058, inlinedAt: !1056)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !697, line: 167, column: 19)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !697, line: 167, column: 13)
!1060 = distinct !DILexicalBlock(scope: !1053, file: !697, line: 166, column: 16)
!1061 = !DILocation(line: 169, column: 9, scope: !1058, inlinedAt: !1056)
!1062 = !DILocation(line: 49, column: 23, scope: !1063, inlinedAt: !1033)
!1063 = distinct !DILexicalBlock(scope: !1041, file: !697, line: 48, column: 18)
!1064 = !DILocation(line: 50, column: 18, scope: !1063, inlinedAt: !1033)
!1065 = !{!964, !964, i64 0}
!1066 = !DILocalVariable(name: "this", arg: 1, scope: !1067, type: !1031, flags: DIFlagArtificial | DIFlagObjectPointer)
!1067 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !699, file: !697, line: 162, type: !757, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !769, retainedNodes: !1068)
!1068 = !{!1066}
!1069 = !DILocation(line: 0, scope: !1067, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 170, column: 13, scope: !1071, inlinedAt: !1056)
!1071 = distinct !DILexicalBlock(scope: !1059, file: !697, line: 169, column: 16)
!1072 = !DILocation(line: 163, column: 81, scope: !1067, inlinedAt: !1070)
!1073 = !DILocation(line: 163, column: 87, scope: !1067, inlinedAt: !1070)
!1074 = !DILocation(line: 163, column: 77, scope: !1067, inlinedAt: !1070)
!1075 = !DILocation(line: 163, column: 15, scope: !1067, inlinedAt: !1070)
!1076 = !DILocation(line: 174, column: 17, scope: !1077, inlinedAt: !1056)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !697, line: 173, column: 46)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !697, line: 173, column: 24)
!1079 = distinct !DILexicalBlock(scope: !1071, file: !697, line: 171, column: 17)
!1080 = !DILocation(line: 181, column: 13, scope: !1081, inlinedAt: !1056)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !697, line: 180, column: 40)
!1082 = distinct !DILexicalBlock(scope: !1060, file: !697, line: 180, column: 13)
!1083 = !DILocation(line: 73, column: 1, scope: !1009)
!1084 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !929, line: 76, type: !1085, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1088)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!934, !1087, !421, !1087, !421}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1096, !1098, !1101, !1104, !1106, !1109, !1110, !1111, !1113}
!1089 = !DILocalVariable(name: "src", arg: 1, scope: !1084, file: !929, line: 76, type: !1087)
!1090 = !DILocalVariable(name: "src_host", arg: 2, scope: !1084, file: !929, line: 76, type: !421)
!1091 = !DILocalVariable(name: "dst", arg: 3, scope: !1084, file: !929, line: 77, type: !1087)
!1092 = !DILocalVariable(name: "dst_host", arg: 4, scope: !1084, file: !929, line: 77, type: !421)
!1093 = !DILocalVariable(name: "c", scope: !1084, file: !929, line: 79, type: !934)
!1094 = !DILocalVariable(name: "i", scope: !1095, file: !929, line: 83, type: !76)
!1095 = distinct !DILexicalBlock(scope: !1084, file: !929, line: 83, column: 5)
!1096 = !DILocalVariable(name: "i", scope: !1097, file: !929, line: 91, type: !76)
!1097 = distinct !DILexicalBlock(scope: !1084, file: !929, line: 91, column: 5)
!1098 = !DILocalVariable(name: "zero", scope: !1099, file: !929, line: 100, type: !934)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !929, line: 98, column: 42)
!1100 = distinct !DILexicalBlock(scope: !1084, file: !929, line: 96, column: 9)
!1101 = !DILocalVariable(name: "zero", scope: !1102, file: !929, line: 107, type: !934)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !929, line: 104, column: 28)
!1103 = distinct !DILexicalBlock(scope: !1084, file: !929, line: 104, column: 9)
!1104 = !DILocalVariable(name: "i", scope: !1105, file: !929, line: 115, type: !76)
!1105 = distinct !DILexicalBlock(scope: !1084, file: !929, line: 115, column: 5)
!1106 = !DILocalVariable(name: "dst_stride_bytes", scope: !1107, file: !929, line: 117, type: !465)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !929, line: 115, column: 47)
!1108 = distinct !DILexicalBlock(scope: !1105, file: !929, line: 115, column: 5)
!1109 = !DILocalVariable(name: "src_stride_bytes", scope: !1107, file: !929, line: 118, type: !465)
!1110 = !DILocalVariable(name: "insert", scope: !1107, file: !929, line: 120, type: !76)
!1111 = !DILocalVariable(name: "j", scope: !1112, file: !929, line: 128, type: !76)
!1112 = distinct !DILexicalBlock(scope: !1107, file: !929, line: 128, column: 9)
!1113 = !DILocalVariable(name: "j", scope: !1114, file: !929, line: 151, type: !76)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !929, line: 151, column: 9)
!1115 = distinct !DILexicalBlock(scope: !1084, file: !929, line: 145, column: 51)
!1116 = !DILocation(line: 0, scope: !1084)
!1117 = !DILocation(line: 79, column: 5, scope: !1084)
!1118 = !DILocation(line: 79, column: 17, scope: !1084)
!1119 = !DILocation(line: 80, column: 13, scope: !1084)
!1120 = !DILocation(line: 80, column: 39, scope: !1084)
!1121 = !{!1122, !1123, i64 12}
!1122 = !{!"_ZTS15halide_buffer_t", !963, i64 0, !1123, i64 8, !1123, i64 12, !963, i64 16, !1124, i64 24, !1127, i64 28, !1123, i64 32, !1123, i64 36}
!1123 = !{!"any pointer", !964, i64 0}
!1124 = !{!"_ZTS13halide_type_t", !1125, i64 0, !964, i64 1, !1126, i64 2}
!1125 = !{!"_ZTS18halide_type_code_t", !964, i64 0}
!1126 = !{!"short", !964, i64 0}
!1127 = !{!"int", !964, i64 0}
!1128 = !DILocation(line: 80, column: 24, scope: !1084)
!1129 = !DILocation(line: 80, column: 51, scope: !1084)
!1130 = !{!1122, !963, i64 0}
!1131 = !DILocation(line: 80, column: 7, scope: !1084)
!1132 = !DILocation(line: 80, column: 11, scope: !1084)
!1133 = !DILocation(line: 81, column: 13, scope: !1084)
!1134 = !DILocation(line: 81, column: 39, scope: !1084)
!1135 = !DILocation(line: 81, column: 24, scope: !1084)
!1136 = !DILocation(line: 81, column: 51, scope: !1084)
!1137 = !DILocation(line: 81, column: 7, scope: !1084)
!1138 = !DILocation(line: 81, column: 11, scope: !1084)
!1139 = !DILocalVariable(name: "this", arg: 1, scope: !1140, type: !1142, flags: DIFlagArtificial | DIFlagObjectPointer)
!1140 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !476, file: !365, line: 481, type: !510, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !509, retainedNodes: !1141)
!1141 = !{!1139}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!1143 = !DILocation(line: 0, scope: !1140, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 82, column: 30, scope: !1084)
!1145 = !DILocation(line: 482, column: 17, scope: !1140, inlinedAt: !1144)
!1146 = !{!1124, !964, i64 1}
!1147 = !DILocation(line: 482, column: 22, scope: !1140, inlinedAt: !1144)
!1148 = !DILocation(line: 482, column: 27, scope: !1140, inlinedAt: !1144)
!1149 = !DILocation(line: 82, column: 20, scope: !1084)
!1150 = !DILocation(line: 82, column: 7, scope: !1084)
!1151 = !DILocation(line: 82, column: 18, scope: !1084)
!1152 = !DILocation(line: 0, scope: !1095)
!1153 = !DILocation(line: 84, column: 9, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !929, line: 83, column: 45)
!1155 = distinct !DILexicalBlock(scope: !1095, file: !929, line: 83, column: 5)
!1156 = !DILocation(line: 84, column: 21, scope: !1154)
!1157 = !DILocation(line: 85, column: 9, scope: !1154)
!1158 = !DILocation(line: 85, column: 31, scope: !1154)
!1159 = !DILocation(line: 86, column: 9, scope: !1154)
!1160 = !DILocation(line: 86, column: 31, scope: !1154)
!1161 = !DILocation(line: 90, column: 7, scope: !1084)
!1162 = !DILocation(line: 0, scope: !1097)
!1163 = !DILocation(line: 91, column: 30, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1097, file: !929, line: 91, column: 5)
!1165 = !{!1122, !1127, i64 28}
!1166 = !DILocation(line: 91, column: 23, scope: !1164)
!1167 = !DILocation(line: 91, column: 5, scope: !1097)
!1168 = !{!1122, !1123, i64 32}
!1169 = !DILocation(line: 94, column: 17, scope: !1084)
!1170 = !DILocation(line: 94, column: 22, scope: !1084)
!1171 = !DILocation(line: 96, column: 33, scope: !1100)
!1172 = !DILocation(line: 96, column: 25, scope: !1100)
!1173 = !DILocation(line: 96, column: 44, scope: !1100)
!1174 = !DILocation(line: 92, column: 46, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1164, file: !929, line: 91, column: 47)
!1176 = !{!1177, !1127, i64 8}
!1177 = !{!"_ZTS18halide_dimension_t", !1127, i64 0, !1127, i64 4, !1127, i64 8, !1127, i64 12}
!1178 = !DILocation(line: 92, column: 34, scope: !1175)
!1179 = !DILocation(line: 92, column: 68, scope: !1175)
!1180 = !{!1177, !1127, i64 0}
!1181 = !DILocation(line: 92, column: 86, scope: !1175)
!1182 = !DILocation(line: 92, column: 72, scope: !1175)
!1183 = !DILocation(line: 92, column: 55, scope: !1175)
!1184 = !DILocation(line: 92, column: 53, scope: !1175)
!1185 = !DILocation(line: 92, column: 21, scope: !1175)
!1186 = !DILocation(line: 91, column: 43, scope: !1164)
!1187 = distinct !{!1187, !1167, !1188, !972}
!1188 = !DILocation(line: 93, column: 5, scope: !1097)
!1189 = !DILocation(line: 0, scope: !1140, inlinedAt: !1190)
!1190 = distinct !DILocation(line: 97, column: 19, scope: !1100)
!1191 = !DILocation(line: 0, scope: !1140, inlinedAt: !1192)
!1192 = distinct !DILocation(line: 97, column: 40, scope: !1100)
!1193 = !DILocation(line: 482, column: 17, scope: !1140, inlinedAt: !1192)
!1194 = !DILocation(line: 482, column: 22, scope: !1140, inlinedAt: !1192)
!1195 = !DILocation(line: 482, column: 27, scope: !1140, inlinedAt: !1192)
!1196 = !DILocation(line: 97, column: 27, scope: !1100)
!1197 = !DILocation(line: 97, column: 48, scope: !1100)
!1198 = !DILocation(line: 100, column: 21, scope: !1099)
!1199 = !DILocation(line: 101, column: 9, scope: !1099)
!1200 = !DILocation(line: 104, column: 22, scope: !1103)
!1201 = !DILocation(line: 104, column: 9, scope: !1084)
!1202 = !DILocation(line: 0, scope: !1105)
!1203 = !DILocation(line: 115, column: 5, scope: !1105)
!1204 = !DILocation(line: 107, column: 21, scope: !1102)
!1205 = !DILocation(line: 108, column: 9, scope: !1102)
!1206 = !DILocation(line: 144, column: 14, scope: !1084)
!1207 = !DILocation(line: 144, column: 28, scope: !1084)
!1208 = !DILocation(line: 144, column: 25, scope: !1084)
!1209 = !DILocation(line: 144, column: 50, scope: !1084)
!1210 = !DILocation(line: 145, column: 28, scope: !1084)
!1211 = !DILocation(line: 117, column: 59, scope: !1107)
!1212 = !DILocation(line: 117, column: 47, scope: !1107)
!1213 = !DILocation(line: 0, scope: !1140, inlinedAt: !1214)
!1214 = distinct !DILocation(line: 117, column: 78, scope: !1107)
!1215 = !DILocation(line: 117, column: 66, scope: !1107)
!1216 = !DILocation(line: 0, scope: !1107)
!1217 = !DILocation(line: 118, column: 59, scope: !1107)
!1218 = !DILocation(line: 118, column: 47, scope: !1107)
!1219 = !DILocation(line: 0, scope: !1140, inlinedAt: !1220)
!1220 = distinct !DILocation(line: 118, column: 78, scope: !1107)
!1221 = !DILocation(line: 118, column: 66, scope: !1107)
!1222 = !DILocation(line: 121, column: 33, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !929, line: 121, column: 9)
!1224 = distinct !DILexicalBlock(scope: !1107, file: !929, line: 121, column: 9)
!1225 = !DILocation(line: 121, column: 9, scope: !1224)
!1226 = !DILocation(line: 124, column: 36, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !929, line: 124, column: 17)
!1228 = distinct !DILexicalBlock(scope: !1223, file: !929, line: 121, column: 48)
!1229 = !DILocation(line: 124, column: 34, scope: !1227)
!1230 = !DILocation(line: 124, column: 63, scope: !1227)
!1231 = !DILocation(line: 121, column: 44, scope: !1223)
!1232 = distinct !{!1232, !1225, !1233, !972}
!1233 = !DILocation(line: 127, column: 9, scope: !1224)
!1234 = !DILocation(line: 0, scope: !1224)
!1235 = !DILocation(line: 0, scope: !1112)
!1236 = !DILocation(line: 128, column: 27, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1112, file: !929, line: 128, column: 9)
!1238 = !DILocation(line: 128, column: 9, scope: !1112)
!1239 = !DILocation(line: 133, column: 40, scope: !1107)
!1240 = !{!1177, !1127, i64 4}
!1241 = !DILocation(line: 133, column: 28, scope: !1107)
!1242 = !DILocation(line: 133, column: 9, scope: !1107)
!1243 = !DILocation(line: 133, column: 26, scope: !1107)
!1244 = !DILocation(line: 135, column: 9, scope: !1107)
!1245 = !DILocation(line: 135, column: 36, scope: !1107)
!1246 = !DILocation(line: 136, column: 9, scope: !1107)
!1247 = !DILocation(line: 136, column: 36, scope: !1107)
!1248 = !DILocation(line: 115, column: 43, scope: !1108)
!1249 = !DILocation(line: 115, column: 23, scope: !1108)
!1250 = distinct !{!1250, !1203, !1251, !972}
!1251 = !DILocation(line: 137, column: 5, scope: !1105)
!1252 = !DILocation(line: 129, column: 38, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1237, file: !929, line: 128, column: 42)
!1254 = !DILocation(line: 129, column: 27, scope: !1253)
!1255 = !DILocation(line: 129, column: 13, scope: !1253)
!1256 = !DILocation(line: 129, column: 25, scope: !1253)
!1257 = !DILocation(line: 130, column: 37, scope: !1253)
!1258 = !DILocation(line: 130, column: 13, scope: !1253)
!1259 = !DILocation(line: 130, column: 35, scope: !1253)
!1260 = !DILocation(line: 131, column: 37, scope: !1253)
!1261 = !DILocation(line: 131, column: 13, scope: !1253)
!1262 = !DILocation(line: 131, column: 35, scope: !1253)
!1263 = distinct !{!1263, !1238, !1264, !972}
!1264 = !DILocation(line: 132, column: 9, scope: !1112)
!1265 = !DILocation(line: 145, column: 25, scope: !1084)
!1266 = !DILocation(line: 144, column: 5, scope: !1084)
!1267 = !DILocation(line: 147, column: 25, scope: !1115)
!1268 = !DILocation(line: 147, column: 22, scope: !1115)
!1269 = !DILocation(line: 0, scope: !1114)
!1270 = !DILocation(line: 152, column: 31, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !929, line: 151, column: 49)
!1272 = distinct !DILexicalBlock(scope: !1114, file: !929, line: 151, column: 9)
!1273 = !DILocation(line: 152, column: 29, scope: !1271)
!1274 = !DILocation(line: 153, column: 41, scope: !1271)
!1275 = !DILocation(line: 153, column: 39, scope: !1271)
!1276 = !DILocation(line: 154, column: 41, scope: !1271)
!1277 = !DILocation(line: 154, column: 39, scope: !1271)
!1278 = !DILocation(line: 156, column: 37, scope: !1115)
!1279 = !DILocation(line: 157, column: 47, scope: !1115)
!1280 = !DILocation(line: 158, column: 47, scope: !1115)
!1281 = distinct !{!1281, !1266, !1282, !972}
!1282 = !DILocation(line: 159, column: 5, scope: !1084)
!1283 = !DILocation(line: 160, column: 12, scope: !1084)
!1284 = !{i64 0, i64 8, !962, i64 8, i64 8, !962, i64 16, i64 8, !962, i64 24, i64 128, !1065, i64 152, i64 128, !1065, i64 280, i64 128, !1065, i64 408, i64 8, !962}
!1285 = !DILocation(line: 160, column: 5, scope: !1084)
!1286 = !DILocation(line: 161, column: 1, scope: !1084)
!1287 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !929, line: 163, type: !1288, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1290)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!934, !1087}
!1290 = !{!1291}
!1291 = !DILocalVariable(name: "buf", arg: 1, scope: !1287, file: !929, line: 163, type: !1087)
!1292 = !DILocation(line: 0, scope: !1287)
!1293 = !DILocation(line: 164, column: 12, scope: !1287)
!1294 = !DILocation(line: 164, column: 5, scope: !1287)
!1295 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !929, line: 167, type: !1288, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1296)
!1296 = !{!1297}
!1297 = !DILocalVariable(name: "buf", arg: 1, scope: !1295, file: !929, line: 167, type: !1087)
!1298 = !DILocation(line: 0, scope: !1295)
!1299 = !DILocation(line: 168, column: 12, scope: !1295)
!1300 = !DILocation(line: 168, column: 5, scope: !1295)
!1301 = distinct !DISubprogram(name: "halide_cuda_get_symbol", scope: !342, file: !342, line: 34, type: !1302, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1304)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!260, !260, !275}
!1304 = !{!1305, !1306, !1307, !1308, !1312}
!1305 = !DILocalVariable(name: "user_context", arg: 1, scope: !1301, file: !342, line: 34, type: !260)
!1306 = !DILocalVariable(name: "name", arg: 2, scope: !1301, file: !342, line: 34, type: !275)
!1307 = !DILocalVariable(name: "symbol", scope: !1301, file: !342, line: 38, type: !260)
!1308 = !DILocalVariable(name: "lib_names", scope: !1301, file: !342, line: 43, type: !1309)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 96, elements: !1310)
!1310 = !{!1311}
!1311 = !DISubrange(count: 3)
!1312 = !DILocalVariable(name: "i", scope: !1313, file: !342, line: 52, type: !196)
!1313 = distinct !DILexicalBlock(scope: !1301, file: !342, line: 52, column: 5)
!1314 = !DILocation(line: 0, scope: !1301)
!1315 = !DILocation(line: 38, column: 46, scope: !1301)
!1316 = !{!1123, !1123, i64 0}
!1317 = !DILocation(line: 38, column: 20, scope: !1301)
!1318 = !DILocation(line: 39, column: 9, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1301, file: !342, line: 39, column: 9)
!1320 = !DILocation(line: 39, column: 9, scope: !1301)
!1321 = !DILocation(line: 0, scope: !1313)
!1322 = !DILocation(line: 53, column: 20, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1324, file: !342, line: 52, column: 75)
!1324 = distinct !DILexicalBlock(scope: !1313, file: !342, line: 52, column: 5)
!1325 = !DILocation(line: 53, column: 18, scope: !1323)
!1326 = !DILocation(line: 54, column: 13, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1323, file: !342, line: 54, column: 13)
!1328 = !DILocation(line: 54, column: 13, scope: !1323)
!1329 = !DILocation(line: 53, column: 40, scope: !1323)
!1330 = !DILocation(line: 0, scope: !1027, inlinedAt: !1331)
!1331 = distinct !DILocation(line: 55, column: 13, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1327, file: !342, line: 54, column: 23)
!1333 = !DILocation(line: 44, column: 27, scope: !1036, inlinedAt: !1331)
!1334 = !DILocation(line: 48, column: 13, scope: !1041, inlinedAt: !1331)
!1335 = !DILocation(line: 48, column: 13, scope: !1039, inlinedAt: !1331)
!1336 = !DILocation(line: 49, column: 23, scope: !1063, inlinedAt: !1331)
!1337 = !DILocation(line: 50, column: 18, scope: !1063, inlinedAt: !1331)
!1338 = !DILocation(line: 51, column: 9, scope: !1063, inlinedAt: !1331)
!1339 = !DILocation(line: 0, scope: !1041, inlinedAt: !1331)
!1340 = !DILocation(line: 0, scope: !1044, inlinedAt: !1341)
!1341 = distinct !DILocation(line: 55, column: 33, scope: !1332)
!1342 = !DILocation(line: 62, column: 19, scope: !1050, inlinedAt: !1341)
!1343 = !DILocation(line: 0, scope: !1044, inlinedAt: !1344)
!1344 = distinct !DILocation(line: 55, column: 72, scope: !1332)
!1345 = !DILocation(line: 62, column: 19, scope: !1050, inlinedAt: !1344)
!1346 = !DILocation(line: 0, scope: !1044, inlinedAt: !1347)
!1347 = distinct !DILocation(line: 55, column: 88, scope: !1332)
!1348 = !DILocation(line: 62, column: 19, scope: !1050, inlinedAt: !1347)
!1349 = !DILocation(line: 0, scope: !1053, inlinedAt: !1350)
!1350 = distinct !DILocation(line: 55, column: 13, scope: !1332)
!1351 = !DILocation(line: 167, column: 13, scope: !1060, inlinedAt: !1350)
!1352 = !DILocation(line: 168, column: 13, scope: !1058, inlinedAt: !1350)
!1353 = !DILocation(line: 169, column: 9, scope: !1058, inlinedAt: !1350)
!1354 = !DILocation(line: 0, scope: !1067, inlinedAt: !1355)
!1355 = distinct !DILocation(line: 170, column: 13, scope: !1071, inlinedAt: !1350)
!1356 = !DILocation(line: 163, column: 81, scope: !1067, inlinedAt: !1355)
!1357 = !DILocation(line: 163, column: 87, scope: !1067, inlinedAt: !1355)
!1358 = !DILocation(line: 163, column: 77, scope: !1067, inlinedAt: !1355)
!1359 = !DILocation(line: 163, column: 15, scope: !1067, inlinedAt: !1355)
!1360 = !DILocation(line: 174, column: 17, scope: !1077, inlinedAt: !1350)
!1361 = !DILocation(line: 181, column: 13, scope: !1081, inlinedAt: !1350)
!1362 = !DILocation(line: 60, column: 38, scope: !1301)
!1363 = !DILocation(line: 56, column: 13, scope: !1332)
!1364 = !DILocation(line: 60, column: 12, scope: !1301)
!1365 = !DILocation(line: 61, column: 1, scope: !1301)
!1366 = !DISubprogram(name: "halide_get_library_symbol", scope: !365, file: !365, line: 377, type: !1302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1008)
!1367 = !DISubprogram(name: "halide_load_library", scope: !365, file: !365, line: 376, type: !1368, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1008)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!260, !275}
!1370 = distinct !DISubprogram(name: "load_libcuda", linkageName: "_ZN6Halide7Runtime8Internal4Cuda12load_libcudaEPv", scope: !2, file: !342, line: 73, type: !1371, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1373)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !260}
!1373 = !{!1374}
!1374 = !DILocalVariable(name: "user_context", arg: 1, scope: !1370, file: !342, line: 73, type: !260)
!1375 = !DILocation(line: 0, scope: !1370)
!1376 = !DILocation(line: 0, scope: !1027, inlinedAt: !1377)
!1377 = distinct !DILocation(line: 74, column: 5, scope: !1370)
!1378 = !DILocation(line: 44, column: 27, scope: !1036, inlinedAt: !1377)
!1379 = !DILocation(line: 48, column: 13, scope: !1041, inlinedAt: !1377)
!1380 = !DILocation(line: 48, column: 13, scope: !1039, inlinedAt: !1377)
!1381 = !DILocation(line: 49, column: 23, scope: !1063, inlinedAt: !1377)
!1382 = !DILocation(line: 50, column: 18, scope: !1063, inlinedAt: !1377)
!1383 = !DILocation(line: 51, column: 9, scope: !1063, inlinedAt: !1377)
!1384 = !DILocation(line: 0, scope: !1041, inlinedAt: !1377)
!1385 = !DILocation(line: 0, scope: !1044, inlinedAt: !1386)
!1386 = distinct !DILocation(line: 74, column: 25, scope: !1370)
!1387 = !DILocation(line: 62, column: 19, scope: !1050, inlinedAt: !1386)
!1388 = !DILocalVariable(name: "this", arg: 1, scope: !1389, type: !1031, flags: DIFlagArtificial | DIFlagObjectPointer)
!1389 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !699, file: !697, line: 97, type: !738, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !737, retainedNodes: !1390)
!1390 = !{!1388, !1391}
!1391 = !DILocalVariable(name: "arg", arg: 2, scope: !1389, file: !697, line: 97, type: !237)
!1392 = !DILocation(line: 0, scope: !1389, inlinedAt: !1393)
!1393 = distinct !DILocation(line: 74, column: 63, scope: !1370)
!1394 = !DILocation(line: 98, column: 15, scope: !1389, inlinedAt: !1393)
!1395 = !DILocation(line: 0, scope: !1044, inlinedAt: !1396)
!1396 = distinct !DILocation(line: 74, column: 79, scope: !1370)
!1397 = !DILocation(line: 62, column: 19, scope: !1050, inlinedAt: !1396)
!1398 = !DILocation(line: 0, scope: !1053, inlinedAt: !1399)
!1399 = distinct !DILocation(line: 74, column: 5, scope: !1370)
!1400 = !DILocation(line: 167, column: 13, scope: !1060, inlinedAt: !1399)
!1401 = !DILocation(line: 168, column: 13, scope: !1058, inlinedAt: !1399)
!1402 = !DILocation(line: 169, column: 9, scope: !1058, inlinedAt: !1399)
!1403 = !DILocation(line: 0, scope: !1067, inlinedAt: !1404)
!1404 = distinct !DILocation(line: 170, column: 13, scope: !1071, inlinedAt: !1399)
!1405 = !DILocation(line: 163, column: 81, scope: !1067, inlinedAt: !1404)
!1406 = !DILocation(line: 163, column: 87, scope: !1067, inlinedAt: !1404)
!1407 = !DILocation(line: 163, column: 77, scope: !1067, inlinedAt: !1404)
!1408 = !DILocation(line: 163, column: 15, scope: !1067, inlinedAt: !1404)
!1409 = !DILocation(line: 174, column: 17, scope: !1077, inlinedAt: !1399)
!1410 = !DILocation(line: 181, column: 13, scope: !1081, inlinedAt: !1399)
!1411 = !DILocation(line: 75, column: 5, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1413, file: !342, line: 75, column: 5)
!1413 = distinct !DILexicalBlock(scope: !1370, file: !342, line: 75, column: 5)
!1414 = !DILocation(line: 75, column: 5, scope: !1413)
!1415 = !DILocation(line: 75, column: 5, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1412, file: !342, line: 75, column: 5)
!1417 = !DILocalVariable(name: "user_context", arg: 1, scope: !1418, file: !342, line: 64, type: !260)
!1418 = distinct !DISubprogram(name: "get_cuda_symbol<Halide::Runtime::Internal::Cuda::CUresult (*)(unsigned int)>", linkageName: "_ZN6Halide7Runtime8Internal4Cuda15get_cuda_symbolIPFNS2_8CUresultEjEEET_PvPKcb", scope: !2, file: !342, line: 64, type: !1419, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, templateParams: !1425, retainedNodes: !1421)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!844, !260, !275, !421}
!1421 = !{!1417, !1422, !1423, !1424}
!1422 = !DILocalVariable(name: "name", arg: 2, scope: !1418, file: !342, line: 64, type: !275)
!1423 = !DILocalVariable(name: "optional", arg: 3, scope: !1418, file: !342, line: 64, type: !421)
!1424 = !DILocalVariable(name: "s", scope: !1418, file: !342, line: 65, type: !844)
!1425 = !{!1426}
!1426 = !DITemplateTypeParameter(name: "T", type: !844)
!1427 = !DILocation(line: 0, scope: !1418, inlinedAt: !1428)
!1428 = distinct !DILocation(line: 19, column: 1, scope: !1429)
!1429 = !DILexicalBlockFile(scope: !1370, file: !6, discriminator: 0)
!1430 = !DILocation(line: 65, column: 14, scope: !1418, inlinedAt: !1428)
!1431 = !DILocation(line: 66, column: 19, scope: !1432, inlinedAt: !1428)
!1432 = distinct !DILexicalBlock(scope: !1418, file: !342, line: 66, column: 9)
!1433 = !DILocalVariable(name: "this", arg: 1, scope: !1434, type: !1438, flags: DIFlagArtificial | DIFlagObjectPointer)
