; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_cache_allocator.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_cache_allocator.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::Hexagon::hexagon_local_cache" = type { i8*, i8, i32, %"struct.Halide::Runtime::Internal::Hexagon::hexagon_local_cache"* }
%struct.halide_mutex = type { [1 x i32] }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [2 x i8] }>
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer.0" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [2 x i8] }>

@_ZN6Halide7Runtime8Internal7Hexagon18hexagon_cache_poolE = weak dso_local local_unnamed_addr global %"struct.Halide::Runtime::Internal::Hexagon::hexagon_local_cache"* null, align 4, !dbg !0
@_ZN6Halide7Runtime8Internal7Hexagon19hexagon_cache_mutexE = weak dso_local global %struct.halide_mutex zeroinitializer, align 4, !dbg !22
@.str = private unnamed_addr constant [28 x i8] c"halide_locked_cache_malloc\0A\00", align 1
@.str.1 = private unnamed_addr constant [26 x i8] c"halide_locked_cache_free\0A\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"halide_hexagon_allocate_l2_pool\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hexagon_cache_pool", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon18hexagon_cache_poolE", scope: !2, file: !6, line: 21, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Hexagon", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_cache_allocator.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcache_pool", scope: !2, file: !6, line: 19, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "hexagon_cache_pool_t", scope: !2, file: !6, line: 17, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hexagon_local_cache", scope: !2, file: !6, line: 12, size: 128, flags: DIFlagTypePassByValue, elements: !11, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon19hexagon_local_cacheE")
!11 = !{!12, !14, !16, !20}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "l2memory", scope: !10, file: !6, line: 13, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !10, file: !6, line: 14, baseType: !15, size: 8, offset: 32)
!15 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !10, file: !6, line: 15, baseType: !17, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 27, baseType: !19)
!18 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !6, line: 16, baseType: !21, size: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "hexagon_cache_mutex", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon19hexagon_cache_mutexE", scope: !2, file: !6, line: 22, type: !24, isLocal: false, isDefinition: true)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !25, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !26, identifier: "_ZTS12halide_mutex")
!25 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !24, file: !25, line: 121, baseType: !28, size: 32)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !18, line: 68, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 12, baseType: !19)
!31 = !{!32}
!32 = !DISubrange(count: 1)
!33 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !34, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !97, globals: !287, imports: !288, splitDebugInlining: false, nameTableKind: None)
!34 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_cache_allocator.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!35 = !{!36, !45, !93}
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !25, line: 403, baseType: !37, size: 8, elements: !39, identifier: "_ZTS18halide_type_code_t")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 16, baseType: !38)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40, !41, !42, !43, !44}
!40 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !25, line: 990, baseType: !46, size: 32, elements: !47, identifier: "_ZTS19halide_error_code_t")
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!48 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!49 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!50 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!51 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!52 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!53 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!54 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!55 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!56 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!57 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!58 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!59 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!60 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!61 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!62 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!63 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!64 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!65 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!66 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!67 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!68 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!69 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!70 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!71 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!72 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!73 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!74 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!75 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!76 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!77 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!78 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!79 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!80 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!81 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!82 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!83 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!84 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!85 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!86 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!87 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!88 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!89 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!90 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!91 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!92 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 23, baseType: !19, size: 32, align: 32, elements: !95)
!94 = !DIFile(filename: "src/runtime/mini_hexagon_dma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!95 = !{!96}
!96 = !DIEnumerator(name: "QURT_EOK", value: 0, isUnsigned: true)
!97 = !{!98, !13, !7, !219, !286, !104}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !100, file: !99, line: 203, baseType: !101)
!99 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!100 = !DINamespace(scope: !3)
!101 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !100, file: !99, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !102, templateParams: !216)
!102 = !{!103, !106, !107, !108, !109, !110, !112, !116, !122, !127, !131, !136, !139, !143, !147, !152, !158, !191, !198, !201, !204, !209, !210, !213, !214, !215}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !101, file: !99, line: 32, baseType: !104, size: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !101, file: !99, line: 32, baseType: !104, size: 32, offset: 32, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !101, file: !99, line: 32, baseType: !104, size: 32, offset: 64, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !101, file: !99, line: 33, baseType: !13, size: 32, offset: 96, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !101, file: !99, line: 34, baseType: !15, size: 8, offset: 128, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !101, file: !99, line: 35, baseType: !111, size: 8, offset: 136, flags: DIFlagPublic)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8, elements: !31)
!112 = !DISubprogram(name: "Printer", scope: !101, file: !99, line: 37, type: !113, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !13, !104}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !101, file: !99, line: 57, type: !117, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !115, !120}
!119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !101, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!122 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !101, file: !99, line: 67, type: !123, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{!119, !115, !125}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !18, line: 9, baseType: !126)
!126 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!127 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !101, file: !99, line: 72, type: !128, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!128 = !DISubroutineType(types: !129)
!129 = !{!119, !115, !130}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 11, baseType: !46)
!131 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !101, file: !99, line: 77, type: !132, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubroutineType(types: !133)
!133 = !{!119, !115, !134}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 10, baseType: !135)
!135 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!136 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !101, file: !99, line: 82, type: !137, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!137 = !DISubroutineType(types: !138)
!138 = !{!119, !115, !30}
!139 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !101, file: !99, line: 87, type: !140, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!140 = !DISubroutineType(types: !141)
!141 = !{!119, !115, !142}
!142 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!143 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !101, file: !99, line: 92, type: !144, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!144 = !DISubroutineType(types: !145)
!145 = !{!119, !115, !146}
!146 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!147 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !101, file: !99, line: 97, type: !148, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{!119, !115, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!152 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !101, file: !99, line: 102, type: !153, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{!119, !115, !155}
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 14, baseType: !157)
!157 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!158 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !101, file: !99, line: 108, type: !159, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!159 = !DISubroutineType(types: !160)
!160 = !{!119, !115, !161}
!161 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !25, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !164, identifier: "_ZTS13halide_type_t")
!164 = !{!165, !167, !168, !169, !173, !176, !180, !183, !184, !185, !188}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !163, file: !25, line: 434, baseType: !166, size: 8, align: 8)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !25, line: 413, baseType: !36)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !163, file: !25, line: 442, baseType: !37, size: 8, align: 8, offset: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !163, file: !25, line: 446, baseType: !156, size: 16, align: 16, offset: 16)
!169 = !DISubprogram(name: "halide_type_t", scope: !163, file: !25, line: 453, type: !170, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !172, !166, !37, !156}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!173 = !DISubprogram(name: "halide_type_t", scope: !163, file: !25, line: 459, type: !174, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !172}
!176 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !163, file: !25, line: 463, type: !177, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!177 = !DISubroutineType(types: !178)
!178 = !{!163, !179, !156}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!180 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !163, file: !25, line: 468, type: !181, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubroutineType(types: !182)
!182 = !{!15, !179, !161}
!183 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !163, file: !25, line: 472, type: !181, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !163, file: !25, line: 476, type: !181, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !163, file: !25, line: 481, type: !186, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubroutineType(types: !187)
!187 = !{!46, !179}
!188 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !163, file: !25, line: 485, type: !189, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!189 = !DISubroutineType(types: !190)
!190 = !{!30, !179}
!191 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !101, file: !99, line: 113, type: !192, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{!119, !115, !194}
!194 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !25, line: 1550, baseType: !197)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !25, line: 1423, size: 320, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15halide_buffer_t")
!198 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !101, file: !99, line: 119, type: !199, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubroutineType(types: !200)
!200 = !{!120, !115}
!201 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !101, file: !99, line: 131, type: !202, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !115}
!204 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !101, file: !99, line: 139, type: !205, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{!134, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!209 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !101, file: !99, line: 143, type: !205, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !101, file: !99, line: 148, type: !211, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !115, !46}
!213 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !101, file: !99, line: 158, type: !199, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !101, file: !99, line: 162, type: !202, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubprogram(name: "~Printer", scope: !101, file: !99, line: 166, type: !202, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !{!217, !218}
!217 = !DITemplateValueParameter(name: "type", type: !46, value: i32 0)
!218 = !DITemplateValueParameter(name: "length", type: !135, value: i64 1024)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !100, file: !99, line: 199, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !100, file: !99, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !221, templateParams: !284)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !232, !236, !239, !242, !245, !248, !251, !254, !257, !260, !263, !266, !269, !272, !277, !278, !281, !282, !283}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !220, file: !99, line: 32, baseType: !104, size: 32, flags: DIFlagPublic)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !220, file: !99, line: 32, baseType: !104, size: 32, offset: 32, flags: DIFlagPublic)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !220, file: !99, line: 32, baseType: !104, size: 32, offset: 64, flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !220, file: !99, line: 33, baseType: !13, size: 32, offset: 96, flags: DIFlagPublic)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !220, file: !99, line: 34, baseType: !15, size: 8, offset: 128, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !220, file: !99, line: 35, baseType: !111, size: 8, offset: 136, flags: DIFlagPublic)
!228 = !DISubprogram(name: "Printer", scope: !220, file: !99, line: 37, type: !229, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, !13, !104}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!232 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !220, file: !99, line: 57, type: !233, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !231, !120}
!235 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !220, size: 32)
!236 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !220, file: !99, line: 67, type: !237, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{!235, !231, !125}
!239 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !220, file: !99, line: 72, type: !240, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubroutineType(types: !241)
!241 = !{!235, !231, !130}
!242 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !220, file: !99, line: 77, type: !243, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!235, !231, !134}
!245 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !220, file: !99, line: 82, type: !246, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!235, !231, !30}
!248 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !220, file: !99, line: 87, type: !249, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DISubroutineType(types: !250)
!250 = !{!235, !231, !142}
!251 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !220, file: !99, line: 92, type: !252, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!252 = !DISubroutineType(types: !253)
!253 = !{!235, !231, !146}
!254 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !220, file: !99, line: 97, type: !255, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!235, !231, !150}
!257 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !220, file: !99, line: 102, type: !258, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!258 = !DISubroutineType(types: !259)
!259 = !{!235, !231, !155}
!260 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !220, file: !99, line: 108, type: !261, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!235, !231, !161}
