; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::HexagonDma::desc_pool" = type { i8*, i8, %"struct.Halide::Runtime::Internal::HexagonDma::desc_pool"* }
%struct.halide_mutex = type { [1 x i64] }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dma_desc_pool", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma13dma_desc_poolE", scope: !2, file: !6, line: 64, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "HexagonDma", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_dma.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdesc_pool", scope: !2, file: !6, line: 62, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "desc_pool_t", scope: !2, file: !6, line: 60, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "desc_pool", scope: !2, file: !6, line: 56, size: 192, flags: DIFlagTypePassByValue, elements: !11, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma9desc_poolE")
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !10, file: !6, line: 57, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !10, file: !6, line: 58, baseType: !15, size: 8, offset: 64)
!15 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !6, line: 59, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "hexagon_desc_mutex", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma18hexagon_desc_mutexE", scope: !2, file: !6, line: 65, type: !20, isLocal: false, isDefinition: true)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !21, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !22, identifier: "_ZTS12halide_mutex")
!21 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !20, file: !21, line: 121, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !29)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 61, baseType: !27)
!26 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !26, line: 10, baseType: !28)
!28 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!29 = !{!30}
!30 = !DISubrange(count: 1)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "hexagon_dma_device_interface", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma28hexagon_dma_device_interfaceE", scope: !2, file: !6, line: 740, type: !33, isLocal: false, isDefinition: true)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !21, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !34, identifier: "_ZTS25halide_device_interface_t")
!34 = !{!35, !161, !165, !166, !170, !171, !172, !173, !174, !178, !183, !187, !188, !192, !193, !198}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !33, file: !21, line: 724, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !13, !40, !45}
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !21, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !42, identifier: "_ZTS15halide_buffer_t")
!42 = !{!43, !44, !47, !51, !52, !94, !96, !119, !120, !130, !134, !137, !138, !141, !142, !147, !150, !151, !152, !157, !160}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !41, file: !21, line: 1425, baseType: !27, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !41, file: !21, line: 1428, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !41, file: !21, line: 1433, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !26, line: 16, baseType: !50)
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !41, file: !21, line: 1436, baseType: !27, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !21, line: 1439, baseType: !53, size: 32, offset: 256)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !21, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !54, identifier: "_ZTS13halide_type_t")
!54 = !{!55, !64, !65, !68, !72, !75, !80, !84, !85, !86, !89}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !53, file: !21, line: 434, baseType: !56, size: 8, align: 8)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !21, line: 413, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !21, line: 403, baseType: !49, size: 8, elements: !58, identifier: "_ZTS18halide_type_code_t")
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !53, file: !21, line: 442, baseType: !49, size: 8, align: 8, offset: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !53, file: !21, line: 446, baseType: !66, size: 16, align: 16, offset: 16)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 14, baseType: !67)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DISubprogram(name: "halide_type_t", scope: !53, file: !21, line: 453, type: !69, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !56, !49, !66}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!72 = !DISubprogram(name: "halide_type_t", scope: !53, file: !21, line: 459, type: !73, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !71}
!75 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !53, file: !21, line: 463, type: !76, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!76 = !DISubroutineType(types: !77)
!77 = !{!53, !78, !66}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!80 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !53, file: !21, line: 468, type: !81, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{!15, !78, !83}
!83 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !79, size: 64)
!84 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !53, file: !21, line: 472, type: !81, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !53, file: !21, line: 476, type: !81, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!86 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !53, file: !21, line: 481, type: !87, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!87 = !DISubroutineType(types: !88)
!88 = !{!39, !78}
!89 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !53, file: !21, line: 485, type: !90, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !78}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 12, baseType: !93)
!93 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !41, file: !21, line: 1442, baseType: !95, size: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !26, line: 11, baseType: !39)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !41, file: !21, line: 1446, baseType: !97, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !21, line: 1409, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !21, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !100, identifier: "_ZTS18halide_dimension_t")
!100 = !{!101, !102, !103, !104, !105, !109, !112, !118}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !99, file: !21, line: 1383, baseType: !95, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !99, file: !21, line: 1383, baseType: !95, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !99, file: !21, line: 1383, baseType: !95, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !21, line: 1386, baseType: !92, size: 32, offset: 96)
!105 = !DISubprogram(name: "halide_dimension_t", scope: !99, file: !21, line: 1388, type: !106, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!109 = !DISubprogram(name: "halide_dimension_t", scope: !99, file: !21, line: 1389, type: !110, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !108, !95, !95, !95, !92}
!112 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !99, file: !21, line: 1393, type: !113, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{!15, !115, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!117 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !116, size: 64)
!118 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !99, file: !21, line: 1400, type: !113, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !41, file: !21, line: 1449, baseType: !13, size: 64, offset: 384)
!120 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !41, file: !21, line: 1454, type: !121, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!121 = !DISubroutineType(types: !122)
!122 = !{!15, !123, !125}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !21, line: 1416, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 1415, baseType: !93, size: 32, elements: !127, identifier: "_ZTS19halide_buffer_flags")
!127 = !{!128, !129}
!128 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!130 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !41, file: !21, line: 1458, type: !131, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !125, !15}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!134 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !41, file: !21, line: 1466, type: !135, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!135 = !DISubroutineType(types: !136)
!136 = !{!15, !123}
!137 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !41, file: !21, line: 1470, type: !135, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!138 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !41, file: !21, line: 1474, type: !139, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !133, !15}
!141 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !41, file: !21, line: 1478, type: !139, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !41, file: !21, line: 1485, type: !143, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !123}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 27, baseType: !146)
!146 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !41, file: !21, line: 1495, type: !148, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{!48, !123}
!150 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !41, file: !21, line: 1506, type: !148, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !41, file: !21, line: 1518, type: !143, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !41, file: !21, line: 1523, type: !153, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{!48, !123, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!157 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !41, file: !21, line: 1534, type: !158, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{!39, !133, !13}
!160 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !41, file: !21, line: 1545, type: !135, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !33, file: !21, line: 726, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!39, !13, !40}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !33, file: !21, line: 727, baseType: !162, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !33, file: !21, line: 728, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !13, !45}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !33, file: !21, line: 730, baseType: !162, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !33, file: !21, line: 731, baseType: !36, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !33, file: !21, line: 733, baseType: !36, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !33, file: !21, line: 735, baseType: !162, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !33, file: !21, line: 736, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!39, !13, !40, !45, !40}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !33, file: !21, line: 738, baseType: !179, size: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!39, !13, !182, !40}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !33, file: !21, line: 740, baseType: !184, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!39, !13, !182, !39, !39, !40}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !33, file: !21, line: 742, baseType: !162, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !33, file: !21, line: 743, baseType: !189, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!39, !13, !40, !27, !45}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !33, file: !21, line: 745, baseType: !162, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !33, file: !21, line: 746, baseType: !194, size: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!39, !13, !197, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !33, file: !21, line: 747, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !202, line: 10, size: 1024, flags: DIFlagTypePassByValue, elements: !203, identifier: "_ZTS30halide_device_interface_impl_t")
!202 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!203 = !{!204, !208, !209, !210, !211, !212, !216, !217, !218, !219, !220, !221, !222, !223, !224, !228}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !201, file: !202, line: 16, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !201, file: !202, line: 17, baseType: !205, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !201, file: !202, line: 18, baseType: !162, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !201, file: !202, line: 19, baseType: !162, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !201, file: !202, line: 20, baseType: !162, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !201, file: !202, line: 21, baseType: !213, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!39, !13}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !201, file: !202, line: 22, baseType: !162, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !201, file: !202, line: 23, baseType: !162, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !201, file: !202, line: 24, baseType: !162, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !201, file: !202, line: 25, baseType: !162, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !201, file: !202, line: 26, baseType: !175, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !201, file: !202, line: 28, baseType: !179, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !201, file: !202, line: 31, baseType: !184, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !201, file: !202, line: 35, baseType: !162, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !201, file: !202, line: 37, baseType: !225, size: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!39, !13, !40, !27}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !201, file: !202, line: 38, baseType: !162, size: 64, offset: 960)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "hexagon_dma_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma33hexagon_dma_device_interface_implE", scope: !2, file: !6, line: 721, type: !201, isLocal: false, isDefinition: true)
!231 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !232, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !233, retainedTypes: !336, globals: !509, imports: !510, splitDebugInlining: false, nameTableKind: None)
!232 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!233 = !{!57, !126, !234, !281, !299, !315, !329, !333}
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !21, line: 990, baseType: !39, size: 32, elements: !235, identifier: "_ZTS19halide_error_code_t")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!236 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!237 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!238 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!239 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!240 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!241 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!242 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!243 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!244 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!245 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!246 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!247 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!248 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!249 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!250 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!251 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!252 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!253 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!254 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!255 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!256 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!257 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!258 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!259 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!260 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!261 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!262 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!263 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!264 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!265 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!266 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!267 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!268 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!269 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!270 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!271 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!272 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!273 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!274 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!275 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!276 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!277 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!278 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!279 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!280 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 39, baseType: !93, size: 32, align: 32, elements: !283, identifier: "_ZTS9t_eDmaFmt")
!282 = !DIFile(filename: "src/runtime/mini_hexagon_dma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!284 = !DIEnumerator(name: "eDmaFmt_RawData", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "eDmaFmt_NV12", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "eDmaFmt_NV12_Y", value: 2, isUnsigned: true)
!287 = !DIEnumerator(name: "eDmaFmt_NV12_UV", value: 3, isUnsigned: true)
!288 = !DIEnumerator(name: "eDmaFmt_P010", value: 4, isUnsigned: true)
!289 = !DIEnumerator(name: "eDmaFmt_P010_Y", value: 5, isUnsigned: true)
!290 = !DIEnumerator(name: "eDmaFmt_P010_UV", value: 6, isUnsigned: true)
!291 = !DIEnumerator(name: "eDmaFmt_TP10", value: 7, isUnsigned: true)
!292 = !DIEnumerator(name: "eDmaFmt_TP10_Y", value: 8, isUnsigned: true)
!293 = !DIEnumerator(name: "eDmaFmt_TP10_UV", value: 9, isUnsigned: true)
!294 = !DIEnumerator(name: "eDmaFmt_NV124R", value: 10, isUnsigned: true)
!295 = !DIEnumerator(name: "eDmaFmt_NV124R_Y", value: 11, isUnsigned: true)
!296 = !DIEnumerator(name: "eDmaFmt_NV124R_UV", value: 12, isUnsigned: true)
!297 = !DIEnumerator(name: "eDmaFmt_Invalid", value: 13, isUnsigned: true)
!298 = !DIEnumerator(name: "eDmaFmt_MAX", value: 14, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 34, baseType: !93, size: 32, elements: !301, identifier: "_ZTS26halide_hexagon_image_fmt_t")
!300 = !DIFile(filename: "src/runtime/HalideRuntimeHexagonDma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!302 = !DIEnumerator(name: "halide_hexagon_fmt_RawData", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "halide_hexagon_fmt_NV12", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "halide_hexagon_fmt_NV12_Y", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "halide_hexagon_fmt_NV12_UV", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "halide_hexagon_fmt_P010", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "halide_hexagon_fmt_P010_Y", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "halide_hexagon_fmt_P010_UV", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "halide_hexagon_fmt_TP10", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "halide_hexagon_fmt_TP10_Y", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "halide_hexagon_fmt_TP10_UV", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "halide_hexagon_fmt_NV124R", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "halide_hexagon_fmt_NV124R_Y", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "halide_hexagon_fmt_NV124R_UV", value: 12, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_hexagon_power_mode_t", file: !316, line: 66, baseType: !93, size: 32, elements: !317, identifier: "_ZTS27halide_hexagon_power_mode_t")
!316 = !DIFile(filename: "src/runtime/HalideRuntimeHexagonHost.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!318 = !DIEnumerator(name: "halide_hexagon_power_low", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "halide_hexagon_power_nominal", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "halide_hexagon_power_turbo", value: 2, isUnsigned: true)
!321 = !DIEnumerator(name: "halide_hexagon_power_default", value: 3, isUnsigned: true)
!322 = !DIEnumerator(name: "halide_hexagon_power_low_plus", value: 4, isUnsigned: true)
!323 = !DIEnumerator(name: "halide_hexagon_power_low_2", value: 5, isUnsigned: true)
!324 = !DIEnumerator(name: "halide_hexagon_power_nominal_plus", value: 6, isUnsigned: true)
!325 = !DIEnumerator(name: "halide_hvx_power_low", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "halide_hvx_power_nominal", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "halide_hvx_power_turbo", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "halide_hvx_power_default", value: 3, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDmaWrapper_TransationType", file: !282, line: 66, baseType: !93, size: 32, align: 32, elements: !330, identifier: "_ZTS26eDmaWrapper_TransationType")
!330 = !{!331, !332}
!331 = !DIEnumerator(name: "eDmaWrapper_DdrToL2", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "eDmaWrapper_L2ToDdr", value: 1, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 23, baseType: !93, size: 32, align: 32, elements: !334)
!334 = !{!335}
!335 = !DIEnumerator(name: "QURT_EOK", value: 0, isUnsigned: true)
!336 = !{!13, !337, !27, !422, !489, !48, !145, !505, !507, !508, !7, !343}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !339, file: !338, line: 203, baseType: !340)
!338 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!339 = !DINamespace(scope: !3)
!340 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !339, file: !338, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !341, templateParams: !419)
!341 = !{!342, !345, !346, !347, !348, !349, !351, !355, !361, !366, !369, !372, !375, !379, !383, !388, !392, !395, !401, !404, !407, !412, !413, !416, !417, !418}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !340, file: !338, line: 32, baseType: !343, size: 64, flags: DIFlagPublic)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !340, file: !338, line: 32, baseType: !343, size: 64, offset: 64, flags: DIFlagPublic)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !340, file: !338, line: 32, baseType: !343, size: 64, offset: 128, flags: DIFlagPublic)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !340, file: !338, line: 33, baseType: !13, size: 64, offset: 192, flags: DIFlagPublic)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !340, file: !338, line: 34, baseType: !15, size: 8, offset: 256, flags: DIFlagPublic)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !340, file: !338, line: 35, baseType: !350, size: 8, offset: 264, flags: DIFlagPublic)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 8, elements: !29)
!351 = !DISubprogram(name: "Printer", scope: !340, file: !338, line: 37, type: !352, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354, !13, !343}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!355 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !340, file: !338, line: 57, type: !356, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !354, !359}
!358 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !340, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!361 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !340, file: !338, line: 67, type: !362, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!362 = !DISubroutineType(types: !363)
!363 = !{!358, !354, !364}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !26, line: 9, baseType: !365)
!365 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!366 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !340, file: !338, line: 72, type: !367, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!358, !354, !95}
!369 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !340, file: !338, line: 77, type: !370, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!370 = !DISubroutineType(types: !371)
!371 = !{!358, !354, !27}
!372 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !340, file: !338, line: 82, type: !373, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!358, !354, !92}
!375 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !340, file: !338, line: 87, type: !376, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!376 = !DISubroutineType(types: !377)
!377 = !{!358, !354, !378}
!378 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!379 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !340, file: !338, line: 92, type: !380, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!380 = !DISubroutineType(types: !381)
!381 = !{!358, !354, !382}
!382 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!383 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !340, file: !338, line: 97, type: !384, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!384 = !DISubroutineType(types: !385)
!385 = !{!358, !354, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!388 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !340, file: !338, line: 102, type: !389, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubroutineType(types: !390)
!390 = !{!358, !354, !391}
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!392 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !340, file: !338, line: 108, type: !393, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!393 = !DISubroutineType(types: !394)
!394 = !{!358, !354, !83}
!395 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !340, file: !338, line: 113, type: !396, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!396 = !DISubroutineType(types: !397)
!397 = !{!358, !354, !398}
!398 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !21, line: 1550, baseType: !41)
!401 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !340, file: !338, line: 119, type: !402, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!402 = !DISubroutineType(types: !403)
!403 = !{!359, !354}
!404 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !340, file: !338, line: 131, type: !405, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !354}
!407 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !340, file: !338, line: 139, type: !408, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!408 = !DISubroutineType(types: !409)
!409 = !{!27, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!412 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !340, file: !338, line: 143, type: !408, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !340, file: !338, line: 148, type: !414, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !354, !39}
!416 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !340, file: !338, line: 158, type: !402, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!417 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !340, file: !338, line: 162, type: !405, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!418 = !DISubprogram(name: "~Printer", scope: !340, file: !338, line: 166, type: !405, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !{!420, !421}
!420 = !DITemplateValueParameter(name: "type", type: !39, value: i32 0)
!421 = !DITemplateValueParameter(name: "length", type: !28, value: i64 1024)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !339, file: !338, line: 199, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !339, file: !338, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !424, templateParams: !487)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !435, !439, !442, !445, !448, !451, !454, !457, !460, !463, !466, !469, !472, !475, !480, !481, !484, !485, !486}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !423, file: !338, line: 32, baseType: !343, size: 64, flags: DIFlagPublic)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !423, file: !338, line: 32, baseType: !343, size: 64, offset: 64, flags: DIFlagPublic)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !423, file: !338, line: 32, baseType: !343, size: 64, offset: 128, flags: DIFlagPublic)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !423, file: !338, line: 33, baseType: !13, size: 64, offset: 192, flags: DIFlagPublic)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !423, file: !338, line: 34, baseType: !15, size: 8, offset: 256, flags: DIFlagPublic)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !423, file: !338, line: 35, baseType: !350, size: 8, offset: 264, flags: DIFlagPublic)
!431 = !DISubprogram(name: "Printer", scope: !423, file: !338, line: 37, type: !432, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !434, !13, !343}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!435 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !423, file: !338, line: 57, type: !436, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !434, !359}
!438 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !423, size: 64)
!439 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !423, file: !338, line: 67, type: !440, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!440 = !DISubroutineType(types: !441)
!441 = !{!438, !434, !364}
!442 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !423, file: !338, line: 72, type: !443, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!443 = !DISubroutineType(types: !444)
!444 = !{!438, !434, !95}
!445 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !423, file: !338, line: 77, type: !446, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubroutineType(types: !447)
!447 = !{!438, !434, !27}
!448 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !423, file: !338, line: 82, type: !449, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!438, !434, !92}
!451 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !423, file: !338, line: 87, type: !452, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!452 = !DISubroutineType(types: !453)
!453 = !{!438, !434, !378}
!454 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !423, file: !338, line: 92, type: !455, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubroutineType(types: !456)
!456 = !{!438, !434, !382}
!457 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !423, file: !338, line: 97, type: !458, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!458 = !DISubroutineType(types: !459)
!459 = !{!438, !434, !386}
!460 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !423, file: !338, line: 102, type: !461, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!461 = !DISubroutineType(types: !462)
!462 = !{!438, !434, !391}
!463 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !423, file: !338, line: 108, type: !464, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!464 = !DISubroutineType(types: !465)
!465 = !{!438, !434, !83}
!466 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !423, file: !338, line: 113, type: !467, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DISubroutineType(types: !468)
!468 = !{!438, !434, !398}
!469 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !423, file: !338, line: 119, type: !470, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DISubroutineType(types: !471)
!471 = !{!359, !434}
!472 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !423, file: !338, line: 131, type: !473, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !434}
!475 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !423, file: !338, line: 139, type: !476, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!476 = !DISubroutineType(types: !477)
!477 = !{!27, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!480 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !423, file: !338, line: 143, type: !476, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !423, file: !338, line: 148, type: !482, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !434, !39}
!484 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !423, file: !338, line: 158, type: !470, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !423, file: !338, line: 162, type: !473, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !DISubprogram(name: "~Printer", scope: !423, file: !338, line: 166, type: !473, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!487 = !{!488, !421}
!488 = !DITemplateValueParameter(name: "type", type: !39, value: i32 1)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_device_handle", scope: !2, file: !6, line: 21, size: 384, flags: DIFlagTypePassByValue, elements: !491, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma17dma_device_handleE")
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !490, file: !6, line: 22, baseType: !48, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "offset_rdx", scope: !490, file: !6, line: 23, baseType: !66, size: 16, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "offset_rdy", scope: !490, file: !6, line: 24, baseType: !66, size: 16, offset: 80)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "offset_wrx", scope: !490, file: !6, line: 25, baseType: !66, size: 16, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "offset_wry", scope: !490, file: !6, line: 26, baseType: !66, size: 16, offset: 112)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dma_engine", scope: !490, file: !6, line: 27, baseType: !13, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !490, file: !6, line: 28, baseType: !39, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !490, file: !6, line: 29, baseType: !39, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "frame_stride", scope: !490, file: !6, line: 30, baseType: !39, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_ubwc", scope: !490, file: !6, line: 31, baseType: !15, size: 8, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !490, file: !6, line: 32, baseType: !15, size: 8, offset: 296)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !490, file: !6, line: 33, baseType: !504, size: 32, align: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_eDmaFmt", file: !282, line: 55, baseType: !281)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !26, line: 28, baseType: !506)
!506 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !282, line: 11, baseType: !92)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !282, line: 10, baseType: !66)
!509 = !{!0, !18, !229, !31}
!510 = !{!511, !512}
!511 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !231, entity: !3, file: !26, line: 225)
!512 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !231, entity: !2, file: !6, line: 72)
!513 = !{i32 7, !"Dwarf Version", i32 4}
!514 = !{i32 2, !"Debug Info Version", i32 3}
!515 = !{i32 1, !"wchar_size", i32 4}
!516 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!517 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !518, line: 47, type: !519, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !535)
!518 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521, !39, !364, !364}
!521 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !518, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !524, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!524 = !{!525, !526, !527, !528, !532, !533, !534}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !523, file: !518, line: 35, baseType: !27, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !523, file: !518, line: 35, baseType: !27, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !523, file: !518, line: 37, baseType: !27, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !523, file: !518, line: 39, baseType: !529, size: 1024, offset: 192)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !523, file: !518, line: 41, baseType: !529, size: 1024, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !523, file: !518, line: 42, baseType: !529, size: 1024, offset: 2240)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !523, file: !518, line: 44, baseType: !27, size: 64, offset: 3264)
!535 = !{!536, !537, !538, !539, !540, !543, !544}
!536 = !DILocalVariable(name: "copy", arg: 1, scope: !517, file: !518, line: 47, type: !521)
!537 = !DILocalVariable(name: "d", arg: 2, scope: !517, file: !518, line: 47, type: !39)
!538 = !DILocalVariable(name: "src_off", arg: 3, scope: !517, file: !518, line: 47, type: !364)
!539 = !DILocalVariable(name: "dst_off", arg: 4, scope: !517, file: !518, line: 47, type: !364)
!540 = !DILocalVariable(name: "from", scope: !541, file: !518, line: 54, type: !386)
!541 = distinct !DILexicalBlock(scope: !542, file: !518, line: 53, column: 18)
!542 = distinct !DILexicalBlock(scope: !517, file: !518, line: 53, column: 9)
!543 = !DILocalVariable(name: "to", scope: !541, file: !518, line: 55, type: !13)
!544 = !DILocalVariable(name: "i", scope: !545, file: !518, line: 58, type: !27)
!545 = distinct !DILexicalBlock(scope: !546, file: !518, line: 58, column: 9)
!546 = distinct !DILexicalBlock(scope: !542, file: !518, line: 57, column: 12)
!547 = !DILocation(line: 0, scope: !517)
!548 = !DILocation(line: 49, column: 14, scope: !517)
!549 = !DILocation(line: 49, column: 19, scope: !517)
!550 = !DILocation(line: 49, column: 22, scope: !517)
!551 = !{!552, !552, i64 0}
!552 = !{!"long long", !553, i64 0}
!553 = !{!"omnipotent char", !554, i64 0}
!554 = !{!"Simple C++ TBAA"}
!555 = !DILocation(line: 49, column: 37, scope: !517)
!556 = !DILocation(line: 49, column: 5, scope: !517)
!557 = !DILocation(line: 50, column: 10, scope: !558)
!558 = distinct !DILexicalBlock(scope: !517, file: !518, line: 49, column: 43)
!559 = distinct !{!559, !556, !560, !561}
!560 = !DILocation(line: 51, column: 5, scope: !517)
!561 = !{!"llvm.loop.mustprogress"}
!562 = !DILocation(line: 53, column: 11, scope: !542)
!563 = !DILocation(line: 53, column: 9, scope: !517)
!564 = !DILocation(line: 0, scope: !545)
!565 = !DILocation(line: 58, column: 34, scope: !566)
!566 = distinct !DILexicalBlock(scope: !545, file: !518, line: 58, column: 9)
!567 = !DILocation(line: 58, column: 32, scope: !566)
!568 = !DILocation(line: 58, column: 9, scope: !545)
!569 = !DILocation(line: 54, column: 42, scope: !541)
!570 = !{!571, !552, i64 0}
!571 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !552, i64 0, !552, i64 8, !552, i64 16, !553, i64 24, !553, i64 152, !553, i64 280, !552, i64 408}
!572 = !DILocation(line: 54, column: 46, scope: !541)
!573 = !DILocation(line: 54, column: 28, scope: !541)
!574 = !DILocation(line: 0, scope: !541)
!575 = !DILocation(line: 55, column: 34, scope: !541)
!576 = !{!571, !552, i64 8}
!577 = !DILocation(line: 55, column: 38, scope: !541)
!578 = !DILocation(line: 55, column: 20, scope: !541)
!579 = !DILocation(line: 56, column: 31, scope: !541)
!580 = !{!571, !552, i64 408}
!581 = !DILocation(line: 56, column: 9, scope: !541)
!582 = !DILocation(line: 57, column: 5, scope: !541)
!583 = !DILocation(line: 59, column: 13, scope: !584)
!584 = distinct !DILexicalBlock(scope: !566, file: !518, line: 58, column: 55)
!585 = !DILocation(line: 60, column: 24, scope: !584)
!586 = !DILocation(line: 60, column: 21, scope: !584)
!587 = !DILocation(line: 61, column: 24, scope: !584)
!588 = !DILocation(line: 61, column: 21, scope: !584)
!589 = !DILocation(line: 58, column: 51, scope: !566)
!590 = distinct !{!590, !568, !591, !561}
!591 = !DILocation(line: 62, column: 9, scope: !545)
!592 = !DILocation(line: 64, column: 1, scope: !517)
!593 = !DISubprogram(name: "memcpy", scope: !26, file: !26, line: 94, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!13, !13, !386, !146}
!596 = !{}
!597 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !518, line: 66, type: !598, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !521, !13}
!600 = !{!601, !602}
!601 = !DILocalVariable(name: "copy", arg: 1, scope: !597, file: !518, line: 66, type: !521)
!602 = !DILocalVariable(name: "user_context", arg: 2, scope: !597, file: !518, line: 66, type: !13)
!603 = !DILocation(line: 0, scope: !597)
!604 = !DILocation(line: 68, column: 14, scope: !605)
!605 = distinct !DILexicalBlock(scope: !597, file: !518, line: 68, column: 9)
!606 = !DILocation(line: 68, column: 26, scope: !605)
!607 = !DILocation(line: 68, column: 18, scope: !605)
!608 = !DILocation(line: 68, column: 9, scope: !597)
!609 = !DILocation(line: 69, column: 58, scope: !610)
!610 = distinct !DILexicalBlock(scope: !605, file: !518, line: 68, column: 31)
!611 = !{!571, !552, i64 16}
!612 = !DILocation(line: 69, column: 9, scope: !610)
!613 = !DILocation(line: 70, column: 5, scope: !610)
!614 = !DILocalVariable(name: "this", arg: 1, scope: !615, type: !619, flags: DIFlagArtificial | DIFlagObjectPointer)
!615 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !340, file: !338, line: 37, type: !352, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !351, retainedNodes: !616)
!616 = !{!614, !617, !618}
!617 = !DILocalVariable(name: "ctx", arg: 2, scope: !615, file: !338, line: 37, type: !13)
!618 = !DILocalVariable(name: "mem", arg: 3, scope: !615, file: !338, line: 37, type: !343)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!620 = !DILocation(line: 0, scope: !615, inlinedAt: !621)
!621 = distinct !DILocation(line: 71, column: 9, scope: !622)
!622 = distinct !DILexicalBlock(scope: !605, file: !518, line: 70, column: 12)
!623 = !DILocation(line: 44, column: 27, scope: !624, inlinedAt: !621)
!624 = distinct !DILexicalBlock(scope: !625, file: !338, line: 43, column: 16)
!625 = distinct !DILexicalBlock(scope: !626, file: !338, line: 41, column: 20)
!626 = distinct !DILexicalBlock(scope: !627, file: !338, line: 39, column: 13)
!627 = distinct !DILexicalBlock(scope: !615, file: !338, line: 38, column: 54)
!628 = !DILocation(line: 48, column: 13, scope: !629, inlinedAt: !621)
!629 = distinct !DILexicalBlock(scope: !627, file: !338, line: 48, column: 13)
!630 = !DILocation(line: 48, column: 13, scope: !627, inlinedAt: !621)
!631 = !DILocalVariable(name: "this", arg: 1, scope: !632, type: !619, flags: DIFlagArtificial | DIFlagObjectPointer)
!632 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !340, file: !338, line: 57, type: !356, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !355, retainedNodes: !633)
!633 = !{!631, !634}
!634 = !DILocalVariable(name: "arg", arg: 2, scope: !632, file: !338, line: 57, type: !359)
!635 = !DILocation(line: 0, scope: !632, inlinedAt: !636)
!636 = distinct !DILocation(line: 71, column: 29, scope: !622)
!637 = !DILocation(line: 62, column: 19, scope: !638, inlinedAt: !636)
!638 = distinct !DILexicalBlock(scope: !639, file: !338, line: 61, column: 16)
!639 = distinct !DILexicalBlock(scope: !632, file: !338, line: 59, column: 13)
!640 = !DILocalVariable(name: "this", arg: 1, scope: !641, type: !619, flags: DIFlagArtificial | DIFlagObjectPointer)
!641 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !340, file: !338, line: 166, type: !405, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !418, retainedNodes: !642)
!642 = !{!640}
!643 = !DILocation(line: 0, scope: !641, inlinedAt: !644)
!644 = distinct !DILocation(line: 71, column: 9, scope: !622)
!645 = !DILocation(line: 168, column: 13, scope: !646, inlinedAt: !644)
!646 = distinct !DILexicalBlock(scope: !647, file: !338, line: 167, column: 19)
!647 = distinct !DILexicalBlock(scope: !648, file: !338, line: 167, column: 13)
!648 = distinct !DILexicalBlock(scope: !641, file: !338, line: 166, column: 16)
!649 = !DILocation(line: 169, column: 9, scope: !646, inlinedAt: !644)
!650 = !DILocation(line: 49, column: 23, scope: !651, inlinedAt: !621)
!651 = distinct !DILexicalBlock(scope: !629, file: !338, line: 48, column: 18)
!652 = !DILocation(line: 50, column: 18, scope: !651, inlinedAt: !621)
!653 = !{!553, !553, i64 0}
!654 = !DILocalVariable(name: "this", arg: 1, scope: !655, type: !619, flags: DIFlagArtificial | DIFlagObjectPointer)
!655 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !340, file: !338, line: 162, type: !405, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !417, retainedNodes: !656)
!656 = !{!654}
!657 = !DILocation(line: 0, scope: !655, inlinedAt: !658)
!658 = distinct !DILocation(line: 170, column: 13, scope: !659, inlinedAt: !644)
!659 = distinct !DILexicalBlock(scope: !647, file: !338, line: 169, column: 16)
!660 = !DILocation(line: 163, column: 81, scope: !655, inlinedAt: !658)
!661 = !DILocation(line: 163, column: 87, scope: !655, inlinedAt: !658)
!662 = !DILocation(line: 163, column: 15, scope: !655, inlinedAt: !658)
!663 = !DILocation(line: 174, column: 17, scope: !664, inlinedAt: !644)
!664 = distinct !DILexicalBlock(scope: !665, file: !338, line: 173, column: 46)
!665 = distinct !DILexicalBlock(scope: !666, file: !338, line: 173, column: 24)
!666 = distinct !DILexicalBlock(scope: !659, file: !338, line: 171, column: 17)
!667 = !DILocation(line: 181, column: 13, scope: !668, inlinedAt: !644)
!668 = distinct !DILexicalBlock(scope: !669, file: !338, line: 180, column: 40)
!669 = distinct !DILexicalBlock(scope: !648, file: !338, line: 180, column: 13)
!670 = !DILocation(line: 73, column: 1, scope: !597)
!671 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !518, line: 76, type: !672, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !675)
!672 = !DISubroutineType(types: !673)
!673 = !{!523, !674, !15, !674, !15}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!675 = !{!676, !677, !678, !679, !680, !681, !683, !685, !688, !691, !693, !696, !697, !698, !700}
!676 = !DILocalVariable(name: "src", arg: 1, scope: !671, file: !518, line: 76, type: !674)
!677 = !DILocalVariable(name: "src_host", arg: 2, scope: !671, file: !518, line: 76, type: !15)
!678 = !DILocalVariable(name: "dst", arg: 3, scope: !671, file: !518, line: 77, type: !674)
!679 = !DILocalVariable(name: "dst_host", arg: 4, scope: !671, file: !518, line: 77, type: !15)
!680 = !DILocalVariable(name: "c", scope: !671, file: !518, line: 79, type: !523)
!681 = !DILocalVariable(name: "i", scope: !682, file: !518, line: 83, type: !39)
!682 = distinct !DILexicalBlock(scope: !671, file: !518, line: 83, column: 5)
!683 = !DILocalVariable(name: "i", scope: !684, file: !518, line: 91, type: !39)
!684 = distinct !DILexicalBlock(scope: !671, file: !518, line: 91, column: 5)
!685 = !DILocalVariable(name: "zero", scope: !686, file: !518, line: 100, type: !523)
!686 = distinct !DILexicalBlock(scope: !687, file: !518, line: 98, column: 42)
!687 = distinct !DILexicalBlock(scope: !671, file: !518, line: 96, column: 9)
!688 = !DILocalVariable(name: "zero", scope: !689, file: !518, line: 107, type: !523)
!689 = distinct !DILexicalBlock(scope: !690, file: !518, line: 104, column: 28)
!690 = distinct !DILexicalBlock(scope: !671, file: !518, line: 104, column: 9)
!691 = !DILocalVariable(name: "i", scope: !692, file: !518, line: 115, type: !39)
!692 = distinct !DILexicalBlock(scope: !671, file: !518, line: 115, column: 5)
!693 = !DILocalVariable(name: "dst_stride_bytes", scope: !694, file: !518, line: 117, type: !27)
!694 = distinct !DILexicalBlock(scope: !695, file: !518, line: 115, column: 47)
!695 = distinct !DILexicalBlock(scope: !692, file: !518, line: 115, column: 5)
!696 = !DILocalVariable(name: "src_stride_bytes", scope: !694, file: !518, line: 118, type: !27)
!697 = !DILocalVariable(name: "insert", scope: !694, file: !518, line: 120, type: !39)
!698 = !DILocalVariable(name: "j", scope: !699, file: !518, line: 128, type: !39)
!699 = distinct !DILexicalBlock(scope: !694, file: !518, line: 128, column: 9)
!700 = !DILocalVariable(name: "j", scope: !701, file: !518, line: 151, type: !39)
!701 = distinct !DILexicalBlock(scope: !702, file: !518, line: 151, column: 9)
!702 = distinct !DILexicalBlock(scope: !671, file: !518, line: 145, column: 51)
!703 = !DILocation(line: 0, scope: !671)
!704 = !DILocation(line: 79, column: 5, scope: !671)
!705 = !DILocation(line: 79, column: 17, scope: !671)
!706 = !DILocation(line: 80, column: 13, scope: !671)
!707 = !DILocation(line: 80, column: 39, scope: !671)
!708 = !{!709, !710, i64 16}
!709 = !{!"_ZTS15halide_buffer_t", !552, i64 0, !710, i64 8, !710, i64 16, !552, i64 24, !711, i64 32, !714, i64 36, !710, i64 40, !710, i64 48}
!710 = !{!"any pointer", !553, i64 0}
!711 = !{!"_ZTS13halide_type_t", !712, i64 0, !553, i64 1, !713, i64 2}
!712 = !{!"_ZTS18halide_type_code_t", !553, i64 0}
!713 = !{!"short", !553, i64 0}
!714 = !{!"int", !553, i64 0}
!715 = !DILocation(line: 80, column: 24, scope: !671)
!716 = !DILocation(line: 80, column: 51, scope: !671)
!717 = !{!709, !552, i64 0}
!718 = !DILocation(line: 80, column: 7, scope: !671)
!719 = !DILocation(line: 80, column: 11, scope: !671)
!720 = !DILocation(line: 81, column: 13, scope: !671)
!721 = !DILocation(line: 81, column: 39, scope: !671)
!722 = !DILocation(line: 81, column: 24, scope: !671)
!723 = !DILocation(line: 81, column: 51, scope: !671)
!724 = !DILocation(line: 81, column: 7, scope: !671)
!725 = !DILocation(line: 81, column: 11, scope: !671)
!726 = !DILocalVariable(name: "this", arg: 1, scope: !727, type: !729, flags: DIFlagArtificial | DIFlagObjectPointer)
!727 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !53, file: !21, line: 481, type: !87, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !86, retainedNodes: !728)
!728 = !{!726}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!730 = !DILocation(line: 0, scope: !727, inlinedAt: !731)
!731 = distinct !DILocation(line: 82, column: 30, scope: !671)
!732 = !DILocation(line: 482, column: 17, scope: !727, inlinedAt: !731)
!733 = !{!711, !553, i64 1}
!734 = !DILocation(line: 482, column: 22, scope: !727, inlinedAt: !731)
!735 = !DILocation(line: 482, column: 27, scope: !727, inlinedAt: !731)
!736 = !DILocation(line: 82, column: 20, scope: !671)
!737 = !DILocation(line: 82, column: 7, scope: !671)
!738 = !DILocation(line: 82, column: 18, scope: !671)
!739 = !DILocation(line: 0, scope: !682)
!740 = !DILocation(line: 84, column: 9, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !518, line: 83, column: 45)
!742 = distinct !DILexicalBlock(scope: !682, file: !518, line: 83, column: 5)
!743 = !DILocation(line: 84, column: 21, scope: !741)
!744 = !DILocation(line: 85, column: 9, scope: !741)
!745 = !DILocation(line: 85, column: 31, scope: !741)
!746 = !DILocation(line: 86, column: 9, scope: !741)
!747 = !DILocation(line: 86, column: 31, scope: !741)
!748 = !DILocation(line: 90, column: 7, scope: !671)
!749 = !DILocation(line: 0, scope: !684)
!750 = !DILocation(line: 91, column: 30, scope: !751)
!751 = distinct !DILexicalBlock(scope: !684, file: !518, line: 91, column: 5)
!752 = !{!709, !714, i64 36}
!753 = !DILocation(line: 91, column: 23, scope: !751)
!754 = !DILocation(line: 91, column: 5, scope: !684)
!755 = !{!709, !710, i64 40}
!756 = !DILocation(line: 94, column: 17, scope: !671)
!757 = !DILocation(line: 94, column: 22, scope: !671)
!758 = !DILocation(line: 96, column: 33, scope: !687)
!759 = !DILocation(line: 96, column: 25, scope: !687)
!760 = !DILocation(line: 96, column: 44, scope: !687)
!761 = !DILocation(line: 92, column: 46, scope: !762)
!762 = distinct !DILexicalBlock(scope: !751, file: !518, line: 91, column: 47)
!763 = !{!764, !714, i64 8}
!764 = !{!"_ZTS18halide_dimension_t", !714, i64 0, !714, i64 4, !714, i64 8, !714, i64 12}
!765 = !DILocation(line: 92, column: 34, scope: !762)
!766 = !DILocation(line: 92, column: 68, scope: !762)
!767 = !{!764, !714, i64 0}
!768 = !DILocation(line: 92, column: 86, scope: !762)
!769 = !DILocation(line: 92, column: 72, scope: !762)
!770 = !DILocation(line: 92, column: 55, scope: !762)
!771 = !DILocation(line: 92, column: 53, scope: !762)
!772 = !DILocation(line: 92, column: 21, scope: !762)
!773 = !DILocation(line: 91, column: 43, scope: !751)
!774 = distinct !{!774, !754, !775, !561}
!775 = !DILocation(line: 93, column: 5, scope: !684)
!776 = !DILocation(line: 0, scope: !727, inlinedAt: !777)
!777 = distinct !DILocation(line: 97, column: 19, scope: !687)
!778 = !DILocation(line: 0, scope: !727, inlinedAt: !779)
!779 = distinct !DILocation(line: 97, column: 40, scope: !687)
!780 = !DILocation(line: 482, column: 17, scope: !727, inlinedAt: !779)
!781 = !DILocation(line: 482, column: 22, scope: !727, inlinedAt: !779)
!782 = !DILocation(line: 482, column: 27, scope: !727, inlinedAt: !779)
!783 = !DILocation(line: 97, column: 27, scope: !687)
!784 = !DILocation(line: 97, column: 48, scope: !687)
!785 = !DILocation(line: 100, column: 21, scope: !686)
!786 = !DILocation(line: 101, column: 9, scope: !686)
!787 = !DILocation(line: 104, column: 22, scope: !690)
!788 = !DILocation(line: 104, column: 9, scope: !671)
!789 = !DILocation(line: 0, scope: !692)
!790 = !DILocation(line: 115, column: 5, scope: !692)
!791 = !DILocation(line: 115, column: 23, scope: !695)
!792 = !DILocation(line: 107, column: 21, scope: !689)
!793 = !DILocation(line: 108, column: 9, scope: !689)
!794 = !DILocation(line: 144, column: 14, scope: !671)
!795 = !DILocation(line: 144, column: 28, scope: !671)
!796 = !DILocation(line: 144, column: 25, scope: !671)
!797 = !DILocation(line: 144, column: 50, scope: !671)
!798 = !DILocation(line: 145, column: 28, scope: !671)
!799 = !DILocation(line: 117, column: 59, scope: !694)
!800 = !DILocation(line: 117, column: 47, scope: !694)
!801 = !DILocation(line: 0, scope: !727, inlinedAt: !802)
!802 = distinct !DILocation(line: 117, column: 78, scope: !694)
!803 = !DILocation(line: 117, column: 66, scope: !694)
!804 = !DILocation(line: 0, scope: !694)
!805 = !DILocation(line: 118, column: 59, scope: !694)
!806 = !DILocation(line: 118, column: 47, scope: !694)
!807 = !DILocation(line: 0, scope: !727, inlinedAt: !808)
!808 = distinct !DILocation(line: 118, column: 78, scope: !694)
!809 = !DILocation(line: 118, column: 66, scope: !694)
!810 = !DILocation(line: 121, column: 33, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !518, line: 121, column: 9)
!812 = distinct !DILexicalBlock(scope: !694, file: !518, line: 121, column: 9)
!813 = !DILocation(line: 121, column: 9, scope: !812)
!814 = !DILocation(line: 128, column: 27, scope: !815)
!815 = distinct !DILexicalBlock(scope: !699, file: !518, line: 128, column: 9)
!816 = !DILocation(line: 124, column: 36, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !518, line: 124, column: 17)
!818 = distinct !DILexicalBlock(scope: !811, file: !518, line: 121, column: 48)
!819 = !DILocation(line: 124, column: 34, scope: !817)
!820 = !DILocation(line: 124, column: 63, scope: !817)
!821 = !DILocation(line: 121, column: 44, scope: !811)
!822 = distinct !{!822, !813, !823, !561}
!823 = !DILocation(line: 127, column: 9, scope: !812)
!824 = !DILocation(line: 0, scope: !812)
!825 = !DILocation(line: 0, scope: !699)
!826 = !DILocation(line: 128, column: 9, scope: !699)
!827 = !DILocation(line: 133, column: 40, scope: !694)
!828 = !{!764, !714, i64 4}
!829 = !DILocation(line: 133, column: 28, scope: !694)
!830 = !DILocation(line: 133, column: 9, scope: !694)
!831 = !DILocation(line: 133, column: 26, scope: !694)
!832 = !DILocation(line: 135, column: 9, scope: !694)
!833 = !DILocation(line: 135, column: 36, scope: !694)
!834 = !DILocation(line: 136, column: 9, scope: !694)
!835 = !DILocation(line: 136, column: 36, scope: !694)
!836 = !DILocation(line: 115, column: 43, scope: !695)
!837 = distinct !{!837, !790, !838, !561}
!838 = !DILocation(line: 137, column: 5, scope: !692)
!839 = !DILocation(line: 129, column: 38, scope: !840)
!840 = distinct !DILexicalBlock(scope: !815, file: !518, line: 128, column: 42)
!841 = !DILocation(line: 129, column: 27, scope: !840)
!842 = !DILocation(line: 129, column: 13, scope: !840)
!843 = !DILocation(line: 129, column: 25, scope: !840)
!844 = !DILocation(line: 130, column: 37, scope: !840)
!845 = !DILocation(line: 130, column: 13, scope: !840)
!846 = !DILocation(line: 130, column: 35, scope: !840)
!847 = !DILocation(line: 131, column: 37, scope: !840)
!848 = !DILocation(line: 131, column: 13, scope: !840)
!849 = !DILocation(line: 131, column: 35, scope: !840)
!850 = distinct !{!850, !826, !851, !561}
!851 = !DILocation(line: 132, column: 9, scope: !699)
!852 = !DILocation(line: 145, column: 25, scope: !671)
!853 = !DILocation(line: 144, column: 5, scope: !671)
!854 = !DILocation(line: 147, column: 25, scope: !702)
!855 = !DILocation(line: 147, column: 22, scope: !702)
!856 = !DILocation(line: 0, scope: !701)
!857 = !DILocation(line: 152, column: 31, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !518, line: 151, column: 49)
!859 = distinct !DILexicalBlock(scope: !701, file: !518, line: 151, column: 9)
!860 = !DILocation(line: 152, column: 29, scope: !858)
!861 = !DILocation(line: 153, column: 41, scope: !858)
!862 = !DILocation(line: 153, column: 39, scope: !858)
!863 = !DILocation(line: 154, column: 41, scope: !858)
!864 = !DILocation(line: 154, column: 39, scope: !858)
!865 = !DILocation(line: 156, column: 37, scope: !702)
!866 = !DILocation(line: 157, column: 47, scope: !702)
!867 = !DILocation(line: 158, column: 47, scope: !702)
!868 = distinct !{!868, !853, !869, !561}
!869 = !DILocation(line: 159, column: 5, scope: !671)
!870 = !DILocation(line: 160, column: 12, scope: !671)
!871 = !{i64 0, i64 8, !551, i64 8, i64 8, !551, i64 16, i64 8, !551, i64 24, i64 128, !653, i64 152, i64 128, !653, i64 280, i64 128, !653, i64 408, i64 8, !551}
!872 = !DILocation(line: 160, column: 5, scope: !671)
!873 = !DILocation(line: 161, column: 1, scope: !671)
!874 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !518, line: 163, type: !875, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!523, !674}
!877 = !{!878}
!878 = !DILocalVariable(name: "buf", arg: 1, scope: !874, file: !518, line: 163, type: !674)
!879 = !DILocation(line: 0, scope: !874)
!880 = !DILocation(line: 164, column: 12, scope: !874)
!881 = !DILocation(line: 164, column: 5, scope: !874)
!882 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !518, line: 167, type: !875, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !883)
!883 = !{!884}
!884 = !DILocalVariable(name: "buf", arg: 1, scope: !882, file: !518, line: 167, type: !674)
!885 = !DILocation(line: 0, scope: !882)
!886 = !DILocation(line: 168, column: 12, scope: !882)
!887 = !DILocation(line: 168, column: 5, scope: !882)
!888 = distinct !DISubprogram(name: "halide_hexagon_dma_device_malloc", scope: !6, file: !6, line: 363, type: !889, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !892)
!889 = !DISubroutineType(types: !890)
!890 = !{!39, !13, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!892 = !{!893, !894, !895, !896, !897}
!893 = !DILocalVariable(name: "user_context", arg: 1, scope: !888, file: !6, line: 363, type: !13)
!894 = !DILocalVariable(name: "buf", arg: 2, scope: !888, file: !6, line: 363, type: !891)
!895 = !DILocalVariable(name: "size", scope: !888, file: !6, line: 373, type: !145)
!896 = !DILocalVariable(name: "mem", scope: !888, file: !6, line: 376, type: !13)
!897 = !DILocalVariable(name: "err", scope: !888, file: !6, line: 382, type: !39)
!898 = !DILocation(line: 0, scope: !888)
!899 = !DILocation(line: 0, scope: !615, inlinedAt: !900)
!900 = distinct !DILocation(line: 364, column: 5, scope: !888)
!901 = !DILocation(line: 44, column: 27, scope: !624, inlinedAt: !900)
!902 = !DILocation(line: 48, column: 13, scope: !629, inlinedAt: !900)
!903 = !DILocation(line: 48, column: 13, scope: !627, inlinedAt: !900)
!904 = !DILocation(line: 49, column: 23, scope: !651, inlinedAt: !900)
!905 = !DILocation(line: 50, column: 18, scope: !651, inlinedAt: !900)
!906 = !DILocation(line: 51, column: 9, scope: !651, inlinedAt: !900)
!907 = !DILocation(line: 0, scope: !629, inlinedAt: !900)
!908 = !DILocation(line: 0, scope: !632, inlinedAt: !909)
!909 = distinct !DILocation(line: 365, column: 9, scope: !888)
!910 = !DILocation(line: 62, column: 19, scope: !638, inlinedAt: !909)
!911 = !DILocalVariable(name: "this", arg: 1, scope: !912, type: !619, flags: DIFlagArtificial | DIFlagObjectPointer)
!912 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !340, file: !338, line: 97, type: !384, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !383, retainedNodes: !913)
!913 = !{!911, !914}
!914 = !DILocalVariable(name: "arg", arg: 2, scope: !912, file: !338, line: 97, type: !386)
!915 = !DILocation(line: 0, scope: !912, inlinedAt: !916)
!916 = distinct !DILocation(line: 365, column: 72, scope: !888)
!917 = !DILocation(line: 98, column: 15, scope: !912, inlinedAt: !916)
!918 = !DILocation(line: 0, scope: !632, inlinedAt: !919)
!919 = distinct !DILocation(line: 366, column: 9, scope: !888)
!920 = !DILocation(line: 62, column: 19, scope: !638, inlinedAt: !919)
!921 = !DILocalVariable(name: "this", arg: 1, scope: !922, type: !619, flags: DIFlagArtificial | DIFlagObjectPointer)
!922 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !340, file: !338, line: 113, type: !396, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !395, retainedNodes: !923)
!923 = !{!921, !924}
!924 = !DILocalVariable(name: "buf", arg: 2, scope: !922, file: !338, line: 113, type: !398)
!925 = !DILocation(line: 0, scope: !922, inlinedAt: !926)
!926 = distinct !DILocation(line: 366, column: 22, scope: !888)
!927 = !DILocation(line: 114, column: 15, scope: !922, inlinedAt: !926)
!928 = !DILocation(line: 0, scope: !632, inlinedAt: !929)
!929 = distinct !DILocation(line: 366, column: 30, scope: !888)
!930 = !DILocation(line: 62, column: 19, scope: !638, inlinedAt: !929)
!931 = !DILocation(line: 0, scope: !641, inlinedAt: !932)
!932 = distinct !DILocation(line: 364, column: 5, scope: !888)
!933 = !DILocation(line: 167, column: 13, scope: !648, inlinedAt: !932)
!934 = !DILocation(line: 168, column: 13, scope: !646, inlinedAt: !932)
!935 = !DILocation(line: 169, column: 9, scope: !646, inlinedAt: !932)
!936 = !DILocation(line: 0, scope: !655, inlinedAt: !937)
!937 = distinct !DILocation(line: 170, column: 13, scope: !659, inlinedAt: !932)
!938 = !DILocation(line: 163, column: 81, scope: !655, inlinedAt: !937)
!939 = !DILocation(line: 163, column: 87, scope: !655, inlinedAt: !937)
!940 = !DILocation(line: 163, column: 15, scope: !655, inlinedAt: !937)
!941 = !DILocation(line: 174, column: 17, scope: !664, inlinedAt: !932)
!942 = !DILocation(line: 181, column: 13, scope: !668, inlinedAt: !932)
!943 = !DILocation(line: 368, column: 14, scope: !944)
!944 = distinct !DILexicalBlock(scope: !888, file: !6, line: 368, column: 9)
!945 = !DILocation(line: 368, column: 9, scope: !944)
!946 = !DILocation(line: 368, column: 9, scope: !888)
!947 = !DILocation(line: 0, scope: !615, inlinedAt: !948)
!948 = distinct !DILocation(line: 369, column: 9, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !6, line: 368, column: 22)
!950 = !DILocation(line: 44, column: 27, scope: !624, inlinedAt: !948)
!951 = !DILocation(line: 48, column: 13, scope: !629, inlinedAt: !948)
!952 = !DILocation(line: 48, column: 13, scope: !627, inlinedAt: !948)
!953 = !DILocation(line: 0, scope: !632, inlinedAt: !954)
!954 = distinct !DILocation(line: 369, column: 29, scope: !949)
!955 = !DILocation(line: 62, column: 19, scope: !638, inlinedAt: !954)
!956 = !DILocation(line: 0, scope: !641, inlinedAt: !957)
!957 = distinct !DILocation(line: 369, column: 9, scope: !949)
!958 = !DILocation(line: 168, column: 13, scope: !646, inlinedAt: !957)
!959 = !DILocation(line: 169, column: 9, scope: !646, inlinedAt: !957)
!960 = !DILocation(line: 49, column: 23, scope: !651, inlinedAt: !948)
!961 = !DILocation(line: 50, column: 18, scope: !651, inlinedAt: !948)
!962 = !DILocation(line: 0, scope: !655, inlinedAt: !963)
!963 = distinct !DILocation(line: 170, column: 13, scope: !659, inlinedAt: !957)
!964 = !DILocation(line: 163, column: 81, scope: !655, inlinedAt: !963)
!965 = !DILocation(line: 163, column: 87, scope: !655, inlinedAt: !963)
!966 = !DILocation(line: 163, column: 15, scope: !655, inlinedAt: !963)
!967 = !DILocation(line: 174, column: 17, scope: !664, inlinedAt: !957)
!968 = !DILocation(line: 181, column: 13, scope: !668, inlinedAt: !957)
!969 = !DILocation(line: 370, column: 9, scope: !949)
!970 = !DILocalVariable(name: "this", arg: 1, scope: !971, type: !182, flags: DIFlagArtificial | DIFlagObjectPointer)
!971 = distinct !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !41, file: !21, line: 1518, type: !143, scopeLine: 1518, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !151, retainedNodes: !972)
!972 = !{!970}
!973 = !DILocation(line: 0, scope: !971, inlinedAt: !974)
!974 = distinct !DILocation(line: 373, column: 24, scope: !888)
!975 = !DILocalVariable(name: "this", arg: 1, scope: !976, type: !182, flags: DIFlagArtificial | DIFlagObjectPointer)
!976 = distinct !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !41, file: !21, line: 1506, type: !148, scopeLine: 1506, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !150, retainedNodes: !977)
!977 = !{!975, !978, !979}
!978 = !DILocalVariable(name: "index", scope: !976, file: !21, line: 1507, type: !505)
!979 = !DILocalVariable(name: "i", scope: !980, file: !21, line: 1508, type: !39)
!980 = distinct !DILexicalBlock(scope: !976, file: !21, line: 1508, column: 9)
!981 = !DILocation(line: 0, scope: !976, inlinedAt: !982)
!982 = distinct !DILocation(line: 1519, column: 25, scope: !971, inlinedAt: !974)
!983 = !DILocation(line: 0, scope: !980, inlinedAt: !982)
!984 = !DILocation(line: 1508, column: 29, scope: !985, inlinedAt: !982)
!985 = distinct !DILexicalBlock(scope: !980, file: !21, line: 1508, column: 9)
!986 = !DILocation(line: 1508, column: 27, scope: !985, inlinedAt: !982)
!987 = !DILocation(line: 1508, column: 9, scope: !980, inlinedAt: !982)
!988 = !DILocation(line: 0, scope: !727, inlinedAt: !989)
!989 = distinct !DILocation(line: 1514, column: 36, scope: !976, inlinedAt: !982)
!990 = !DILocation(line: 482, column: 17, scope: !727, inlinedAt: !989)
!991 = !DILocalVariable(name: "this", arg: 1, scope: !992, type: !182, flags: DIFlagArtificial | DIFlagObjectPointer)
!992 = distinct !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !41, file: !21, line: 1495, type: !148, scopeLine: 1495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !147, retainedNodes: !993)
!993 = !{!991, !994, !995}
!994 = !DILocalVariable(name: "index", scope: !992, file: !21, line: 1496, type: !505)
!995 = !DILocalVariable(name: "i", scope: !996, file: !21, line: 1497, type: !39)
!996 = distinct !DILexicalBlock(scope: !992, file: !21, line: 1497, column: 9)
!997 = !DILocation(line: 0, scope: !992, inlinedAt: !998)
!998 = distinct !DILocation(line: 1519, column: 33, scope: !971, inlinedAt: !974)
!999 = !DILocation(line: 0, scope: !996, inlinedAt: !998)
!1000 = !DILocation(line: 1497, column: 9, scope: !996, inlinedAt: !998)
!1001 = !DILocation(line: 1509, column: 24, scope: !1002, inlinedAt: !982)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !21, line: 1509, column: 17)
!1003 = distinct !DILexicalBlock(scope: !985, file: !21, line: 1508, column: 46)
!1004 = !DILocation(line: 1509, column: 31, scope: !1002, inlinedAt: !982)
!1005 = !DILocation(line: 1509, column: 17, scope: !1003, inlinedAt: !982)
!1006 = !DILocation(line: 1510, column: 37, scope: !1007, inlinedAt: !982)
!1007 = distinct !DILexicalBlock(scope: !1002, file: !21, line: 1509, column: 36)
!1008 = !DILocation(line: 1510, column: 61, scope: !1007, inlinedAt: !982)
!1009 = !DILocation(line: 1510, column: 68, scope: !1007, inlinedAt: !982)
!1010 = !DILocation(line: 1510, column: 53, scope: !1007, inlinedAt: !982)
!1011 = !DILocation(line: 1510, column: 51, scope: !1007, inlinedAt: !982)
!1012 = !DILocation(line: 1510, column: 23, scope: !1007, inlinedAt: !982)
!1013 = !DILocation(line: 1511, column: 13, scope: !1007, inlinedAt: !982)
!1014 = !DILocation(line: 1508, column: 42, scope: !985, inlinedAt: !982)
!1015 = distinct !{!1015, !987, !1016, !561}
!1016 = !DILocation(line: 1512, column: 9, scope: !980, inlinedAt: !982)
!1017 = !DILocation(line: 1498, column: 24, scope: !1018, inlinedAt: !998)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !21, line: 1498, column: 17)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !21, line: 1497, column: 46)
!1020 = distinct !DILexicalBlock(scope: !996, file: !21, line: 1497, column: 9)
!1021 = !DILocation(line: 1498, column: 31, scope: !1018, inlinedAt: !998)
!1022 = !DILocation(line: 1498, column: 17, scope: !1019, inlinedAt: !998)
!1023 = !DILocation(line: 1499, column: 37, scope: !1024, inlinedAt: !998)
!1024 = distinct !DILexicalBlock(scope: !1018, file: !21, line: 1498, column: 36)
!1025 = !DILocation(line: 1499, column: 61, scope: !1024, inlinedAt: !998)
!1026 = !DILocation(line: 1499, column: 68, scope: !1024, inlinedAt: !998)
!1027 = !DILocation(line: 1499, column: 53, scope: !1024, inlinedAt: !998)
!1028 = !DILocation(line: 1499, column: 51, scope: !1024, inlinedAt: !998)
!1029 = !DILocation(line: 1499, column: 23, scope: !1024, inlinedAt: !998)
!1030 = !DILocation(line: 1500, column: 13, scope: !1024, inlinedAt: !998)
!1031 = !DILocation(line: 1497, column: 42, scope: !1020, inlinedAt: !998)
!1032 = !DILocation(line: 1497, column: 27, scope: !1020, inlinedAt: !998)
!1033 = distinct !{!1033, !1000, !1034, !561}
!1034 = !DILocation(line: 1501, column: 9, scope: !996, inlinedAt: !998)
!1035 = !DILocation(line: 482, column: 22, scope: !727, inlinedAt: !989)
!1036 = !DILocation(line: 482, column: 27, scope: !727, inlinedAt: !989)
!1037 = !DILocation(line: 1513, column: 15, scope: !976, inlinedAt: !982)
!1038 = !DILocation(line: 0, scope: !727, inlinedAt: !1039)
!1039 = distinct !DILocation(line: 1502, column: 36, scope: !992, inlinedAt: !998)
!1040 = !DILocation(line: 1519, column: 31, scope: !971, inlinedAt: !974)
!1041 = !DILocation(line: 374, column: 5, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !6, line: 374, column: 5)
!1043 = distinct !DILexicalBlock(scope: !888, file: !6, line: 374, column: 5)
!1044 = !DILocation(line: 374, column: 5, scope: !1043)
!1045 = !DILocation(line: 374, column: 5, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !6, line: 374, column: 5)
!1047 = !DILocation(line: 376, column: 17, scope: !888)
!1048 = !DILocation(line: 377, column: 10, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !888, file: !6, line: 377, column: 9)
!1050 = !DILocation(line: 377, column: 9, scope: !888)
!1051 = !DILocalVariable(name: "this", arg: 1, scope: !1052, type: !1056, flags: DIFlagArtificial | DIFlagObjectPointer)
!1052 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EEC2EPvPc", scope: !423, file: !338, line: 37, type: !432, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !431, retainedNodes: !1053)
!1053 = !{!1051, !1054, !1055}
!1054 = !DILocalVariable(name: "ctx", arg: 2, scope: !1052, file: !338, line: 37, type: !13)
!1055 = !DILocalVariable(name: "mem", arg: 3, scope: !1052, file: !338, line: 37, type: !343)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!1057 = !DILocation(line: 0, scope: !1052, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 378, column: 9, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1049, file: !6, line: 377, column: 15)
!1060 = !DILocation(line: 44, column: 27, scope: !1061, inlinedAt: !1058)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !338, line: 43, column: 16)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !338, line: 41, column: 20)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !338, line: 39, column: 13)
!1064 = distinct !DILexicalBlock(scope: !1052, file: !338, line: 38, column: 54)
!1065 = !DILocation(line: 48, column: 13, scope: !1066, inlinedAt: !1058)
!1066 = distinct !DILexicalBlock(scope: !1064, file: !338, line: 48, column: 13)
!1067 = !DILocation(line: 48, column: 13, scope: !1064, inlinedAt: !1058)
!1068 = !DILocalVariable(name: "this", arg: 1, scope: !1069, type: !1056, flags: DIFlagArtificial | DIFlagObjectPointer)
!1069 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !423, file: !338, line: 57, type: !436, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !435, retainedNodes: !1070)
!1070 = !{!1068, !1071}
!1071 = !DILocalVariable(name: "arg", arg: 2, scope: !1069, file: !338, line: 57, type: !359)
!1072 = !DILocation(line: 0, scope: !1069, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 378, column: 29, scope: !1059)
!1074 = !DILocation(line: 62, column: 19, scope: !1075, inlinedAt: !1073)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !338, line: 61, column: 16)
!1076 = distinct !DILexicalBlock(scope: !1069, file: !338, line: 59, column: 13)
!1077 = !DILocalVariable(name: "this", arg: 1, scope: !1078, type: !1056, flags: DIFlagArtificial | DIFlagObjectPointer)
!1078 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EED2Ev", scope: !423, file: !338, line: 166, type: !473, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !486, retainedNodes: !1079)
!1079 = !{!1077}
!1080 = !DILocation(line: 0, scope: !1078, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 378, column: 9, scope: !1059)
!1082 = !DILocation(line: 168, column: 13, scope: !1083, inlinedAt: !1081)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !338, line: 167, column: 19)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !338, line: 167, column: 13)
!1085 = distinct !DILexicalBlock(scope: !1078, file: !338, line: 166, column: 16)
!1086 = !DILocation(line: 169, column: 9, scope: !1083, inlinedAt: !1081)
!1087 = !DILocation(line: 49, column: 23, scope: !1088, inlinedAt: !1058)
!1088 = distinct !DILexicalBlock(scope: !1066, file: !338, line: 48, column: 18)
!1089 = !DILocation(line: 50, column: 18, scope: !1088, inlinedAt: !1058)
!1090 = !DILocalVariable(name: "this", arg: 1, scope: !1091, type: !1056, flags: DIFlagArtificial | DIFlagObjectPointer)
!1091 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !423, file: !338, line: 162, type: !473, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, declaration: !485, retainedNodes: !1092)
!1092 = !{!1090}
!1093 = !DILocation(line: 0, scope: !1091, inlinedAt: !1094)
!1094 = distinct !DILocation(line: 170, column: 13, scope: !1095, inlinedAt: !1081)
!1095 = distinct !DILexicalBlock(scope: !1084, file: !338, line: 169, column: 16)
!1096 = !DILocation(line: 163, column: 81, scope: !1091, inlinedAt: !1094)
!1097 = !DILocation(line: 163, column: 87, scope: !1091, inlinedAt: !1094)
!1098 = !DILocation(line: 163, column: 15, scope: !1091, inlinedAt: !1094)
!1099 = !DILocation(line: 172, column: 17, scope: !1100, inlinedAt: !1081)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !338, line: 171, column: 39)
!1101 = distinct !DILexicalBlock(scope: !1095, file: !338, line: 171, column: 17)
!1102 = !DILocation(line: 181, column: 13, scope: !1103, inlinedAt: !1081)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !338, line: 180, column: 40)
!1104 = distinct !DILexicalBlock(scope: !1085, file: !338, line: 180, column: 13)
!1105 = !DILocation(line: 379, column: 9, scope: !1059)
!1106 = !DILocation(line: 383, column: 53, scope: !888)
!1107 = !DILocation(line: 382, column: 15, scope: !888)
!1108 = !DILocation(line: 384, column: 13, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !888, file: !6, line: 384, column: 9)
!1110 = !DILocation(line: 384, column: 9, scope: !888)
!1111 = !DILocation(line: 385, column: 9, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1109, file: !6, line: 384, column: 19)
!1113 = !DILocation(line: 386, column: 9, scope: !1112)
!1114 = !DILocation(line: 390, column: 1, scope: !888)
!1115 = !DISubprogram(name: "halide_print", scope: !21, file: !21, line: 97, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !596)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !13, !359}
!1118 = !DISubprogram(name: "abort", scope: !26, file: !26, line: 108, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !596)
