; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_host.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_host.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::Hexagon::_remote_buffer__seq_octet" = type { i8*, i32, [4 x i8] }
%"struct.Halide::Runtime::Internal::Hexagon::module_state" = type { i32, %"struct.Halide::Runtime::Internal::Hexagon::module_state"* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "thread_lock", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon11thread_lockE", scope: !2, file: !6, line: 18, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Hexagon", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_host.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !8, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS12halide_mutex")
!8 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !7, file: !8, line: 121, baseType: !11, size: 64)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !16)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 61, baseType: !14)
!13 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 10, baseType: !15)
!15 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !{!17}
!17 = !DISubrange(count: 1)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "remote_load_library", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon19remote_load_libraryE", scope: !2, file: !6, line: 48, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_load_library_fn", scope: !2, file: !6, line: 30, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !25, !24, !28, !24, !31}
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_hexagon_handle_t", file: !33, line: 21, baseType: !24)
!33 = !DIFile(filename: "src/runtime/HalideRuntimeHexagonHost.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "remote_get_symbol", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon17remote_get_symbolE", scope: !2, file: !6, line: 49, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_get_symbol_fn", scope: !2, file: !6, line: 31, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!24, !32, !25, !24, !31}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "remote_run", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon10remote_runE", scope: !2, file: !6, line: 50, type: !42, isLocal: false, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_run_fn", scope: !2, file: !6, line: 32, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!24, !32, !24, !46, !24, !46, !24, !55, !24}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_buffer", scope: !2, file: !6, line: 24, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "_remote_buffer__seq_octet", scope: !2, file: !6, line: 23, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_remote_buffer__seq_octet", scope: !2, file: !6, line: 25, size: 128, flags: DIFlagTypePassByValue, elements: !51, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon25_remote_buffer__seq_octetE")
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !6, line: 26, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dataLen", scope: !50, file: !6, line: 27, baseType: !24, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "remote_release_library", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon22remote_release_libraryE", scope: !2, file: !6, line: 51, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_release_library_fn", scope: !2, file: !6, line: 35, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!24, !32}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "remote_poll_log", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon15remote_poll_logE", scope: !2, file: !6, line: 52, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_poll_log_fn", scope: !2, file: !6, line: 36, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!24, !68, !24, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "remote_poll_profiler_state", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon26remote_poll_profiler_stateE", scope: !2, file: !6, line: 53, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_poll_profiler_state_fn", scope: !2, file: !6, line: 37, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !69, !69}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "remote_profiler_set_current_func", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon32remote_profiler_set_current_funcE", scope: !2, file: !6, line: 54, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_profiler_set_current_func_fn", scope: !2, file: !6, line: 38, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!24, !24}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "remote_power_hvx_on", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon19remote_power_hvx_onE", scope: !2, file: !6, line: 55, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_power_fn", scope: !2, file: !6, line: 39, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!24}
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "remote_power_hvx_off", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon20remote_power_hvx_offE", scope: !2, file: !6, line: 56, type: !84, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "remote_set_performance", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon22remote_set_performanceE", scope: !2, file: !6, line: 57, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_power_perf_fn", scope: !2, file: !6, line: 41, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!24, !24, !96, !96, !24, !96, !96, !24, !24}
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "remote_set_performance_mode", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon27remote_set_performance_modeE", scope: !2, file: !6, line: 58, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_power_mode_fn", scope: !2, file: !6, line: 40, baseType: !79)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "remote_set_thread_priority", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon26remote_set_thread_priorityE", scope: !2, file: !6, line: 59, type: !102, isLocal: false, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_thread_priority_fn", scope: !2, file: !6, line: 42, baseType: !79)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "host_malloc_init", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon16host_malloc_initE", scope: !2, file: !6, line: 61, type: !105, isLocal: false, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "host_malloc_init_fn", scope: !2, file: !6, line: 44, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "host_malloc_deinit", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon18host_malloc_deinitE", scope: !2, file: !6, line: 62, type: !105, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "host_malloc", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon11host_mallocE", scope: !2, file: !6, line: 63, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "host_malloc_fn", scope: !2, file: !6, line: 45, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 27, baseType: !119)
!119 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "host_free", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon9host_freeE", scope: !2, file: !6, line: 64, type: !122, isLocal: false, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "host_free_fn", scope: !2, file: !6, line: 46, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !117}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "state_list", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon10state_listE", scope: !2, file: !6, line: 201, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_state", scope: !2, file: !6, line: 197, size: 128, flags: DIFlagTypePassByValue, elements: !130, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon12module_stateE")
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !129, file: !6, line: 198, baseType: !32, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !6, line: 199, baseType: !128, size: 64, offset: 64)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "shared_runtime", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon14shared_runtimeE", scope: !2, file: !6, line: 202, type: !32, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "unique_id", scope: !137, file: !6, line: 306, type: !24, isLocal: true, isDefinition: true)
!137 = distinct !DISubprogram(name: "halide_hexagon_initialize_kernels", scope: !6, file: !6, line: 239, type: !138, scopeLine: 241, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !614)
!138 = !DISubroutineType(types: !139)
!139 = !{!24, !117, !140, !141, !14, !141, !14}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 16, baseType: !30)
!144 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !145, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !218, globals: !603, imports: !610, splitDebugInlining: false, nameTableKind: None)
!145 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_host.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!146 = !{!147, !154, !158, !205}
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !8, line: 403, baseType: !143, size: 8, elements: !148, identifier: "_ZTS18halide_type_code_t")
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!153 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 1415, baseType: !96, size: 32, elements: !155, identifier: "_ZTS19halide_buffer_flags")
!155 = !{!156, !157}
!156 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !8, line: 990, baseType: !24, size: 32, elements: !159, identifier: "_ZTS19halide_error_code_t")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!160 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!161 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!162 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!163 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!164 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!165 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!166 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!167 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!168 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!169 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!170 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!171 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!172 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!173 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!174 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!175 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!176 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!177 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!178 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!179 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!180 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!181 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!182 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!183 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!184 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!185 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!186 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!187 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!188 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!189 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!190 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!191 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!192 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!193 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!194 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!195 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!196 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!197 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!198 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!199 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!200 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!201 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!202 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!203 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!204 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_hexagon_power_mode_t", file: !33, line: 66, baseType: !96, size: 32, elements: !206, identifier: "_ZTS27halide_hexagon_power_mode_t")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!207 = !DIEnumerator(name: "halide_hexagon_power_low", value: 0, isUnsigned: true)
!208 = !DIEnumerator(name: "halide_hexagon_power_nominal", value: 1, isUnsigned: true)
!209 = !DIEnumerator(name: "halide_hexagon_power_turbo", value: 2, isUnsigned: true)
!210 = !DIEnumerator(name: "halide_hexagon_power_default", value: 3, isUnsigned: true)
!211 = !DIEnumerator(name: "halide_hexagon_power_low_plus", value: 4, isUnsigned: true)
!212 = !DIEnumerator(name: "halide_hexagon_power_low_2", value: 5, isUnsigned: true)
!213 = !DIEnumerator(name: "halide_hexagon_power_nominal_plus", value: 6, isUnsigned: true)
!214 = !DIEnumerator(name: "halide_hvx_power_low", value: 0, isUnsigned: true)
!215 = !DIEnumerator(name: "halide_hvx_power_nominal", value: 1, isUnsigned: true)
!216 = !DIEnumerator(name: "halide_hvx_power_turbo", value: 2, isUnsigned: true)
!217 = !DIEnumerator(name: "halide_hvx_power_default", value: 3, isUnsigned: true)
!218 = !{!117, !219, !14, !476, !477, !24, !118, !544, !128, !545, !393, !55, !578, !586, !243, !68, !588, !591, !594, !79, !106, !600, !123, !65, !73, !85, !93, !12}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !221, file: !220, line: 203, baseType: !222)
!220 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!221 = !DINamespace(scope: !3)
!222 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !221, file: !220, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !223, templateParams: !473)
!223 = !{!224, !225, !226, !227, !228, !230, !232, !236, !240, !245, !249, !252, !256, !260, !264, !269, !275, !308, !455, !458, !461, !466, !467, !470, !471, !472}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !222, file: !220, line: 32, baseType: !68, size: 64, flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !222, file: !220, line: 32, baseType: !68, size: 64, offset: 64, flags: DIFlagPublic)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !222, file: !220, line: 32, baseType: !68, size: 64, offset: 128, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !222, file: !220, line: 33, baseType: !117, size: 64, offset: 192, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !222, file: !220, line: 34, baseType: !229, size: 8, offset: 256, flags: DIFlagPublic)
!229 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !222, file: !220, line: 35, baseType: !231, size: 8, offset: 264, flags: DIFlagPublic)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !16)
!232 = !DISubprogram(name: "Printer", scope: !222, file: !220, line: 37, type: !233, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !235, !117, !68}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!236 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !222, file: !220, line: 57, type: !237, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !235, !25}
!239 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !222, size: 64)
!240 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !222, file: !220, line: 67, type: !241, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{!239, !235, !243}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 9, baseType: !244)
!244 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!245 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !222, file: !220, line: 72, type: !246, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!239, !235, !248}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 11, baseType: !24)
!249 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !222, file: !220, line: 77, type: !250, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!239, !235, !14}
!252 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !222, file: !220, line: 82, type: !253, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{!239, !235, !255}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 12, baseType: !96)
!256 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !222, file: !220, line: 87, type: !257, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{!239, !235, !259}
!259 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!260 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !222, file: !220, line: 92, type: !261, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!239, !235, !263}
!263 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!264 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !222, file: !220, line: 97, type: !265, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{!239, !235, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!269 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !222, file: !220, line: 102, type: !270, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!239, !235, !272}
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 14, baseType: !274)
!274 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!275 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !222, file: !220, line: 108, type: !276, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DISubroutineType(types: !277)
!277 = !{!239, !235, !278}
!278 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !8, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !281, identifier: "_ZTS13halide_type_t")
!281 = !{!282, !284, !285, !286, !290, !293, !297, !300, !301, !302, !305}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !280, file: !8, line: 434, baseType: !283, size: 8, align: 8)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !8, line: 413, baseType: !147)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !280, file: !8, line: 442, baseType: !143, size: 8, align: 8, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !280, file: !8, line: 446, baseType: !273, size: 16, align: 16, offset: 16)
!286 = !DISubprogram(name: "halide_type_t", scope: !280, file: !8, line: 453, type: !287, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289, !283, !143, !273}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!290 = !DISubprogram(name: "halide_type_t", scope: !280, file: !8, line: 459, type: !291, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !289}
!293 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !280, file: !8, line: 463, type: !294, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!280, !296, !273}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!297 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !280, file: !8, line: 468, type: !298, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{!229, !296, !278}
!300 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !280, file: !8, line: 472, type: !298, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!301 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !280, file: !8, line: 476, type: !298, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !280, file: !8, line: 481, type: !303, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!24, !296}
!305 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !280, file: !8, line: 485, type: !306, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!255, !296}
!308 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !222, file: !220, line: 113, type: !309, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DISubroutineType(types: !310)
!310 = !{!239, !235, !311}
!311 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !8, line: 1550, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !8, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !315, identifier: "_ZTS15halide_buffer_t")
!315 = !{!316, !317, !392, !394, !395, !396, !397, !420, !421, !426, !430, !433, !434, !437, !438, !441, !444, !445, !446, !451, !454}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !314, file: !8, line: 1425, baseType: !14, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !314, file: !8, line: 1428, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !8, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !321, identifier: "_ZTS25halide_device_interface_t")
!321 = !{!322, !327, !331, !332, !336, !337, !338, !339, !340, !344, !350, !354, !355, !359, !360, !364}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !320, file: !8, line: 724, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!24, !117, !326, !318}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !320, file: !8, line: 726, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!24, !117, !326}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !320, file: !8, line: 727, baseType: !328, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !320, file: !8, line: 728, baseType: !333, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !117, !318}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !320, file: !8, line: 730, baseType: !328, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !320, file: !8, line: 731, baseType: !323, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !320, file: !8, line: 733, baseType: !323, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !320, file: !8, line: 735, baseType: !328, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !320, file: !8, line: 736, baseType: !341, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!24, !117, !326, !318, !326}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !320, file: !8, line: 738, baseType: !345, size: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!24, !117, !348, !326}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !320, file: !8, line: 740, baseType: !351, size: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!24, !117, !348, !24, !24, !326}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !320, file: !8, line: 742, baseType: !328, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !320, file: !8, line: 743, baseType: !356, size: 64, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!24, !117, !326, !14, !318}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !320, file: !8, line: 745, baseType: !328, size: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !320, file: !8, line: 746, baseType: !361, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!24, !117, !69, !69}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !320, file: !8, line: 747, baseType: !365, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !368, line: 10, size: 1024, flags: DIFlagTypePassByValue, elements: !369, identifier: "_ZTS30halide_device_interface_impl_t")
!368 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!369 = !{!370, !371, !372, !373, !374, !375, !379, !380, !381, !382, !383, !384, !385, !386, !387, !391}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !367, file: !368, line: 16, baseType: !106, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !367, file: !368, line: 17, baseType: !106, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !367, file: !368, line: 18, baseType: !328, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !367, file: !368, line: 19, baseType: !328, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !367, file: !368, line: 20, baseType: !328, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !367, file: !368, line: 21, baseType: !376, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!24, !117}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !367, file: !368, line: 22, baseType: !328, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !367, file: !368, line: 23, baseType: !328, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !367, file: !368, line: 24, baseType: !328, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !367, file: !368, line: 25, baseType: !328, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !367, file: !368, line: 26, baseType: !341, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !367, file: !368, line: 28, baseType: !345, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !367, file: !368, line: 31, baseType: !351, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !367, file: !368, line: 35, baseType: !328, size: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !367, file: !368, line: 37, baseType: !388, size: 64, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!24, !117, !326, !14}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !367, file: !368, line: 38, baseType: !328, size: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !314, file: !8, line: 1433, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !8, line: 1436, baseType: !14, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !314, file: !8, line: 1439, baseType: !280, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !314, file: !8, line: 1442, baseType: !248, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !314, file: !8, line: 1446, baseType: !398, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !8, line: 1409, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !8, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !401, identifier: "_ZTS18halide_dimension_t")
!401 = !{!402, !403, !404, !405, !406, !410, !413, !419}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !400, file: !8, line: 1383, baseType: !248, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !400, file: !8, line: 1383, baseType: !248, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !400, file: !8, line: 1383, baseType: !248, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !8, line: 1386, baseType: !255, size: 32, offset: 96)
!406 = !DISubprogram(name: "halide_dimension_t", scope: !400, file: !8, line: 1388, type: !407, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!410 = !DISubprogram(name: "halide_dimension_t", scope: !400, file: !8, line: 1389, type: !411, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !409, !248, !248, !248, !255}
!413 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !400, file: !8, line: 1393, type: !414, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !DISubroutineType(types: !415)
!415 = !{!229, !416, !418}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!418 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !417, size: 64)
!419 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !400, file: !8, line: 1400, type: !414, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !314, file: !8, line: 1449, baseType: !117, size: 64, offset: 384)
!421 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !314, file: !8, line: 1454, type: !422, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DISubroutineType(types: !423)
!423 = !{!229, !424, !425}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !8, line: 1416, baseType: !154)
!426 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !314, file: !8, line: 1458, type: !427, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429, !425, !229}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!430 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !314, file: !8, line: 1466, type: !431, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{!229, !424}
!433 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !314, file: !8, line: 1470, type: !431, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !314, file: !8, line: 1474, type: !435, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !429, !229}
!437 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !314, file: !8, line: 1478, type: !435, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !314, file: !8, line: 1485, type: !439, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{!118, !424}
!441 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !314, file: !8, line: 1495, type: !442, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!393, !424}
!444 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !314, file: !8, line: 1506, type: !442, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !314, file: !8, line: 1518, type: !439, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !314, file: !8, line: 1523, type: !447, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!447 = !DISubroutineType(types: !448)
!448 = !{!393, !424, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!451 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !314, file: !8, line: 1534, type: !452, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!452 = !DISubroutineType(types: !453)
!453 = !{!24, !429, !117}
!454 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !314, file: !8, line: 1545, type: !431, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !222, file: !220, line: 119, type: !456, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{!25, !235}
!458 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !222, file: !220, line: 131, type: !459, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !235}
!461 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !222, file: !220, line: 139, type: !462, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!462 = !DISubroutineType(types: !463)
!463 = !{!14, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!466 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !222, file: !220, line: 143, type: !462, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !222, file: !220, line: 148, type: !468, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !235, !24}
!470 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !222, file: !220, line: 158, type: !456, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !222, file: !220, line: 162, type: !459, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubprogram(name: "~Printer", scope: !222, file: !220, line: 166, type: !459, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !{!474, !475}
!474 = !DITemplateValueParameter(name: "type", type: !24, value: i32 0)
!475 = !DITemplateValueParameter(name: "length", type: !15, value: i64 1024)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "print", scope: !221, file: !220, line: 198, baseType: !222)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !221, file: !220, line: 199, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !221, file: !220, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !479, templateParams: !542)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !490, !494, !497, !500, !503, !506, !509, !512, !515, !518, !521, !524, !527, !530, !535, !536, !539, !540, !541}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !478, file: !220, line: 32, baseType: !68, size: 64, flags: DIFlagPublic)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !478, file: !220, line: 32, baseType: !68, size: 64, offset: 64, flags: DIFlagPublic)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !478, file: !220, line: 32, baseType: !68, size: 64, offset: 128, flags: DIFlagPublic)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !478, file: !220, line: 33, baseType: !117, size: 64, offset: 192, flags: DIFlagPublic)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !478, file: !220, line: 34, baseType: !229, size: 8, offset: 256, flags: DIFlagPublic)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !478, file: !220, line: 35, baseType: !231, size: 8, offset: 264, flags: DIFlagPublic)
!486 = !DISubprogram(name: "Printer", scope: !478, file: !220, line: 37, type: !487, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !489, !117, !68}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!490 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !478, file: !220, line: 57, type: !491, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !489, !25}
!493 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !478, size: 64)
!494 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !478, file: !220, line: 67, type: !495, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!495 = !DISubroutineType(types: !496)
!496 = !{!493, !489, !243}
!497 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !478, file: !220, line: 72, type: !498, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubroutineType(types: !499)
!499 = !{!493, !489, !248}
!500 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !478, file: !220, line: 77, type: !501, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!501 = !DISubroutineType(types: !502)
!502 = !{!493, !489, !14}
!503 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !478, file: !220, line: 82, type: !504, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{!493, !489, !255}
!506 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !478, file: !220, line: 87, type: !507, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!507 = !DISubroutineType(types: !508)
!508 = !{!493, !489, !259}
!509 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !478, file: !220, line: 92, type: !510, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(types: !511)
!511 = !{!493, !489, !263}
!512 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !478, file: !220, line: 97, type: !513, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!513 = !DISubroutineType(types: !514)
!514 = !{!493, !489, !267}
!515 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !478, file: !220, line: 102, type: !516, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(types: !517)
!517 = !{!493, !489, !272}
!518 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !478, file: !220, line: 108, type: !519, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubroutineType(types: !520)
!520 = !{!493, !489, !278}
!521 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !478, file: !220, line: 113, type: !522, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!522 = !DISubroutineType(types: !523)
!523 = !{!493, !489, !311}
!524 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !478, file: !220, line: 119, type: !525, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{!25, !489}
!527 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !478, file: !220, line: 131, type: !528, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !489}
!530 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !478, file: !220, line: 139, type: !531, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(types: !532)
!532 = !{!14, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!535 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !478, file: !220, line: 143, type: !531, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !478, file: !220, line: 148, type: !537, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !489, !24}
!539 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !478, file: !220, line: 158, type: !525, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !478, file: !220, line: 162, type: !528, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubprogram(name: "~Printer", scope: !478, file: !220, line: 166, type: !528, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !{!543, !475}
!543 = !DITemplateValueParameter(name: "type", type: !24, value: i32 1)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hexagon_device_pointer", scope: !547, file: !6, line: 356, size: 128, flags: DIFlagTypePassByValue, elements: !583)
!547 = distinct !DISubprogram(name: "map_arguments", scope: !548, file: !6, line: 345, type: !549, scopeLine: 347, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !552)
!548 = !DINamespace(scope: null)
!549 = !DISubroutineType(types: !550)
!550 = !{!24, !117, !24, !551, !140, !69, !24, !24, !55}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !564, !568, !573, !574, !575}
!553 = !DILocalVariable(name: "user_context", arg: 1, scope: !547, file: !6, line: 345, type: !117)
!554 = !DILocalVariable(name: "arg_count", arg: 2, scope: !547, file: !6, line: 345, type: !24)
!555 = !DILocalVariable(name: "arg_sizes", arg: 3, scope: !547, file: !6, line: 346, type: !551)
!556 = !DILocalVariable(name: "args", arg: 4, scope: !547, file: !6, line: 346, type: !140)
!557 = !DILocalVariable(name: "arg_flags", arg: 5, scope: !547, file: !6, line: 346, type: !69)
!558 = !DILocalVariable(name: "flag_mask", arg: 6, scope: !547, file: !6, line: 346, type: !24)
!559 = !DILocalVariable(name: "flag_value", arg: 7, scope: !547, file: !6, line: 346, type: !24)
!560 = !DILocalVariable(name: "mapped_args", arg: 8, scope: !547, file: !6, line: 347, type: !55)
!561 = !DILocalVariable(name: "mapped_count", scope: !547, file: !6, line: 348, type: !24)
!562 = !DILocalVariable(name: "i", scope: !563, file: !6, line: 349, type: !24)
!563 = distinct !DILexicalBlock(scope: !547, file: !6, line: 349, column: 5)
!564 = !DILocalVariable(name: "mapped_arg", scope: !565, file: !6, line: 353, type: !567)
!565 = distinct !DILexicalBlock(scope: !566, file: !6, line: 349, column: 41)
!566 = distinct !DILexicalBlock(scope: !563, file: !6, line: 349, column: 5)
!567 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !48, size: 64)
!568 = !DILocalVariable(name: "b", scope: !569, file: !6, line: 360, type: !571)
!569 = distinct !DILexicalBlock(scope: !570, file: !6, line: 354, column: 32)
!570 = distinct !DILexicalBlock(scope: !565, file: !6, line: 354, column: 13)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!573 = !DILocalVariable(name: "device", scope: !569, file: !6, line: 361, type: !14)
!574 = !DILocalVariable(name: "host", scope: !569, file: !6, line: 362, type: !393)
!575 = !DILocalVariable(name: "ion_handle", scope: !576, file: !6, line: 365, type: !578)
!576 = distinct !DILexicalBlock(scope: !577, file: !6, line: 363, column: 25)
!577 = distinct !DILexicalBlock(scope: !569, file: !6, line: 363, column: 17)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ion_device_handle", scope: !2, file: !6, line: 13, size: 128, flags: DIFlagTypePassByValue, elements: !580, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon17ion_device_handleE")
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !579, file: !6, line: 14, baseType: !117, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !6, line: 15, baseType: !118, size: 64, offset: 64)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !546, file: !6, line: 357, baseType: !14, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !546, file: !6, line: 358, baseType: !393, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !13, line: 28, baseType: !587)
!587 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!24, !25, !24, !28, !24, !69}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!24, !24, !25, !24, !69}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!24, !24, !24, !597, !24, !597, !24, !599, !24}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!117, !119}
!603 = !{!0, !18, !34, !40, !56, !62, !70, !76, !82, !88, !90, !97, !100, !103, !109, !111, !120, !126, !133, !135, !604, !606, !608}
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression(DW_OP_constu, 4096, DW_OP_stack_value))
!605 = distinct !DIGlobalVariable(name: "min_ion_allocation_size", scope: !144, file: !6, line: 531, type: !450, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "hexagon_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon29hexagon_device_interface_implE", scope: !2, file: !6, line: 1025, type: !367, isLocal: false, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "hexagon_device_interface", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon24hexagon_device_interfaceE", scope: !2, file: !6, line: 1044, type: !320, isLocal: false, isDefinition: true)
!610 = !{!611, !612, !613}
!611 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !144, entity: !3, file: !13, line: 225)
!612 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !144, entity: !3, file: !6, line: 229)
!613 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !144, entity: !2, file: !6, line: 230)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !636, !642, !643, !713, !714}
!615 = !DILocalVariable(name: "user_context", arg: 1, scope: !137, file: !6, line: 239, type: !117)
!616 = !DILocalVariable(name: "state_ptr", arg: 2, scope: !137, file: !6, line: 239, type: !140)
!617 = !DILocalVariable(name: "code", arg: 3, scope: !137, file: !6, line: 240, type: !141)
!618 = !DILocalVariable(name: "code_size", arg: 4, scope: !137, file: !6, line: 240, type: !14)
!619 = !DILocalVariable(name: "runtime", arg: 5, scope: !137, file: !6, line: 241, type: !141)
!620 = !DILocalVariable(name: "runtime_size", arg: 6, scope: !137, file: !6, line: 241, type: !14)
!621 = !DILocalVariable(name: "result", scope: !137, file: !6, line: 242, type: !24)
!622 = !DILocalVariable(name: "t_before", scope: !137, file: !6, line: 256, type: !14)
!623 = !DILocalVariable(name: "lock", scope: !137, file: !6, line: 265, type: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedMutexLock", scope: !3, file: !625, line: 11, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !626, identifier: "_ZTSN6Halide7Runtime8Internal15ScopedMutexLockE")
!625 = !DIFile(filename: "src/runtime/scoped_mutex_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!626 = !{!627, !629, !633}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !624, file: !625, line: 12, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!629 = !DISubprogram(name: "ScopedMutexLock", scope: !624, file: !625, line: 14, type: !630, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !632, !628}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!633 = !DISubprogram(name: "~ScopedMutexLock", scope: !624, file: !625, line: 19, type: !634, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !632}
!636 = !DILocalVariable(name: "soname", scope: !637, file: !6, line: 270, type: !639)
!637 = distinct !DILexicalBlock(scope: !638, file: !6, line: 268, column: 26)
!638 = distinct !DILexicalBlock(scope: !137, file: !6, line: 268, column: 9)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 28)
!642 = !DILocalVariable(name: "state", scope: !137, file: !6, line: 294, type: !544)
!643 = !DILocalVariable(name: "soname", scope: !644, file: !6, line: 307, type: !646)
!644 = distinct !DILexicalBlock(scope: !645, file: !6, line: 305, column: 28)
!645 = distinct !DILexicalBlock(scope: !137, file: !6, line: 305, column: 9)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringstream", scope: !221, file: !220, line: 200, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 1024>", scope: !221, file: !220, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !648, templateParams: !711)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !659, !663, !666, !669, !672, !675, !678, !681, !684, !687, !690, !693, !696, !699, !704, !705, !708, !709, !710}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !647, file: !220, line: 32, baseType: !68, size: 64, flags: DIFlagPublic)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !647, file: !220, line: 32, baseType: !68, size: 64, offset: 64, flags: DIFlagPublic)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !647, file: !220, line: 32, baseType: !68, size: 64, offset: 128, flags: DIFlagPublic)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !647, file: !220, line: 33, baseType: !117, size: 64, offset: 192, flags: DIFlagPublic)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !647, file: !220, line: 34, baseType: !229, size: 8, offset: 256, flags: DIFlagPublic)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !647, file: !220, line: 35, baseType: !231, size: 8, offset: 264, flags: DIFlagPublic)
!655 = !DISubprogram(name: "Printer", scope: !647, file: !220, line: 37, type: !656, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !658, !117, !68}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!659 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !647, file: !220, line: 57, type: !660, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !658, !25}
!662 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !647, size: 64)
!663 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEx", scope: !647, file: !220, line: 67, type: !664, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!664 = !DISubroutineType(types: !665)
!665 = !{!662, !658, !243}
!666 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEi", scope: !647, file: !220, line: 72, type: !667, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!667 = !DISubroutineType(types: !668)
!668 = !{!662, !658, !248}
!669 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEy", scope: !647, file: !220, line: 77, type: !670, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!670 = !DISubroutineType(types: !671)
!671 = !{!662, !658, !14}
!672 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEj", scope: !647, file: !220, line: 82, type: !673, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!673 = !DISubroutineType(types: !674)
!674 = !{!662, !658, !255}
!675 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEd", scope: !647, file: !220, line: 87, type: !676, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!676 = !DISubroutineType(types: !677)
!677 = !{!662, !658, !259}
!678 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEf", scope: !647, file: !220, line: 92, type: !679, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!679 = !DISubroutineType(types: !680)
!680 = !{!662, !658, !263}
!681 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKv", scope: !647, file: !220, line: 97, type: !682, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!682 = !DISubroutineType(types: !683)
!683 = !{!662, !658, !267}
!684 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE23write_float16_from_bitsEt", scope: !647, file: !220, line: 102, type: !685, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!685 = !DISubroutineType(types: !686)
!686 = !{!662, !658, !272}
!687 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK13halide_type_t", scope: !647, file: !220, line: 108, type: !688, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!688 = !DISubroutineType(types: !689)
!689 = !{!662, !658, !278}
!690 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK15halide_buffer_t", scope: !647, file: !220, line: 113, type: !691, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!691 = !DISubroutineType(types: !692)
!692 = !{!662, !658, !311}
!693 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE3strEv", scope: !647, file: !220, line: 119, type: !694, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!694 = !DISubroutineType(types: !695)
!695 = !{!25, !658}
!696 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5clearEv", scope: !647, file: !220, line: 131, type: !697, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !658}
!699 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE4sizeEv", scope: !647, file: !220, line: 139, type: !700, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!700 = !DISubroutineType(types: !701)
!701 = !{!14, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!704 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE8capacityEv", scope: !647, file: !220, line: 143, type: !700, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!705 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5eraseEi", scope: !647, file: !220, line: 148, type: !706, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !658, !24}
!708 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE16allocation_errorEv", scope: !647, file: !220, line: 158, type: !694, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!709 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE28msan_annotate_is_initializedEv", scope: !647, file: !220, line: 162, type: !697, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!710 = !DISubprogram(name: "~Printer", scope: !647, file: !220, line: 166, type: !697, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!711 = !{!712, !475}
!712 = !DITemplateValueParameter(name: "type", type: !24, value: i32 2)
!713 = !DILocalVariable(name: "module", scope: !644, file: !6, line: 314, type: !32)
!714 = !DILocalVariable(name: "t_after", scope: !137, file: !6, line: 329, type: !14)
!715 = !{i32 7, !"Dwarf Version", i32 4}
!716 = !{i32 2, !"Debug Info Version", i32 3}
!717 = !{i32 1, !"wchar_size", i32 4}
!718 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!719 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !720, line: 47, type: !721, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !737)
!720 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!721 = !DISubroutineType(types: !722)
!722 = !{null, !723, !24, !243, !243}
!723 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !720, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !726, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!726 = !{!727, !728, !729, !730, !734, !735, !736}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !725, file: !720, line: 35, baseType: !14, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !725, file: !720, line: 35, baseType: !14, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !725, file: !720, line: 37, baseType: !14, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !725, file: !720, line: 39, baseType: !731, size: 1024, offset: 192)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !725, file: !720, line: 41, baseType: !731, size: 1024, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !725, file: !720, line: 42, baseType: !731, size: 1024, offset: 2240)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !725, file: !720, line: 44, baseType: !14, size: 64, offset: 3264)
!737 = !{!738, !739, !740, !741, !742, !745, !746}
!738 = !DILocalVariable(name: "copy", arg: 1, scope: !719, file: !720, line: 47, type: !723)
!739 = !DILocalVariable(name: "d", arg: 2, scope: !719, file: !720, line: 47, type: !24)
!740 = !DILocalVariable(name: "src_off", arg: 3, scope: !719, file: !720, line: 47, type: !243)
!741 = !DILocalVariable(name: "dst_off", arg: 4, scope: !719, file: !720, line: 47, type: !243)
!742 = !DILocalVariable(name: "from", scope: !743, file: !720, line: 54, type: !267)
!743 = distinct !DILexicalBlock(scope: !744, file: !720, line: 53, column: 18)
!744 = distinct !DILexicalBlock(scope: !719, file: !720, line: 53, column: 9)
!745 = !DILocalVariable(name: "to", scope: !743, file: !720, line: 55, type: !117)
!746 = !DILocalVariable(name: "i", scope: !747, file: !720, line: 58, type: !14)
!747 = distinct !DILexicalBlock(scope: !748, file: !720, line: 58, column: 9)
!748 = distinct !DILexicalBlock(scope: !744, file: !720, line: 57, column: 12)
!749 = !DILocation(line: 0, scope: !719)
!750 = !DILocation(line: 49, column: 14, scope: !719)
!751 = !DILocation(line: 49, column: 19, scope: !719)
!752 = !DILocation(line: 49, column: 22, scope: !719)
!753 = !{!754, !754, i64 0}
!754 = !{!"long long", !755, i64 0}
!755 = !{!"omnipotent char", !756, i64 0}
!756 = !{!"Simple C++ TBAA"}
!757 = !DILocation(line: 49, column: 37, scope: !719)
!758 = !DILocation(line: 49, column: 5, scope: !719)
!759 = !DILocation(line: 50, column: 10, scope: !760)
!760 = distinct !DILexicalBlock(scope: !719, file: !720, line: 49, column: 43)
!761 = distinct !{!761, !758, !762, !763}
!762 = !DILocation(line: 51, column: 5, scope: !719)
!763 = !{!"llvm.loop.mustprogress"}
!764 = !DILocation(line: 53, column: 11, scope: !744)
!765 = !DILocation(line: 53, column: 9, scope: !719)
!766 = !DILocation(line: 0, scope: !747)
!767 = !DILocation(line: 58, column: 34, scope: !768)
!768 = distinct !DILexicalBlock(scope: !747, file: !720, line: 58, column: 9)
!769 = !DILocation(line: 58, column: 32, scope: !768)
!770 = !DILocation(line: 58, column: 9, scope: !747)
!771 = !DILocation(line: 54, column: 42, scope: !743)
!772 = !{!773, !754, i64 0}
!773 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !754, i64 0, !754, i64 8, !754, i64 16, !755, i64 24, !755, i64 152, !755, i64 280, !754, i64 408}
!774 = !DILocation(line: 54, column: 46, scope: !743)
!775 = !DILocation(line: 54, column: 28, scope: !743)
!776 = !DILocation(line: 0, scope: !743)
!777 = !DILocation(line: 55, column: 34, scope: !743)
!778 = !{!773, !754, i64 8}
!779 = !DILocation(line: 55, column: 38, scope: !743)
!780 = !DILocation(line: 55, column: 20, scope: !743)
!781 = !DILocation(line: 56, column: 31, scope: !743)
!782 = !{!773, !754, i64 408}
!783 = !DILocation(line: 56, column: 9, scope: !743)
!784 = !DILocation(line: 57, column: 5, scope: !743)
!785 = !DILocation(line: 59, column: 13, scope: !786)
!786 = distinct !DILexicalBlock(scope: !768, file: !720, line: 58, column: 55)
!787 = !DILocation(line: 60, column: 24, scope: !786)
!788 = !DILocation(line: 60, column: 21, scope: !786)
!789 = !DILocation(line: 61, column: 24, scope: !786)
!790 = !DILocation(line: 61, column: 21, scope: !786)
!791 = !DILocation(line: 58, column: 51, scope: !768)
!792 = distinct !{!792, !770, !793, !763}
!793 = !DILocation(line: 62, column: 9, scope: !747)
!794 = !DILocation(line: 64, column: 1, scope: !719)
!795 = !DISubprogram(name: "memcpy", scope: !13, file: !13, line: 94, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !798)
!796 = !DISubroutineType(types: !797)
!797 = !{!117, !117, !267, !119}
!798 = !{}
!799 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !720, line: 66, type: !800, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !723, !117}
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "copy", arg: 1, scope: !799, file: !720, line: 66, type: !723)
!804 = !DILocalVariable(name: "user_context", arg: 2, scope: !799, file: !720, line: 66, type: !117)
!805 = !DILocation(line: 0, scope: !799)
!806 = !DILocation(line: 68, column: 14, scope: !807)
!807 = distinct !DILexicalBlock(scope: !799, file: !720, line: 68, column: 9)
!808 = !DILocation(line: 68, column: 26, scope: !807)
!809 = !DILocation(line: 68, column: 18, scope: !807)
!810 = !DILocation(line: 68, column: 9, scope: !799)
!811 = !DILocation(line: 69, column: 58, scope: !812)
!812 = distinct !DILexicalBlock(scope: !807, file: !720, line: 68, column: 31)
!813 = !{!773, !754, i64 16}
!814 = !DILocation(line: 69, column: 9, scope: !812)
!815 = !DILocation(line: 70, column: 5, scope: !812)
!816 = !DILocalVariable(name: "this", arg: 1, scope: !817, type: !821, flags: DIFlagArtificial | DIFlagObjectPointer)
!817 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !222, file: !220, line: 37, type: !233, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !232, retainedNodes: !818)
!818 = !{!816, !819, !820}
!819 = !DILocalVariable(name: "ctx", arg: 2, scope: !817, file: !220, line: 37, type: !117)
!820 = !DILocalVariable(name: "mem", arg: 3, scope: !817, file: !220, line: 37, type: !68)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!822 = !DILocation(line: 0, scope: !817, inlinedAt: !823)
!823 = distinct !DILocation(line: 71, column: 9, scope: !824)
!824 = distinct !DILexicalBlock(scope: !807, file: !720, line: 70, column: 12)
!825 = !DILocation(line: 44, column: 27, scope: !826, inlinedAt: !823)
!826 = distinct !DILexicalBlock(scope: !827, file: !220, line: 43, column: 16)
!827 = distinct !DILexicalBlock(scope: !828, file: !220, line: 41, column: 20)
!828 = distinct !DILexicalBlock(scope: !829, file: !220, line: 39, column: 13)
!829 = distinct !DILexicalBlock(scope: !817, file: !220, line: 38, column: 54)
!830 = !DILocation(line: 48, column: 13, scope: !831, inlinedAt: !823)
!831 = distinct !DILexicalBlock(scope: !829, file: !220, line: 48, column: 13)
!832 = !DILocation(line: 48, column: 13, scope: !829, inlinedAt: !823)
!833 = !DILocalVariable(name: "this", arg: 1, scope: !834, type: !821, flags: DIFlagArtificial | DIFlagObjectPointer)
!834 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !222, file: !220, line: 57, type: !237, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !236, retainedNodes: !835)
!835 = !{!833, !836}
!836 = !DILocalVariable(name: "arg", arg: 2, scope: !834, file: !220, line: 57, type: !25)
!837 = !DILocation(line: 0, scope: !834, inlinedAt: !838)
!838 = distinct !DILocation(line: 71, column: 29, scope: !824)
!839 = !DILocation(line: 62, column: 19, scope: !840, inlinedAt: !838)
!840 = distinct !DILexicalBlock(scope: !841, file: !220, line: 61, column: 16)
!841 = distinct !DILexicalBlock(scope: !834, file: !220, line: 59, column: 13)
!842 = !DILocalVariable(name: "this", arg: 1, scope: !843, type: !821, flags: DIFlagArtificial | DIFlagObjectPointer)
!843 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !222, file: !220, line: 166, type: !459, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !472, retainedNodes: !844)
!844 = !{!842}
!845 = !DILocation(line: 0, scope: !843, inlinedAt: !846)
!846 = distinct !DILocation(line: 71, column: 9, scope: !824)
!847 = !DILocation(line: 168, column: 13, scope: !848, inlinedAt: !846)
!848 = distinct !DILexicalBlock(scope: !849, file: !220, line: 167, column: 19)
!849 = distinct !DILexicalBlock(scope: !850, file: !220, line: 167, column: 13)
!850 = distinct !DILexicalBlock(scope: !843, file: !220, line: 166, column: 16)
!851 = !DILocation(line: 169, column: 9, scope: !848, inlinedAt: !846)
!852 = !DILocation(line: 49, column: 23, scope: !853, inlinedAt: !823)
!853 = distinct !DILexicalBlock(scope: !831, file: !220, line: 48, column: 18)
!854 = !DILocation(line: 50, column: 18, scope: !853, inlinedAt: !823)
!855 = !{!755, !755, i64 0}
!856 = !DILocalVariable(name: "this", arg: 1, scope: !857, type: !821, flags: DIFlagArtificial | DIFlagObjectPointer)
!857 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !222, file: !220, line: 162, type: !459, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !471, retainedNodes: !858)
!858 = !{!856}
!859 = !DILocation(line: 0, scope: !857, inlinedAt: !860)
!860 = distinct !DILocation(line: 170, column: 13, scope: !861, inlinedAt: !846)
!861 = distinct !DILexicalBlock(scope: !849, file: !220, line: 169, column: 16)
!862 = !DILocation(line: 163, column: 81, scope: !857, inlinedAt: !860)
!863 = !DILocation(line: 163, column: 87, scope: !857, inlinedAt: !860)
!864 = !DILocation(line: 163, column: 15, scope: !857, inlinedAt: !860)
!865 = !DILocation(line: 174, column: 17, scope: !866, inlinedAt: !846)
!866 = distinct !DILexicalBlock(scope: !867, file: !220, line: 173, column: 46)
!867 = distinct !DILexicalBlock(scope: !868, file: !220, line: 173, column: 24)
!868 = distinct !DILexicalBlock(scope: !861, file: !220, line: 171, column: 17)
!869 = !DILocation(line: 181, column: 13, scope: !870, inlinedAt: !846)
!870 = distinct !DILexicalBlock(scope: !871, file: !220, line: 180, column: 40)
!871 = distinct !DILexicalBlock(scope: !850, file: !220, line: 180, column: 13)
!872 = !DILocation(line: 73, column: 1, scope: !799)
!873 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !720, line: 76, type: !874, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !877)
!874 = !DISubroutineType(types: !875)
!875 = !{!725, !876, !229, !876, !229}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!877 = !{!878, !879, !880, !881, !882, !883, !885, !887, !890, !893, !895, !898, !899, !900, !902}
!878 = !DILocalVariable(name: "src", arg: 1, scope: !873, file: !720, line: 76, type: !876)
!879 = !DILocalVariable(name: "src_host", arg: 2, scope: !873, file: !720, line: 76, type: !229)
!880 = !DILocalVariable(name: "dst", arg: 3, scope: !873, file: !720, line: 77, type: !876)
!881 = !DILocalVariable(name: "dst_host", arg: 4, scope: !873, file: !720, line: 77, type: !229)
!882 = !DILocalVariable(name: "c", scope: !873, file: !720, line: 79, type: !725)
!883 = !DILocalVariable(name: "i", scope: !884, file: !720, line: 83, type: !24)
!884 = distinct !DILexicalBlock(scope: !873, file: !720, line: 83, column: 5)
!885 = !DILocalVariable(name: "i", scope: !886, file: !720, line: 91, type: !24)
!886 = distinct !DILexicalBlock(scope: !873, file: !720, line: 91, column: 5)
!887 = !DILocalVariable(name: "zero", scope: !888, file: !720, line: 100, type: !725)
!888 = distinct !DILexicalBlock(scope: !889, file: !720, line: 98, column: 42)
!889 = distinct !DILexicalBlock(scope: !873, file: !720, line: 96, column: 9)
!890 = !DILocalVariable(name: "zero", scope: !891, file: !720, line: 107, type: !725)
!891 = distinct !DILexicalBlock(scope: !892, file: !720, line: 104, column: 28)
!892 = distinct !DILexicalBlock(scope: !873, file: !720, line: 104, column: 9)
!893 = !DILocalVariable(name: "i", scope: !894, file: !720, line: 115, type: !24)
!894 = distinct !DILexicalBlock(scope: !873, file: !720, line: 115, column: 5)
!895 = !DILocalVariable(name: "dst_stride_bytes", scope: !896, file: !720, line: 117, type: !14)
!896 = distinct !DILexicalBlock(scope: !897, file: !720, line: 115, column: 47)
!897 = distinct !DILexicalBlock(scope: !894, file: !720, line: 115, column: 5)
!898 = !DILocalVariable(name: "src_stride_bytes", scope: !896, file: !720, line: 118, type: !14)
!899 = !DILocalVariable(name: "insert", scope: !896, file: !720, line: 120, type: !24)
!900 = !DILocalVariable(name: "j", scope: !901, file: !720, line: 128, type: !24)
!901 = distinct !DILexicalBlock(scope: !896, file: !720, line: 128, column: 9)
!902 = !DILocalVariable(name: "j", scope: !903, file: !720, line: 151, type: !24)
!903 = distinct !DILexicalBlock(scope: !904, file: !720, line: 151, column: 9)
!904 = distinct !DILexicalBlock(scope: !873, file: !720, line: 145, column: 51)
!905 = !DILocation(line: 0, scope: !873)
!906 = !DILocation(line: 79, column: 5, scope: !873)
!907 = !DILocation(line: 79, column: 17, scope: !873)
!908 = !DILocation(line: 80, column: 13, scope: !873)
!909 = !DILocation(line: 80, column: 39, scope: !873)
!910 = !{!911, !912, i64 16}
!911 = !{!"_ZTS15halide_buffer_t", !754, i64 0, !912, i64 8, !912, i64 16, !754, i64 24, !913, i64 32, !916, i64 36, !912, i64 40, !912, i64 48}
!912 = !{!"any pointer", !755, i64 0}
!913 = !{!"_ZTS13halide_type_t", !914, i64 0, !755, i64 1, !915, i64 2}
!914 = !{!"_ZTS18halide_type_code_t", !755, i64 0}
!915 = !{!"short", !755, i64 0}
!916 = !{!"int", !755, i64 0}
!917 = !DILocation(line: 80, column: 24, scope: !873)
!918 = !DILocation(line: 80, column: 51, scope: !873)
!919 = !{!911, !754, i64 0}
!920 = !DILocation(line: 80, column: 7, scope: !873)
!921 = !DILocation(line: 80, column: 11, scope: !873)
!922 = !DILocation(line: 81, column: 13, scope: !873)
!923 = !DILocation(line: 81, column: 39, scope: !873)
!924 = !DILocation(line: 81, column: 24, scope: !873)
!925 = !DILocation(line: 81, column: 51, scope: !873)
!926 = !DILocation(line: 81, column: 7, scope: !873)
!927 = !DILocation(line: 81, column: 11, scope: !873)
!928 = !DILocalVariable(name: "this", arg: 1, scope: !929, type: !931, flags: DIFlagArtificial | DIFlagObjectPointer)
!929 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !280, file: !8, line: 481, type: !303, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !302, retainedNodes: !930)
!930 = !{!928}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!932 = !DILocation(line: 0, scope: !929, inlinedAt: !933)
!933 = distinct !DILocation(line: 82, column: 30, scope: !873)
!934 = !DILocation(line: 482, column: 17, scope: !929, inlinedAt: !933)
!935 = !{!913, !755, i64 1}
!936 = !DILocation(line: 482, column: 22, scope: !929, inlinedAt: !933)
!937 = !DILocation(line: 482, column: 27, scope: !929, inlinedAt: !933)
!938 = !DILocation(line: 82, column: 20, scope: !873)
!939 = !DILocation(line: 82, column: 7, scope: !873)
!940 = !DILocation(line: 82, column: 18, scope: !873)
!941 = !DILocation(line: 0, scope: !884)
!942 = !DILocation(line: 84, column: 9, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !720, line: 83, column: 45)
!944 = distinct !DILexicalBlock(scope: !884, file: !720, line: 83, column: 5)
!945 = !DILocation(line: 84, column: 21, scope: !943)
!946 = !DILocation(line: 85, column: 9, scope: !943)
!947 = !DILocation(line: 85, column: 31, scope: !943)
!948 = !DILocation(line: 86, column: 9, scope: !943)
!949 = !DILocation(line: 86, column: 31, scope: !943)
!950 = !DILocation(line: 90, column: 7, scope: !873)
!951 = !DILocation(line: 0, scope: !886)
!952 = !DILocation(line: 91, column: 30, scope: !953)
!953 = distinct !DILexicalBlock(scope: !886, file: !720, line: 91, column: 5)
!954 = !{!911, !916, i64 36}
!955 = !DILocation(line: 91, column: 23, scope: !953)
!956 = !DILocation(line: 91, column: 5, scope: !886)
!957 = !{!911, !912, i64 40}
!958 = !DILocation(line: 94, column: 17, scope: !873)
!959 = !DILocation(line: 94, column: 22, scope: !873)
!960 = !DILocation(line: 96, column: 33, scope: !889)
!961 = !DILocation(line: 96, column: 25, scope: !889)
!962 = !DILocation(line: 96, column: 44, scope: !889)
!963 = !DILocation(line: 92, column: 46, scope: !964)
!964 = distinct !DILexicalBlock(scope: !953, file: !720, line: 91, column: 47)
!965 = !{!966, !916, i64 8}
!966 = !{!"_ZTS18halide_dimension_t", !916, i64 0, !916, i64 4, !916, i64 8, !916, i64 12}
!967 = !DILocation(line: 92, column: 34, scope: !964)
!968 = !DILocation(line: 92, column: 68, scope: !964)
!969 = !{!966, !916, i64 0}
!970 = !DILocation(line: 92, column: 86, scope: !964)
!971 = !DILocation(line: 92, column: 72, scope: !964)
!972 = !DILocation(line: 92, column: 55, scope: !964)
!973 = !DILocation(line: 92, column: 53, scope: !964)
!974 = !DILocation(line: 92, column: 21, scope: !964)
!975 = !DILocation(line: 91, column: 43, scope: !953)
!976 = distinct !{!976, !956, !977, !763}
!977 = !DILocation(line: 93, column: 5, scope: !886)
!978 = !DILocation(line: 0, scope: !929, inlinedAt: !979)
!979 = distinct !DILocation(line: 97, column: 19, scope: !889)
!980 = !DILocation(line: 0, scope: !929, inlinedAt: !981)
!981 = distinct !DILocation(line: 97, column: 40, scope: !889)
!982 = !DILocation(line: 482, column: 17, scope: !929, inlinedAt: !981)
!983 = !DILocation(line: 482, column: 22, scope: !929, inlinedAt: !981)
!984 = !DILocation(line: 482, column: 27, scope: !929, inlinedAt: !981)
!985 = !DILocation(line: 97, column: 27, scope: !889)
!986 = !DILocation(line: 97, column: 48, scope: !889)
!987 = !DILocation(line: 100, column: 21, scope: !888)
!988 = !DILocation(line: 101, column: 9, scope: !888)
!989 = !DILocation(line: 104, column: 22, scope: !892)
!990 = !DILocation(line: 104, column: 9, scope: !873)
!991 = !DILocation(line: 0, scope: !894)
!992 = !DILocation(line: 115, column: 5, scope: !894)
!993 = !DILocation(line: 115, column: 23, scope: !897)
!994 = !DILocation(line: 107, column: 21, scope: !891)
!995 = !DILocation(line: 108, column: 9, scope: !891)
!996 = !DILocation(line: 144, column: 14, scope: !873)
!997 = !DILocation(line: 144, column: 28, scope: !873)
!998 = !DILocation(line: 144, column: 25, scope: !873)
!999 = !DILocation(line: 144, column: 50, scope: !873)
!1000 = !DILocation(line: 145, column: 28, scope: !873)
!1001 = !DILocation(line: 117, column: 59, scope: !896)
!1002 = !DILocation(line: 117, column: 47, scope: !896)
!1003 = !DILocation(line: 0, scope: !929, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 117, column: 78, scope: !896)
!1005 = !DILocation(line: 117, column: 66, scope: !896)
!1006 = !DILocation(line: 0, scope: !896)
!1007 = !DILocation(line: 118, column: 59, scope: !896)
!1008 = !DILocation(line: 118, column: 47, scope: !896)
!1009 = !DILocation(line: 0, scope: !929, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 118, column: 78, scope: !896)
!1011 = !DILocation(line: 118, column: 66, scope: !896)
!1012 = !DILocation(line: 121, column: 33, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !720, line: 121, column: 9)
!1014 = distinct !DILexicalBlock(scope: !896, file: !720, line: 121, column: 9)
!1015 = !DILocation(line: 121, column: 9, scope: !1014)
!1016 = !DILocation(line: 128, column: 27, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !901, file: !720, line: 128, column: 9)
!1018 = !DILocation(line: 124, column: 36, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !720, line: 124, column: 17)
!1020 = distinct !DILexicalBlock(scope: !1013, file: !720, line: 121, column: 48)
!1021 = !DILocation(line: 124, column: 34, scope: !1019)
!1022 = !DILocation(line: 124, column: 63, scope: !1019)
!1023 = !DILocation(line: 121, column: 44, scope: !1013)
!1024 = distinct !{!1024, !1015, !1025, !763}
!1025 = !DILocation(line: 127, column: 9, scope: !1014)
!1026 = !DILocation(line: 0, scope: !1014)
!1027 = !DILocation(line: 0, scope: !901)
!1028 = !DILocation(line: 128, column: 9, scope: !901)
!1029 = !DILocation(line: 133, column: 40, scope: !896)
!1030 = !{!966, !916, i64 4}
!1031 = !DILocation(line: 133, column: 28, scope: !896)
!1032 = !DILocation(line: 133, column: 9, scope: !896)
!1033 = !DILocation(line: 133, column: 26, scope: !896)
!1034 = !DILocation(line: 135, column: 9, scope: !896)
!1035 = !DILocation(line: 135, column: 36, scope: !896)
!1036 = !DILocation(line: 136, column: 9, scope: !896)
!1037 = !DILocation(line: 136, column: 36, scope: !896)
!1038 = !DILocation(line: 115, column: 43, scope: !897)
!1039 = distinct !{!1039, !992, !1040, !763}
!1040 = !DILocation(line: 137, column: 5, scope: !894)
!1041 = !DILocation(line: 129, column: 38, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1017, file: !720, line: 128, column: 42)
!1043 = !DILocation(line: 129, column: 27, scope: !1042)
!1044 = !DILocation(line: 129, column: 13, scope: !1042)
!1045 = !DILocation(line: 129, column: 25, scope: !1042)
!1046 = !DILocation(line: 130, column: 37, scope: !1042)
!1047 = !DILocation(line: 130, column: 13, scope: !1042)
!1048 = !DILocation(line: 130, column: 35, scope: !1042)
!1049 = !DILocation(line: 131, column: 37, scope: !1042)
!1050 = !DILocation(line: 131, column: 13, scope: !1042)
!1051 = !DILocation(line: 131, column: 35, scope: !1042)
!1052 = distinct !{!1052, !1028, !1053, !763}
!1053 = !DILocation(line: 132, column: 9, scope: !901)
!1054 = !DILocation(line: 145, column: 25, scope: !873)
!1055 = !DILocation(line: 144, column: 5, scope: !873)
!1056 = !DILocation(line: 147, column: 25, scope: !904)
!1057 = !DILocation(line: 147, column: 22, scope: !904)
!1058 = !DILocation(line: 0, scope: !903)
!1059 = !DILocation(line: 152, column: 31, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !720, line: 151, column: 49)
!1061 = distinct !DILexicalBlock(scope: !903, file: !720, line: 151, column: 9)
!1062 = !DILocation(line: 152, column: 29, scope: !1060)
!1063 = !DILocation(line: 153, column: 41, scope: !1060)
!1064 = !DILocation(line: 153, column: 39, scope: !1060)
!1065 = !DILocation(line: 154, column: 41, scope: !1060)
!1066 = !DILocation(line: 154, column: 39, scope: !1060)
!1067 = !DILocation(line: 156, column: 37, scope: !904)
!1068 = !DILocation(line: 157, column: 47, scope: !904)
!1069 = !DILocation(line: 158, column: 47, scope: !904)
!1070 = distinct !{!1070, !1055, !1071, !763}
!1071 = !DILocation(line: 159, column: 5, scope: !873)
!1072 = !DILocation(line: 160, column: 12, scope: !873)
!1073 = !{i64 0, i64 8, !753, i64 8, i64 8, !753, i64 16, i64 8, !753, i64 24, i64 128, !855, i64 152, i64 128, !855, i64 280, i64 128, !855, i64 408, i64 8, !753}
!1074 = !DILocation(line: 160, column: 5, scope: !873)
!1075 = !DILocation(line: 161, column: 1, scope: !873)
!1076 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !720, line: 163, type: !1077, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !1079)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!725, !876}
!1079 = !{!1080}
!1080 = !DILocalVariable(name: "buf", arg: 1, scope: !1076, file: !720, line: 163, type: !876)
!1081 = !DILocation(line: 0, scope: !1076)
!1082 = !DILocation(line: 164, column: 12, scope: !1076)
!1083 = !DILocation(line: 164, column: 5, scope: !1076)
!1084 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !720, line: 167, type: !1077, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !1085)
!1085 = !{!1086}
