; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/write_debug_image.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/write_debug_image.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }
%struct.halide_device_interface_impl_t = type opaque
%struct.halide_type_t = type { i8, i8, i16 }

!20 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/write_debug_image.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!21 = !{!22, !30}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !23, line: 403, baseType: !15, size: 8, elements: !24, identifier: "_ZTS18halide_type_code_t")
!23 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 1415, baseType: !31, size: 32, elements: !32, identifier: "_ZTS19halide_buffer_flags")
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!35 = !{!36, !7, !39, !40, !41, !43, !45}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 12, baseType: !31)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 10, baseType: !42)
!42 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 27, baseType: !44)
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !8, line: 28, baseType: !46)
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !{!0, !12, !17}
!48 = !{!49}
!49 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !19, entity: !2, file: !8, line: 225)
!50 = !{i32 7, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 4}
!53 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!54 = distinct !DISubprogram(name: "ends_with", linkageName: "_ZN6Halide7Runtime8Internal9ends_withEPKcS3_", scope: !2, file: !5, line: 92, type: !55, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !58)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !36, !36}
!57 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!58 = !{!59, !60, !61, !62}
!59 = !DILocalVariable(name: "filename", arg: 1, scope: !54, file: !5, line: 92, type: !36)
!60 = !DILocalVariable(name: "suffix", arg: 2, scope: !54, file: !5, line: 92, type: !36)
!61 = !DILocalVariable(name: "f", scope: !54, file: !5, line: 93, type: !36)
!62 = !DILocalVariable(name: "s", scope: !54, file: !5, line: 93, type: !36)
!63 = !DILocation(line: 0, scope: !54)
!64 = !DILocation(line: 94, column: 5, scope: !54)
!65 = !DILocation(line: 94, column: 12, scope: !54)
!66 = !{!67, !67, i64 0}
!67 = !{!"omnipotent char", !68, i64 0}
!68 = !{!"Simple C++ TBAA"}
!69 = !DILocation(line: 95, column: 10, scope: !70)
!70 = distinct !DILexicalBlock(scope: !54, file: !5, line: 94, column: 16)
!71 = distinct !{!71, !64, !72, !73}
!72 = !DILocation(line: 96, column: 5, scope: !54)
!73 = !{!"llvm.loop.mustprogress"}
!74 = !DILocation(line: 97, column: 12, scope: !54)
!75 = !DILocation(line: 98, column: 10, scope: !76)
!76 = distinct !DILexicalBlock(scope: !54, file: !5, line: 97, column: 16)
!77 = !DILocation(line: 97, column: 5, scope: !54)
!78 = distinct !{!78, !77, !79, !73}
!79 = !DILocation(line: 99, column: 5, scope: !54)
!80 = !DILocation(line: 100, column: 14, scope: !54)
!81 = !DILocation(line: 100, column: 24, scope: !54)
!82 = !DILocation(line: 100, column: 5, scope: !54)
!83 = !DILocation(line: 104, column: 10, scope: !84)
!84 = distinct !DILexicalBlock(scope: !54, file: !5, line: 100, column: 42)
!85 = !DILocation(line: 105, column: 10, scope: !84)
!86 = distinct !{!86, !82, !87, !73}
!87 = !DILocation(line: 106, column: 5, scope: !54)
!88 = !DILocation(line: 101, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !84, file: !5, line: 101, column: 13)
!90 = !DILocation(line: 101, column: 13, scope: !84)
!91 = !DILocation(line: 107, column: 18, scope: !54)
!92 = !DILocation(line: 107, column: 12, scope: !54)
!93 = !DILocation(line: 107, column: 15, scope: !54)
!94 = !DILocation(line: 107, column: 5, scope: !54)
!95 = !DILocation(line: 108, column: 1, scope: !54)
!96 = distinct !DISubprogram(name: "halide_debug_to_file", scope: !5, file: !5, line: 132, type: !97, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !251)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !39, !36, !99, !101}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 11, baseType: !100)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !23, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !103, identifier: "_ZTS15halide_buffer_t")
!103 = !{!104, !105, !156, !158, !159, !192, !193, !216, !217, !222, !226, !229, !230, !233, !234, !237, !240, !241, !242, !247, !250}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !102, file: !23, line: 1425, baseType: !41, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !102, file: !23, line: 1428, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !23, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !109, identifier: "_ZTS25halide_device_interface_t")
!109 = !{!110, !114, !118, !119, !123, !124, !125, !126, !127, !131, !137, !141, !142, !146, !147, !152}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !108, file: !23, line: 724, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!100, !39, !101, !106}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !108, file: !23, line: 726, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!100, !39, !101}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !108, file: !23, line: 727, baseType: !115, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !108, file: !23, line: 728, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !39, !106}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !108, file: !23, line: 730, baseType: !115, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !108, file: !23, line: 731, baseType: !111, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !108, file: !23, line: 733, baseType: !111, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !108, file: !23, line: 735, baseType: !115, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !108, file: !23, line: 736, baseType: !128, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!100, !39, !101, !106, !101}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !108, file: !23, line: 738, baseType: !132, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!100, !39, !135, !101}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !108, file: !23, line: 740, baseType: !138, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!100, !39, !135, !100, !100, !101}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !108, file: !23, line: 742, baseType: !115, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !108, file: !23, line: 743, baseType: !143, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!100, !39, !101, !41, !106}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !108, file: !23, line: 745, baseType: !115, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !108, file: !23, line: 746, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!100, !39, !151, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !108, file: !23, line: 747, baseType: !153, size: 64, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !23, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !102, file: !23, line: 1433, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !102, file: !23, line: 1436, baseType: !41, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !23, line: 1439, baseType: !160, size: 32, offset: 256)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !23, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !161, identifier: "_ZTS13halide_type_t")
!161 = !{!162, !164, !165, !168, !172, !175, !180, !184, !185, !186, !189}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !160, file: !23, line: 434, baseType: !163, size: 8, align: 8)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !23, line: 413, baseType: !22)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !160, file: !23, line: 442, baseType: !15, size: 8, align: 8, offset: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !160, file: !23, line: 446, baseType: !166, size: 16, align: 16, offset: 16)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 14, baseType: !167)
!167 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!168 = !DISubprogram(name: "halide_type_t", scope: !160, file: !23, line: 453, type: !169, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171, !163, !15, !166}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DISubprogram(name: "halide_type_t", scope: !160, file: !23, line: 459, type: !173, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !171}
!175 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !160, file: !23, line: 463, type: !176, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{!160, !178, !166}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!180 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !160, file: !23, line: 468, type: !181, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubroutineType(types: !182)
!182 = !{!57, !178, !183}
!183 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !179, size: 64)
!184 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !160, file: !23, line: 472, type: !181, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !160, file: !23, line: 476, type: !181, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !160, file: !23, line: 481, type: !187, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!187 = !DISubroutineType(types: !188)
!188 = !{!100, !178}
!189 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !160, file: !23, line: 485, type: !190, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!190 = !DISubroutineType(types: !191)
!191 = !{!40, !178}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !102, file: !23, line: 1442, baseType: !99, size: 32, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !102, file: !23, line: 1446, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !23, line: 1409, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !23, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !197, identifier: "_ZTS18halide_dimension_t")
!197 = !{!198, !199, !200, !201, !202, !206, !209, !215}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !196, file: !23, line: 1383, baseType: !99, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !196, file: !23, line: 1383, baseType: !99, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !196, file: !23, line: 1383, baseType: !99, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !23, line: 1386, baseType: !40, size: 32, offset: 96)
!202 = !DISubprogram(name: "halide_dimension_t", scope: !196, file: !23, line: 1388, type: !203, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!206 = !DISubprogram(name: "halide_dimension_t", scope: !196, file: !23, line: 1389, type: !207, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !205, !99, !99, !99, !40}
!209 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !196, file: !23, line: 1393, type: !210, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{!57, !212, !214}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!214 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !213, size: 64)
!215 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !196, file: !23, line: 1400, type: !210, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !102, file: !23, line: 1449, baseType: !39, size: 64, offset: 384)
!217 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !102, file: !23, line: 1454, type: !218, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubroutineType(types: !219)
!219 = !{!57, !220, !221}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !23, line: 1416, baseType: !30)
!222 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !102, file: !23, line: 1458, type: !223, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !225, !221, !57}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!226 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !102, file: !23, line: 1466, type: !227, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{!57, !220}
!229 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !102, file: !23, line: 1470, type: !227, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !102, file: !23, line: 1474, type: !231, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !225, !57}
!233 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !102, file: !23, line: 1478, type: !231, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !102, file: !23, line: 1485, type: !235, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!235 = !DISubroutineType(types: !236)
!236 = !{!43, !220}
!237 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !102, file: !23, line: 1495, type: !238, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{!157, !220}
!240 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !102, file: !23, line: 1506, type: !238, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !102, file: !23, line: 1518, type: !235, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !102, file: !23, line: 1523, type: !243, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!157, !220, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!247 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !102, file: !23, line: 1534, type: !248, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DISubroutineType(types: !249)
!249 = !{!100, !225, !39}
!250 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !102, file: !23, line: 1545, type: !227, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!251 = !{!252, !253, !254, !255, !256, !277, !278, !282, !284, !286, !287, !288, !291, !292, !293, !294, !334, !335, !336, !338, !341, !343, !344, !346, !349, !350, !351, !355, !357, !358, !362, !363, !364, !365, !369, !371, !373, !374, !379, !380, !384, !385, !386, !388, !392, !396, !400, !403, !404, !405}
!252 = !DILocalVariable(name: "user_context", arg: 1, scope: !96, file: !5, line: 132, type: !39)
!253 = !DILocalVariable(name: "filename", arg: 2, scope: !96, file: !5, line: 132, type: !36)
!254 = !DILocalVariable(name: "type_code", arg: 3, scope: !96, file: !5, line: 133, type: !99)
!255 = !DILocalVariable(name: "buf", arg: 4, scope: !96, file: !5, line: 133, type: !101)
!256 = !DILocalVariable(name: "f", scope: !96, file: !5, line: 147, type: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedFile", scope: !2, file: !5, line: 110, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !258, identifier: "_ZTSN6Halide7Runtime8Internal10ScopedFileE")
!258 = !{!259, !260, !264, !267, !272}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !257, file: !5, line: 111, baseType: !39, size: 64)
!260 = !DISubprogram(name: "ScopedFile", scope: !257, file: !5, line: 112, type: !261, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !263, !36, !36}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!264 = !DISubprogram(name: "~ScopedFile", scope: !257, file: !5, line: 115, type: !265, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !263}
!267 = !DISubprogram(name: "write", linkageName: "_ZN6Halide7Runtime8Internal10ScopedFile5writeEPKvm", scope: !257, file: !5, line: 120, type: !268, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{!57, !263, !270, !43}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!272 = !DISubprogram(name: "open", linkageName: "_ZNK6Halide7Runtime8Internal10ScopedFile4openEv", scope: !257, file: !5, line: 123, type: !273, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!273 = !DISubroutineType(types: !274)
!274 = !{!57, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!277 = !DILocalVariable(name: "elts", scope: !96, file: !5, line: 152, type: !43)
!278 = !DILocalVariable(name: "shape", scope: !96, file: !5, line: 153, type: !279)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 512, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 4)
!282 = !DILocalVariable(name: "i", scope: !283, file: !5, line: 154, type: !100)
!283 = distinct !DILexicalBlock(scope: !96, file: !5, line: 154, column: 5)
!284 = !DILocalVariable(name: "i", scope: !285, file: !5, line: 158, type: !100)
!285 = distinct !DILexicalBlock(scope: !96, file: !5, line: 158, column: 5)
!286 = !DILocalVariable(name: "bytes_per_element", scope: !96, file: !5, line: 163, type: !99)
!287 = !DILocalVariable(name: "final_padding_bytes", scope: !96, file: !5, line: 165, type: !40)
!288 = !DILocalVariable(name: "channels", scope: !289, file: !5, line: 168, type: !99)
!289 = distinct !DILexicalBlock(scope: !290, file: !5, line: 167, column: 70)
!290 = distinct !DILexicalBlock(scope: !96, file: !5, line: 167, column: 9)
!291 = !DILocalVariable(name: "width", scope: !289, file: !5, line: 169, type: !99)
!292 = !DILocalVariable(name: "height", scope: !289, file: !5, line: 170, type: !99)
!293 = !DILocalVariable(name: "depth", scope: !289, file: !5, line: 171, type: !99)
!294 = !DILocalVariable(name: "header", scope: !289, file: !5, line: 181, type: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_tiff_header", scope: !2, file: !5, line: 79, size: 1680, flags: DIFlagTypePassByValue, elements: !296, identifier: "_ZTSN6Halide7Runtime8Internal18halide_tiff_headerE")
!296 = !{!297, !298, !299, !300, !301, !328, !329, !333}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order_marker", scope: !295, file: !5, line: 80, baseType: !7, size: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !295, file: !5, line: 81, baseType: !7, size: 16, offset: 16)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ifd0_offset", scope: !295, file: !5, line: 82, baseType: !99, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "entry_count", scope: !295, file: !5, line: 83, baseType: !7, size: 16, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !295, file: !5, line: 84, baseType: !302, size: 1440, offset: 80)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 1440, elements: !326)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff_tag", scope: !2, file: !5, line: 47, size: 96, flags: DIFlagTypePassByValue, elements: !304, identifier: "_ZTSN6Halide7Runtime8Internal8tiff_tagE")
!304 = !{!305, !306, !307, !308, !316, !320, !323}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tag_code", scope: !303, file: !5, line: 48, baseType: !166, size: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type_code", scope: !303, file: !5, line: 49, baseType: !7, size: 16, offset: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !303, file: !5, line: 50, baseType: !99, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !303, file: !5, line: 55, baseType: !309, size: 32, offset: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !5, line: 51, size: 32, flags: DIFlagTypePassByValue, elements: !310, identifier: "_ZTSN6Halide7Runtime8Internal8tiff_tagUt_E")
!310 = !{!311, !314, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i8", scope: !309, file: !5, line: 52, baseType: !312, size: 8)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !8, line: 15, baseType: !313)
!313 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i16", scope: !309, file: !5, line: 53, baseType: !7, size: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !309, file: !5, line: 54, baseType: !99, size: 32)
!316 = !DISubprogram(name: "assign16", linkageName: "_ZN6Halide7Runtime8Internal8tiff_tag8assign16Etis", scope: !303, file: !5, line: 57, type: !317, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !319, !166, !99, !7}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!320 = !DISubprogram(name: "assign32", linkageName: "_ZN6Halide7Runtime8Internal8tiff_tag8assign32Etii", scope: !303, file: !5, line: 64, type: !321, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !319, !166, !99, !99}
!323 = !DISubprogram(name: "assign32", linkageName: "_ZN6Halide7Runtime8Internal8tiff_tag8assign32Etsii", scope: !303, file: !5, line: 71, type: !324, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !319, !166, !7, !99, !99}
!326 = !{!327}
!327 = !DISubrange(count: 15)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ifd0_end", scope: !295, file: !5, line: 85, baseType: !99, size: 32, offset: 1520)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "width_resolution", scope: !295, file: !5, line: 86, baseType: !330, size: 64, offset: 1552)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 2)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "height_resolution", scope: !295, file: !5, line: 87, baseType: !330, size: 64, offset: 1616)
!334 = !DILocalVariable(name: "MMII", scope: !289, file: !5, line: 183, type: !99)
!335 = !DILocalVariable(name: "c", scope: !289, file: !5, line: 185, type: !36)
!336 = !DILocalVariable(name: "tag", scope: !289, file: !5, line: 192, type: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!338 = !DILocalVariable(name: "offset", scope: !339, file: !5, line: 227, type: !99)
!339 = distinct !DILexicalBlock(scope: !340, file: !5, line: 226, column: 27)
!340 = distinct !DILexicalBlock(scope: !289, file: !5, line: 226, column: 13)
!341 = !DILocalVariable(name: "i", scope: !342, file: !5, line: 229, type: !99)
!342 = distinct !DILexicalBlock(scope: !339, file: !5, line: 229, column: 13)
!343 = !DILocalVariable(name: "count", scope: !339, file: !5, line: 235, type: !99)
!344 = !DILocalVariable(name: "i", scope: !345, file: !5, line: 236, type: !99)
!345 = distinct !DILexicalBlock(scope: !339, file: !5, line: 236, column: 13)
!346 = !DILocalVariable(name: "end", scope: !347, file: !5, line: 244, type: !36)
!347 = distinct !DILexicalBlock(scope: !348, file: !5, line: 242, column: 45)
!348 = distinct !DILexicalBlock(scope: !290, file: !5, line: 242, column: 16)
!349 = !DILocalVariable(name: "start", scope: !347, file: !5, line: 251, type: !36)
!350 = !DILocalVariable(name: "name_size", scope: !347, file: !5, line: 255, type: !40)
!351 = !DILocalVariable(name: "array_name", scope: !347, file: !5, line: 256, type: !352)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 256)
!355 = !DILocalVariable(name: "dst", scope: !347, file: !5, line: 257, type: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!357 = !DILocalVariable(name: "padded_name_size", scope: !347, file: !5, line: 265, type: !40)
!358 = !DILocalVariable(name: "header", scope: !347, file: !5, line: 267, type: !359)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1032, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 129)
!362 = !DILocalVariable(name: "payload_bytes", scope: !347, file: !5, line: 273, type: !43)
!363 = !DILocalVariable(name: "dims", scope: !347, file: !5, line: 281, type: !100)
!364 = !DILocalVariable(name: "padded_dimensions", scope: !347, file: !5, line: 287, type: !100)
!365 = !DILocalVariable(name: "tags", scope: !347, file: !5, line: 289, type: !366)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 8)
!369 = !DILocalVariable(name: "extents", scope: !347, file: !5, line: 301, type: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, elements: !280)
!371 = !DILocalVariable(name: "name_header", scope: !347, file: !5, line: 307, type: !372)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !331)
!373 = !DILocalVariable(name: "payload_header", scope: !347, file: !5, line: 319, type: !372)
!374 = !DILocalVariable(name: "header", scope: !375, file: !5, line: 325, type: !376)
!375 = distinct !DILexicalBlock(scope: !348, file: !5, line: 324, column: 12)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 160, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 5)
!379 = !DILocalVariable(name: "TEMP_SIZE", scope: !96, file: !5, line: 336, type: !246)
!380 = !DILocalVariable(name: "temp", scope: !96, file: !5, line: 337, type: !381)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32768, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 4096)
!384 = !DILocalVariable(name: "max_elts", scope: !96, file: !5, line: 338, type: !100)
!385 = !DILocalVariable(name: "counter", scope: !96, file: !5, line: 339, type: !100)
!386 = !DILocalVariable(name: "dim3", scope: !387, file: !5, line: 341, type: !99)
