; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_threads_tsan.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_threads_tsan.cpp"
target datalayout = "e-m:x-p:32:32-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:32-n8:16:32-a:0:32-S32"
target triple = "i386-unknown-windows-msvc19.11.0"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8 }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32 }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i32] }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::spawned_thread" = type { void (i8*)*, i8*, i8* }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "?table_storage@Synchronization@Internal@Runtime@Halide@@3PADA", scope: !2, file: !6, line: 478, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Synchronization", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b400fbacf7de8493908f4259eb79919f")
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 98304, elements: !9)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!10}
!10 = !DISubrange(count: 12288)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "?work_queue@Internal@Runtime@Halide@@3Uwork_queue_t@123@A", scope: !3, file: !13, line: 166, type: !14, isLocal: false, isDefinition: true)
!13 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "385167390ae95a5e646994afa54aa508")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !3, file: !13, line: 94, size: 8640, flags: DIFlagTypePassByValue, elements: !15, identifier: ".?AUwork_queue_t@Internal@Runtime@Halide@@")
!15 = !{!16, !28, !30, !31, !89, !90, !91, !92, !96, !97, !98, !99, !100, !106, !107, !108, !109, !114, !117}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !14, file: !13, line: 96, baseType: !17, size: 32)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !18, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !19, identifier: ".?AUhalide_mutex@@")
!18 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !17, file: !18, line: 121, baseType: !21, size: 32)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !26)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 68, baseType: !24)
!23 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "0c7b3d8a4f3a5581b3edea53998e0f01")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 12, baseType: !25)
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 1)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !14, file: !13, line: 99, baseType: !29, size: 32, offset: 32)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !14, file: !13, line: 103, baseType: !29, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !14, file: !13, line: 106, baseType: !32, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !3, file: !13, line: 26, size: 640, flags: DIFlagTypePassByValue, elements: !34, identifier: ".?AUwork@Internal@Runtime@Halide@@")
!34 = !{!35, !65, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !84}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !33, file: !13, line: 27, baseType: !36, size: 288)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !18, line: 201, size: 288, flags: DIFlagTypePassByValue, elements: !37, identifier: ".?AUhalide_parallel_task_t@@")
!37 = !{!38, !47, !48, !51, !59, !60, !61, !62, !63}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !36, file: !18, line: 204, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !18, line: 192, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DISubroutineType(types: !42)
!42 = !{!29, !43, !29, !29, !44, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 16, baseType: !46)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !36, file: !18, line: 207, baseType: !44, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !18, line: 210, baseType: !49, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !36, file: !18, line: 214, baseType: !52, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !18, line: 177, size: 64, flags: DIFlagTypePassByValue, elements: !54, identifier: ".?AUhalide_semaphore_acquire_t@@")
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !53, file: !18, line: 178, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !18, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: ".?AUhalide_semaphore_t@@")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !18, line: 179, baseType: !29, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !36, file: !18, line: 215, baseType: !29, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !36, file: !18, line: 238, baseType: !29, size: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !36, file: !18, line: 243, baseType: !64, size: 8, offset: 256)
!64 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !33, file: !13, line: 31, baseType: !66, size: 32, offset: 288)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !18, line: 158, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DISubroutineType(types: !69)
!69 = !{!29, !43, !29, !44}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !33, file: !13, line: 33, baseType: !32, size: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !33, file: !13, line: 34, baseType: !32, size: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !33, file: !13, line: 35, baseType: !29, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !33, file: !13, line: 36, baseType: !32, size: 32, offset: 416)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !33, file: !13, line: 37, baseType: !29, size: 32, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !33, file: !13, line: 39, baseType: !43, size: 32, offset: 480)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !33, file: !13, line: 40, baseType: !29, size: 32, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !33, file: !13, line: 41, baseType: !29, size: 32, offset: 544)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !33, file: !13, line: 42, baseType: !29, size: 32, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !33, file: !13, line: 44, baseType: !64, size: 8, offset: 608)
!80 = !DISubprogram(name: "make_runnable", linkageName: "?make_runnable@work@Internal@Runtime@Halide@@QAE_NXZ", scope: !33, file: !13, line: 46, type: !81, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !82)
!82 = !{!64, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!84 = !DISubprogram(name: "running", linkageName: "?running@work@Internal@Runtime@Halide@@QBE_NXZ", scope: !33, file: !13, line: 62, type: !85, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !86)
!86 = !{!64, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !14, file: !13, line: 109, baseType: !29, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !14, file: !13, line: 122, baseType: !93, size: 32, offset: 224)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !18, line: 125, size: 32, flags: DIFlagTypePassByValue, elements: !94, identifier: ".?AUhalide_cond@@")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !93, file: !18, line: 126, baseType: !21, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !14, file: !13, line: 122, baseType: !93, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !14, file: !13, line: 122, baseType: !93, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 352)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !14, file: !13, line: 129, baseType: !101, size: 8192, offset: 384)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8192, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !18, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AUhalide_thread@@")
!104 = !{!105}
!105 = !DISubrange(count: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 8576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 8584)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !14, file: !13, line: 139, baseType: !29, size: 32, offset: 8608)
!109 = !DISubprogram(name: "running", linkageName: "?running@work_queue_t@Internal@Runtime@Halide@@QBE_NXZ", scope: !14, file: !13, line: 141, type: !110, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !111)
!111 = !{!64, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!114 = !DISubprogram(name: "assert_zeroed", linkageName: "?assert_zeroed@work_queue_t@Internal@Runtime@Halide@@QBEXXZ", scope: !14, file: !13, line: 146, type: !115, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !116)
!116 = !{null, !112}
!117 = !DISubprogram(name: "reset", linkageName: "?reset@work_queue_t@Internal@Runtime@Halide@@QAEXXZ", scope: !14, file: !13, line: 158, type: !118, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !119)
!119 = !{null, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "?custom_do_task@Internal@Runtime@Halide@@3P6AHPAXP6AH0HPAE@ZH1@ZA", scope: !3, file: !13, line: 567, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !18, line: 259, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!29, !43, !66, !29, !44}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "?custom_do_loop_task@Internal@Runtime@Halide@@3P6AHPAXP6AH0HHPAE0@ZHH10@ZA", scope: !3, file: !13, line: 568, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !18, line: 268, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{!29, !43, !39, !29, !29, !44, !43}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "?custom_do_par_for@Internal@Runtime@Halide@@3P6AHPAXP6AH0HPAE@ZHH1@ZA", scope: !3, file: !13, line: 569, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !18, line: 167, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{!29, !43, !66, !29, !29, !44}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "?custom_do_parallel_tasks@Internal@Runtime@Halide@@3P6AHPAXHPAUhalide_parallel_task_t@@0@ZA", scope: !3, file: !13, line: 570, type: !141, isLocal: false, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !18, line: 281, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!29, !43, !29, !145, !43}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "?custom_semaphore_init@Internal@Runtime@Halide@@3P6AHPAUhalide_semaphore_t@@H@ZA", scope: !3, file: !13, line: 571, type: !148, isLocal: false, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !18, line: 184, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{!29, !56, !29}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "?custom_semaphore_try_acquire@Internal@Runtime@Halide@@3P6A_NPAUhalide_semaphore_t@@H@ZA", scope: !3, file: !13, line: 572, type: !154, isLocal: false, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !18, line: 186, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{!64, !56, !29}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "?custom_semaphore_release@Internal@Runtime@Halide@@3P6AHPAUhalide_semaphore_t@@H@ZA", scope: !3, file: !13, line: 573, type: !160, isLocal: false, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !18, line: 185, baseType: !149)
!161 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !162, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !163, retainedTypes: !164, globals: !373, imports: !384, nameTableKind: None)
!162 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_threads_tsan.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "50ae3740d88f85cff08b4f2677cebdf4")
!163 = !{}
!164 = !{!165, !102, !22, !176, !229, !264, !265, !305, !330, !340, !311, !350, !363, !367, !32, !368, !300, !49, !372}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !3, file: !167, line: 38, size: 96, flags: DIFlagTypePassByValue, elements: !168, identifier: ".?AUspawned_thread@Internal@Runtime@Halide@@")
!167 = !DIFile(filename: "src/runtime/windows_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "6b47adcd64c88f8a38b8b1700cd2db58")
!168 = !{!169, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !166, file: !167, line: 39, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !43}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !166, file: !167, line: 40, baseType: !43, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !166, file: !167, line: 41, baseType: !175, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", file: !167, line: 17, baseType: !43)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !2, file: !6, line: 254, size: 576, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !178, identifier: ".?AUword_lock_queue_data@Synchronization@Internal@Runtime@Halide@@")
!178 = !{!179, !221, !222, !223, !224, !228}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !177, file: !6, line: 255, baseType: !180, size: 448)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !2, file: !167, line: 87, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !181, identifier: ".?AUthread_parker@Synchronization@Internal@Runtime@Halide@@")
!181 = !{!182, !192, !194, !195, !201, !205, !209, !212, !215, !216, !217, !218, !219, !220}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "critical_section", scope: !180, file: !167, line: 88, baseType: !183, size: 320)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "CriticalSection", file: !167, line: 20, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CriticalSection", file: !167, line: 18, size: 320, flags: DIFlagTypePassByValue, elements: !185, identifier: ".?AUCriticalSection@@")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !184, file: !167, line: 19, baseType: !187, size: 320)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 320, elements: !190)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 10, baseType: !189)
!189 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!190 = !{!191}
!191 = !DISubrange(count: 5)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !180, file: !167, line: 89, baseType: !193, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", file: !167, line: 16, baseType: !188)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !180, file: !167, line: 90, baseType: !64, size: 8, offset: 384)
!195 = !DISubprogram(name: "thread_parker", scope: !180, file: !167, line: 92, type: !196, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!196 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !197)
!197 = !{null, !198, !199}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!199 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!201 = !DISubprogram(name: "operator=", linkageName: "??4thread_parker@Synchronization@Internal@Runtime@Halide@@QAEAAU01234@ABU01234@@Z", scope: !180, file: !167, line: 93, type: !202, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!202 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !203)
!203 = !{!204, !198, !199}
!204 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !180, size: 32)
!205 = !DISubprogram(name: "thread_parker", scope: !180, file: !167, line: 94, type: !206, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!206 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !207)
!207 = !{null, !198, !208}
!208 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !180, size: 32)
!209 = !DISubprogram(name: "operator=", linkageName: "??4thread_parker@Synchronization@Internal@Runtime@Halide@@QAEAAU01234@$$QAU01234@@Z", scope: !180, file: !167, line: 95, type: !210, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!210 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !211)
!211 = !{!204, !198, !208}
!212 = !DISubprogram(name: "thread_parker", scope: !180, file: !167, line: 97, type: !213, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !214)
!214 = !{null, !198}
!215 = !DISubprogram(name: "~thread_parker", scope: !180, file: !167, line: 102, type: !213, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubprogram(name: "prepare_park", linkageName: "?prepare_park@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 107, type: !213, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubprogram(name: "park", linkageName: "?park@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 111, type: !213, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubprogram(name: "unpark_start", linkageName: "?unpark_start@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 119, type: !213, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DISubprogram(name: "unpark", linkageName: "?unpark@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 123, type: !213, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubprogram(name: "unpark_finish", linkageName: "?unpark_finish@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 128, type: !213, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !6, line: 273, baseType: !176, size: 32, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !6, line: 274, baseType: !176, size: 32, offset: 480)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !177, file: !6, line: 275, baseType: !176, size: 32, offset: 512)
!224 = !DISubprogram(name: "word_lock_queue_data", scope: !177, file: !6, line: 277, type: !225, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !226)
!226 = !{null, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!228 = !DISubprogram(name: "~word_lock_queue_data", scope: !177, file: !6, line: 280, type: !225, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !2, file: !6, line: 475, size: 98304, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !231, identifier: ".?AUhash_table@Synchronization@Internal@Runtime@Halide@@")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !230, file: !6, line: 476, baseType: !233, size: 98304)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 98304, elements: !262)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !2, file: !6, line: 463, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !235, identifier: ".?AUhash_bucket@Synchronization@Internal@Runtime@Halide@@")
!235 = !{!236, !248, !261}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !234, file: !6, line: 464, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !2, file: !6, line: 283, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !238, identifier: ".?AVword_lock@Synchronization@Internal@Runtime@Halide@@")
!238 = !{!239, !240, !244, !245, !246, !247}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !6, line: 284, baseType: !22, size: 32)
!240 = !DISubprogram(name: "lock_full", linkageName: "?lock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AAEXXZ", scope: !237, file: !6, line: 286, type: !241, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !242)
!242 = !{null, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!244 = !DISubprogram(name: "unlock_full", linkageName: "?unlock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AAEXXZ", scope: !237, file: !6, line: 287, type: !241, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!245 = !DISubprogram(name: "word_lock", scope: !237, file: !6, line: 290, type: !241, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubprogram(name: "lock", linkageName: "?lock@word_lock@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !237, file: !6, line: 291, type: !241, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!247 = !DISubprogram(name: "unlock", linkageName: "?unlock@word_lock@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !237, file: !6, line: 304, type: !241, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !234, file: !6, line: 466, baseType: !249, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !2, file: !6, line: 448, size: 576, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !251, identifier: ".?AUqueue_data@Synchronization@Internal@Runtime@Halide@@")
!251 = !{!252, !253, !254, !255, !256, !260}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !250, file: !6, line: 449, baseType: !180, size: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !250, file: !6, line: 451, baseType: !22, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !6, line: 452, baseType: !249, size: 32, offset: 480)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !250, file: !6, line: 453, baseType: !22, size: 32, offset: 512)
!256 = !DISubprogram(name: "queue_data", scope: !250, file: !6, line: 455, type: !257, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !258)
!258 = !{null, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!260 = !DISubprogram(name: "~queue_data", scope: !250, file: !6, line: 457, type: !257, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !234, file: !6, line: 467, baseType: !249, size: 32, offset: 64)
!262 = !{!263}
!263 = !DISubrange(count: 1024)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !2, file: !6, line: 829, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !267, identifier: ".?AUmutex_parking_control@Synchronization@Internal@Runtime@Halide@@")
!267 = !{!268, !299, !301}
!268 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !266, baseType: !269, extraData: i32 0)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !2, file: !6, line: 592, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !270, identifier: ".?AUparking_control@Synchronization@Internal@Runtime@Halide@@")
!270 = !{!271, !284, !285, !289, !295}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !269, file: !6, line: 593, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{!64, !43, !275}
!275 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !2, file: !6, line: 576, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !277, identifier: ".?AUvalidate_action@Synchronization@Internal@Runtime@Halide@@")
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !276, file: !6, line: 577, baseType: !64, size: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !276, file: !6, line: 578, baseType: !22, size: 32, offset: 32)
!280 = !DISubprogram(name: "validate_action", scope: !276, file: !6, line: 580, type: !281, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!281 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !282)
!282 = !{null, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !269, file: !6, line: 594, baseType: !170, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !269, file: !6, line: 595, baseType: !286, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{!22, !43, !29, !64}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !269, file: !6, line: 596, baseType: !290, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !43, !293, !64, !64}
!293 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!295 = !DISubprogram(name: "parking_control", scope: !269, file: !6, line: 598, type: !296, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !297)
!297 = !{null, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !266, file: !6, line: 830, baseType: !300, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!301 = !DISubprogram(name: "mutex_parking_control", scope: !266, file: !6, line: 832, type: !302, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !303)
!303 = !{null, !304, !300}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !2, file: !6, line: 958, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !307, identifier: ".?AUsignal_parking_control@Synchronization@Internal@Runtime@Halide@@")
!307 = !{!308, !309, !310, !326}
!308 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !306, baseType: !269, extraData: i32 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !306, file: !6, line: 959, baseType: !300, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !306, file: !6, line: 960, baseType: !311, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !2, file: !6, line: 859, size: 32, flags: DIFlagTypePassByValue, elements: !313, identifier: ".?AVfast_mutex@Synchronization@Internal@Runtime@Halide@@")
!313 = !{!314, !315, !319, !320, !321, !322, !325}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !312, file: !6, line: 860, baseType: !22, size: 32)
!315 = !DISubprogram(name: "lock_full", linkageName: "?lock_full@fast_mutex@Synchronization@Internal@Runtime@Halide@@AAEXXZ", scope: !312, file: !6, line: 862, type: !316, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !317)
!317 = !{null, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!319 = !DISubprogram(name: "unlock_full", linkageName: "?unlock_full@fast_mutex@Synchronization@Internal@Runtime@Halide@@AAEXXZ", scope: !312, file: !6, line: 906, type: !316, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubprogram(name: "lock", linkageName: "?lock@fast_mutex@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !312, file: !6, line: 920, type: !316, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubprogram(name: "unlock", linkageName: "?unlock@fast_mutex@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !312, file: !6, line: 929, type: !316, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubprogram(name: "make_parked_if_locked", linkageName: "?make_parked_if_locked@fast_mutex@Synchronization@Internal@Runtime@Halide@@QAE_NXZ", scope: !312, file: !6, line: 938, type: !323, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !324)
!324 = !{!64, !318}
!325 = !DISubprogram(name: "make_parked", linkageName: "?make_parked@fast_mutex@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !312, file: !6, line: 953, type: !316, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubprogram(name: "signal_parking_control", scope: !306, file: !6, line: 962, type: !327, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!327 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !328)
!328 = !{null, !329, !300, !311}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !2, file: !6, line: 985, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !332, identifier: ".?AUbroadcast_parking_control@Synchronization@Internal@Runtime@Halide@@")
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !331, baseType: !269, extraData: i32 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !331, file: !6, line: 986, baseType: !300, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !331, file: !6, line: 987, baseType: !311, size: 32, offset: 160)
!336 = !DISubprogram(name: "broadcast_parking_control", scope: !331, file: !6, line: 989, type: !337, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !338)
!338 = !{null, !339, !300, !311}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !2, file: !6, line: 1026, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !342, identifier: ".?AUwait_parking_control@Synchronization@Internal@Runtime@Halide@@")
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !341, baseType: !269, extraData: i32 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !341, file: !6, line: 1027, baseType: !300, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !341, file: !6, line: 1028, baseType: !311, size: 32, offset: 160)
!346 = !DISubprogram(name: "wait_parking_control", scope: !341, file: !6, line: 1030, type: !347, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !348)
!348 = !{null, !349, !300, !311}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !2, file: !6, line: 1072, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !352, identifier: ".?AVfast_cond@Synchronization@Internal@Runtime@Halide@@")
!352 = !{!353, !354, !358, !359, !360}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !6, line: 1073, baseType: !22, size: 32)
!354 = !DISubprogram(name: "fast_cond", scope: !351, file: !6, line: 1076, type: !355, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !356)
!356 = !{null, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!358 = !DISubprogram(name: "signal", linkageName: "?signal@fast_cond@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !351, file: !6, line: 1078, type: !355, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubprogram(name: "broadcast", linkageName: "?broadcast@fast_cond@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !351, file: !6, line: 1092, type: !355, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubprogram(name: "wait", linkageName: "?wait@fast_cond@Synchronization@Internal@Runtime@Halide@@QAEXPAVfast_mutex@2345@@Z", scope: !351, file: !6, line: 1105, type: !361, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !362)
!362 = !{null, !357, !311}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !6, line: 1164, size: 32, flags: DIFlagTypePassByValue, elements: !365, identifier: ".?AUhalide_mutex_array@@")
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !364, file: !6, line: 1165, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !13, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !370, identifier: ".?AUhalide_semaphore_impl_t@@")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !13, line: 712, baseType: !29, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!373 = !{!374, !377, !0, !379, !11, !121, !127, !133, !139, !146, !152, !158, !381}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!375 = distinct !DIGlobalVariable(name: "lock_bit", scope: !2, file: !6, line: 250, type: !376, isLocal: true, isDefinition: true)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!378 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !2, file: !6, line: 251, type: !376, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!380 = distinct !DIGlobalVariable(name: "parked_bit", scope: !2, file: !6, line: 252, type: !376, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!382 = distinct !DIGlobalVariable(name: "__tsan_mutex_linker_init", scope: !161, file: !6, line: 37, type: !383, isLocal: true, isDefinition: true)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!384 = !{!385, !386}
!385 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !23, line: 225)
!386 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !13, line: 579)
!387 = !{i32 1, !"NumRegisterParameters", i32 0}
!388 = !{i32 2, !"CodeView", i32 1}
!389 = !{i32 2, !"Debug Info Version", i32 3}
!390 = !{i32 1, !"wchar_size", i32 2}
!391 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!392 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "?spawn_thread_helper@Internal@Runtime@Halide@@YAPAXPAX@Z", scope: !3, file: !167, line: 43, type: !393, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{!43, !43}
!395 = !{!396, !397}
!396 = !DILocalVariable(name: "arg", arg: 1, scope: !392, file: !167, line: 43, type: !43)
!397 = !DILocalVariable(name: "t", scope: !392, file: !167, line: 44, type: !165)
!398 = !DILocation(line: 0, scope: !392)
!399 = !DILocation(line: 45, scope: !392)
!400 = !{!401, !402, i64 0}
!401 = !{!"?AUspawned_thread@Internal@Runtime@Halide@@", !402, i64 0, !402, i64 4, !402, i64 8}
!402 = !{!"any pointer", !403, i64 0}
!403 = !{!"omnipotent char", !404, i64 0}
!404 = !{!"Simple C++ TBAA"}
!405 = !{!401, !402, i64 4}
!406 = !DILocation(line: 46, scope: !392)
!407 = distinct !DISubprogram(name: "halide_host_cpu_count", scope: !167, file: !167, line: 55, type: !408, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!29}
!410 = !{!411}
!411 = !DILocalVariable(name: "num_cores", scope: !407, file: !167, line: 57, type: !372)
!412 = !DILocation(line: 57, scope: !407)
!413 = !DILocation(line: 0, scope: !407)
!414 = !DILocation(line: 58, scope: !407)
!415 = !DILocation(line: 59, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !167, line: 58)
!417 = distinct !DILexicalBlock(scope: !407, file: !167, line: 58)
!418 = !DILocation(line: 0, scope: !417)
!419 = !DILocation(line: 63, scope: !407)
!420 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !167, file: !167, line: 65, type: !421, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!102, !170, !43}
!423 = !{!424, !425, !426}
!424 = !DILocalVariable(name: "closure", arg: 2, scope: !420, file: !167, line: 65, type: !43)
!425 = !DILocalVariable(name: "f", arg: 1, scope: !420, file: !167, line: 65, type: !170)
!426 = !DILocalVariable(name: "t", scope: !420, file: !167, line: 66, type: !165)
!427 = !DILocation(line: 0, scope: !420)
!428 = !DILocation(line: 66, scope: !420)
!429 = !DILocation(line: 67, scope: !420)
!430 = !DILocation(line: 68, scope: !420)
!431 = !DILocation(line: 69, scope: !420)
!432 = !{!401, !402, i64 8}
!433 = !DILocation(line: 70, scope: !420)
!434 = distinct !DISubprogram(name: "halide_join_thread", scope: !167, file: !167, line: 73, type: !435, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !102}
!437 = !{!438, !439}
!438 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !434, file: !167, line: 73, type: !102)
!439 = !DILocalVariable(name: "thread", scope: !434, file: !167, line: 74, type: !165)
!440 = !DILocation(line: 0, scope: !434)
!441 = !DILocation(line: 74, scope: !434)
!442 = !DILocation(line: 75, scope: !434)
!443 = !DILocation(line: 76, scope: !434)
!444 = !DILocation(line: 77, scope: !434)
!445 = distinct !DISubprogram(name: "lock_full", linkageName: "?lock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AAEXXZ", scope: !237, file: !6, line: 321, type: !241, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !240, retainedNodes: !446)
!446 = !{!447, !449, !461, !462, !466, !467, !468}
!447 = !DILocalVariable(name: "this", arg: 1, scope: !445, type: !448, flags: DIFlagArtificial | DIFlagObjectPointer)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!449 = !DILocalVariable(name: "spinner", scope: !445, file: !6, line: 322, type: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !2, file: !6, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !451, identifier: ".?AVspin_control@Synchronization@Internal@Runtime@Halide@@")
!451 = !{!452, !453, !457, !460}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !450, file: !6, line: 231, baseType: !29, size: 32)
!453 = !DISubprogram(name: "spin_control", scope: !450, file: !6, line: 235, type: !454, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !455)
!455 = !{null, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!457 = !DISubprogram(name: "should_spin", linkageName: "?should_spin@spin_control@Synchronization@Internal@Runtime@Halide@@QAE_NXZ", scope: !450, file: !6, line: 237, type: !458, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!458 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !459)
!459 = !{!64, !456}
!460 = !DISubprogram(name: "reset", linkageName: "?reset@spin_control@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !450, file: !6, line: 244, type: !454, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!461 = !DILocalVariable(name: "expected", scope: !445, file: !6, line: 323, type: !22)
!462 = !DILocalVariable(name: "desired", scope: !463, file: !6, line: 328, type: !22)
!463 = distinct !DILexicalBlock(scope: !464, file: !6, line: 327)
!464 = distinct !DILexicalBlock(scope: !465, file: !6, line: 327)
!465 = distinct !DILexicalBlock(scope: !445, file: !6, line: 326)
!466 = !DILocalVariable(name: "node", scope: !465, file: !6, line: 342, type: !177)
!467 = !DILocalVariable(name: "head", scope: !465, file: !6, line: 347, type: !176)
!468 = !DILocalVariable(name: "desired", scope: !465, file: !6, line: 359, type: !22)
!469 = !DILocation(line: 0, scope: !445)
!470 = !DILocation(line: 324, scope: !445)
!471 = !{!472, !472, i64 0}
!472 = !{!"int", !403, i64 0}
!473 = !DILocation(line: 326, scope: !445)
!474 = !DILocation(line: 327, scope: !465)
!475 = !DILocation(line: 328, scope: !463)
!476 = !DILocation(line: 0, scope: !463)
!477 = !DILocalVariable(name: "desired", arg: 3, scope: !478, file: !6, line: 126, type: !300)
!478 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "?atomic_cas_weak_acquire_relaxed@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YA_NPAI00@Z", scope: !479, file: !6, line: 126, type: !480, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !482)
!479 = !DINamespace(scope: !2)
!480 = !DISubroutineType(types: !481)
!481 = !{!64, !300, !300, !300}
!482 = !{!477, !483, !484}
!483 = !DILocalVariable(name: "expected", arg: 2, scope: !478, file: !6, line: 126, type: !300)
!484 = !DILocalVariable(name: "addr", arg: 1, scope: !478, file: !6, line: 126, type: !300)
!485 = !DILocation(line: 0, scope: !478, inlinedAt: !486)
!486 = distinct !DILocation(line: 330, scope: !463)
!487 = !DILocalVariable(name: "desired", arg: 3, scope: !488, file: !6, line: 102, type: !491)
!488 = distinct !DISubprogram(name: "cas_strong_sequentially_consistent_helper<unsigned int>", linkageName: "??$cas_strong_sequentially_consistent_helper@I@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YA_NPAI00@Z", scope: !479, file: !6, line: 102, type: !489, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !497, retainedNodes: !492)
!489 = !DISubroutineType(types: !490)
!490 = !{!64, !491, !491, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!492 = !{!487, !493, !494, !495, !496}
!493 = !DILocalVariable(name: "expected", arg: 2, scope: !488, file: !6, line: 102, type: !491)
!494 = !DILocalVariable(name: "addr", arg: 1, scope: !488, file: !6, line: 102, type: !491)
!495 = !DILocalVariable(name: "oldval", scope: !488, file: !6, line: 103, type: !25)
!496 = !DILocalVariable(name: "gotval", scope: !488, file: !6, line: 104, type: !25)
!497 = !{!498}
!498 = !DITemplateTypeParameter(name: "T", type: !25)
!499 = !DILocation(line: 0, scope: !488, inlinedAt: !500)
!500 = distinct !DILocation(line: 127, scope: !478, inlinedAt: !486)
!501 = !DILocation(line: 104, scope: !488, inlinedAt: !500)
!502 = !DILocation(line: 106, scope: !488, inlinedAt: !500)
!503 = !DILocation(line: 336, scope: !465)
!504 = !DILocalVariable(name: "this", arg: 1, scope: !505, type: !507, flags: DIFlagArtificial | DIFlagObjectPointer)
!505 = distinct !DISubprogram(name: "should_spin", linkageName: "?should_spin@spin_control@Synchronization@Internal@Runtime@Halide@@QAE_NXZ", scope: !450, file: !6, line: 237, type: !458, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !457, retainedNodes: !506)
!506 = !{!504}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!508 = !DILocation(line: 0, scope: !505, inlinedAt: !509)
!509 = distinct !DILocation(line: 336, scope: !465)
!510 = !DILocation(line: 241, scope: !505, inlinedAt: !509)
!511 = !DILocation(line: 239, scope: !512, inlinedAt: !509)
!512 = distinct !DILexicalBlock(scope: !513, file: !6, line: 238)
!513 = distinct !DILexicalBlock(scope: !505, file: !6, line: 238)
!514 = !DILocation(line: 337, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !6, line: 336)
!516 = distinct !DILexicalBlock(scope: !465, file: !6, line: 336)
!517 = !DILocation(line: 338, scope: !515)
!518 = !DILocation(line: 339, scope: !515)
!519 = !DILocation(line: 342, scope: !465)
!520 = !DILocalVariable(name: "this", arg: 1, scope: !521, type: !176, flags: DIFlagArtificial | DIFlagObjectPointer)
!521 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "??0word_lock_queue_data@Synchronization@Internal@Runtime@Halide@@QAE@XZ", scope: !177, file: !6, line: 277, type: !225, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !224, retainedNodes: !522)
!522 = !{!520}
!523 = !DILocation(line: 0, scope: !521, inlinedAt: !524)
!524 = distinct !DILocation(line: 342, scope: !465)
!525 = !DILocalVariable(name: "this", arg: 1, scope: !526, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!526 = distinct !DISubprogram(name: "thread_parker", linkageName: "??0thread_parker@Synchronization@Internal@Runtime@Halide@@QAE@XZ", scope: !180, file: !167, line: 97, type: !213, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !212, retainedNodes: !527)
!527 = !{!525}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!529 = !DILocation(line: 0, scope: !526, inlinedAt: !530)
!530 = distinct !DILocation(line: 277, scope: !521, inlinedAt: !524)
!531 = !DILocation(line: 97, scope: !526, inlinedAt: !530)
!532 = !{!533, !536, i64 48}
!533 = !{!"?AUthread_parker@Synchronization@Internal@Runtime@Halide@@", !534, i64 0, !535, i64 40, !536, i64 48}
!534 = !{!"?AUCriticalSection@@", !403, i64 0}
!535 = !{!"long long", !403, i64 0}
!536 = !{!"bool", !403, i64 0}
!537 = !DILocation(line: 98, scope: !538, inlinedAt: !530)
!538 = distinct !DILexicalBlock(scope: !526, file: !167, line: 97)
!539 = !DILocation(line: 99, scope: !538, inlinedAt: !530)
!540 = !DILocation(line: 277, scope: !521, inlinedAt: !524)
!541 = !{!542, !402, i64 56}
!542 = !{!"?AUword_lock_queue_data@Synchronization@Internal@Runtime@Halide@@", !533, i64 0, !402, i64 56, !402, i64 60, !402, i64 64}
!543 = !{!542, !402, i64 60}
!544 = !{!542, !402, i64 64}
!545 = !DILocalVariable(name: "this", arg: 1, scope: !546, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!546 = distinct !DISubprogram(name: "prepare_park", linkageName: "?prepare_park@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 107, type: !213, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !216, retainedNodes: !547)
!547 = !{!545}
!548 = !DILocation(line: 0, scope: !546, inlinedAt: !549)
!549 = distinct !DILocation(line: 344, scope: !465)
!550 = !DILocation(line: 108, scope: !546, inlinedAt: !549)
!551 = !DILocation(line: 347, scope: !465)
!552 = !DILocation(line: 0, scope: !465)
!553 = !DILocation(line: 348, scope: !465)
!554 = !DILocation(line: 349, scope: !555)
!555 = distinct !DILexicalBlock(scope: !556, file: !6, line: 348)
!556 = distinct !DILexicalBlock(scope: !465, file: !6, line: 348)
!557 = !DILocation(line: 351, scope: !555)
!558 = !DILocation(line: 356, scope: !559)
!559 = distinct !DILexicalBlock(scope: !556, file: !6, line: 351)
!560 = !DILocation(line: 357, scope: !559)
!561 = !DILocation(line: 359, scope: !465)
!562 = !DILocalVariable(name: "desired", arg: 3, scope: !563, file: !6, line: 113, type: !300)
!563 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "?atomic_cas_weak_release_relaxed@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YA_NPAI00@Z", scope: !479, file: !6, line: 113, type: !480, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !564)
!564 = !{!562, !565, !566}
!565 = !DILocalVariable(name: "expected", arg: 2, scope: !563, file: !6, line: 113, type: !300)
!566 = !DILocalVariable(name: "addr", arg: 1, scope: !563, file: !6, line: 113, type: !300)
!567 = !DILocation(line: 0, scope: !563, inlinedAt: !568)
!568 = distinct !DILocation(line: 360, scope: !465)
!569 = !DILocation(line: 0, scope: !488, inlinedAt: !570)
!570 = distinct !DILocation(line: 114, scope: !563, inlinedAt: !568)
!571 = !DILocation(line: 104, scope: !488, inlinedAt: !570)
!572 = !DILocation(line: 106, scope: !488, inlinedAt: !570)
!573 = !DILocation(line: 360, scope: !465)
!574 = !DILocalVariable(name: "this", arg: 1, scope: !575, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!575 = distinct !DISubprogram(name: "park", linkageName: "?park@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 111, type: !213, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !217, retainedNodes: !576)
!576 = !{!574}
!577 = !DILocation(line: 0, scope: !575, inlinedAt: !578)
!578 = distinct !DILocation(line: 361, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !6, line: 360)
!580 = distinct !DILexicalBlock(scope: !465, file: !6, line: 360)
!581 = !DILocation(line: 112, scope: !575, inlinedAt: !578)
!582 = !DILocation(line: 113, scope: !575, inlinedAt: !578)
!583 = !{i8 0, i8 2}
!584 = !DILocation(line: 114, scope: !585, inlinedAt: !578)
!585 = distinct !DILexicalBlock(scope: !575, file: !167, line: 113)
!586 = distinct !{!586, !582, !587, !588}
!587 = !DILocation(line: 115, scope: !575, inlinedAt: !578)
!588 = !{!"llvm.loop.mustprogress"}
!589 = !DILocation(line: 116, scope: !575, inlinedAt: !578)
!590 = !DILocation(line: 363, scope: !579)
!591 = !DILocation(line: 364, scope: !579)
!592 = !DILocalVariable(name: "this", arg: 1, scope: !593, type: !176, flags: DIFlagArtificial | DIFlagObjectPointer)
!593 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "??1word_lock_queue_data@Synchronization@Internal@Runtime@Halide@@QAE@XZ", scope: !177, file: !6, line: 280, type: !225, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !228, retainedNodes: !594)
!594 = !{!592}
!595 = !DILocation(line: 0, scope: !593, inlinedAt: !596)
!596 = distinct !DILocation(line: 365, scope: !465)
!597 = !DILocalVariable(name: "this", arg: 1, scope: !598, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!598 = distinct !DISubprogram(name: "~thread_parker", linkageName: "??1thread_parker@Synchronization@Internal@Runtime@Halide@@QAE@XZ", scope: !180, file: !167, line: 102, type: !213, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !215, retainedNodes: !599)
!599 = !{!597}
!600 = !DILocation(line: 0, scope: !598, inlinedAt: !601)
!601 = distinct !DILocation(line: 280, scope: !602, inlinedAt: !596)
!602 = distinct !DILexicalBlock(scope: !593, file: !6, line: 280)
!603 = !DILocation(line: 104, scope: !604, inlinedAt: !601)
!604 = distinct !DILexicalBlock(scope: !598, file: !167, line: 102)
!605 = !DILocation(line: 365, scope: !465)
!606 = distinct !{!606, !473, !607}
!607 = !DILocation(line: 365, scope: !445)
!608 = !DILocation(line: 366, scope: !445)
!609 = distinct !DISubprogram(name: "unlock_full", linkageName: "?unlock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AAEXXZ", scope: !237, file: !6, line: 368, type: !241, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !244, retainedNodes: !610)
!610 = !{!611, !612, !613, !615, !616, !617, !619, !620, !621, !622, !624, !627, !628, !631}
!611 = !DILocalVariable(name: "this", arg: 1, scope: !609, type: !448, flags: DIFlagArtificial | DIFlagObjectPointer)
!612 = !DILocalVariable(name: "expected", scope: !609, file: !6, line: 369, type: !22)
!613 = !DILocalVariable(name: "thread_queuing", scope: !614, file: !6, line: 375, type: !64)
!614 = distinct !DILexicalBlock(scope: !609, file: !6, line: 372)
!615 = !DILocalVariable(name: "none_queued", scope: !614, file: !6, line: 377, type: !64)
!616 = !DILocalVariable(name: "desired", scope: !614, file: !6, line: 382, type: !22)
!617 = !DILocalVariable(name: "head", scope: !618, file: !6, line: 389, type: !176)
!618 = distinct !DILexicalBlock(scope: !609, file: !6, line: 388)
!619 = !DILocalVariable(name: "current", scope: !618, file: !6, line: 390, type: !176)
!620 = !DILocalVariable(name: "tail", scope: !618, file: !6, line: 391, type: !176)
!621 = !DILocalVariable(name: "times_through", scope: !618, file: !6, line: 392, type: !29)
!622 = !DILocalVariable(name: "next", scope: !623, file: !6, line: 394, type: !176)
!623 = distinct !DILexicalBlock(scope: !618, file: !6, line: 393)
!624 = !DILocalVariable(name: "desired", scope: !625, file: !6, line: 406, type: !22)
!625 = distinct !DILexicalBlock(scope: !626, file: !6, line: 405)
!626 = distinct !DILexicalBlock(scope: !618, file: !6, line: 405)
!627 = !DILocalVariable(name: "new_tail", scope: !618, file: !6, line: 414, type: !176)
!628 = !DILocalVariable(name: "continue_outer", scope: !629, file: !6, line: 416, type: !64)
!629 = distinct !DILexicalBlock(scope: !630, file: !6, line: 415)
!630 = distinct !DILexicalBlock(scope: !618, file: !6, line: 415)
!631 = !DILocalVariable(name: "desired", scope: !632, file: !6, line: 418, type: !22)
!632 = distinct !DILexicalBlock(scope: !629, file: !6, line: 417)
!633 = !DILocation(line: 0, scope: !609)
!634 = !DILocation(line: 370, scope: !609)
!635 = !DILocalVariable(name: "val", arg: 2, scope: !636, file: !6, line: 135, type: !491)
!636 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned int>", linkageName: "??$atomic_load_relaxed@I@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YAXPAI0@Z", scope: !479, file: !6, line: 135, type: !637, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !497, retainedNodes: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !491, !491}
!639 = !{!635, !640}
!640 = !DILocalVariable(name: "addr", arg: 1, scope: !636, file: !6, line: 135, type: !491)
!641 = !DILocation(line: 0, scope: !636, inlinedAt: !642)
!642 = distinct !DILocation(line: 370, scope: !609)
!643 = !DILocation(line: 372, scope: !609)
!644 = !DILocation(line: 136, scope: !636, inlinedAt: !642)
!645 = !DILocation(line: 375, scope: !614)
!646 = !DILocation(line: 0, scope: !614)
!647 = !DILocation(line: 378, scope: !614)
!648 = !DILocation(line: 382, scope: !614)
!649 = !DILocation(line: 0, scope: !478, inlinedAt: !650)
!650 = distinct !DILocation(line: 383, scope: !614)
!651 = !DILocation(line: 0, scope: !488, inlinedAt: !652)
!652 = distinct !DILocation(line: 127, scope: !478, inlinedAt: !650)
!653 = !DILocation(line: 104, scope: !488, inlinedAt: !652)
!654 = !DILocation(line: 106, scope: !488, inlinedAt: !652)
!655 = !DILocation(line: 389, scope: !618)
!656 = !DILocation(line: 0, scope: !618)
!657 = !DILocation(line: 391, scope: !618)
!658 = !DILocation(line: 393, scope: !618)
!659 = !DILocation(line: 394, scope: !623)
!660 = !DILocation(line: 0, scope: !623)
!661 = !DILocation(line: 395, scope: !662)
!662 = distinct !DILexicalBlock(scope: !623, file: !6, line: 395)
!663 = !DILocation(line: 395, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !6, line: 395)
!665 = distinct !DILexicalBlock(scope: !662, file: !6, line: 395)
!666 = !DILocation(line: 396, scope: !623)
!667 = !DILocation(line: 398, scope: !623)
!668 = distinct !{!668, !658, !669, !588}
!669 = !DILocation(line: 400, scope: !618)
!670 = !DILocation(line: 401, scope: !618)
!671 = !DILocation(line: 405, scope: !618)
!672 = !DILocation(line: 406, scope: !625)
!673 = !DILocation(line: 0, scope: !625)
!674 = !DILocalVariable(name: "desired", arg: 3, scope: !675, file: !6, line: 118, type: !491)
!675 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned int>", linkageName: "??$atomic_cas_weak_relacq_relaxed@I@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YA_NPAI00@Z", scope: !479, file: !6, line: 118, type: !489, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !497, retainedNodes: !676)
!676 = !{!674, !677, !678}
!677 = !DILocalVariable(name: "expected", arg: 2, scope: !675, file: !6, line: 118, type: !491)
!678 = !DILocalVariable(name: "addr", arg: 1, scope: !675, file: !6, line: 118, type: !491)
!679 = !DILocation(line: 0, scope: !675, inlinedAt: !680)
!680 = distinct !DILocation(line: 407, scope: !625)
!681 = !DILocation(line: 0, scope: !488, inlinedAt: !682)
!682 = distinct !DILocation(line: 119, scope: !675, inlinedAt: !680)
!683 = !DILocation(line: 104, scope: !488, inlinedAt: !682)
!684 = !DILocation(line: 106, scope: !488, inlinedAt: !682)
!685 = !DILocation(line: 407, scope: !625)
!686 = distinct !{!686, !687, !688}
!687 = !DILocation(line: 388, scope: !609)
!688 = !DILocation(line: 445, scope: !609)
!689 = !DILocation(line: 414, scope: !618)
!690 = !DILocation(line: 415, scope: !618)
!691 = !DILocation(line: 0, scope: !629)
!692 = !DILocation(line: 418, scope: !632)
!693 = !DILocation(line: 0, scope: !632)
!694 = !DILocation(line: 0, scope: !675, inlinedAt: !695)
!695 = distinct !DILocation(line: 419, scope: !632)
!696 = !DILocation(line: 0, scope: !488, inlinedAt: !697)
!697 = distinct !DILocation(line: 119, scope: !675, inlinedAt: !695)
!698 = !DILocation(line: 104, scope: !488, inlinedAt: !697)
!699 = !DILocation(line: 106, scope: !488, inlinedAt: !697)
!700 = !DILocation(line: 419, scope: !632)
!701 = !DILocation(line: 422, scope: !632)
!702 = distinct !{!702, !703, !704, !588}
!703 = !DILocation(line: 417, scope: !629)
!704 = !DILocation(line: 428, scope: !629)
!705 = !DILocation(line: 434, scope: !706)
!706 = distinct !DILexicalBlock(scope: !630, file: !6, line: 433)
!707 = !DILocalVariable(name: "val", arg: 2, scope: !708, file: !6, line: 92, type: !22)
!708 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "?atomic_and_fetch_release@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YAIPAII@Z", scope: !479, file: !6, line: 92, type: !709, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{!22, !300, !22}
!711 = !{!707, !712}
!712 = !DILocalVariable(name: "addr", arg: 1, scope: !708, file: !6, line: 92, type: !300)
!713 = !DILocation(line: 0, scope: !708, inlinedAt: !714)
!714 = distinct !DILocation(line: 435, scope: !706)
!715 = !DILocation(line: 93, scope: !708, inlinedAt: !714)
!716 = !DILocation(line: 436, scope: !706)
!717 = !DILocalVariable(name: "this", arg: 1, scope: !718, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!718 = distinct !DISubprogram(name: "unpark_start", linkageName: "?unpark_start@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 119, type: !213, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !218, retainedNodes: !719)
!719 = !{!717}
!720 = !DILocation(line: 0, scope: !718, inlinedAt: !721)
!721 = distinct !DILocation(line: 441, scope: !618)
!722 = !DILocation(line: 120, scope: !718, inlinedAt: !721)
!723 = !DILocalVariable(name: "this", arg: 1, scope: !724, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!724 = distinct !DISubprogram(name: "unpark", linkageName: "?unpark@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 123, type: !213, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !219, retainedNodes: !725)
!725 = !{!723}
!726 = !DILocation(line: 0, scope: !724, inlinedAt: !727)
!727 = distinct !DILocation(line: 442, scope: !618)
!728 = !DILocation(line: 124, scope: !724, inlinedAt: !727)
!729 = !DILocation(line: 125, scope: !724, inlinedAt: !727)
!730 = !DILocalVariable(name: "this", arg: 1, scope: !731, type: !528, flags: DIFlagArtificial | DIFlagObjectPointer)
!731 = distinct !DISubprogram(name: "unpark_finish", linkageName: "?unpark_finish@thread_parker@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !180, file: !167, line: 128, type: !213, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !220, retainedNodes: !732)
!732 = !{!730}
!733 = !DILocation(line: 0, scope: !731, inlinedAt: !734)
!734 = distinct !DILocation(line: 443, scope: !618)
!735 = !DILocation(line: 129, scope: !731, inlinedAt: !734)
!736 = !DILocation(line: 444, scope: !618)
!737 = !DILocation(line: 446, scope: !609)
!738 = distinct !DISubprogram(name: "lock_bucket", linkageName: "?lock_bucket@Synchronization@Internal@Runtime@Halide@@YAAAUhash_bucket@1234@I@Z", scope: !2, file: !6, line: 509, type: !739, scopeLine: 509, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !742)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !22}
!741 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !234, size: 32)
!742 = !{!743, !744, !745}
!743 = !DILocalVariable(name: "addr", arg: 1, scope: !738, file: !6, line: 509, type: !22)
!744 = !DILocalVariable(name: "hash", scope: !738, file: !6, line: 510, type: !22)
!745 = !DILocalVariable(name: "bucket", scope: !738, file: !6, line: 515, type: !741)
!746 = !DILocation(line: 0, scope: !738)
!747 = !DILocalVariable(name: "bits", arg: 2, scope: !748, file: !6, line: 499, type: !24)
!748 = distinct !DISubprogram(name: "addr_hash", linkageName: "?addr_hash@Synchronization@Internal@Runtime@Halide@@YAIII@Z", scope: !2, file: !6, line: 499, type: !749, scopeLine: 499, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !751)
!749 = !DISubroutineType(types: !750)
!750 = !{!22, !22, !24}
!751 = !{!747, !752}
!752 = !DILocalVariable(name: "addr", arg: 1, scope: !748, file: !6, line: 499, type: !22)
!753 = !DILocation(line: 0, scope: !748, inlinedAt: !754)
!754 = distinct !DILocation(line: 510, scope: !738)
!755 = !DILocation(line: 505, scope: !756, inlinedAt: !754)
!756 = distinct !DILexicalBlock(scope: !757, file: !6, line: 504)
!757 = distinct !DILexicalBlock(scope: !748, file: !6, line: 502)
!758 = !DILocation(line: 515, scope: !738)
!759 = !DILocalVariable(name: "this", arg: 1, scope: !760, type: !448, flags: DIFlagArtificial | DIFlagObjectPointer)
!760 = distinct !DISubprogram(name: "lock", linkageName: "?lock@word_lock@Synchronization@Internal@Runtime@Halide@@QAEXXZ", scope: !237, file: !6, line: 291, type: !241, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !246, retainedNodes: !761)
!761 = !{!759, !762, !763}
!762 = !DILocalVariable(name: "expected", scope: !760, file: !6, line: 294, type: !22)
!763 = !DILocalVariable(name: "desired", scope: !760, file: !6, line: 295, type: !22)
!764 = !DILocation(line: 0, scope: !760, inlinedAt: !765)
!765 = distinct !DILocation(line: 517, scope: !738)
!766 = !DILocation(line: 292, scope: !760, inlinedAt: !765)
!767 = !DILocalVariable(name: "mutex", arg: 1, scope: !768, file: !6, line: 56, type: !43)
!768 = distinct !DISubprogram(name: "if_tsan_pre_lock", linkageName: "?if_tsan_pre_lock@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YAXPAX@Z", scope: !479, file: !6, line: 56, type: !171, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !769)
!769 = !{!767}
!770 = !DILocation(line: 0, scope: !768, inlinedAt: !771)
!771 = distinct !DILocation(line: 292, scope: !760, inlinedAt: !765)
!772 = !DILocation(line: 57, scope: !768, inlinedAt: !771)
!773 = !DILocation(line: 297, scope: !760, inlinedAt: !765)
!774 = !DILocation(line: 0, scope: !478, inlinedAt: !775)
!775 = distinct !DILocation(line: 297, scope: !760, inlinedAt: !765)
!776 = !DILocation(line: 0, scope: !488, inlinedAt: !777)
!777 = distinct !DILocation(line: 127, scope: !478, inlinedAt: !775)
!778 = !DILocation(line: 104, scope: !488, inlinedAt: !777)
!779 = !DILocation(line: 106, scope: !488, inlinedAt: !777)
!780 = !DILocation(line: 517, scope: !738)
!781 = !DILocation(line: 298, scope: !782, inlinedAt: !765)
!782 = distinct !DILexicalBlock(scope: !783, file: !6, line: 297)
!783 = distinct !DILexicalBlock(scope: !760, file: !6, line: 297)
!784 = !DILocation(line: 299, scope: !782, inlinedAt: !765)
!785 = !DILocalVariable(name: "mutex", arg: 1, scope: !786, file: !6, line: 60, type: !43)
!786 = distinct !DISubprogram(name: "if_tsan_post_lock", linkageName: "?if_tsan_post_lock@?A0xC67814F4@Synchronization@Internal@Runtime@Halide@@YAXPAX@Z", scope: !479, file: !6, line: 60, type: !171, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !787)
!787 = !{!785}
!788 = !DILocation(line: 0, scope: !786, inlinedAt: !789)
!789 = distinct !DILocation(line: 301, scope: !760, inlinedAt: !765)
!790 = !DILocation(line: 61, scope: !786, inlinedAt: !789)
!791 = !DILocation(line: 519, scope: !738)
!792 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "?lock_bucket_pair@Synchronization@Internal@Runtime@Halide@@YA?AUbucket_pair@1234@II@Z", scope: !2, file: !6, line: 531, type: !793, scopeLine: 531, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !803)
!793 = !DISubroutineType(types: !794)
!794 = !{!795, !22, !22}
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !2, file: !6, line: 522, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !796, identifier: ".?AUbucket_pair@Synchronization@Internal@Runtime@Halide@@")
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !795, file: !6, line: 523, baseType: !741, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !795, file: !6, line: 524, baseType: !741, size: 32, offset: 32)
!799 = !DISubprogram(name: "bucket_pair", scope: !795, file: !6, line: 526, type: !800, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!800 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !801)
!801 = !{null, !802, !741, !741}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!803 = !{!804, !805, !806, !807, !808, !811, !814, !815, !817}
!804 = !DILocalVariable(name: "addr_to", arg: 2, scope: !792, file: !6, line: 531, type: !22)
!805 = !DILocalVariable(name: "addr_from", arg: 1, scope: !792, file: !6, line: 531, type: !22)
!806 = !DILocalVariable(name: "hash_from", scope: !792, file: !6, line: 533, type: !22)
!807 = !DILocalVariable(name: "hash_to", scope: !792, file: !6, line: 534, type: !22)
!808 = !DILocalVariable(name: "first", scope: !809, file: !6, line: 542, type: !741)
!809 = distinct !DILexicalBlock(scope: !810, file: !6, line: 541)
!810 = distinct !DILexicalBlock(scope: !792, file: !6, line: 541)
!811 = !DILocalVariable(name: "first", scope: !812, file: !6, line: 546, type: !741)
!812 = distinct !DILexicalBlock(scope: !813, file: !6, line: 545)
!813 = distinct !DILexicalBlock(scope: !810, file: !6, line: 545)
!814 = !DILocalVariable(name: "second", scope: !812, file: !6, line: 547, type: !741)
!815 = !DILocalVariable(name: "first", scope: !816, file: !6, line: 552, type: !741)
!816 = distinct !DILexicalBlock(scope: !813, file: !6, line: 551)
!817 = !DILocalVariable(name: "second", scope: !816, file: !6, line: 553, type: !741)
!818 = !DILocation(line: 0, scope: !792)
!819 = !DILocation(line: 0, scope: !748, inlinedAt: !820)
!820 = distinct !DILocation(line: 533, scope: !792)
!821 = !DILocation(line: 505, scope: !756, inlinedAt: !820)
!822 = !DILocation(line: 0, scope: !748, inlinedAt: !823)
!823 = distinct !DILocation(line: 534, scope: !792)
!824 = !DILocation(line: 505, scope: !756, inlinedAt: !823)
!825 = !DILocation(line: 541, scope: !792)
!826 = !DILocation(line: 542, scope: !809)
!827 = !DILocation(line: 0, scope: !809)
!828 = !DILocation(line: 0, scope: !760, inlinedAt: !829)
!829 = distinct !DILocation(line: 543, scope: !809)
!830 = !DILocation(line: 292, scope: !760, inlinedAt: !829)
!831 = !DILocation(line: 0, scope: !768, inlinedAt: !832)
!832 = distinct !DILocation(line: 292, scope: !760, inlinedAt: !829)
!833 = !DILocation(line: 57, scope: !768, inlinedAt: !832)
!834 = !DILocation(line: 297, scope: !760, inlinedAt: !829)
!835 = !DILocation(line: 0, scope: !478, inlinedAt: !836)
!836 = distinct !DILocation(line: 297, scope: !760, inlinedAt: !829)
!837 = !DILocation(line: 0, scope: !488, inlinedAt: !838)
!838 = distinct !DILocation(line: 127, scope: !478, inlinedAt: !836)
!839 = !DILocation(line: 104, scope: !488, inlinedAt: !838)
!840 = !DILocation(line: 106, scope: !488, inlinedAt: !838)
!841 = !DILocation(line: 543, scope: !809)
!842 = !DILocation(line: 298, scope: !782, inlinedAt: !829)
!843 = !DILocation(line: 299, scope: !782, inlinedAt: !829)
!844 = !DILocation(line: 545, scope: !810)
!845 = !DILocation(line: 546, scope: !812)
!846 = !DILocation(line: 0, scope: !812)
!847 = !DILocation(line: 547, scope: !812)
!848 = !DILocation(line: 0, scope: !760, inlinedAt: !849)
!849 = distinct !DILocation(line: 548, scope: !812)
!850 = !DILocation(line: 292, scope: !760, inlinedAt: !849)
!851 = !DILocation(line: 0, scope: !768, inlinedAt: !852)
!852 = distinct !DILocation(line: 292, scope: !760, inlinedAt: !849)
!853 = !DILocation(line: 57, scope: !768, inlinedAt: !852)
!854 = !DILocation(line: 297, scope: !760, inlinedAt: !849)
!855 = !DILocation(line: 0, scope: !478, inlinedAt: !856)
!856 = distinct !DILocation(line: 297, scope: !760, inlinedAt: !849)
!857 = !DILocation(line: 0, scope: !488, inlinedAt: !858)
!858 = distinct !DILocation(line: 127, scope: !478, inlinedAt: !856)
