; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads_tsan.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads_tsan.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8 }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32 }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i32] }
%struct.halide_thread = type { i32 }
%struct._qurt_thread_attr = type { [16 x i8], i8, i8, i16, i8, i8, i16, i32, i8* }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "halide_qurt_default_thread_priority", scope: !2, file: !8, line: 37, type: !409, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !3, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !310, imports: !404, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads_tsan.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!4 = !{}
!5 = !{!6, !25, !26, !29, !101, !136, !137, !178, !203, !213, !184, !223, !236, !240, !248, !305, !173, !265, !309}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !9, file: !8, line: 14, size: 128, flags: DIFlagTypePassByValue, elements: !10)
!8 = !DIFile(filename: "src/runtime/qurt_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !DINamespace(scope: null)
!10 = !{!11, !16, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !7, file: !8, line: 15, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !7, file: !8, line: 16, baseType: !15, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !7, file: !8, line: 17, baseType: !15, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !7, file: !8, line: 18, baseType: !19, size: 32, offset: 96)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 9, size: 32, flags: DIFlagTypePassByValue, elements: !20, identifier: "_ZTS13halide_thread")
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !8, line: 10, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_t", file: !23, line: 18, baseType: !24)
!23 = !DIFile(filename: "src/runtime/mini_qurt.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !27, line: 68, baseType: !28)
!27 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 12, baseType: !24)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !32, file: !31, line: 254, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !36, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE")
!31 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!32 = !DINamespace(name: "Synchronization", scope: !33)
!33 = !DINamespace(name: "Internal", scope: !34)
!34 = !DINamespace(name: "Runtime", scope: !35)
!35 = !DINamespace(name: "Halide", scope: null)
!36 = !{!37, !93, !94, !95, !96, !100}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !30, file: !31, line: 255, baseType: !38, size: 320)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !32, file: !8, line: 84, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !39, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE")
!39 = !{!40, !53, !65, !67, !73, !77, !81, !84, !87, !88, !89, !90, !91, !92}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !38, file: !8, line: 85, baseType: !41, size: 128)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_mutex_t", file: !23, line: 211, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "qurt_mutex_aligned8", file: !23, line: 201, size: 128, flags: DIFlagTypePassByValue, elements: !43, identifier: "_ZTS19qurt_mutex_aligned8")
!43 = !{!44, !51}
!44 = !DIDerivedType(tag: DW_TAG_member, scope: !42, file: !23, line: 203, baseType: !45, size: 128)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !42, file: !23, line: 203, size: 128, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !46, identifier: "_ZTSN19qurt_mutex_aligned8Ut_E")
!46 = !{!47, !48, !49, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "holder", scope: !45, file: !23, line: 204, baseType: !24, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !45, file: !23, line: 205, baseType: !24, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !45, file: !23, line: 206, baseType: !24, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !45, file: !23, line: 207, baseType: !24, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !42, file: !23, line: 209, baseType: !52, size: 64)
!52 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !38, file: !8, line: 86, baseType: !54, size: 128, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_cond_t", file: !23, line: 224, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !23, line: 214, size: 128, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTS11qurt_cond_t")
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !55, file: !23, line: 216, baseType: !52, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !55, file: !23, line: 222, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !23, line: 217, size: 128, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN11qurt_cond_tUt_E")
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !59, file: !23, line: 218, baseType: !24, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting", scope: !59, file: !23, line: 219, baseType: !24, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !59, file: !23, line: 220, baseType: !24, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !59, file: !23, line: 221, baseType: !24, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !38, file: !8, line: 87, baseType: !66, size: 8, offset: 256)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DISubprogram(name: "thread_parker", scope: !38, file: !8, line: 89, type: !68, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!73 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSERKS3_", scope: !38, file: !8, line: 90, type: !74, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !70, !71}
!76 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38, size: 32)
!77 = !DISubprogram(name: "thread_parker", scope: !38, file: !8, line: 91, type: !78, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !70, !80}
!80 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !38, size: 32)
!81 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSEOS3_", scope: !38, file: !8, line: 92, type: !82, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!82 = !DISubroutineType(types: !83)
!83 = !{!76, !70, !80}
!84 = !DISubprogram(name: "thread_parker", scope: !38, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !70}
!87 = !DISubprogram(name: "~thread_parker", scope: !38, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !38, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!89 = !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !38, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !38, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!91 = !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !38, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !38, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !31, line: 273, baseType: !29, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !30, file: !31, line: 274, baseType: !29, size: 32, offset: 352)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !30, file: !31, line: 275, baseType: !29, size: 32, offset: 384)
!96 = !DISubprogram(name: "word_lock_queue_data", scope: !30, file: !31, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!100 = !DISubprogram(name: "~word_lock_queue_data", scope: !30, file: !31, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !32, file: !31, line: 475, size: 98304, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !103, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10hash_tableE")
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !102, file: !31, line: 476, baseType: !105, size: 98304)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 98304, elements: !134)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !32, file: !31, line: 463, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !107, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11hash_bucketE")
!107 = !{!108, !120, !133}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !106, file: !31, line: 464, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !32, file: !31, line: 283, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !110, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9word_lockE")
!110 = !{!111, !112, !116, !117, !118, !119}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !31, line: 284, baseType: !26, size: 32)
!112 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !31, line: 286, type: !113, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !31, line: 287, type: !113, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubprogram(name: "word_lock", scope: !109, file: !31, line: 290, type: !113, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !31, line: 291, type: !113, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock6unlockEv", scope: !109, file: !31, line: 304, type: !113, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !106, file: !31, line: 466, baseType: !121, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !32, file: !31, line: 448, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !123, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10queue_dataE")
!123 = !{!124, !125, !126, !127, !128, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !122, file: !31, line: 449, baseType: !38, size: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !122, file: !31, line: 451, baseType: !26, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !31, line: 452, baseType: !121, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !122, file: !31, line: 453, baseType: !26, size: 32, offset: 384)
!128 = !DISubprogram(name: "queue_data", scope: !122, file: !31, line: 455, type: !129, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!132 = !DISubprogram(name: "~queue_data", scope: !122, file: !31, line: 457, type: !129, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !106, file: !31, line: 467, baseType: !121, size: 32, offset: 64)
!134 = !{!135}
!135 = !DISubrange(count: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !32, file: !31, line: 829, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !139, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization21mutex_parking_controlE")
!139 = !{!140, !172, !174}
!140 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !138, baseType: !141, extraData: i32 0)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !32, file: !31, line: 592, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !142, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15parking_controlE")
!142 = !{!143, !156, !157, !162, !168}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !141, file: !31, line: 593, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DISubroutineType(types: !146)
!146 = !{!66, !15, !147}
!147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !148, size: 32)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !32, file: !31, line: 576, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !149, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15validate_actionE")
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !148, file: !31, line: 577, baseType: !66, size: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !148, file: !31, line: 578, baseType: !26, size: 32, offset: 32)
!152 = !DISubprogram(name: "validate_action", scope: !148, file: !31, line: 580, type: !153, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !141, file: !31, line: 594, baseType: !12, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !141, file: !31, line: 595, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!26, !15, !161, !66}
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !141, file: !31, line: 596, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !15, !166, !66, !66}
!166 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!168 = !DISubprogram(name: "parking_control", scope: !141, file: !31, line: 598, type: !169, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !138, file: !31, line: 830, baseType: !173, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!174 = !DISubprogram(name: "mutex_parking_control", scope: !138, file: !31, line: 832, type: !175, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !173}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !32, file: !31, line: 958, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !180, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization22signal_parking_controlE")
!180 = !{!181, !182, !183, !199}
!181 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !179, baseType: !141, extraData: i32 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !179, file: !31, line: 959, baseType: !173, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !179, file: !31, line: 960, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !32, file: !31, line: 859, size: 32, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10fast_mutexE")
!186 = !{!187, !188, !192, !193, !194, !195, !198}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !185, file: !31, line: 860, baseType: !26, size: 32)
!188 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex9lock_fullEv", scope: !185, file: !31, line: 862, type: !189, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!192 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11unlock_fullEv", scope: !185, file: !31, line: 906, type: !189, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex4lockEv", scope: !185, file: !31, line: 920, type: !189, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex6unlockEv", scope: !185, file: !31, line: 929, type: !189, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubprogram(name: "make_parked_if_locked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex21make_parked_if_lockedEv", scope: !185, file: !31, line: 938, type: !196, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !191}
!198 = !DISubprogram(name: "make_parked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11make_parkedEv", scope: !185, file: !31, line: 953, type: !189, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubprogram(name: "signal_parking_control", scope: !179, file: !31, line: 962, type: !200, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202, !173, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !32, file: !31, line: 985, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !205, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization25broadcast_parking_controlE")
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !204, baseType: !141, extraData: i32 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !204, file: !31, line: 986, baseType: !173, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !204, file: !31, line: 987, baseType: !184, size: 32, offset: 160)
!209 = !DISubprogram(name: "broadcast_parking_control", scope: !204, file: !31, line: 989, type: !210, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212, !173, !184}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !32, file: !31, line: 1026, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !215, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20wait_parking_controlE")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !214, baseType: !141, extraData: i32 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !214, file: !31, line: 1027, baseType: !173, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !214, file: !31, line: 1028, baseType: !184, size: 32, offset: 160)
!219 = !DISubprogram(name: "wait_parking_control", scope: !214, file: !31, line: 1030, type: !220, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !173, !184}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !32, file: !31, line: 1072, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !225, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9fast_condE")
!225 = !{!226, !227, !231, !232, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !31, line: 1073, baseType: !26, size: 32)
!227 = !DISubprogram(name: "fast_cond", scope: !224, file: !31, line: 1076, type: !228, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!231 = !DISubprogram(name: "signal", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond6signalEv", scope: !224, file: !31, line: 1078, type: !228, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubprogram(name: "broadcast", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond9broadcastEv", scope: !224, file: !31, line: 1092, type: !228, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubprogram(name: "wait", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond4waitEPNS2_10fast_mutexE", scope: !224, file: !31, line: 1105, type: !234, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !230, !184}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !31, line: 1164, size: 32, flags: DIFlagTypePassByValue, elements: !238, identifier: "_ZTS18halide_mutex_array")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !237, file: !31, line: 1165, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !242, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !243, identifier: "_ZTS12halide_mutex")
!242 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !241, file: !242, line: 121, baseType: !245, size: 32)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !33, file: !250, line: 26, size: 640, flags: DIFlagTypePassByValue, elements: !251, identifier: "_ZTSN6Halide7Runtime8Internal4workE")
!250 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!251 = !{!252, !281, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !249, file: !250, line: 27, baseType: !253, size: 288)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !242, line: 201, size: 288, flags: DIFlagTypePassByValue, elements: !254, identifier: "_ZTS22halide_parallel_task_t")
!254 = !{!255, !263, !264, !268, !276, !277, !278, !279, !280}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !253, file: !242, line: 204, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !242, line: 192, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DISubroutineType(types: !259)
!259 = !{!161, !15, !161, !161, !260, !15}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 16, baseType: !262)
!262 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !253, file: !242, line: 207, baseType: !260, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !242, line: 210, baseType: !265, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !253, file: !242, line: 214, baseType: !269, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !242, line: 177, size: 64, flags: DIFlagTypePassByValue, elements: !271, identifier: "_ZTS26halide_semaphore_acquire_t")
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !270, file: !242, line: 178, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !242, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS18halide_semaphore_t")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !242, line: 179, baseType: !161, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !253, file: !242, line: 215, baseType: !161, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !253, file: !242, line: 238, baseType: !161, size: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !253, file: !242, line: 243, baseType: !66, size: 8, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !249, file: !250, line: 31, baseType: !282, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !242, line: 158, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!161, !15, !161, !260}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !249, file: !250, line: 33, baseType: !248, size: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !249, file: !250, line: 34, baseType: !248, size: 32, offset: 352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !249, file: !250, line: 35, baseType: !161, size: 32, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !249, file: !250, line: 36, baseType: !248, size: 32, offset: 416)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !249, file: !250, line: 37, baseType: !161, size: 32, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !249, file: !250, line: 39, baseType: !15, size: 32, offset: 480)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !249, file: !250, line: 40, baseType: !161, size: 32, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !249, file: !250, line: 41, baseType: !161, size: 32, offset: 544)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !249, file: !250, line: 42, baseType: !161, size: 32, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !249, file: !250, line: 44, baseType: !66, size: 8, offset: 608)
!296 = !DISubprogram(name: "make_runnable", linkageName: "_ZN6Halide7Runtime8Internal4work13make_runnableEv", scope: !249, file: !250, line: 46, type: !297, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!66, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!300 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal4work7runningEv", scope: !249, file: !250, line: 62, type: !301, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!301 = !DISubroutineType(types: !302)
!302 = !{!66, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !250, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !307, identifier: "_ZTS23halide_semaphore_impl_t")
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !306, file: !250, line: 712, baseType: !161, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!310 = !{!0, !311, !314, !316, !321, !323, !361, !367, !373, !379, !386, !392, !398, !401}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!312 = distinct !DIGlobalVariable(name: "lock_bit", scope: !32, file: !31, line: 250, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!315 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !32, file: !31, line: 251, type: !313, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13table_storageE", scope: !32, file: !31, line: 478, type: !318, isLocal: false, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 98304, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 12288)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!322 = distinct !DIGlobalVariable(name: "parked_bit", scope: !32, file: !31, line: 252, type: !313, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "_ZN6Halide7Runtime8Internal10work_queueE", scope: !33, file: !250, line: 166, type: !325, isLocal: false, isDefinition: true)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !33, file: !250, line: 94, size: 8640, flags: DIFlagTypePassByValue, elements: !326, identifier: "_ZTSN6Halide7Runtime8Internal12work_queue_tE")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !346, !347, !348, !349, !354, !357}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !325, file: !250, line: 96, baseType: !241, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !325, file: !250, line: 99, baseType: !161, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !325, file: !250, line: 103, baseType: !161, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !325, file: !250, line: 106, baseType: !248, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !325, file: !250, line: 109, baseType: !161, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !325, file: !250, line: 122, baseType: !335, size: 32, offset: 224)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !242, line: 125, size: 32, flags: DIFlagTypePassByValue, elements: !336, identifier: "_ZTS11halide_cond")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !335, file: !242, line: 126, baseType: !245, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !325, file: !250, line: 122, baseType: !335, size: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !325, file: !250, line: 122, baseType: !335, size: 32, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !325, file: !250, line: 129, baseType: !343, size: 8192, offset: 384)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8192, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 8576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 8584)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !325, file: !250, line: 139, baseType: !161, size: 32, offset: 8608)
!349 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t7runningEv", scope: !325, file: !250, line: 141, type: !350, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!66, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!354 = !DISubprogram(name: "assert_zeroed", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t13assert_zeroedEv", scope: !325, file: !250, line: 146, type: !355, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !352}
!357 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal12work_queue_t5resetEv", scope: !325, file: !250, line: 158, type: !358, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "_ZN6Halide7Runtime8Internal14custom_do_taskE", scope: !33, file: !250, line: 567, type: !363, isLocal: false, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !242, line: 259, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{!161, !15, !282, !161, !260}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "_ZN6Halide7Runtime8Internal19custom_do_loop_taskE", scope: !33, file: !250, line: 568, type: !369, isLocal: false, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !242, line: 268, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{!161, !15, !256, !161, !161, !260, !15}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "_ZN6Halide7Runtime8Internal17custom_do_par_forE", scope: !33, file: !250, line: 569, type: !375, isLocal: false, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !242, line: 167, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DISubroutineType(types: !378)
!378 = !{!161, !15, !282, !161, !161, !260}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "_ZN6Halide7Runtime8Internal24custom_do_parallel_tasksE", scope: !33, file: !250, line: 570, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !242, line: 281, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DISubroutineType(types: !384)
!384 = !{!161, !15, !161, !385, !15}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "_ZN6Halide7Runtime8Internal21custom_semaphore_initE", scope: !33, file: !250, line: 571, type: !388, isLocal: false, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !242, line: 184, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{!161, !273, !161}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "_ZN6Halide7Runtime8Internal28custom_semaphore_try_acquireE", scope: !33, file: !250, line: 572, type: !394, isLocal: false, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !242, line: 186, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!66, !273, !161}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "_ZN6Halide7Runtime8Internal24custom_semaphore_releaseE", scope: !33, file: !250, line: 573, type: !400, isLocal: false, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !242, line: 185, baseType: !389)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!402 = distinct !DIGlobalVariable(name: "__tsan_mutex_linker_init", scope: !2, file: !31, line: 37, type: !403, isLocal: true, isDefinition: true)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!404 = !{!405, !406, !408}
!405 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !33, file: !27, line: 225)
!406 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !407, file: !8, line: 7)
!407 = !DINamespace(name: "Qurt", scope: !33)
!408 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !33, file: !250, line: 579)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 14, baseType: !410)
!410 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!411 = !{i32 7, !"Dwarf Version", i32 4}
!412 = !{i32 2, !"Debug Info Version", i32 3}
!413 = !{i32 1, !"wchar_size", i32 4}
!414 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!415 = distinct !DISubprogram(name: "halide_host_cpu_count", scope: !8, file: !8, line: 30, type: !416, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!416 = !DISubroutineType(types: !417)
!417 = !{!161}
!418 = !DILocation(line: 32, column: 5, scope: !415)
!419 = distinct !DISubprogram(name: "halide_set_default_thread_priority", scope: !8, file: !8, line: 39, type: !420, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !161}
!422 = !{!423}
!423 = !DILocalVariable(name: "priority", arg: 1, scope: !419, file: !8, line: 39, type: !161)
!424 = !DILocation(line: 0, scope: !419)
!425 = !DILocation(line: 40, column: 18, scope: !426)
!426 = distinct !DILexicalBlock(scope: !419, file: !8, line: 40, column: 9)
!427 = !DILocation(line: 40, column: 9, scope: !419)
!428 = !DILocation(line: 42, column: 25, scope: !429)
!429 = distinct !DILexicalBlock(scope: !426, file: !8, line: 42, column: 16)
!430 = !DILocation(line: 42, column: 16, scope: !426)
!431 = !DILocation(line: 45, column: 41, scope: !419)
!432 = !{!433, !433, i64 0}
!433 = !{!"short", !434, i64 0}
!434 = !{!"omnipotent char", !435, i64 0}
!435 = !{!"Simple C++ TBAA"}
!436 = !DILocation(line: 46, column: 1, scope: !419)
!437 = distinct !DISubprogram(name: "halide_get_default_thread_priority", scope: !8, file: !8, line: 48, type: !438, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!438 = !DISubroutineType(types: !439)
!439 = !{!409}
!440 = !DILocation(line: 49, column: 12, scope: !437)
!441 = !DILocation(line: 49, column: 5, scope: !437)
!442 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !8, file: !8, line: 52, type: !443, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{!25, !12, !15}
!445 = !{!446, !447, !448, !449, !450}
!446 = !DILocalVariable(name: "f", arg: 1, scope: !442, file: !8, line: 52, type: !12)
!447 = !DILocalVariable(name: "closure", arg: 2, scope: !442, file: !8, line: 52, type: !15)
!448 = !DILocalVariable(name: "priority", scope: !442, file: !8, line: 53, type: !409)
!449 = !DILocalVariable(name: "t", scope: !442, file: !8, line: 54, type: !6)
!450 = !DILocalVariable(name: "thread_attr", scope: !442, file: !8, line: 59, type: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_attr_t", file: !23, line: 67, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qurt_thread_attr", file: !23, line: 52, size: 256, flags: DIFlagTypePassByValue, elements: !453, identifier: "_ZTS17_qurt_thread_attr")
!453 = !{!454, !458, !459, !460, !461, !462, !463, !464, !465}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !23, line: 54, baseType: !455, size: 128)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tcb_partition", scope: !452, file: !23, line: 55, baseType: !262, size: 8, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "affinity", scope: !452, file: !23, line: 57, baseType: !262, size: 8, offset: 136)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !452, file: !23, line: 59, baseType: !410, size: 16, offset: 144)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "asid", scope: !452, file: !23, line: 60, baseType: !262, size: 8, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bus_priority", scope: !452, file: !23, line: 61, baseType: !262, size: 8, offset: 168)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "timetest_id", scope: !452, file: !23, line: 62, baseType: !410, size: 16, offset: 176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !452, file: !23, line: 63, baseType: !24, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "stack_addr", scope: !452, file: !23, line: 64, baseType: !15, size: 32, offset: 224)
!466 = !DILocation(line: 0, scope: !442)
!467 = !DILocation(line: 53, column: 25, scope: !442)
!468 = !DILocation(line: 54, column: 43, scope: !442)
!469 = !DILocation(line: 55, column: 8, scope: !442)
!470 = !DILocation(line: 55, column: 10, scope: !442)
!471 = !{!472, !473, i64 0}
!472 = !{!"_ZTSN12_GLOBAL__N_114spawned_threadE", !473, i64 0, !473, i64 4, !473, i64 8, !474, i64 12}
!473 = !{!"any pointer", !434, i64 0}
!474 = !{!"_ZTS13halide_thread", !475, i64 0}
!475 = !{!"int", !434, i64 0}
!476 = !DILocation(line: 56, column: 8, scope: !442)
!477 = !DILocation(line: 56, column: 16, scope: !442)
!478 = !{!472, !473, i64 4}
!479 = !DILocation(line: 57, column: 16, scope: !442)
!480 = !DILocation(line: 57, column: 8, scope: !442)
!481 = !DILocation(line: 57, column: 14, scope: !442)
!482 = !{!472, !473, i64 8}
!483 = !DILocation(line: 58, column: 16, scope: !442)
!484 = !DILocation(line: 58, column: 5, scope: !442)
!485 = !DILocation(line: 59, column: 5, scope: !442)
!486 = !DILocation(line: 59, column: 24, scope: !442)
!487 = !DILocalVariable(name: "attr", arg: 1, scope: !488, file: !23, line: 96, type: !491)
!488 = distinct !DISubprogram(name: "qurt_thread_attr_init", linkageName: "_ZL21qurt_thread_attr_initP17_qurt_thread_attr", scope: !23, file: !23, line: 96, type: !489, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !492)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!492 = !{!487}
!493 = !DILocation(line: 0, scope: !488, inlinedAt: !494)
!494 = distinct !DILocation(line: 60, column: 5, scope: !442)
!495 = !DILocation(line: 98, column: 19, scope: !488, inlinedAt: !494)
!496 = !{!434, !434, i64 0}
!497 = !DILocation(line: 99, column: 11, scope: !488, inlinedAt: !494)
!498 = !DILocation(line: 99, column: 25, scope: !488, inlinedAt: !494)
!499 = !{!500, !434, i64 16}
!500 = !{!"_ZTS17_qurt_thread_attr", !434, i64 0, !434, i64 16, !434, i64 17, !433, i64 18, !434, i64 20, !434, i64 21, !433, i64 22, !475, i64 24, !473, i64 28}
!501 = !DILocation(line: 100, column: 11, scope: !488, inlinedAt: !494)
!502 = !DILocation(line: 101, column: 11, scope: !488, inlinedAt: !494)
!503 = !DILocation(line: 101, column: 16, scope: !488, inlinedAt: !494)
!504 = !{!500, !434, i64 20}
!505 = !DILocation(line: 102, column: 11, scope: !488, inlinedAt: !494)
!506 = !DILocation(line: 102, column: 20, scope: !488, inlinedAt: !494)
!507 = !{!500, !434, i64 17}
!508 = !DILocation(line: 103, column: 11, scope: !488, inlinedAt: !494)
!509 = !DILocation(line: 103, column: 24, scope: !488, inlinedAt: !494)
!510 = !{!500, !434, i64 21}
!511 = !DILocation(line: 104, column: 11, scope: !488, inlinedAt: !494)
!512 = !DILocation(line: 104, column: 23, scope: !488, inlinedAt: !494)
!513 = !{!500, !433, i64 22}
!514 = !DILocation(line: 105, column: 11, scope: !488, inlinedAt: !494)
!515 = !DILocation(line: 106, column: 11, scope: !488, inlinedAt: !494)
!516 = !DILocation(line: 61, column: 54, scope: !442)
!517 = !DILocalVariable(name: "attr", arg: 1, scope: !518, file: !23, line: 152, type: !491)
!518 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_addr", linkageName: "_ZL31qurt_thread_attr_set_stack_addrP17_qurt_thread_attrPv", scope: !23, file: !23, line: 152, type: !519, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !491, !15}
!521 = !{!517, !522}
!522 = !DILocalVariable(name: "stack_addr", arg: 2, scope: !518, file: !23, line: 152, type: !15)
!523 = !DILocation(line: 0, scope: !518, inlinedAt: !524)
!524 = distinct !DILocation(line: 61, column: 5, scope: !442)
!525 = !DILocation(line: 153, column: 22, scope: !518, inlinedAt: !524)
!526 = !{!500, !473, i64 28}
!527 = !DILocalVariable(name: "attr", arg: 1, scope: !528, file: !23, line: 127, type: !491)
!528 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_size", linkageName: "_ZL31qurt_thread_attr_set_stack_sizeP17_qurt_thread_attrj", scope: !23, file: !23, line: 127, type: !529, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !491, !24}
!531 = !{!527, !532}
!532 = !DILocalVariable(name: "stack_size", arg: 2, scope: !528, file: !23, line: 127, type: !24)
!533 = !DILocation(line: 0, scope: !528, inlinedAt: !534)
!534 = distinct !DILocation(line: 62, column: 5, scope: !442)
!535 = !DILocation(line: 128, column: 22, scope: !528, inlinedAt: !534)
!536 = !{!500, !475, i64 24}
!537 = !DILocalVariable(name: "attr", arg: 1, scope: !538, file: !23, line: 170, type: !491)
!538 = distinct !DISubprogram(name: "qurt_thread_attr_set_priority", linkageName: "_ZL29qurt_thread_attr_set_priorityP17_qurt_thread_attrt", scope: !23, file: !23, line: 170, type: !539, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !491, !410}
!541 = !{!537, !542}
!542 = !DILocalVariable(name: "priority", arg: 2, scope: !538, file: !23, line: 170, type: !410)
!543 = !DILocation(line: 0, scope: !538, inlinedAt: !544)
!544 = distinct !DILocation(line: 63, column: 5, scope: !442)
!545 = !DILocation(line: 171, column: 20, scope: !538, inlinedAt: !544)
!546 = !{!500, !433, i64 18}
!547 = !DILocation(line: 64, column: 35, scope: !442)
!548 = !DILocation(line: 64, column: 5, scope: !442)
!549 = !DILocation(line: 65, column: 12, scope: !442)
!550 = !DILocation(line: 66, column: 1, scope: !442)
!551 = !DILocation(line: 65, column: 5, scope: !442)
!552 = !DISubprogram(name: "malloc", scope: !27, file: !27, line: 87, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!553 = !DISubroutineType(types: !554)
!554 = !{!15, !24}
!555 = !DISubprogram(name: "memalign", scope: !8, file: !8, line: 28, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!556 = !DISubroutineType(types: !557)
!557 = !{!15, !24, !24}
!558 = !DISubprogram(name: "memset", scope: !27, file: !27, line: 96, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!559 = !DISubroutineType(types: !560)
!560 = !{!15, !15, !161, !24}
!561 = !DISubprogram(name: "qurt_thread_create", scope: !23, file: !23, line: 175, type: !562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!562 = !DISubroutineType(types: !563)
!563 = !{!161, !564, !565, !12, !15}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!566 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "_ZN12_GLOBAL__N_119spawn_thread_helperEPv", scope: !9, file: !8, line: 20, type: !13, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !567)
!567 = !{!568, !569}
!568 = !DILocalVariable(name: "arg", arg: 1, scope: !566, file: !8, line: 20, type: !15)
!569 = !DILocalVariable(name: "t", scope: !566, file: !8, line: 21, type: !6)
!570 = !DILocation(line: 0, scope: !566)
!571 = !DILocation(line: 22, column: 8, scope: !566)
!572 = !DILocation(line: 22, column: 13, scope: !566)
!573 = !DILocation(line: 22, column: 5, scope: !566)
!574 = !DILocation(line: 23, column: 1, scope: !566)
!575 = distinct !DISubprogram(name: "halide_join_thread", scope: !8, file: !8, line: 68, type: !576, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !25}
!578 = !{!579, !580, !581}
!579 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !575, file: !8, line: 68, type: !25)
!580 = !DILocalVariable(name: "t", scope: !575, file: !8, line: 69, type: !6)
!581 = !DILocalVariable(name: "ret", scope: !575, file: !8, line: 70, type: !161)
!582 = !DILocation(line: 0, scope: !575)
!583 = !DILocation(line: 70, column: 5, scope: !575)
!584 = !DILocation(line: 70, column: 9, scope: !575)
!585 = !{!475, !475, i64 0}
!586 = !DILocation(line: 71, column: 32, scope: !575)
!587 = !{!472, !475, i64 12}
!588 = !DILocation(line: 71, column: 5, scope: !575)
!589 = !DILocation(line: 72, column: 13, scope: !575)
!590 = !DILocation(line: 72, column: 5, scope: !575)
!591 = !DILocation(line: 73, column: 10, scope: !575)
!592 = !DILocation(line: 73, column: 5, scope: !575)
!593 = !DILocation(line: 74, column: 1, scope: !575)
!594 = !DISubprogram(name: "qurt_thread_join", scope: !23, file: !23, line: 194, type: !595, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!595 = !DISubroutineType(types: !596)
!596 = !{!161, !24, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!598 = !DISubprogram(name: "free", scope: !27, file: !27, line: 86, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!599 = distinct !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !31, line: 321, type: !113, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !112, retainedNodes: !600)
!600 = !{!601, !603, !615, !616, !620, !621, !622}
!601 = !DILocalVariable(name: "this", arg: 1, scope: !599, type: !602, flags: DIFlagArtificial | DIFlagObjectPointer)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!603 = !DILocalVariable(name: "spinner", scope: !599, file: !31, line: 322, type: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !32, file: !31, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !605, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization12spin_controlE")
!605 = !{!606, !607, !611, !614}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !604, file: !31, line: 231, baseType: !161, size: 32)
!607 = !DISubprogram(name: "spin_control", scope: !604, file: !31, line: 235, type: !608, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!611 = !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !604, file: !31, line: 237, type: !612, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(types: !613)
!613 = !{!66, !610}
!614 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control5resetEv", scope: !604, file: !31, line: 244, type: !608, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DILocalVariable(name: "expected", scope: !599, file: !31, line: 323, type: !26)
!616 = !DILocalVariable(name: "desired", scope: !617, file: !31, line: 328, type: !26)
!617 = distinct !DILexicalBlock(scope: !618, file: !31, line: 327, column: 37)
!618 = distinct !DILexicalBlock(scope: !619, file: !31, line: 327, column: 13)
!619 = distinct !DILexicalBlock(scope: !599, file: !31, line: 326, column: 18)
!620 = !DILocalVariable(name: "node", scope: !619, file: !31, line: 342, type: !30)
!621 = !DILocalVariable(name: "head", scope: !619, file: !31, line: 347, type: !29)
!622 = !DILocalVariable(name: "desired", scope: !619, file: !31, line: 359, type: !26)
!623 = !DILocation(line: 0, scope: !599)
!624 = !DILocation(line: 324, column: 26, scope: !599)
!625 = !DILocation(line: 324, column: 5, scope: !599)
!626 = !DILocation(line: 326, column: 5, scope: !599)
!627 = !DILocation(line: 327, column: 13, scope: !619)
!628 = !DILocation(line: 327, column: 24, scope: !618)
!629 = !DILocation(line: 327, column: 14, scope: !618)
!630 = !DILocation(line: 328, column: 42, scope: !617)
!631 = !DILocation(line: 0, scope: !617)
!632 = !DILocalVariable(name: "addr", arg: 1, scope: !633, file: !31, line: 126, type: !173)
!633 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_acquire_relaxedEPjS4_S4_", scope: !634, file: !31, line: 126, type: !635, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !637)
!634 = !DINamespace(scope: !32)
!635 = !DISubroutineType(types: !636)
!636 = !{!66, !173, !173, !173}
!637 = !{!632, !638, !639}
!638 = !DILocalVariable(name: "expected", arg: 2, scope: !633, file: !31, line: 126, type: !173)
!639 = !DILocalVariable(name: "desired", arg: 3, scope: !633, file: !31, line: 126, type: !173)
!640 = !DILocation(line: 0, scope: !633, inlinedAt: !641)
!641 = distinct !DILocation(line: 330, column: 17, scope: !642)
!642 = distinct !DILexicalBlock(scope: !617, file: !31, line: 330, column: 17)
!643 = !DILocalVariable(name: "addr", arg: 1, scope: !644, file: !31, line: 102, type: !564)
!644 = distinct !DISubprogram(name: "cas_strong_sequentially_consistent_helper<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_141cas_strong_sequentially_consistent_helperIjEEbPT_S6_S6_", scope: !634, file: !31, line: 102, type: !645, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !652, retainedNodes: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{!66, !564, !564, !564}
!647 = !{!643, !648, !649, !650, !651}
!648 = !DILocalVariable(name: "expected", arg: 2, scope: !644, file: !31, line: 102, type: !564)
!649 = !DILocalVariable(name: "desired", arg: 3, scope: !644, file: !31, line: 102, type: !564)
!650 = !DILocalVariable(name: "oldval", scope: !644, file: !31, line: 103, type: !24)
!651 = !DILocalVariable(name: "gotval", scope: !644, file: !31, line: 104, type: !24)
!652 = !{!653}
!653 = !DITemplateTypeParameter(name: "T", type: !24)
!654 = !DILocation(line: 0, scope: !644, inlinedAt: !655)
!655 = distinct !DILocation(line: 127, column: 12, scope: !633, inlinedAt: !641)
!656 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !655)
!657 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !655)
!658 = !DILocation(line: 336, column: 67, scope: !659)
!659 = distinct !DILexicalBlock(scope: !619, file: !31, line: 336, column: 13)
!660 = !DILocation(line: 336, column: 73, scope: !659)
!661 = !DILocalVariable(name: "this", arg: 1, scope: !662, type: !664, flags: DIFlagArtificial | DIFlagObjectPointer)
!662 = distinct !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !604, file: !31, line: 237, type: !612, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !611, retainedNodes: !663)
!663 = !{!661}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!665 = !DILocation(line: 0, scope: !662, inlinedAt: !666)
!666 = distinct !DILocation(line: 336, column: 84, scope: !659)
!667 = !DILocation(line: 241, column: 27, scope: !662, inlinedAt: !666)
!668 = !DILocation(line: 336, column: 13, scope: !619)
!669 = !DILocation(line: 239, column: 23, scope: !670, inlinedAt: !666)
!670 = distinct !DILexicalBlock(scope: !671, file: !31, line: 238, column: 29)
!671 = distinct !DILexicalBlock(scope: !662, file: !31, line: 238, column: 13)
!672 = !DILocation(line: 337, column: 13, scope: !673)
!673 = distinct !DILexicalBlock(scope: !659, file: !31, line: 336, column: 99)
!674 = !DILocation(line: 338, column: 13, scope: !673)
!675 = !DILocation(line: 339, column: 13, scope: !673)
!676 = !DILocation(line: 342, column: 9, scope: !619)
!677 = !DILocation(line: 342, column: 30, scope: !619)
!678 = !DILocalVariable(name: "this", arg: 1, scope: !679, type: !29, flags: DIFlagArtificial | DIFlagObjectPointer)
!679 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataC2Ev", scope: !30, file: !31, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !96, retainedNodes: !680)
!680 = !{!678}
!681 = !DILocation(line: 0, scope: !679, inlinedAt: !682)
!682 = distinct !DILocation(line: 342, column: 30, scope: !619)
!683 = !DILocalVariable(name: "this", arg: 1, scope: !684, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!684 = distinct !DISubprogram(name: "thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerC2Ev", scope: !38, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !84, retainedNodes: !685)
!685 = !{!683}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!687 = !DILocation(line: 0, scope: !684, inlinedAt: !688)
!688 = distinct !DILocation(line: 277, column: 19, scope: !679, inlinedAt: !682)
!689 = !DILocation(line: 87, column: 10, scope: !684, inlinedAt: !688)
!690 = !{!691, !692, i64 32}
!691 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE", !434, i64 0, !434, i64 16, !692, i64 32}
!692 = !{!"bool", !434, i64 0}
!693 = !DILocation(line: 95, column: 9, scope: !694, inlinedAt: !688)
!694 = distinct !DILexicalBlock(scope: !684, file: !8, line: 94, column: 35)
!695 = !DILocation(line: 96, column: 9, scope: !694, inlinedAt: !688)
!696 = !DILocation(line: 273, column: 27, scope: !679, inlinedAt: !682)
!697 = !{!698, !473, i64 40}
!698 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE", !691, i64 0, !473, i64 40, !473, i64 44, !473, i64 48}
!699 = !DILocation(line: 274, column: 27, scope: !679, inlinedAt: !682)
!700 = !{!698, !473, i64 44}
!701 = !DILocation(line: 275, column: 27, scope: !679, inlinedAt: !682)
!702 = !{!698, !473, i64 48}
!703 = !DILocalVariable(name: "this", arg: 1, scope: !704, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!704 = distinct !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !38, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !88, retainedNodes: !705)
!705 = !{!703}
!706 = !DILocation(line: 0, scope: !704, inlinedAt: !707)
!707 = distinct !DILocation(line: 344, column: 21, scope: !619)
!708 = !DILocation(line: 106, column: 21, scope: !704, inlinedAt: !707)
!709 = !DILocation(line: 347, column: 72, scope: !619)
!710 = !DILocation(line: 0, scope: !619)
!711 = !DILocation(line: 348, column: 18, scope: !712)
!712 = distinct !DILexicalBlock(scope: !619, file: !31, line: 348, column: 13)
!713 = !DILocation(line: 348, column: 13, scope: !619)
!714 = !DILocation(line: 349, column: 23, scope: !715)
!715 = distinct !DILexicalBlock(scope: !712, file: !31, line: 348, column: 30)
!716 = !DILocation(line: 351, column: 9, scope: !715)
!717 = !DILocation(line: 347, column: 38, scope: !619)
!718 = !DILocation(line: 356, column: 23, scope: !719)
!719 = distinct !DILexicalBlock(scope: !712, file: !31, line: 351, column: 16)
!720 = !DILocation(line: 359, column: 60, scope: !619)
!721 = !DILocation(line: 359, column: 48, scope: !619)
!722 = !DILocalVariable(name: "addr", arg: 1, scope: !723, file: !31, line: 113, type: !173)
!723 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_release_relaxedEPjS4_S4_", scope: !634, file: !31, line: 113, type: !635, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !724)
!724 = !{!722, !725, !726}
!725 = !DILocalVariable(name: "expected", arg: 2, scope: !723, file: !31, line: 113, type: !173)
!726 = !DILocalVariable(name: "desired", arg: 3, scope: !723, file: !31, line: 113, type: !173)
!727 = !DILocation(line: 0, scope: !723, inlinedAt: !728)
!728 = distinct !DILocation(line: 360, column: 13, scope: !729)
!729 = distinct !DILexicalBlock(scope: !619, file: !31, line: 360, column: 13)
!730 = !DILocation(line: 0, scope: !644, inlinedAt: !731)
!731 = distinct !DILocation(line: 114, column: 12, scope: !723, inlinedAt: !728)
!732 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !731)
!733 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !731)
!734 = !DILocation(line: 360, column: 13, scope: !619)
!735 = !DILocalVariable(name: "this", arg: 1, scope: !736, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!736 = distinct !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !38, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !89, retainedNodes: !737)
!737 = !{!735}
!738 = !DILocation(line: 0, scope: !736, inlinedAt: !739)
!739 = distinct !DILocation(line: 361, column: 25, scope: !740)
!740 = distinct !DILexicalBlock(scope: !729, file: !31, line: 360, column: 75)
!741 = !DILocation(line: 110, column: 9, scope: !736, inlinedAt: !739)
!742 = !DILocation(line: 111, column: 16, scope: !736, inlinedAt: !739)
!743 = !{i8 0, i8 2}
!744 = !DILocation(line: 111, column: 9, scope: !736, inlinedAt: !739)
!745 = !DILocation(line: 112, column: 13, scope: !746, inlinedAt: !739)
!746 = distinct !DILexicalBlock(scope: !736, file: !8, line: 111, column: 29)
!747 = distinct !{!747, !744, !748, !749}
!748 = !DILocation(line: 113, column: 9, scope: !736, inlinedAt: !739)
!749 = !{!"llvm.loop.mustprogress"}
!750 = !DILocation(line: 114, column: 9, scope: !736, inlinedAt: !739)
!751 = !DILocation(line: 363, column: 13, scope: !740)
!752 = !DILocation(line: 364, column: 9, scope: !740)
!753 = !DILocation(line: 0, scope: !729)
!754 = !DILocalVariable(name: "this", arg: 1, scope: !755, type: !29, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataD2Ev", scope: !30, file: !31, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !100, retainedNodes: !756)
!756 = !{!754}
!757 = !DILocation(line: 0, scope: !755, inlinedAt: !758)
!758 = distinct !DILocation(line: 365, column: 5, scope: !599)
!759 = !DILocalVariable(name: "this", arg: 1, scope: !760, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!760 = distinct !DISubprogram(name: "~thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerD2Ev", scope: !38, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !87, retainedNodes: !761)
!761 = !{!759}
!762 = !DILocation(line: 0, scope: !760, inlinedAt: !763)
!763 = distinct !DILocation(line: 280, column: 51, scope: !764, inlinedAt: !758)
!764 = distinct !DILexicalBlock(scope: !755, file: !31, line: 280, column: 51)
!765 = !DILocation(line: 101, column: 9, scope: !766, inlinedAt: !763)
!766 = distinct !DILexicalBlock(scope: !760, file: !8, line: 100, column: 36)
!767 = !DILocation(line: 102, column: 9, scope: !766, inlinedAt: !763)
!768 = !DILocation(line: 365, column: 5, scope: !599)
!769 = distinct !{!769, !626, !768}
!770 = !DILocation(line: 366, column: 1, scope: !599)
!771 = !DISubprogram(name: "halide_thread_yield", scope: !27, file: !27, line: 190, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!772 = !DISubroutineType(types: !773)
!773 = !{null}
!774 = distinct !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !31, line: 368, type: !113, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !116, retainedNodes: !775)
!775 = !{!776, !777, !778, !780, !781, !782, !784, !785, !786, !787, !789, !792, !793, !796}
!776 = !DILocalVariable(name: "this", arg: 1, scope: !774, type: !602, flags: DIFlagArtificial | DIFlagObjectPointer)
!777 = !DILocalVariable(name: "expected", scope: !774, file: !31, line: 369, type: !26)
!778 = !DILocalVariable(name: "thread_queuing", scope: !779, file: !31, line: 375, type: !66)
!779 = distinct !DILexicalBlock(scope: !774, file: !31, line: 372, column: 18)
!780 = !DILocalVariable(name: "none_queued", scope: !779, file: !31, line: 377, type: !66)
!781 = !DILocalVariable(name: "desired", scope: !779, file: !31, line: 382, type: !26)
!782 = !DILocalVariable(name: "head", scope: !783, file: !31, line: 389, type: !29)
!783 = distinct !DILexicalBlock(scope: !774, file: !31, line: 388, column: 18)
!784 = !DILocalVariable(name: "current", scope: !783, file: !31, line: 390, type: !29)
!785 = !DILocalVariable(name: "tail", scope: !783, file: !31, line: 391, type: !29)
!786 = !DILocalVariable(name: "times_through", scope: !783, file: !31, line: 392, type: !161)
!787 = !DILocalVariable(name: "next", scope: !788, file: !31, line: 394, type: !29)
!788 = distinct !DILexicalBlock(scope: !783, file: !31, line: 393, column: 33)
!789 = !DILocalVariable(name: "desired", scope: !790, file: !31, line: 406, type: !26)
!790 = distinct !DILexicalBlock(scope: !791, file: !31, line: 405, column: 34)
!791 = distinct !DILexicalBlock(scope: !783, file: !31, line: 405, column: 13)
!792 = !DILocalVariable(name: "new_tail", scope: !783, file: !31, line: 414, type: !29)
!793 = !DILocalVariable(name: "continue_outer", scope: !794, file: !31, line: 416, type: !66)
!794 = distinct !DILexicalBlock(scope: !795, file: !31, line: 415, column: 34)
!795 = distinct !DILexicalBlock(scope: !783, file: !31, line: 415, column: 13)
!796 = !DILocalVariable(name: "desired", scope: !797, file: !31, line: 418, type: !26)
!797 = distinct !DILexicalBlock(scope: !794, file: !31, line: 417, column: 37)
!798 = !DILocation(line: 0, scope: !774)
!799 = !DILocation(line: 370, column: 26, scope: !774)
!800 = !DILocation(line: 370, column: 5, scope: !774)
!801 = !DILocalVariable(name: "addr", arg: 1, scope: !802, file: !31, line: 135, type: !564)
!802 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_119atomic_load_relaxedIjEEvPT_S6_", scope: !634, file: !31, line: 135, type: !803, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !652, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !564, !564}
!805 = !{!801, !806}
!806 = !DILocalVariable(name: "val", arg: 2, scope: !802, file: !31, line: 135, type: !564)
!807 = !DILocation(line: 0, scope: !802, inlinedAt: !808)
!808 = distinct !DILocation(line: 370, column: 5, scope: !774)
!809 = !DILocation(line: 372, column: 5, scope: !774)
!810 = !DILocation(line: 136, column: 10, scope: !802, inlinedAt: !808)
!811 = !DILocation(line: 375, column: 41, scope: !779)
!812 = !DILocation(line: 375, column: 31, scope: !779)
!813 = !DILocation(line: 0, scope: !779)
!814 = !DILocation(line: 378, column: 28, scope: !815)
!815 = distinct !DILexicalBlock(scope: !779, file: !31, line: 378, column: 13)
!816 = !DILocation(line: 382, column: 38, scope: !779)
!817 = !DILocation(line: 0, scope: !633, inlinedAt: !818)
!818 = distinct !DILocation(line: 383, column: 13, scope: !819)
!819 = distinct !DILexicalBlock(scope: !779, file: !31, line: 383, column: 13)
!820 = !DILocation(line: 0, scope: !644, inlinedAt: !821)
!821 = distinct !DILocation(line: 127, column: 12, scope: !633, inlinedAt: !818)
!822 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !821)
!823 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !821)
!824 = !DILocation(line: 389, column: 72, scope: !783)
!825 = !DILocation(line: 389, column: 38, scope: !783)
!826 = !DILocation(line: 0, scope: !783)
!827 = !DILocation(line: 391, column: 47, scope: !783)
!828 = !DILocation(line: 393, column: 21, scope: !783)
!829 = !DILocation(line: 393, column: 9, scope: !783)
!830 = !DILocation(line: 394, column: 51, scope: !788)
!831 = !DILocation(line: 0, scope: !788)
!832 = !DILocation(line: 395, column: 13, scope: !833)
!833 = distinct !DILexicalBlock(scope: !834, file: !31, line: 395, column: 13)
!834 = distinct !DILexicalBlock(scope: !788, file: !31, line: 395, column: 13)
!835 = !DILocation(line: 395, column: 13, scope: !834)
!836 = !DILocation(line: 395, column: 13, scope: !837)
!837 = distinct !DILexicalBlock(scope: !833, file: !31, line: 395, column: 13)
!838 = !DILocation(line: 396, column: 19, scope: !788)
!839 = !DILocation(line: 396, column: 24, scope: !788)
!840 = !DILocation(line: 398, column: 29, scope: !788)
!841 = distinct !{!841, !829, !842, !749}
!842 = !DILocation(line: 400, column: 9, scope: !783)
!843 = !DILocation(line: 401, column: 20, scope: !783)
!844 = !DILocation(line: 405, column: 22, scope: !791)
!845 = !DILocation(line: 405, column: 13, scope: !791)
!846 = !DILocation(line: 405, column: 13, scope: !783)
!847 = !DILocation(line: 406, column: 42, scope: !790)
!848 = !DILocation(line: 0, scope: !790)
!849 = !DILocalVariable(name: "addr", arg: 1, scope: !850, file: !31, line: 118, type: !564)
!850 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_130atomic_cas_weak_relacq_relaxedIjEEbPT_S6_S6_", scope: !634, file: !31, line: 118, type: !645, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !652, retainedNodes: !851)
!851 = !{!849, !852, !853}
!852 = !DILocalVariable(name: "expected", arg: 2, scope: !850, file: !31, line: 118, type: !564)
!853 = !DILocalVariable(name: "desired", arg: 3, scope: !850, file: !31, line: 118, type: !564)
!854 = !DILocation(line: 0, scope: !850, inlinedAt: !855)
!855 = distinct !DILocation(line: 407, column: 17, scope: !856)
!856 = distinct !DILexicalBlock(scope: !790, file: !31, line: 407, column: 17)
!857 = !DILocation(line: 0, scope: !644, inlinedAt: !858)
!858 = distinct !DILocation(line: 119, column: 12, scope: !850, inlinedAt: !855)
!859 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !858)
!860 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !858)
!861 = !DILocation(line: 407, column: 17, scope: !790)
!862 = distinct !{!862, !863, !864}
!863 = !DILocation(line: 388, column: 5, scope: !774)
!864 = !DILocation(line: 445, column: 5, scope: !774)
!865 = !DILocation(line: 414, column: 48, scope: !783)
!866 = !DILocation(line: 415, column: 22, scope: !795)
!867 = !DILocation(line: 415, column: 13, scope: !783)
!868 = !DILocation(line: 418, column: 46, scope: !797)
!869 = !DILocation(line: 0, scope: !797)
!870 = !DILocation(line: 0, scope: !850, inlinedAt: !871)
!871 = distinct !DILocation(line: 419, column: 21, scope: !872)
!872 = distinct !DILexicalBlock(scope: !797, file: !31, line: 419, column: 21)
!873 = !DILocation(line: 0, scope: !644, inlinedAt: !874)
!874 = distinct !DILocation(line: 119, column: 12, scope: !850, inlinedAt: !871)
!875 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !874)
!876 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !874)
!877 = !DILocation(line: 419, column: 21, scope: !797)
!878 = !DILocation(line: 422, column: 74, scope: !879)
!879 = distinct !DILexicalBlock(scope: !797, file: !31, line: 422, column: 21)
!880 = !DILocation(line: 422, column: 21, scope: !797)
!881 = distinct !{!881, !882, !883, !749}
!882 = !DILocation(line: 417, column: 13, scope: !794)
!883 = !DILocation(line: 428, column: 13, scope: !794)
!884 = !DILocation(line: 434, column: 24, scope: !885)
!885 = distinct !DILexicalBlock(scope: !795, file: !31, line: 433, column: 16)
!886 = !DILocalVariable(name: "addr", arg: 1, scope: !887, file: !31, line: 92, type: !173)
!887 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_124atomic_and_fetch_releaseEPjj", scope: !634, file: !31, line: 92, type: !888, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{!26, !173, !26}
!890 = !{!886, !891}
!891 = !DILocalVariable(name: "val", arg: 2, scope: !887, file: !31, line: 92, type: !26)
!892 = !DILocation(line: 0, scope: !887, inlinedAt: !893)
!893 = distinct !DILocation(line: 435, column: 13, scope: !885)
!894 = !DILocation(line: 93, column: 12, scope: !887, inlinedAt: !893)
!895 = !DILocalVariable(name: "this", arg: 1, scope: !896, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!896 = distinct !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !38, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !90, retainedNodes: !897)
!897 = !{!895}
!898 = !DILocation(line: 0, scope: !896, inlinedAt: !899)
!899 = distinct !DILocation(line: 441, column: 22, scope: !783)
!900 = !DILocation(line: 118, column: 26, scope: !896, inlinedAt: !899)
!901 = !DILocation(line: 118, column: 9, scope: !896, inlinedAt: !899)
!902 = !DILocalVariable(name: "this", arg: 1, scope: !903, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!903 = distinct !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !38, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !91, retainedNodes: !904)
!904 = !{!902}
!905 = !DILocation(line: 0, scope: !903, inlinedAt: !906)
!906 = distinct !DILocation(line: 442, column: 22, scope: !783)
!907 = !DILocation(line: 122, column: 9, scope: !903, inlinedAt: !906)
!908 = !DILocation(line: 122, column: 21, scope: !903, inlinedAt: !906)
!909 = !DILocation(line: 123, column: 27, scope: !903, inlinedAt: !906)
!910 = !DILocation(line: 123, column: 9, scope: !903, inlinedAt: !906)
!911 = !DILocalVariable(name: "this", arg: 1, scope: !912, type: !686, flags: DIFlagArtificial | DIFlagObjectPointer)
!912 = distinct !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !38, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !92, retainedNodes: !913)
!913 = !{!911}
!914 = !DILocation(line: 0, scope: !912, inlinedAt: !915)
!915 = distinct !DILocation(line: 443, column: 22, scope: !783)
!916 = !DILocation(line: 127, column: 9, scope: !912, inlinedAt: !915)
!917 = !DILocation(line: 444, column: 9, scope: !783)
!918 = !DILocation(line: 0, scope: !794)
!919 = !DILocation(line: 446, column: 1, scope: !774)
!920 = !DISubprogram(name: "halide_print", scope: !242, file: !242, line: 97, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !15, !265}
!923 = !DISubprogram(name: "abort", scope: !27, file: !27, line: 108, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!924 = distinct !DISubprogram(name: "lock_bucket", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization11lock_bucketEj", scope: !32, file: !31, line: 509, type: !925, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !928)
!925 = !DISubroutineType(types: !926)
!926 = !{!927, !26}
!927 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !106, size: 32)
!928 = !{!929, !930, !931}
!929 = !DILocalVariable(name: "addr", arg: 1, scope: !924, file: !31, line: 509, type: !26)
!930 = !DILocalVariable(name: "hash", scope: !924, file: !31, line: 510, type: !26)
!931 = !DILocalVariable(name: "bucket", scope: !924, file: !31, line: 515, type: !927)
!932 = !DILocation(line: 0, scope: !924)
!933 = !DILocalVariable(name: "addr", arg: 1, scope: !934, file: !31, line: 499, type: !26)
!934 = distinct !DISubprogram(name: "addr_hash", linkageName: "_ZN6Halide7Runtime8Internal15SynchronizationL9addr_hashEjj", scope: !32, file: !31, line: 499, type: !935, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !937)
!935 = !DISubroutineType(types: !936)
!936 = !{!26, !26, !28}
!937 = !{!933, !938}
!938 = !DILocalVariable(name: "bits", arg: 2, scope: !934, file: !31, line: 499, type: !28)
!939 = !DILocation(line: 0, scope: !934, inlinedAt: !940)
!940 = distinct !DILocation(line: 510, column: 22, scope: !924)
!941 = !DILocation(line: 505, column: 22, scope: !942, inlinedAt: !940)
!942 = distinct !DILexicalBlock(scope: !943, file: !31, line: 504, column: 12)
!943 = distinct !DILexicalBlock(scope: !934, file: !31, line: 502, column: 9)
!944 = !DILocation(line: 505, column: 47, scope: !942, inlinedAt: !940)
!945 = !DILocation(line: 515, column: 27, scope: !924)
!946 = !DILocalVariable(name: "this", arg: 1, scope: !947, type: !602, flags: DIFlagArtificial | DIFlagObjectPointer)
!947 = distinct !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !31, line: 291, type: !113, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !118, retainedNodes: !948)
!948 = !{!946, !949, !950}
!949 = !DILocalVariable(name: "expected", scope: !947, file: !31, line: 294, type: !26)
!950 = !DILocalVariable(name: "desired", scope: !947, file: !31, line: 295, type: !26)
!951 = !DILocation(line: 0, scope: !947, inlinedAt: !952)
!952 = distinct !DILocation(line: 517, column: 18, scope: !924)
!953 = !DILocation(line: 292, column: 26, scope: !947, inlinedAt: !952)
!954 = !DILocalVariable(name: "mutex", arg: 1, scope: !955, file: !31, line: 56, type: !15)
!955 = distinct !DISubprogram(name: "if_tsan_pre_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_116if_tsan_pre_lockEPv", scope: !634, file: !31, line: 56, type: !13, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !956)
!956 = !{!954}
!957 = !DILocation(line: 0, scope: !955, inlinedAt: !958)
!958 = distinct !DILocation(line: 292, column: 9, scope: !947, inlinedAt: !952)
!959 = !DILocation(line: 57, column: 5, scope: !955, inlinedAt: !958)
!960 = !DILocation(line: 297, column: 47, scope: !961, inlinedAt: !952)
!961 = distinct !DILexicalBlock(scope: !947, file: !31, line: 297, column: 13)
!962 = !DILocation(line: 0, scope: !633, inlinedAt: !963)
!963 = distinct !DILocation(line: 297, column: 14, scope: !961, inlinedAt: !952)
!964 = !DILocation(line: 0, scope: !644, inlinedAt: !965)
!965 = distinct !DILocation(line: 127, column: 12, scope: !633, inlinedAt: !963)
!966 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !965)
!967 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !965)
!968 = !DILocation(line: 297, column: 13, scope: !947, inlinedAt: !952)
!969 = !DILocation(line: 517, column: 12, scope: !924)
!970 = !DILocation(line: 298, column: 13, scope: !971, inlinedAt: !952)
!971 = distinct !DILexicalBlock(scope: !961, file: !31, line: 297, column: 76)
!972 = !DILocation(line: 299, column: 9, scope: !971, inlinedAt: !952)
!973 = !DILocalVariable(name: "mutex", arg: 1, scope: !974, file: !31, line: 60, type: !15)
!974 = distinct !DISubprogram(name: "if_tsan_post_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_117if_tsan_post_lockEPv", scope: !634, file: !31, line: 60, type: !13, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !975)
!975 = !{!973}
!976 = !DILocation(line: 0, scope: !974, inlinedAt: !977)
!977 = distinct !DILocation(line: 301, column: 9, scope: !947, inlinedAt: !952)
!978 = !DILocation(line: 61, column: 5, scope: !974, inlinedAt: !977)
!979 = !DILocation(line: 519, column: 5, scope: !924)
!980 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization16lock_bucket_pairEjj", scope: !32, file: !31, line: 531, type: !981, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !991)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !26, !26}
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !32, file: !31, line: 522, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !984, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11bucket_pairE")
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !983, file: !31, line: 523, baseType: !927, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !983, file: !31, line: 524, baseType: !927, size: 32, offset: 32)
!987 = !DISubprogram(name: "bucket_pair", scope: !983, file: !31, line: 526, type: !988, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !990, !927, !927}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!991 = !{!992, !993, !994, !995, !996, !999, !1002, !1003, !1005}
!992 = !DILocalVariable(name: "addr_from", arg: 1, scope: !980, file: !31, line: 531, type: !26)
!993 = !DILocalVariable(name: "addr_to", arg: 2, scope: !980, file: !31, line: 531, type: !26)
!994 = !DILocalVariable(name: "hash_from", scope: !980, file: !31, line: 533, type: !26)
!995 = !DILocalVariable(name: "hash_to", scope: !980, file: !31, line: 534, type: !26)
!996 = !DILocalVariable(name: "first", scope: !997, file: !31, line: 542, type: !927)
!997 = distinct !DILexicalBlock(scope: !998, file: !31, line: 541, column: 31)
!998 = distinct !DILexicalBlock(scope: !980, file: !31, line: 541, column: 9)
!999 = !DILocalVariable(name: "first", scope: !1000, file: !31, line: 546, type: !927)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !31, line: 545, column: 37)
!1001 = distinct !DILexicalBlock(scope: !998, file: !31, line: 545, column: 16)
!1002 = !DILocalVariable(name: "second", scope: !1000, file: !31, line: 547, type: !927)
!1003 = !DILocalVariable(name: "first", scope: !1004, file: !31, line: 552, type: !927)
!1004 = distinct !DILexicalBlock(scope: !1001, file: !31, line: 551, column: 12)
!1005 = !DILocalVariable(name: "second", scope: !1004, file: !31, line: 553, type: !927)
!1006 = !DILocation(line: 0, scope: !980)
!1007 = !DILocation(line: 0, scope: !934, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 533, column: 27, scope: !980)
!1009 = !DILocation(line: 505, column: 22, scope: !942, inlinedAt: !1008)
!1010 = !DILocation(line: 505, column: 47, scope: !942, inlinedAt: !1008)
!1011 = !DILocation(line: 0, scope: !934, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 534, column: 25, scope: !980)
!1013 = !DILocation(line: 505, column: 22, scope: !942, inlinedAt: !1012)
!1014 = !DILocation(line: 505, column: 47, scope: !942, inlinedAt: !1012)
!1015 = !DILocation(line: 541, column: 19, scope: !998)
!1016 = !DILocation(line: 541, column: 9, scope: !980)
!1017 = !DILocation(line: 542, column: 30, scope: !997)
!1018 = !DILocation(line: 0, scope: !997)
!1019 = !DILocation(line: 0, scope: !947, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 543, column: 21, scope: !997)
!1021 = !DILocation(line: 292, column: 26, scope: !947, inlinedAt: !1020)
!1022 = !DILocation(line: 0, scope: !955, inlinedAt: !1023)
!1023 = distinct !DILocation(line: 292, column: 9, scope: !947, inlinedAt: !1020)
!1024 = !DILocation(line: 57, column: 5, scope: !955, inlinedAt: !1023)
!1025 = !DILocation(line: 297, column: 47, scope: !961, inlinedAt: !1020)
!1026 = !DILocation(line: 0, scope: !633, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 297, column: 14, scope: !961, inlinedAt: !1020)
!1028 = !DILocation(line: 0, scope: !644, inlinedAt: !1029)
!1029 = distinct !DILocation(line: 127, column: 12, scope: !633, inlinedAt: !1027)
!1030 = !DILocation(line: 104, column: 16, scope: !644, inlinedAt: !1029)
!1031 = !DILocation(line: 106, column: 19, scope: !644, inlinedAt: !1029)
!1032 = !DILocation(line: 297, column: 13, scope: !947, inlinedAt: !1020)
!1033 = !DILocation(line: 543, column: 15, scope: !997)
!1034 = !DILocation(line: 298, column: 13, scope: !971, inlinedAt: !1020)
!1035 = !DILocation(line: 299, column: 9, scope: !971, inlinedAt: !1020)
!1036 = !DILocation(line: 545, column: 26, scope: !1001)
!1037 = !DILocation(line: 545, column: 16, scope: !998)
!1038 = !DILocation(line: 546, column: 30, scope: !1000)
!1039 = !DILocation(line: 0, scope: !1000)
!1040 = !DILocation(line: 547, column: 31, scope: !1000)
