; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/write_debug_image.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/write_debug_image.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }
%struct.halide_device_interface_impl_t = type opaque
%struct.halide_type_t = type { i8, i8, i16 }

!19 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !20, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !35, globals: !46, imports: !47, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/write_debug_image.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!21 = !{!22, !30}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !23, line: 403, baseType: !15, size: 8, elements: !24, identifier: "_ZTS18halide_type_code_t")
!23 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 1415, baseType: !31, size: 32, elements: !32, identifier: "_ZTS19halide_buffer_flags")
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!35 = !{!36, !7, !39, !40, !41, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 12, baseType: !31)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 10, baseType: !42)
!42 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 27, baseType: !31)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !8, line: 28, baseType: !45)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !{!0, !12, !17}
!47 = !{!48}
!48 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !19, entity: !2, file: !8, line: 225)
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!53 = distinct !DISubprogram(name: "ends_with", linkageName: "_ZN6Halide7Runtime8Internal9ends_withEPKcS3_", scope: !2, file: !5, line: 92, type: !54, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !57)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !36, !36}
!56 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!57 = !{!58, !59, !60, !61}
!58 = !DILocalVariable(name: "filename", arg: 1, scope: !53, file: !5, line: 92, type: !36)
!59 = !DILocalVariable(name: "suffix", arg: 2, scope: !53, file: !5, line: 92, type: !36)
!60 = !DILocalVariable(name: "f", scope: !53, file: !5, line: 93, type: !36)
!61 = !DILocalVariable(name: "s", scope: !53, file: !5, line: 93, type: !36)
!62 = !DILocation(line: 0, scope: !53)
!63 = !DILocation(line: 94, column: 5, scope: !53)
!64 = !DILocation(line: 94, column: 12, scope: !53)
!65 = !{!66, !66, i64 0}
!66 = !{!"omnipotent char", !67, i64 0}
!67 = !{!"Simple C++ TBAA"}
!68 = !DILocation(line: 95, column: 10, scope: !69)
!69 = distinct !DILexicalBlock(scope: !53, file: !5, line: 94, column: 16)
!70 = distinct !{!70, !63, !71, !72}
!71 = !DILocation(line: 96, column: 5, scope: !53)
!72 = !{!"llvm.loop.mustprogress"}
!73 = !DILocation(line: 97, column: 12, scope: !53)
!74 = !DILocation(line: 98, column: 10, scope: !75)
!75 = distinct !DILexicalBlock(scope: !53, file: !5, line: 97, column: 16)
!76 = !DILocation(line: 97, column: 5, scope: !53)
!77 = distinct !{!77, !76, !78, !72}
!78 = !DILocation(line: 99, column: 5, scope: !53)
!79 = !DILocation(line: 100, column: 14, scope: !53)
!80 = !DILocation(line: 100, column: 24, scope: !53)
!81 = !DILocation(line: 100, column: 5, scope: !53)
!82 = !DILocation(line: 104, column: 10, scope: !83)
!83 = distinct !DILexicalBlock(scope: !53, file: !5, line: 100, column: 42)
!84 = !DILocation(line: 105, column: 10, scope: !83)
!85 = distinct !{!85, !81, !86, !72}
!86 = !DILocation(line: 106, column: 5, scope: !53)
!87 = !DILocation(line: 101, column: 16, scope: !88)
!88 = distinct !DILexicalBlock(scope: !83, file: !5, line: 101, column: 13)
!89 = !DILocation(line: 101, column: 13, scope: !83)
!90 = !DILocation(line: 107, column: 18, scope: !53)
!91 = !DILocation(line: 107, column: 12, scope: !53)
!92 = !DILocation(line: 107, column: 15, scope: !53)
!93 = !DILocation(line: 107, column: 5, scope: !53)
!94 = !DILocation(line: 108, column: 1, scope: !53)
!95 = distinct !DISubprogram(name: "halide_debug_to_file", scope: !5, file: !5, line: 132, type: !96, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !19, retainedNodes: !249)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !39, !36, !98, !99}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 11, baseType: !45)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !23, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !101, identifier: "_ZTS15halide_buffer_t")
!101 = !{!102, !103, !154, !156, !157, !190, !191, !214, !215, !220, !224, !227, !228, !231, !232, !235, !238, !239, !240, !245, !248}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !100, file: !23, line: 1425, baseType: !41, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !100, file: !23, line: 1428, baseType: !104, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !23, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !107, identifier: "_ZTS25halide_device_interface_t")
!107 = !{!108, !112, !116, !117, !121, !122, !123, !124, !125, !129, !135, !139, !140, !144, !145, !150}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !106, file: !23, line: 724, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DISubroutineType(types: !111)
!111 = !{!45, !39, !99, !104}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !106, file: !23, line: 726, baseType: !113, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!45, !39, !99}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !106, file: !23, line: 727, baseType: !113, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !106, file: !23, line: 728, baseType: !118, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !39, !104}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !106, file: !23, line: 730, baseType: !113, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !106, file: !23, line: 731, baseType: !109, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !106, file: !23, line: 733, baseType: !109, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !106, file: !23, line: 735, baseType: !113, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !106, file: !23, line: 736, baseType: !126, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(types: !128)
!128 = !{!45, !39, !99, !104, !99}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !106, file: !23, line: 738, baseType: !130, size: 32, offset: 288)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{!45, !39, !133, !99}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !106, file: !23, line: 740, baseType: !136, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{!45, !39, !133, !45, !45, !99}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !106, file: !23, line: 742, baseType: !113, size: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !106, file: !23, line: 743, baseType: !141, size: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DISubroutineType(types: !143)
!143 = !{!45, !39, !99, !41, !104}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !106, file: !23, line: 745, baseType: !113, size: 32, offset: 416)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !106, file: !23, line: 746, baseType: !146, size: 32, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!45, !39, !149, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !106, file: !23, line: 747, baseType: !151, size: 32, offset: 480)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !23, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !100, file: !23, line: 1433, baseType: !155, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !23, line: 1436, baseType: !41, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !23, line: 1439, baseType: !158, size: 32, offset: 192)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !23, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !159, identifier: "_ZTS13halide_type_t")
!159 = !{!160, !162, !163, !166, !170, !173, !178, !182, !183, !184, !187}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !158, file: !23, line: 434, baseType: !161, size: 8, align: 8)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !23, line: 413, baseType: !22)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !158, file: !23, line: 442, baseType: !15, size: 8, align: 8, offset: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !158, file: !23, line: 446, baseType: !164, size: 16, align: 16, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 14, baseType: !165)
!165 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!166 = !DISubprogram(name: "halide_type_t", scope: !158, file: !23, line: 453, type: !167, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !161, !15, !164}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!170 = !DISubprogram(name: "halide_type_t", scope: !158, file: !23, line: 459, type: !171, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !169}
!173 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !158, file: !23, line: 463, type: !174, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!158, !176, !164}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!178 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !158, file: !23, line: 468, type: !179, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!179 = !DISubroutineType(types: !180)
!180 = !{!56, !176, !181}
!181 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !177, size: 32)
!182 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !158, file: !23, line: 472, type: !179, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!183 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !158, file: !23, line: 476, type: !179, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !158, file: !23, line: 481, type: !185, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubroutineType(types: !186)
!186 = !{!45, !176}
!187 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !158, file: !23, line: 485, type: !188, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{!40, !176}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !100, file: !23, line: 1442, baseType: !98, size: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !100, file: !23, line: 1446, baseType: !192, size: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !23, line: 1409, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !23, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !195, identifier: "_ZTS18halide_dimension_t")
!195 = !{!196, !197, !198, !199, !200, !204, !207, !213}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !194, file: !23, line: 1383, baseType: !98, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !194, file: !23, line: 1383, baseType: !98, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !194, file: !23, line: 1383, baseType: !98, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !23, line: 1386, baseType: !40, size: 32, offset: 96)
!200 = !DISubprogram(name: "halide_dimension_t", scope: !194, file: !23, line: 1388, type: !201, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!204 = !DISubprogram(name: "halide_dimension_t", scope: !194, file: !23, line: 1389, type: !205, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !203, !98, !98, !98, !40}
!207 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !194, file: !23, line: 1393, type: !208, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!208 = !DISubroutineType(types: !209)
!209 = !{!56, !210, !212}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!212 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !211, size: 32)
!213 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !194, file: !23, line: 1400, type: !208, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !100, file: !23, line: 1449, baseType: !39, size: 32, offset: 288)
!215 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !100, file: !23, line: 1454, type: !216, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubroutineType(types: !217)
!217 = !{!56, !218, !219}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !23, line: 1416, baseType: !30)
!220 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !100, file: !23, line: 1458, type: !221, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !223, !219, !56}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!224 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !100, file: !23, line: 1466, type: !225, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{!56, !218}
!227 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !100, file: !23, line: 1470, type: !225, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !100, file: !23, line: 1474, type: !229, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !223, !56}
!231 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !100, file: !23, line: 1478, type: !229, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !100, file: !23, line: 1485, type: !233, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !218}
!235 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !100, file: !23, line: 1495, type: !236, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!236 = !DISubroutineType(types: !237)
!237 = !{!155, !218}
!238 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !100, file: !23, line: 1506, type: !236, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !100, file: !23, line: 1518, type: !233, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !100, file: !23, line: 1523, type: !241, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{!155, !218, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!245 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !100, file: !23, line: 1534, type: !246, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!45, !223, !39}
!248 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !100, file: !23, line: 1545, type: !225, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !{!250, !251, !252, !253, !254, !275, !276, !280, !282, !284, !285, !286, !289, !290, !291, !292, !332, !333, !334, !336, !339, !341, !342, !344, !347, !348, !349, !353, !355, !356, !360, !361, !362, !363, !367, !369, !371, !372, !377, !378, !382, !383, !384, !386, !390, !394, !398, !401, !402, !403}
!250 = !DILocalVariable(name: "user_context", arg: 1, scope: !95, file: !5, line: 132, type: !39)
!251 = !DILocalVariable(name: "filename", arg: 2, scope: !95, file: !5, line: 132, type: !36)
!252 = !DILocalVariable(name: "type_code", arg: 3, scope: !95, file: !5, line: 133, type: !98)
!253 = !DILocalVariable(name: "buf", arg: 4, scope: !95, file: !5, line: 133, type: !99)
!254 = !DILocalVariable(name: "f", scope: !95, file: !5, line: 147, type: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedFile", scope: !2, file: !5, line: 110, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !256, identifier: "_ZTSN6Halide7Runtime8Internal10ScopedFileE")
!256 = !{!257, !258, !262, !265, !270}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !255, file: !5, line: 111, baseType: !39, size: 32)
!258 = !DISubprogram(name: "ScopedFile", scope: !255, file: !5, line: 112, type: !259, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261, !36, !36}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!262 = !DISubprogram(name: "~ScopedFile", scope: !255, file: !5, line: 115, type: !263, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !261}
!265 = !DISubprogram(name: "write", linkageName: "_ZN6Halide7Runtime8Internal10ScopedFile5writeEPKvj", scope: !255, file: !5, line: 120, type: !266, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DISubroutineType(types: !267)
!267 = !{!56, !261, !268, !43}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!270 = !DISubprogram(name: "open", linkageName: "_ZNK6Halide7Runtime8Internal10ScopedFile4openEv", scope: !255, file: !5, line: 123, type: !271, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{!56, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!275 = !DILocalVariable(name: "elts", scope: !95, file: !5, line: 152, type: !43)
!276 = !DILocalVariable(name: "shape", scope: !95, file: !5, line: 153, type: !277)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 512, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 4)
!280 = !DILocalVariable(name: "i", scope: !281, file: !5, line: 154, type: !45)
!281 = distinct !DILexicalBlock(scope: !95, file: !5, line: 154, column: 5)
!282 = !DILocalVariable(name: "i", scope: !283, file: !5, line: 158, type: !45)
!283 = distinct !DILexicalBlock(scope: !95, file: !5, line: 158, column: 5)
!284 = !DILocalVariable(name: "bytes_per_element", scope: !95, file: !5, line: 163, type: !98)
!285 = !DILocalVariable(name: "final_padding_bytes", scope: !95, file: !5, line: 165, type: !40)
!286 = !DILocalVariable(name: "channels", scope: !287, file: !5, line: 168, type: !98)
!287 = distinct !DILexicalBlock(scope: !288, file: !5, line: 167, column: 70)
!288 = distinct !DILexicalBlock(scope: !95, file: !5, line: 167, column: 9)
!289 = !DILocalVariable(name: "width", scope: !287, file: !5, line: 169, type: !98)
!290 = !DILocalVariable(name: "height", scope: !287, file: !5, line: 170, type: !98)
!291 = !DILocalVariable(name: "depth", scope: !287, file: !5, line: 171, type: !98)
!292 = !DILocalVariable(name: "header", scope: !287, file: !5, line: 181, type: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_tiff_header", scope: !2, file: !5, line: 79, size: 1680, flags: DIFlagTypePassByValue, elements: !294, identifier: "_ZTSN6Halide7Runtime8Internal18halide_tiff_headerE")
!294 = !{!295, !296, !297, !298, !299, !326, !327, !331}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order_marker", scope: !293, file: !5, line: 80, baseType: !7, size: 16)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !293, file: !5, line: 81, baseType: !7, size: 16, offset: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ifd0_offset", scope: !293, file: !5, line: 82, baseType: !98, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "entry_count", scope: !293, file: !5, line: 83, baseType: !7, size: 16, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !293, file: !5, line: 84, baseType: !300, size: 1440, offset: 80)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 1440, elements: !324)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff_tag", scope: !2, file: !5, line: 47, size: 96, flags: DIFlagTypePassByValue, elements: !302, identifier: "_ZTSN6Halide7Runtime8Internal8tiff_tagE")
!302 = !{!303, !304, !305, !306, !314, !318, !321}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tag_code", scope: !301, file: !5, line: 48, baseType: !164, size: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type_code", scope: !301, file: !5, line: 49, baseType: !7, size: 16, offset: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !301, file: !5, line: 50, baseType: !98, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !5, line: 55, baseType: !307, size: 32, offset: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !5, line: 51, size: 32, flags: DIFlagTypePassByValue, elements: !308, identifier: "_ZTSN6Halide7Runtime8Internal8tiff_tagUt_E")
!308 = !{!309, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i8", scope: !307, file: !5, line: 52, baseType: !310, size: 8)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !8, line: 15, baseType: !311)
!311 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i16", scope: !307, file: !5, line: 53, baseType: !7, size: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !307, file: !5, line: 54, baseType: !98, size: 32)
!314 = !DISubprogram(name: "assign16", linkageName: "_ZN6Halide7Runtime8Internal8tiff_tag8assign16Etis", scope: !301, file: !5, line: 57, type: !315, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !317, !164, !98, !7}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!318 = !DISubprogram(name: "assign32", linkageName: "_ZN6Halide7Runtime8Internal8tiff_tag8assign32Etii", scope: !301, file: !5, line: 64, type: !319, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !317, !164, !98, !98}
!321 = !DISubprogram(name: "assign32", linkageName: "_ZN6Halide7Runtime8Internal8tiff_tag8assign32Etsii", scope: !301, file: !5, line: 71, type: !322, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !317, !164, !7, !98, !98}
!324 = !{!325}
!325 = !DISubrange(count: 15)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ifd0_end", scope: !293, file: !5, line: 85, baseType: !98, size: 32, offset: 1520)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "width_resolution", scope: !293, file: !5, line: 86, baseType: !328, size: 64, offset: 1552)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "height_resolution", scope: !293, file: !5, line: 87, baseType: !328, size: 64, offset: 1616)
!332 = !DILocalVariable(name: "MMII", scope: !287, file: !5, line: 183, type: !98)
!333 = !DILocalVariable(name: "c", scope: !287, file: !5, line: 185, type: !36)
!334 = !DILocalVariable(name: "tag", scope: !287, file: !5, line: 192, type: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!336 = !DILocalVariable(name: "offset", scope: !337, file: !5, line: 227, type: !98)
!337 = distinct !DILexicalBlock(scope: !338, file: !5, line: 226, column: 27)
!338 = distinct !DILexicalBlock(scope: !287, file: !5, line: 226, column: 13)
!339 = !DILocalVariable(name: "i", scope: !340, file: !5, line: 229, type: !98)
!340 = distinct !DILexicalBlock(scope: !337, file: !5, line: 229, column: 13)
!341 = !DILocalVariable(name: "count", scope: !337, file: !5, line: 235, type: !98)
!342 = !DILocalVariable(name: "i", scope: !343, file: !5, line: 236, type: !98)
!343 = distinct !DILexicalBlock(scope: !337, file: !5, line: 236, column: 13)
!344 = !DILocalVariable(name: "end", scope: !345, file: !5, line: 244, type: !36)
!345 = distinct !DILexicalBlock(scope: !346, file: !5, line: 242, column: 45)
!346 = distinct !DILexicalBlock(scope: !288, file: !5, line: 242, column: 16)
!347 = !DILocalVariable(name: "start", scope: !345, file: !5, line: 251, type: !36)
!348 = !DILocalVariable(name: "name_size", scope: !345, file: !5, line: 255, type: !40)
!349 = !DILocalVariable(name: "array_name", scope: !345, file: !5, line: 256, type: !350)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 256)
!353 = !DILocalVariable(name: "dst", scope: !345, file: !5, line: 257, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!355 = !DILocalVariable(name: "padded_name_size", scope: !345, file: !5, line: 265, type: !40)
!356 = !DILocalVariable(name: "header", scope: !345, file: !5, line: 267, type: !357)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1032, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 129)
!360 = !DILocalVariable(name: "payload_bytes", scope: !345, file: !5, line: 273, type: !43)
!361 = !DILocalVariable(name: "dims", scope: !345, file: !5, line: 281, type: !45)
!362 = !DILocalVariable(name: "padded_dimensions", scope: !345, file: !5, line: 287, type: !45)
!363 = !DILocalVariable(name: "tags", scope: !345, file: !5, line: 289, type: !364)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 8)
!367 = !DILocalVariable(name: "extents", scope: !345, file: !5, line: 301, type: !368)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !278)
!369 = !DILocalVariable(name: "name_header", scope: !345, file: !5, line: 307, type: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !329)
!371 = !DILocalVariable(name: "payload_header", scope: !345, file: !5, line: 319, type: !370)
!372 = !DILocalVariable(name: "header", scope: !373, file: !5, line: 325, type: !374)
!373 = distinct !DILexicalBlock(scope: !346, file: !5, line: 324, column: 12)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 160, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 5)
!377 = !DILocalVariable(name: "TEMP_SIZE", scope: !95, file: !5, line: 336, type: !244)
!378 = !DILocalVariable(name: "temp", scope: !95, file: !5, line: 337, type: !379)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32768, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 4096)
!382 = !DILocalVariable(name: "max_elts", scope: !95, file: !5, line: 338, type: !45)
!383 = !DILocalVariable(name: "counter", scope: !95, file: !5, line: 339, type: !45)
!384 = !DILocalVariable(name: "dim3", scope: !385, file: !5, line: 341, type: !98)
