; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/to_string.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/to_string.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.halide_type_t = type { i8, i8, i16 }
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }
%struct.halide_device_interface_impl_t = type opaque

!342 = !DILocation(line: 201, column: 40, scope: !160)
!343 = !DILocation(line: 202, column: 25, scope: !160)
!344 = !DILocation(line: 0, scope: !180)
!345 = !DILocation(line: 203, column: 27, scope: !183)
!346 = !DILocation(line: 203, column: 9, scope: !180)
!347 = !DILocation(line: 0, scope: !185)
!348 = !DILocation(line: 0, scope: !182)
!349 = !DILocation(line: 206, column: 43, scope: !188)
!350 = !DILocation(line: 206, column: 13, scope: !185)
!351 = !DILocation(line: 224, column: 15, scope: !160)
!352 = !DILocation(line: 225, column: 15, scope: !160)
!353 = !DILocation(line: 226, column: 15, scope: !160)
!354 = !DILocation(line: 227, column: 5, scope: !155)
!355 = !DILocation(line: 217, column: 17, scope: !182)
!356 = !DILocation(line: 207, column: 34, scope: !187)
!357 = !DILocation(line: 207, column: 37, scope: !187)
!358 = !DILocation(line: 0, scope: !187)
!359 = !DILocation(line: 208, column: 34, scope: !187)
!360 = !DILocation(line: 208, column: 44, scope: !187)
!361 = !DILocation(line: 208, column: 48, scope: !187)
!362 = !DILocation(line: 209, column: 31, scope: !363)
!363 = distinct !DILexicalBlock(scope: !187, file: !32, line: 209, column: 21)
!364 = !DILocation(line: 209, column: 21, scope: !187)
!365 = !DILocation(line: 215, column: 22, scope: !187)
!366 = !DILocation(line: 215, column: 20, scope: !187)
!367 = distinct !{!367, !350, !368, !112}
!368 = !DILocation(line: 216, column: 13, scope: !185)
!369 = !DILocation(line: 220, column: 29, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !32, line: 217, column: 24)
!371 = distinct !DILexicalBlock(scope: !182, file: !32, line: 217, column: 17)
!372 = !DILocation(line: 221, column: 31, scope: !370)
!373 = !DILocation(line: 222, column: 13, scope: !370)
!374 = !DILocation(line: 203, column: 48, scope: !183)
!375 = distinct !{!375, !346, !376, !112}
!376 = !DILocation(line: 223, column: 9, scope: !180)
!377 = !DILocation(line: 230, column: 1, scope: !134)
!378 = !DISubprogram(name: "memcpy", scope: !6, file: !6, line: 94, type: !379, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !385)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !381, !382, !384}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!384 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!385 = !{}
!386 = distinct !DISubprogram(name: "halide_pointer_to_string", scope: !32, file: !32, line: 232, type: !387, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!35, !35, !35, !382}
!389 = !{!390, !391, !392, !393, !394, !398, !399, !400}
!390 = !DILocalVariable(name: "dst", arg: 1, scope: !386, file: !32, line: 232, type: !35)
!391 = !DILocalVariable(name: "end", arg: 2, scope: !386, file: !32, line: 232, type: !35)
!392 = !DILocalVariable(name: "arg", arg: 3, scope: !386, file: !32, line: 232, type: !382)
!393 = !DILocalVariable(name: "hex_digits", scope: !386, file: !32, line: 233, type: !37)
!394 = !DILocalVariable(name: "buf", scope: !386, file: !32, line: 234, type: !395)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 20)
!398 = !DILocalVariable(name: "buf_ptr", scope: !386, file: !32, line: 235, type: !35)
!399 = !DILocalVariable(name: "bits", scope: !386, file: !32, line: 236, type: !20)
!400 = !DILocalVariable(name: "i", scope: !401, file: !32, line: 237, type: !71)
!401 = distinct !DILexicalBlock(scope: !386, file: !32, line: 237, column: 5)
!402 = !DILocation(line: 0, scope: !386)
!403 = !DILocation(line: 234, column: 5, scope: !386)
!404 = !DILocation(line: 234, column: 10, scope: !386)
!405 = !DILocation(line: 235, column: 25, scope: !386)
!406 = !DILocation(line: 236, column: 21, scope: !386)
!407 = !DILocation(line: 0, scope: !401)
!408 = !DILocation(line: 238, column: 38, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !32, line: 237, column: 34)
!410 = distinct !DILexicalBlock(scope: !401, file: !32, line: 237, column: 5)
!411 = !DILocation(line: 238, column: 22, scope: !409)
!412 = !DILocation(line: 238, column: 17, scope: !409)
!413 = !DILocation(line: 238, column: 20, scope: !409)
!414 = !DILocation(line: 239, column: 14, scope: !409)
!415 = !DILocation(line: 240, column: 14, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !32, line: 240, column: 13)
!417 = !DILocation(line: 240, column: 13, scope: !409)
!418 = !DILocation(line: 244, column: 13, scope: !386)
!419 = !DILocation(line: 244, column: 16, scope: !386)
!420 = !DILocation(line: 245, column: 14, scope: !386)
!421 = !DILocation(line: 246, column: 12, scope: !386)
!422 = !DILocation(line: 247, column: 1, scope: !386)
!423 = !DILocation(line: 246, column: 5, scope: !386)
!424 = distinct !DISubprogram(name: "halide_type_to_string", scope: !32, file: !32, line: 249, type: !425, scopeLine: 249, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!425 = !DISubroutineType(types: !426)
!426 = !{!35, !35, !35, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !4, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !430, identifier: "_ZTS13halide_type_t")
!430 = !{!431, !433, !434, !437, !441, !444, !448, !453, !454, !455, !458}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !429, file: !4, line: 434, baseType: !432, size: 8, align: 8)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !4, line: 413, baseType: !3)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !429, file: !4, line: 442, baseType: !5, size: 8, align: 8, offset: 8)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !429, file: !4, line: 446, baseType: !435, size: 16, align: 16, offset: 16)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 14, baseType: !436)
!436 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!437 = !DISubprogram(name: "halide_type_t", scope: !429, file: !4, line: 453, type: !438, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !440, !432, !5, !435}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!441 = !DISubprogram(name: "halide_type_t", scope: !429, file: !4, line: 459, type: !442, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !440}
!444 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !429, file: !4, line: 463, type: !445, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!429, !447, !435}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!448 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !429, file: !4, line: 468, type: !449, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !447, !452}
!451 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!452 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !428, size: 64)
!453 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !429, file: !4, line: 472, type: !449, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !429, file: !4, line: 476, type: !449, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !429, file: !4, line: 481, type: !456, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{!71, !447}
!458 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !429, file: !4, line: 485, type: !459, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !447}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 12, baseType: !15)
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(name: "dst", arg: 1, scope: !424, file: !32, line: 249, type: !35)
!464 = !DILocalVariable(name: "end", arg: 2, scope: !424, file: !32, line: 249, type: !35)
!465 = !DILocalVariable(name: "t", arg: 3, scope: !424, file: !32, line: 249, type: !427)
!466 = !DILocalVariable(name: "code_name", scope: !424, file: !32, line: 250, type: !37)
!467 = !DILocation(line: 0, scope: !424)
!468 = !DILocation(line: 251, column: 16, scope: !424)
!469 = !{!470, !471, i64 0}
!470 = !{!"_ZTS13halide_type_t", !471, i64 0, !52, i64 1, !472, i64 2}
!471 = !{!"_ZTS18halide_type_code_t", !52, i64 0}
!472 = !{!"short", !52, i64 0}
!473 = !DILocation(line: 251, column: 5, scope: !424)
!474 = !DILocation(line: 257, column: 9, scope: !475)
!475 = distinct !DILexicalBlock(scope: !424, file: !32, line: 251, column: 22)
!476 = !DILocation(line: 260, column: 9, scope: !475)
!477 = !DILocation(line: 263, column: 9, scope: !475)
!478 = !DILocation(line: 266, column: 9, scope: !475)
!479 = !DILocation(line: 0, scope: !475)
!480 = !DILocation(line: 268, column: 11, scope: !424)
!481 = !DILocation(line: 269, column: 48, scope: !424)
!482 = !{!470, !52, i64 1}
!483 = !DILocation(line: 269, column: 45, scope: !424)
!484 = !DILocation(line: 269, column: 11, scope: !424)
!485 = !DILocation(line: 270, column: 12, scope: !486)
!486 = distinct !DILexicalBlock(scope: !424, file: !32, line: 270, column: 9)
!487 = !{!470, !472, i64 2}
!488 = !DILocation(line: 270, column: 18, scope: !486)
!489 = !DILocation(line: 270, column: 9, scope: !424)
!490 = !DILocation(line: 271, column: 15, scope: !491)
!491 = distinct !DILexicalBlock(scope: !486, file: !32, line: 270, column: 24)
!492 = !DILocation(line: 272, column: 52, scope: !491)
!493 = !DILocation(line: 272, column: 49, scope: !491)
!494 = !DILocation(line: 272, column: 15, scope: !491)
!495 = !DILocation(line: 273, column: 5, scope: !491)
!496 = !DILocation(line: 274, column: 5, scope: !424)
!497 = distinct !DISubprogram(name: "halide_buffer_to_string", scope: !32, file: !32, line: 277, type: !498, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !622)
!498 = !DISubroutineType(types: !499)
!499 = !{!35, !35, !35, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !4, line: 1550, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !4, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !504, identifier: "_ZTS15halide_buffer_t")
!504 = !{!505, !506, !558, !560, !561, !562, !564, !587, !588, !593, !597, !600, !601, !604, !605, !609, !612, !613, !614, !618, !621}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !503, file: !4, line: 1425, baseType: !20, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !503, file: !4, line: 1428, baseType: !507, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !4, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !510, identifier: "_ZTS25halide_device_interface_t")
!510 = !{!511, !516, !520, !521, !525, !526, !527, !528, !529, !533, !539, !543, !544, !548, !549, !554}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !509, file: !4, line: 724, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!71, !381, !515, !507}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !509, file: !4, line: 726, baseType: !517, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!71, !381, !515}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !509, file: !4, line: 727, baseType: !517, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !509, file: !4, line: 728, baseType: !522, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !381, !507}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !509, file: !4, line: 730, baseType: !517, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !509, file: !4, line: 731, baseType: !512, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !509, file: !4, line: 733, baseType: !512, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !509, file: !4, line: 735, baseType: !517, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !509, file: !4, line: 736, baseType: !530, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!71, !381, !515, !507, !515}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !509, file: !4, line: 738, baseType: !534, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!71, !381, !537, !515}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !509, file: !4, line: 740, baseType: !540, size: 64, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!71, !381, !537, !71, !71, !515}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !509, file: !4, line: 742, baseType: !517, size: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !509, file: !4, line: 743, baseType: !545, size: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!71, !381, !515, !20, !507}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !509, file: !4, line: 745, baseType: !517, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !509, file: !4, line: 746, baseType: !550, size: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!71, !381, !553, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !509, file: !4, line: 747, baseType: !555, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !4, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!558 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !503, file: !4, line: 1433, baseType: !559, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !503, file: !4, line: 1436, baseType: !20, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !4, line: 1439, baseType: !429, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !503, file: !4, line: 1442, baseType: !563, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !6, line: 11, baseType: !71)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !503, file: !4, line: 1446, baseType: !565, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !4, line: 1409, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !4, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !568, identifier: "_ZTS18halide_dimension_t")
!568 = !{!569, !570, !571, !572, !573, !577, !580, !586}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !567, file: !4, line: 1383, baseType: !563, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !567, file: !4, line: 1383, baseType: !563, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !567, file: !4, line: 1383, baseType: !563, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !567, file: !4, line: 1386, baseType: !461, size: 32, offset: 96)
!573 = !DISubprogram(name: "halide_dimension_t", scope: !567, file: !4, line: 1388, type: !574, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!577 = !DISubprogram(name: "halide_dimension_t", scope: !567, file: !4, line: 1389, type: !578, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !576, !563, !563, !563, !461}
!580 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !567, file: !4, line: 1393, type: !581, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!581 = !DISubroutineType(types: !582)
!582 = !{!451, !583, !585}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!585 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !584, size: 64)
!586 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !567, file: !4, line: 1400, type: !581, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !503, file: !4, line: 1449, baseType: !381, size: 64, offset: 384)
!588 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !503, file: !4, line: 1454, type: !589, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!589 = !DISubroutineType(types: !590)
!590 = !{!451, !591, !592}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !4, line: 1416, baseType: !14)
!593 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !503, file: !4, line: 1458, type: !594, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !596, !592, !451}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!597 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !503, file: !4, line: 1466, type: !598, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DISubroutineType(types: !599)
!599 = !{!451, !591}
!600 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !503, file: !4, line: 1470, type: !598, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!601 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !503, file: !4, line: 1474, type: !602, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !596, !451}
!604 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !503, file: !4, line: 1478, type: !602, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !503, file: !4, line: 1485, type: !606, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !591}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 27, baseType: !384)
!609 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !503, file: !4, line: 1495, type: !610, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!610 = !DISubroutineType(types: !611)
!611 = !{!559, !591}
!612 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !503, file: !4, line: 1506, type: !610, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!613 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !503, file: !4, line: 1518, type: !606, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !503, file: !4, line: 1523, type: !615, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubroutineType(types: !616)
!616 = !{!559, !591, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!618 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !503, file: !4, line: 1534, type: !619, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !DISubroutineType(types: !620)
!620 = !{!71, !596, !381}
!621 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !503, file: !4, line: 1545, type: !598, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !{!623, !624, !625, !626}
