; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/openglcompute.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/openglcompute.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::OpenGLCompute::GlobalState" = type { i8, void (i32, i32)*, void (i32, i32)*, void (i32, i32, i32)*, void (i32, i64, i8*, i32)*, i32 ()*, void (i32)*, i32 (i32)*, void (i32, i32*)*, void (i32)*, void (i32)*, void (i32, i32, i32)*, void ()*, void (i32, i32*)*, i32 ()*, void (i32, i32, i32*, i8*)*, void (i32, i32, i32*)*, void (i32, i32, i32*, i8*)*, void (i32, i32, i32*)*, i8* (i32)*, void (i32)*, i8* (i32, i64, i64, i32)*, void (i32)*, void (i32, i32, i8**, i32*)*, void (i32, i32)*, void (i32, i32)*, void (i32, float)*, void (i32)*, void (i32)*, void (i32, i32, i32, i32*, i32*, i32*, i8*)*, i32 (i32, i8*)* }
%"struct.Halide::Runtime::Internal::OpenGLCompute::ModuleState" = type { %"struct.Halide::Runtime::Internal::OpenGLCompute::KernelInfo"*, %"struct.Halide::Runtime::Internal::OpenGLCompute::ModuleState"* }
%"struct.Halide::Runtime::Internal::OpenGLCompute::KernelInfo" = type { i8*, i32, %"struct.Halide::Runtime::Internal::OpenGLCompute::KernelInfo"* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "global_state", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute12global_stateE", scope: !2, file: !6, line: 147, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "OpenGLCompute", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/openglcompute.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalState", scope: !2, file: !6, line: 123, size: 1984, flags: DIFlagTypePassByValue, elements: !8, identifier: "_ZTSN6Halide7Runtime8Internal13OpenGLCompute11GlobalStateE")
!8 = !{!9, !11, !19, !25, !30, !42, !47, !52, !57, !66, !68, !70, !75, !80, !86, !91, !100, !107, !109, !111, !120, !122, !130, !135, !145, !150, !151, !158, !163, !165, !171, !176, !180}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !7, file: !6, line: 127, baseType: !10, size: 8)
!10 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "AttachShader", scope: !7, file: !6, line: 131, baseType: !12, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLATTACHSHADERPROC", file: !13, line: 128, baseType: !14)
!13 = !DIFile(filename: "src/runtime/mini_opengl.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !17}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !13, line: 11, baseType: !18)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "BindBuffer", scope: !7, file: !6, line: 131, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLBINDBUFFERPROC", file: !13, line: 111, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24, !17}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLenum", file: !13, line: 8, baseType: !18)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "BindBufferBase", scope: !7, file: !6, line: 131, baseType: !26, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLBINDBUFFERBASEPROC", file: !13, line: 215, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !24, !17, !17}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "BufferData", scope: !7, file: !6, line: 131, baseType: !31, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLBUFFERDATAPROC", file: !13, line: 112, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !24, !35, !39, !24}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLsizeiptr", file: !13, line: 13, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !37, line: 28, baseType: !38)
!37 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!38 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLvoid", file: !13, line: 16, baseType: null)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "CreateProgram", scope: !7, file: !6, line: 131, baseType: !43, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLCREATEPROGRAMPROC", file: !13, line: 130, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!17}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "CompileShader", scope: !7, file: !6, line: 131, baseType: !48, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLCOMPILESHADERPROC", file: !13, line: 129, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !17}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "CreateShader", scope: !7, file: !6, line: 131, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLCREATESHADERPROC", file: !13, line: 131, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!17, !24}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteBuffers", scope: !7, file: !6, line: 131, baseType: !58, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDELETEBUFFERSPROC", file: !13, line: 216, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !64}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLsizei", file: !13, line: 12, baseType: !63)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteProgram", scope: !7, file: !6, line: 131, baseType: !67, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDELETEPROGRAMPROC", file: !13, line: 132, baseType: !49)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteShader", scope: !7, file: !6, line: 131, baseType: !69, size: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDELETESHADERPROC", file: !13, line: 133, baseType: !49)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchCompute", scope: !7, file: !6, line: 131, baseType: !71, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDISPATCHCOMPUTEPROC", file: !13, line: 213, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !17, !17, !17}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !7, file: !6, line: 131, baseType: !76, size: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLFINISHPROC", file: !13, line: 153, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "GenBuffers", scope: !7, file: !6, line: 131, baseType: !81, size: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGENBUFFERSPROC", file: !13, line: 109, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !62, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", scope: !7, file: !6, line: 131, baseType: !87, size: 64, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETERRORPROC", file: !13, line: 70, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!24}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "GetProgramInfoLog", scope: !7, file: !6, line: 131, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETPROGRAMINFOLOGPROC", file: !13, line: 138, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !17, !62, !96, !97}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLchar", file: !13, line: 6, baseType: !99)
!99 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "GetProgramiv", scope: !7, file: !6, line: 131, baseType: !101, size: 64, offset: 1024)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETPROGRAMIVPROC", file: !13, line: 137, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !17, !24, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLint", file: !13, line: 10, baseType: !63)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "GetShaderInfoLog", scope: !7, file: !6, line: 131, baseType: !108, size: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETSHADERINFOLOGPROC", file: !13, line: 140, baseType: !93)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "GetShaderiv", scope: !7, file: !6, line: 131, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETSHADERIVPROC", file: !13, line: 139, baseType: !102)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "GetString", scope: !7, file: !6, line: 131, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETSTRINGPROC", file: !13, line: 71, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !24}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !13, line: 7, baseType: !119)
!119 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "LinkProgram", scope: !7, file: !6, line: 131, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLLINKPROGRAMPROC", file: !13, line: 142, baseType: !49)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "MapBufferRange", scope: !7, file: !6, line: 131, baseType: !123, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLMAPBUFFERRANGEPROC", file: !13, line: 212, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !24, !128, !35, !129}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLintptr", file: !13, line: 207, baseType: !36)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLbitfield", file: !13, line: 206, baseType: !18)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "MemoryBarrier", scope: !7, file: !6, line: 131, baseType: !131, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLMEMORYBARRIERPROC", file: !13, line: 211, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !129}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ShaderSource", scope: !7, file: !6, line: 131, baseType: !136, size: 64, offset: 1472)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLSHADERSOURCEPROC", file: !13, line: 143, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !17, !62, !140, !143}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Uniform1i", scope: !7, file: !6, line: 131, baseType: !146, size: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUNIFORM1IPROC", file: !13, line: 145, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !17, !106}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Uniform1ui", scope: !7, file: !6, line: 131, baseType: !146, size: 64, offset: 1600)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Uniform1f", scope: !7, file: !6, line: 131, baseType: !152, size: 64, offset: 1664)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUNIFORM1FPROC", file: !13, line: 144, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !17, !156}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLfloat", file: !13, line: 14, baseType: !157)
!157 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "UnmapBuffer", scope: !7, file: !6, line: 131, baseType: !159, size: 64, offset: 1728)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUNMAPBUFFERPROC", file: !13, line: 214, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !24}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "UseProgram", scope: !7, file: !6, line: 131, baseType: !164, size: 64, offset: 1792)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUSEPROGRAMPROC", file: !13, line: 149, baseType: !49)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "GetActiveUniform", scope: !7, file: !6, line: 131, baseType: !166, size: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETACTIVEUNIFORM", file: !13, line: 218, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !17, !17, !62, !96, !105, !170, !97}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "GetUniformLocation", scope: !7, file: !6, line: 131, baseType: !172, size: 64, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETUNIFORMLOCATION", file: !13, line: 219, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!106, !17, !141}
!176 = !DISubprogram(name: "init", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute11GlobalState4initEv", scope: !7, file: !6, line: 124, type: !177, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!180 = !DISubprogram(name: "CheckAndReportError", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute11GlobalState19CheckAndReportErrorEPvPKc", scope: !7, file: !6, line: 125, type: !181, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubroutineType(types: !182)
!182 = !{!10, !179, !127, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "state_list", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute10state_listE", scope: !2, file: !6, line: 150, type: !187, isLocal: false, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModuleState", scope: !2, file: !6, line: 109, size: 128, flags: DIFlagTypePassByValue, elements: !189, identifier: "_ZTSN6Halide7Runtime8Internal13OpenGLCompute11ModuleStateE")
!189 = !{!190, !198}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "kernel", scope: !188, file: !6, line: 110, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", scope: !2, file: !6, line: 103, size: 192, flags: DIFlagTypePassByValue, elements: !193, identifier: "_ZTSN6Halide7Runtime8Internal13OpenGLCompute10KernelInfoE")
!193 = !{!194, !196, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_name", scope: !192, file: !6, line: 104, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "program_id", scope: !192, file: !6, line: 105, baseType: !17, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !6, line: 106, baseType: !191, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !6, line: 111, baseType: !187, size: 64, offset: 64)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "openglcompute_device_interface", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute30openglcompute_device_interfaceE", scope: !2, file: !6, line: 948, type: !201, isLocal: false, isDefinition: true)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !202, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !203, identifier: "_ZTS25halide_device_interface_t")
!202 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!203 = !{!204, !329, !333, !334, !338, !339, !340, !341, !342, !346, !351, !355, !356, !360, !361, !366}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !201, file: !202, line: 724, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!63, !127, !208, !215}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !202, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !210, identifier: "_ZTS15halide_buffer_t")
!210 = !{!211, !214, !217, !220, !221, !262, !264, !287, !288, !298, !302, !305, !306, !309, !310, !315, !318, !319, !320, !325, !328}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !209, file: !202, line: 1425, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !37, line: 10, baseType: !213)
!213 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !209, file: !202, line: 1428, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !209, file: !202, line: 1433, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !37, line: 16, baseType: !119)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !209, file: !202, line: 1436, baseType: !212, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !202, line: 1439, baseType: !222, size: 32, offset: 256)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !202, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !223, identifier: "_ZTS13halide_type_t")
!223 = !{!224, !233, !234, !237, !241, !244, !249, !253, !254, !255, !258}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !222, file: !202, line: 434, baseType: !225, size: 8, align: 8)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !202, line: 413, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !202, line: 403, baseType: !219, size: 8, elements: !227, identifier: "_ZTS18halide_type_code_t")
!227 = !{!228, !229, !230, !231, !232}
!228 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!232 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !222, file: !202, line: 442, baseType: !219, size: 8, align: 8, offset: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !222, file: !202, line: 446, baseType: !235, size: 16, align: 16, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !37, line: 14, baseType: !236)
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DISubprogram(name: "halide_type_t", scope: !222, file: !202, line: 453, type: !238, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240, !225, !219, !235}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!241 = !DISubprogram(name: "halide_type_t", scope: !222, file: !202, line: 459, type: !242, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !240}
!244 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !222, file: !202, line: 463, type: !245, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!245 = !DISubroutineType(types: !246)
!246 = !{!222, !247, !235}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!249 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !222, file: !202, line: 468, type: !250, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!10, !247, !252}
!252 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !248, size: 64)
!253 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !222, file: !202, line: 472, type: !250, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !222, file: !202, line: 476, type: !250, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !222, file: !202, line: 481, type: !256, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!63, !247}
!258 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !222, file: !202, line: 485, type: !259, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !247}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !37, line: 12, baseType: !18)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !209, file: !202, line: 1442, baseType: !263, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !37, line: 11, baseType: !63)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !209, file: !202, line: 1446, baseType: !265, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !202, line: 1409, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !202, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !268, identifier: "_ZTS18halide_dimension_t")
!268 = !{!269, !270, !271, !272, !273, !277, !280, !286}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !267, file: !202, line: 1383, baseType: !263, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !267, file: !202, line: 1383, baseType: !263, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !267, file: !202, line: 1383, baseType: !263, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !267, file: !202, line: 1386, baseType: !261, size: 32, offset: 96)
!273 = !DISubprogram(name: "halide_dimension_t", scope: !267, file: !202, line: 1388, type: !274, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!277 = !DISubprogram(name: "halide_dimension_t", scope: !267, file: !202, line: 1389, type: !278, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !276, !263, !263, !263, !261}
!280 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !267, file: !202, line: 1393, type: !281, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!281 = !DISubroutineType(types: !282)
!282 = !{!10, !283, !285}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!285 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !284, size: 64)
!286 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !267, file: !202, line: 1400, type: !281, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !209, file: !202, line: 1449, baseType: !127, size: 64, offset: 384)
!288 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !209, file: !202, line: 1454, type: !289, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!289 = !DISubroutineType(types: !290)
!290 = !{!10, !291, !293}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !202, line: 1416, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 1415, baseType: !18, size: 32, elements: !295, identifier: "_ZTS19halide_buffer_flags")
!295 = !{!296, !297}
!296 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!298 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !209, file: !202, line: 1458, type: !299, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !301, !293, !10}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!302 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !209, file: !202, line: 1466, type: !303, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!10, !291}
!305 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !209, file: !202, line: 1470, type: !303, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !209, file: !202, line: 1474, type: !307, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !301, !10}
!309 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !209, file: !202, line: 1478, type: !307, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !209, file: !202, line: 1485, type: !311, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !291}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 27, baseType: !314)
!314 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !209, file: !202, line: 1495, type: !316, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{!218, !291}
!318 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !209, file: !202, line: 1506, type: !316, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !209, file: !202, line: 1518, type: !311, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !209, file: !202, line: 1523, type: !321, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{!218, !291, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!325 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !209, file: !202, line: 1534, type: !326, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!63, !301, !127}
!328 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !209, file: !202, line: 1545, type: !303, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !201, file: !202, line: 726, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!63, !127, !208}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !201, file: !202, line: 727, baseType: !330, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !201, file: !202, line: 728, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !127, !215}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !201, file: !202, line: 730, baseType: !330, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !201, file: !202, line: 731, baseType: !205, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !201, file: !202, line: 733, baseType: !205, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !201, file: !202, line: 735, baseType: !330, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !201, file: !202, line: 736, baseType: !343, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!63, !127, !208, !215, !208}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !201, file: !202, line: 738, baseType: !347, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!63, !127, !350, !208}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !201, file: !202, line: 740, baseType: !352, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!63, !127, !350, !63, !63, !208}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !201, file: !202, line: 742, baseType: !330, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !201, file: !202, line: 743, baseType: !357, size: 64, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!63, !127, !208, !212, !215}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !201, file: !202, line: 745, baseType: !330, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !201, file: !202, line: 746, baseType: !362, size: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!63, !127, !365, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !201, file: !202, line: 747, baseType: !367, size: 64, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !370, line: 10, size: 1024, flags: DIFlagTypePassByValue, elements: !371, identifier: "_ZTS30halide_device_interface_impl_t")
!370 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!371 = !{!372, !373, !374, !375, !376, !377, !381, !382, !383, !384, !385, !386, !387, !388, !389, !393}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !369, file: !370, line: 16, baseType: !77, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !369, file: !370, line: 17, baseType: !77, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !369, file: !370, line: 18, baseType: !330, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !369, file: !370, line: 19, baseType: !330, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !369, file: !370, line: 20, baseType: !330, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !369, file: !370, line: 21, baseType: !378, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!63, !127}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !369, file: !370, line: 22, baseType: !330, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !369, file: !370, line: 23, baseType: !330, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !369, file: !370, line: 24, baseType: !330, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !369, file: !370, line: 25, baseType: !330, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !369, file: !370, line: 26, baseType: !343, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !369, file: !370, line: 28, baseType: !347, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !369, file: !370, line: 31, baseType: !352, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !369, file: !370, line: 35, baseType: !330, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !369, file: !370, line: 37, baseType: !390, size: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!63, !127, !208, !212}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !369, file: !370, line: 38, baseType: !330, size: 64, offset: 960)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "openglcompute_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute35openglcompute_device_interface_implE", scope: !2, file: !6, line: 929, type: !369, isLocal: false, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !397, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, retainedTypes: !399, globals: !568, imports: !569, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/openglcompute.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!398 = !{!226, !294}
!399 = !{!127, !400, !212, !482, !63, !17, !549, !18, !187, !550, !553, !556, !218, !557, !558, !559, !560, !195, !561, !191, !106, !562, !313, !36, !563, !365, !564, !565, !566, !567, !552, !555, !119, !236}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !402, file: !401, line: 203, baseType: !403)
!401 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!402 = !DINamespace(scope: !3)
!403 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !402, file: !401, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !404, templateParams: !479)
!404 = !{!405, !406, !407, !408, !409, !410, !414, !418, !422, !427, !430, !433, !436, !440, !443, !448, !452, !455, !461, !464, !467, !472, !473, !476, !477, !478}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !403, file: !401, line: 32, baseType: !195, size: 64, flags: DIFlagPublic)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !403, file: !401, line: 32, baseType: !195, size: 64, offset: 64, flags: DIFlagPublic)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !403, file: !401, line: 32, baseType: !195, size: 64, offset: 128, flags: DIFlagPublic)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !403, file: !401, line: 33, baseType: !127, size: 64, offset: 192, flags: DIFlagPublic)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !403, file: !401, line: 34, baseType: !10, size: 8, offset: 256, flags: DIFlagPublic)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !403, file: !401, line: 35, baseType: !411, size: 8, offset: 264, flags: DIFlagPublic)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 8, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 1)
!414 = !DISubprogram(name: "Printer", scope: !403, file: !401, line: 37, type: !415, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417, !127, !195}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!418 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !403, file: !401, line: 57, type: !419, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !417, !183}
!421 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !403, size: 64)
!422 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !403, file: !401, line: 67, type: !423, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!423 = !DISubroutineType(types: !424)
!424 = !{!421, !417, !425}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !37, line: 9, baseType: !426)
!426 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!427 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !403, file: !401, line: 72, type: !428, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!428 = !DISubroutineType(types: !429)
!429 = !{!421, !417, !263}
!430 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !403, file: !401, line: 77, type: !431, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{!421, !417, !212}
!433 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !403, file: !401, line: 82, type: !434, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!421, !417, !261}
!436 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !403, file: !401, line: 87, type: !437, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubroutineType(types: !438)
!438 = !{!421, !417, !439}
!439 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!440 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !403, file: !401, line: 92, type: !441, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!441 = !DISubroutineType(types: !442)
!442 = !{!421, !417, !157}
!443 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !403, file: !401, line: 97, type: !444, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!444 = !DISubroutineType(types: !445)
!445 = !{!421, !417, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!448 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !403, file: !401, line: 102, type: !449, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!421, !417, !451}
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!452 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !403, file: !401, line: 108, type: !453, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!453 = !DISubroutineType(types: !454)
!454 = !{!421, !417, !252}
!455 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !403, file: !401, line: 113, type: !456, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{!421, !417, !458}
!458 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !202, line: 1550, baseType: !209)
!461 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !403, file: !401, line: 119, type: !462, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!462 = !DISubroutineType(types: !463)
!463 = !{!183, !417}
!464 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !403, file: !401, line: 131, type: !465, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !417}
!467 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !403, file: !401, line: 139, type: !468, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!468 = !DISubroutineType(types: !469)
!469 = !{!212, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!472 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !403, file: !401, line: 143, type: !468, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !403, file: !401, line: 148, type: !474, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !417, !63}
!476 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !403, file: !401, line: 158, type: !462, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!477 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !403, file: !401, line: 162, type: !465, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DISubprogram(name: "~Printer", scope: !403, file: !401, line: 166, type: !465, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !{!480, !481}
!480 = !DITemplateValueParameter(name: "type", type: !63, value: i32 0)
!481 = !DITemplateValueParameter(name: "length", type: !213, value: i64 1024)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !402, file: !401, line: 199, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !402, file: !401, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !484, templateParams: !547)
!484 = !{!485, !486, !487, !488, !489, !490, !491, !495, !499, !502, !505, !508, !511, !514, !517, !520, !523, !526, !529, !532, !535, !540, !541, !544, !545, !546}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !483, file: !401, line: 32, baseType: !195, size: 64, flags: DIFlagPublic)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !483, file: !401, line: 32, baseType: !195, size: 64, offset: 64, flags: DIFlagPublic)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !483, file: !401, line: 32, baseType: !195, size: 64, offset: 128, flags: DIFlagPublic)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !483, file: !401, line: 33, baseType: !127, size: 64, offset: 192, flags: DIFlagPublic)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !483, file: !401, line: 34, baseType: !10, size: 8, offset: 256, flags: DIFlagPublic)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !483, file: !401, line: 35, baseType: !411, size: 8, offset: 264, flags: DIFlagPublic)
!491 = !DISubprogram(name: "Printer", scope: !483, file: !401, line: 37, type: !492, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494, !127, !195}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!495 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !483, file: !401, line: 57, type: !496, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{!498, !494, !183}
!498 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !483, size: 64)
!499 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !483, file: !401, line: 67, type: !500, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!498, !494, !425}
!502 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !483, file: !401, line: 72, type: !503, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!503 = !DISubroutineType(types: !504)
!504 = !{!498, !494, !263}
!505 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !483, file: !401, line: 77, type: !506, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!506 = !DISubroutineType(types: !507)
!507 = !{!498, !494, !212}
!508 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !483, file: !401, line: 82, type: !509, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubroutineType(types: !510)
!510 = !{!498, !494, !261}
!511 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !483, file: !401, line: 87, type: !512, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(types: !513)
!513 = !{!498, !494, !439}
!514 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !483, file: !401, line: 92, type: !515, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!515 = !DISubroutineType(types: !516)
!516 = !{!498, !494, !157}
!517 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !483, file: !401, line: 97, type: !518, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!518 = !DISubroutineType(types: !519)
!519 = !{!498, !494, !446}
!520 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !483, file: !401, line: 102, type: !521, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!521 = !DISubroutineType(types: !522)
!522 = !{!498, !494, !451}
!523 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !483, file: !401, line: 108, type: !524, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!498, !494, !252}
!526 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !483, file: !401, line: 113, type: !527, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(types: !528)
!528 = !{!498, !494, !458}
!529 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !483, file: !401, line: 119, type: !530, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DISubroutineType(types: !531)
!531 = !{!183, !494}
!532 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !483, file: !401, line: 131, type: !533, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !494}
!535 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !483, file: !401, line: 139, type: !536, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubroutineType(types: !537)
!537 = !{!212, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!540 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !483, file: !401, line: 143, type: !536, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !483, file: !401, line: 148, type: !542, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !494, !63}
!544 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !483, file: !401, line: 158, type: !530, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !483, file: !401, line: 162, type: !533, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubprogram(name: "~Printer", scope: !483, file: !401, line: 166, type: !533, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !{!548, !481}
!548 = !DITemplateValueParameter(name: "type", type: !63, value: i32 1)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !37, line: 15, baseType: !552)
!552 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !37, line: 13, baseType: !555)
!555 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "print", scope: !402, file: !401, line: 198, baseType: !403)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!568 = !{!0, !185, !394, !199}
!569 = !{!570, !571, !572}
!570 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !396, entity: !3, file: !37, line: 225)
!571 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !396, entity: !3, file: !6, line: 50)
!572 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !396, entity: !2, file: !6, line: 585)
!573 = !{i32 7, !"Dwarf Version", i32 4}
!574 = !{i32 2, !"Debug Info Version", i32 3}
!575 = !{i32 1, !"wchar_size", i32 4}
!576 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!577 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !578, line: 47, type: !579, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !595)
!578 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581, !63, !425, !425}
!581 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !578, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !584, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!584 = !{!585, !586, !587, !588, !592, !593, !594}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !583, file: !578, line: 35, baseType: !212, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !583, file: !578, line: 35, baseType: !212, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !583, file: !578, line: 37, baseType: !212, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !583, file: !578, line: 39, baseType: !589, size: 1024, offset: 192)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 1024, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 16)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !583, file: !578, line: 41, baseType: !589, size: 1024, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !583, file: !578, line: 42, baseType: !589, size: 1024, offset: 2240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !583, file: !578, line: 44, baseType: !212, size: 64, offset: 3264)
!595 = !{!596, !597, !598, !599, !600, !603, !604}
!596 = !DILocalVariable(name: "copy", arg: 1, scope: !577, file: !578, line: 47, type: !581)
!597 = !DILocalVariable(name: "d", arg: 2, scope: !577, file: !578, line: 47, type: !63)
!598 = !DILocalVariable(name: "src_off", arg: 3, scope: !577, file: !578, line: 47, type: !425)
!599 = !DILocalVariable(name: "dst_off", arg: 4, scope: !577, file: !578, line: 47, type: !425)
!600 = !DILocalVariable(name: "from", scope: !601, file: !578, line: 54, type: !446)
!601 = distinct !DILexicalBlock(scope: !602, file: !578, line: 53, column: 18)
!602 = distinct !DILexicalBlock(scope: !577, file: !578, line: 53, column: 9)
!603 = !DILocalVariable(name: "to", scope: !601, file: !578, line: 55, type: !127)
!604 = !DILocalVariable(name: "i", scope: !605, file: !578, line: 58, type: !212)
!605 = distinct !DILexicalBlock(scope: !606, file: !578, line: 58, column: 9)
!606 = distinct !DILexicalBlock(scope: !602, file: !578, line: 57, column: 12)
!607 = !DILocation(line: 0, scope: !577)
!608 = !DILocation(line: 49, column: 14, scope: !577)
!609 = !DILocation(line: 49, column: 19, scope: !577)
!610 = !DILocation(line: 49, column: 22, scope: !577)
!611 = !{!612, !612, i64 0}
!612 = !{!"long long", !613, i64 0}
!613 = !{!"omnipotent char", !614, i64 0}
!614 = !{!"Simple C++ TBAA"}
!615 = !DILocation(line: 49, column: 37, scope: !577)
!616 = !DILocation(line: 49, column: 5, scope: !577)
!617 = !DILocation(line: 50, column: 10, scope: !618)
!618 = distinct !DILexicalBlock(scope: !577, file: !578, line: 49, column: 43)
!619 = distinct !{!619, !616, !620, !621}
!620 = !DILocation(line: 51, column: 5, scope: !577)
!621 = !{!"llvm.loop.mustprogress"}
!622 = !DILocation(line: 53, column: 11, scope: !602)
!623 = !DILocation(line: 53, column: 9, scope: !577)
!624 = !DILocation(line: 0, scope: !605)
!625 = !DILocation(line: 58, column: 34, scope: !626)
!626 = distinct !DILexicalBlock(scope: !605, file: !578, line: 58, column: 9)
!627 = !DILocation(line: 58, column: 32, scope: !626)
!628 = !DILocation(line: 58, column: 9, scope: !605)
!629 = !DILocation(line: 54, column: 42, scope: !601)
!630 = !{!631, !612, i64 0}
!631 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !612, i64 0, !612, i64 8, !612, i64 16, !613, i64 24, !613, i64 152, !613, i64 280, !612, i64 408}
!632 = !DILocation(line: 54, column: 46, scope: !601)
!633 = !DILocation(line: 54, column: 28, scope: !601)
!634 = !DILocation(line: 0, scope: !601)
!635 = !DILocation(line: 55, column: 34, scope: !601)
!636 = !{!631, !612, i64 8}
!637 = !DILocation(line: 55, column: 38, scope: !601)
!638 = !DILocation(line: 55, column: 20, scope: !601)
!639 = !DILocation(line: 56, column: 31, scope: !601)
!640 = !{!631, !612, i64 408}
!641 = !DILocation(line: 56, column: 9, scope: !601)
!642 = !DILocation(line: 57, column: 5, scope: !601)
!643 = !DILocation(line: 59, column: 13, scope: !644)
!644 = distinct !DILexicalBlock(scope: !626, file: !578, line: 58, column: 55)
!645 = !DILocation(line: 60, column: 24, scope: !644)
!646 = !DILocation(line: 60, column: 21, scope: !644)
!647 = !DILocation(line: 61, column: 24, scope: !644)
!648 = !DILocation(line: 61, column: 21, scope: !644)
!649 = !DILocation(line: 58, column: 51, scope: !626)
!650 = distinct !{!650, !628, !651, !621}
!651 = !DILocation(line: 62, column: 9, scope: !605)
!652 = !DILocation(line: 64, column: 1, scope: !577)
!653 = !DISubprogram(name: "memcpy", scope: !37, file: !37, line: 94, type: !654, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !656)
!654 = !DISubroutineType(types: !655)
!655 = !{!127, !127, !446, !314}
!656 = !{}
!657 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !578, line: 66, type: !658, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !581, !127}
!660 = !{!661, !662}
!661 = !DILocalVariable(name: "copy", arg: 1, scope: !657, file: !578, line: 66, type: !581)
!662 = !DILocalVariable(name: "user_context", arg: 2, scope: !657, file: !578, line: 66, type: !127)
!663 = !DILocation(line: 0, scope: !657)
!664 = !DILocation(line: 68, column: 14, scope: !665)
!665 = distinct !DILexicalBlock(scope: !657, file: !578, line: 68, column: 9)
!666 = !DILocation(line: 68, column: 26, scope: !665)
!667 = !DILocation(line: 68, column: 18, scope: !665)
!668 = !DILocation(line: 68, column: 9, scope: !657)
!669 = !DILocation(line: 69, column: 58, scope: !670)
!670 = distinct !DILexicalBlock(scope: !665, file: !578, line: 68, column: 31)
!671 = !{!631, !612, i64 16}
!672 = !DILocation(line: 69, column: 9, scope: !670)
!673 = !DILocation(line: 70, column: 5, scope: !670)
!674 = !DILocalVariable(name: "this", arg: 1, scope: !675, type: !679, flags: DIFlagArtificial | DIFlagObjectPointer)
!675 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !403, file: !401, line: 37, type: !415, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !414, retainedNodes: !676)
!676 = !{!674, !677, !678}
!677 = !DILocalVariable(name: "ctx", arg: 2, scope: !675, file: !401, line: 37, type: !127)
!678 = !DILocalVariable(name: "mem", arg: 3, scope: !675, file: !401, line: 37, type: !195)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!680 = !DILocation(line: 0, scope: !675, inlinedAt: !681)
!681 = distinct !DILocation(line: 71, column: 9, scope: !682)
!682 = distinct !DILexicalBlock(scope: !665, file: !578, line: 70, column: 12)
!683 = !DILocation(line: 44, column: 27, scope: !684, inlinedAt: !681)
!684 = distinct !DILexicalBlock(scope: !685, file: !401, line: 43, column: 16)
!685 = distinct !DILexicalBlock(scope: !686, file: !401, line: 41, column: 20)
!686 = distinct !DILexicalBlock(scope: !687, file: !401, line: 39, column: 13)
!687 = distinct !DILexicalBlock(scope: !675, file: !401, line: 38, column: 54)
!688 = !DILocation(line: 48, column: 13, scope: !689, inlinedAt: !681)
!689 = distinct !DILexicalBlock(scope: !687, file: !401, line: 48, column: 13)
!690 = !DILocation(line: 48, column: 13, scope: !687, inlinedAt: !681)
!691 = !DILocalVariable(name: "this", arg: 1, scope: !692, type: !679, flags: DIFlagArtificial | DIFlagObjectPointer)
!692 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !403, file: !401, line: 57, type: !419, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !418, retainedNodes: !693)
!693 = !{!691, !694}
!694 = !DILocalVariable(name: "arg", arg: 2, scope: !692, file: !401, line: 57, type: !183)
!695 = !DILocation(line: 0, scope: !692, inlinedAt: !696)
!696 = distinct !DILocation(line: 71, column: 29, scope: !682)
!697 = !DILocation(line: 62, column: 19, scope: !698, inlinedAt: !696)
!698 = distinct !DILexicalBlock(scope: !699, file: !401, line: 61, column: 16)
!699 = distinct !DILexicalBlock(scope: !692, file: !401, line: 59, column: 13)
!700 = !DILocalVariable(name: "this", arg: 1, scope: !701, type: !679, flags: DIFlagArtificial | DIFlagObjectPointer)
!701 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !403, file: !401, line: 166, type: !465, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !478, retainedNodes: !702)
!702 = !{!700}
!703 = !DILocation(line: 0, scope: !701, inlinedAt: !704)
!704 = distinct !DILocation(line: 71, column: 9, scope: !682)
!705 = !DILocation(line: 168, column: 13, scope: !706, inlinedAt: !704)
!706 = distinct !DILexicalBlock(scope: !707, file: !401, line: 167, column: 19)
!707 = distinct !DILexicalBlock(scope: !708, file: !401, line: 167, column: 13)
!708 = distinct !DILexicalBlock(scope: !701, file: !401, line: 166, column: 16)
!709 = !DILocation(line: 169, column: 9, scope: !706, inlinedAt: !704)
!710 = !DILocation(line: 49, column: 23, scope: !711, inlinedAt: !681)
!711 = distinct !DILexicalBlock(scope: !689, file: !401, line: 48, column: 18)
!712 = !DILocation(line: 50, column: 18, scope: !711, inlinedAt: !681)
!713 = !{!613, !613, i64 0}
!714 = !DILocalVariable(name: "this", arg: 1, scope: !715, type: !679, flags: DIFlagArtificial | DIFlagObjectPointer)
!715 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !403, file: !401, line: 162, type: !465, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !477, retainedNodes: !716)
!716 = !{!714}
!717 = !DILocation(line: 0, scope: !715, inlinedAt: !718)
!718 = distinct !DILocation(line: 170, column: 13, scope: !719, inlinedAt: !704)
!719 = distinct !DILexicalBlock(scope: !707, file: !401, line: 169, column: 16)
!720 = !DILocation(line: 163, column: 81, scope: !715, inlinedAt: !718)
!721 = !DILocation(line: 163, column: 87, scope: !715, inlinedAt: !718)
!722 = !DILocation(line: 163, column: 15, scope: !715, inlinedAt: !718)
!723 = !DILocation(line: 174, column: 17, scope: !724, inlinedAt: !704)
!724 = distinct !DILexicalBlock(scope: !725, file: !401, line: 173, column: 46)
!725 = distinct !DILexicalBlock(scope: !726, file: !401, line: 173, column: 24)
!726 = distinct !DILexicalBlock(scope: !719, file: !401, line: 171, column: 17)
!727 = !DILocation(line: 181, column: 13, scope: !728, inlinedAt: !704)
!728 = distinct !DILexicalBlock(scope: !729, file: !401, line: 180, column: 40)
!729 = distinct !DILexicalBlock(scope: !708, file: !401, line: 180, column: 13)
!730 = !DILocation(line: 73, column: 1, scope: !657)
!731 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !578, line: 76, type: !732, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !735)
!732 = !DISubroutineType(types: !733)
!733 = !{!583, !734, !10, !734, !10}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!735 = !{!736, !737, !738, !739, !740, !741, !743, !745, !748, !751, !753, !756, !757, !758, !760}
!736 = !DILocalVariable(name: "src", arg: 1, scope: !731, file: !578, line: 76, type: !734)
!737 = !DILocalVariable(name: "src_host", arg: 2, scope: !731, file: !578, line: 76, type: !10)
!738 = !DILocalVariable(name: "dst", arg: 3, scope: !731, file: !578, line: 77, type: !734)
!739 = !DILocalVariable(name: "dst_host", arg: 4, scope: !731, file: !578, line: 77, type: !10)
!740 = !DILocalVariable(name: "c", scope: !731, file: !578, line: 79, type: !583)
!741 = !DILocalVariable(name: "i", scope: !742, file: !578, line: 83, type: !63)
!742 = distinct !DILexicalBlock(scope: !731, file: !578, line: 83, column: 5)
!743 = !DILocalVariable(name: "i", scope: !744, file: !578, line: 91, type: !63)
!744 = distinct !DILexicalBlock(scope: !731, file: !578, line: 91, column: 5)
!745 = !DILocalVariable(name: "zero", scope: !746, file: !578, line: 100, type: !583)
!746 = distinct !DILexicalBlock(scope: !747, file: !578, line: 98, column: 42)
!747 = distinct !DILexicalBlock(scope: !731, file: !578, line: 96, column: 9)
!748 = !DILocalVariable(name: "zero", scope: !749, file: !578, line: 107, type: !583)
!749 = distinct !DILexicalBlock(scope: !750, file: !578, line: 104, column: 28)
!750 = distinct !DILexicalBlock(scope: !731, file: !578, line: 104, column: 9)
!751 = !DILocalVariable(name: "i", scope: !752, file: !578, line: 115, type: !63)
!752 = distinct !DILexicalBlock(scope: !731, file: !578, line: 115, column: 5)
!753 = !DILocalVariable(name: "dst_stride_bytes", scope: !754, file: !578, line: 117, type: !212)
!754 = distinct !DILexicalBlock(scope: !755, file: !578, line: 115, column: 47)
!755 = distinct !DILexicalBlock(scope: !752, file: !578, line: 115, column: 5)
!756 = !DILocalVariable(name: "src_stride_bytes", scope: !754, file: !578, line: 118, type: !212)
!757 = !DILocalVariable(name: "insert", scope: !754, file: !578, line: 120, type: !63)
!758 = !DILocalVariable(name: "j", scope: !759, file: !578, line: 128, type: !63)
!759 = distinct !DILexicalBlock(scope: !754, file: !578, line: 128, column: 9)
!760 = !DILocalVariable(name: "j", scope: !761, file: !578, line: 151, type: !63)
!761 = distinct !DILexicalBlock(scope: !762, file: !578, line: 151, column: 9)
!762 = distinct !DILexicalBlock(scope: !731, file: !578, line: 145, column: 51)
!763 = !DILocation(line: 0, scope: !731)
!764 = !DILocation(line: 79, column: 5, scope: !731)
!765 = !DILocation(line: 79, column: 17, scope: !731)
!766 = !DILocation(line: 80, column: 13, scope: !731)
!767 = !DILocation(line: 80, column: 39, scope: !731)
!768 = !{!769, !770, i64 16}
!769 = !{!"_ZTS15halide_buffer_t", !612, i64 0, !770, i64 8, !770, i64 16, !612, i64 24, !771, i64 32, !774, i64 36, !770, i64 40, !770, i64 48}
!770 = !{!"any pointer", !613, i64 0}
!771 = !{!"_ZTS13halide_type_t", !772, i64 0, !613, i64 1, !773, i64 2}
!772 = !{!"_ZTS18halide_type_code_t", !613, i64 0}
!773 = !{!"short", !613, i64 0}
!774 = !{!"int", !613, i64 0}
!775 = !DILocation(line: 80, column: 24, scope: !731)
!776 = !DILocation(line: 80, column: 51, scope: !731)
!777 = !{!769, !612, i64 0}
!778 = !DILocation(line: 80, column: 7, scope: !731)
!779 = !DILocation(line: 80, column: 11, scope: !731)
!780 = !DILocation(line: 81, column: 13, scope: !731)
!781 = !DILocation(line: 81, column: 39, scope: !731)
!782 = !DILocation(line: 81, column: 24, scope: !731)
!783 = !DILocation(line: 81, column: 51, scope: !731)
!784 = !DILocation(line: 81, column: 7, scope: !731)
!785 = !DILocation(line: 81, column: 11, scope: !731)
!786 = !DILocalVariable(name: "this", arg: 1, scope: !787, type: !789, flags: DIFlagArtificial | DIFlagObjectPointer)
!787 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !222, file: !202, line: 481, type: !256, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !255, retainedNodes: !788)
!788 = !{!786}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!790 = !DILocation(line: 0, scope: !787, inlinedAt: !791)
!791 = distinct !DILocation(line: 82, column: 30, scope: !731)
!792 = !DILocation(line: 482, column: 17, scope: !787, inlinedAt: !791)
!793 = !{!771, !613, i64 1}
!794 = !DILocation(line: 482, column: 22, scope: !787, inlinedAt: !791)
!795 = !DILocation(line: 482, column: 27, scope: !787, inlinedAt: !791)
!796 = !DILocation(line: 82, column: 20, scope: !731)
!797 = !DILocation(line: 82, column: 7, scope: !731)
!798 = !DILocation(line: 82, column: 18, scope: !731)
!799 = !DILocation(line: 0, scope: !742)
!800 = !DILocation(line: 84, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !578, line: 83, column: 45)
!802 = distinct !DILexicalBlock(scope: !742, file: !578, line: 83, column: 5)
!803 = !DILocation(line: 84, column: 21, scope: !801)
!804 = !DILocation(line: 85, column: 9, scope: !801)
!805 = !DILocation(line: 85, column: 31, scope: !801)
!806 = !DILocation(line: 86, column: 9, scope: !801)
!807 = !DILocation(line: 86, column: 31, scope: !801)
!808 = !DILocation(line: 90, column: 7, scope: !731)
!809 = !DILocation(line: 0, scope: !744)
!810 = !DILocation(line: 91, column: 30, scope: !811)
!811 = distinct !DILexicalBlock(scope: !744, file: !578, line: 91, column: 5)
!812 = !{!769, !774, i64 36}
!813 = !DILocation(line: 91, column: 23, scope: !811)
!814 = !DILocation(line: 91, column: 5, scope: !744)
!815 = !{!769, !770, i64 40}
!816 = !DILocation(line: 94, column: 17, scope: !731)
!817 = !DILocation(line: 94, column: 22, scope: !731)
!818 = !DILocation(line: 96, column: 33, scope: !747)
!819 = !DILocation(line: 96, column: 25, scope: !747)
!820 = !DILocation(line: 96, column: 44, scope: !747)
!821 = !DILocation(line: 92, column: 46, scope: !822)
!822 = distinct !DILexicalBlock(scope: !811, file: !578, line: 91, column: 47)
!823 = !{!824, !774, i64 8}
!824 = !{!"_ZTS18halide_dimension_t", !774, i64 0, !774, i64 4, !774, i64 8, !774, i64 12}
!825 = !DILocation(line: 92, column: 34, scope: !822)
!826 = !DILocation(line: 92, column: 68, scope: !822)
!827 = !{!824, !774, i64 0}
!828 = !DILocation(line: 92, column: 86, scope: !822)
!829 = !DILocation(line: 92, column: 72, scope: !822)
!830 = !DILocation(line: 92, column: 55, scope: !822)
!831 = !DILocation(line: 92, column: 53, scope: !822)
!832 = !DILocation(line: 92, column: 21, scope: !822)
!833 = !DILocation(line: 91, column: 43, scope: !811)
!834 = distinct !{!834, !814, !835, !621}
!835 = !DILocation(line: 93, column: 5, scope: !744)
!836 = !DILocation(line: 0, scope: !787, inlinedAt: !837)
!837 = distinct !DILocation(line: 97, column: 19, scope: !747)
!838 = !DILocation(line: 0, scope: !787, inlinedAt: !839)
!839 = distinct !DILocation(line: 97, column: 40, scope: !747)
!840 = !DILocation(line: 482, column: 17, scope: !787, inlinedAt: !839)
!841 = !DILocation(line: 482, column: 22, scope: !787, inlinedAt: !839)
!842 = !DILocation(line: 482, column: 27, scope: !787, inlinedAt: !839)
!843 = !DILocation(line: 97, column: 27, scope: !747)
!844 = !DILocation(line: 97, column: 48, scope: !747)
!845 = !DILocation(line: 100, column: 21, scope: !746)
!846 = !DILocation(line: 101, column: 9, scope: !746)
!847 = !DILocation(line: 104, column: 22, scope: !750)
!848 = !DILocation(line: 104, column: 9, scope: !731)
!849 = !DILocation(line: 0, scope: !752)
!850 = !DILocation(line: 115, column: 5, scope: !752)
!851 = !DILocation(line: 115, column: 23, scope: !755)
!852 = !DILocation(line: 107, column: 21, scope: !749)
!853 = !DILocation(line: 108, column: 9, scope: !749)
!854 = !DILocation(line: 144, column: 14, scope: !731)
!855 = !DILocation(line: 144, column: 28, scope: !731)
!856 = !DILocation(line: 144, column: 25, scope: !731)
!857 = !DILocation(line: 144, column: 50, scope: !731)
!858 = !DILocation(line: 145, column: 28, scope: !731)
!859 = !DILocation(line: 117, column: 59, scope: !754)
!860 = !DILocation(line: 117, column: 47, scope: !754)
!861 = !DILocation(line: 0, scope: !787, inlinedAt: !862)
!862 = distinct !DILocation(line: 117, column: 78, scope: !754)
!863 = !DILocation(line: 117, column: 66, scope: !754)
!864 = !DILocation(line: 0, scope: !754)
!865 = !DILocation(line: 118, column: 59, scope: !754)
!866 = !DILocation(line: 118, column: 47, scope: !754)
!867 = !DILocation(line: 0, scope: !787, inlinedAt: !868)
!868 = distinct !DILocation(line: 118, column: 78, scope: !754)
!869 = !DILocation(line: 118, column: 66, scope: !754)
!870 = !DILocation(line: 121, column: 33, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !578, line: 121, column: 9)
!872 = distinct !DILexicalBlock(scope: !754, file: !578, line: 121, column: 9)
!873 = !DILocation(line: 121, column: 9, scope: !872)
!874 = !DILocation(line: 128, column: 27, scope: !875)
!875 = distinct !DILexicalBlock(scope: !759, file: !578, line: 128, column: 9)
!876 = !DILocation(line: 124, column: 36, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !578, line: 124, column: 17)
!878 = distinct !DILexicalBlock(scope: !871, file: !578, line: 121, column: 48)
!879 = !DILocation(line: 124, column: 34, scope: !877)
!880 = !DILocation(line: 124, column: 63, scope: !877)
!881 = !DILocation(line: 121, column: 44, scope: !871)
!882 = distinct !{!882, !873, !883, !621}
!883 = !DILocation(line: 127, column: 9, scope: !872)
!884 = !DILocation(line: 0, scope: !872)
!885 = !DILocation(line: 0, scope: !759)
!886 = !DILocation(line: 128, column: 9, scope: !759)
!887 = !DILocation(line: 133, column: 40, scope: !754)
!888 = !{!824, !774, i64 4}
!889 = !DILocation(line: 133, column: 28, scope: !754)
!890 = !DILocation(line: 133, column: 9, scope: !754)
!891 = !DILocation(line: 133, column: 26, scope: !754)
!892 = !DILocation(line: 135, column: 9, scope: !754)
!893 = !DILocation(line: 135, column: 36, scope: !754)
!894 = !DILocation(line: 136, column: 9, scope: !754)
!895 = !DILocation(line: 136, column: 36, scope: !754)
!896 = !DILocation(line: 115, column: 43, scope: !755)
!897 = distinct !{!897, !850, !898, !621}
!898 = !DILocation(line: 137, column: 5, scope: !752)
!899 = !DILocation(line: 129, column: 38, scope: !900)
!900 = distinct !DILexicalBlock(scope: !875, file: !578, line: 128, column: 42)
!901 = !DILocation(line: 129, column: 27, scope: !900)
!902 = !DILocation(line: 129, column: 13, scope: !900)
!903 = !DILocation(line: 129, column: 25, scope: !900)
!904 = !DILocation(line: 130, column: 37, scope: !900)
!905 = !DILocation(line: 130, column: 13, scope: !900)
!906 = !DILocation(line: 130, column: 35, scope: !900)
!907 = !DILocation(line: 131, column: 37, scope: !900)
!908 = !DILocation(line: 131, column: 13, scope: !900)
!909 = !DILocation(line: 131, column: 35, scope: !900)
!910 = distinct !{!910, !886, !911, !621}
!911 = !DILocation(line: 132, column: 9, scope: !759)
!912 = !DILocation(line: 145, column: 25, scope: !731)
!913 = !DILocation(line: 144, column: 5, scope: !731)
!914 = !DILocation(line: 147, column: 25, scope: !762)
!915 = !DILocation(line: 147, column: 22, scope: !762)
!916 = !DILocation(line: 0, scope: !761)
!917 = !DILocation(line: 152, column: 31, scope: !918)
!918 = distinct !DILexicalBlock(scope: !919, file: !578, line: 151, column: 49)
!919 = distinct !DILexicalBlock(scope: !761, file: !578, line: 151, column: 9)
!920 = !DILocation(line: 152, column: 29, scope: !918)
!921 = !DILocation(line: 153, column: 41, scope: !918)
!922 = !DILocation(line: 153, column: 39, scope: !918)
!923 = !DILocation(line: 154, column: 41, scope: !918)
!924 = !DILocation(line: 154, column: 39, scope: !918)
!925 = !DILocation(line: 156, column: 37, scope: !762)
!926 = !DILocation(line: 157, column: 47, scope: !762)
!927 = !DILocation(line: 158, column: 47, scope: !762)
!928 = distinct !{!928, !913, !929, !621}
!929 = !DILocation(line: 159, column: 5, scope: !731)
!930 = !DILocation(line: 160, column: 12, scope: !731)
!931 = !{i64 0, i64 8, !611, i64 8, i64 8, !611, i64 16, i64 8, !611, i64 24, i64 128, !713, i64 152, i64 128, !713, i64 280, i64 128, !713, i64 408, i64 8, !611}
!932 = !DILocation(line: 160, column: 5, scope: !731)
!933 = !DILocation(line: 161, column: 1, scope: !731)
!934 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !578, line: 163, type: !935, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !937)
!935 = !DISubroutineType(types: !936)
!936 = !{!583, !734}
!937 = !{!938}
!938 = !DILocalVariable(name: "buf", arg: 1, scope: !934, file: !578, line: 163, type: !734)
!939 = !DILocation(line: 0, scope: !934)
!940 = !DILocation(line: 164, column: 12, scope: !934)
!941 = !DILocation(line: 164, column: 5, scope: !934)
!942 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !578, line: 167, type: !935, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !943)
!943 = !{!944}
!944 = !DILocalVariable(name: "buf", arg: 1, scope: !942, file: !578, line: 167, type: !734)
!945 = !DILocation(line: 0, scope: !942)
!946 = !DILocation(line: 168, column: 12, scope: !942)
!947 = !DILocation(line: 168, column: 5, scope: !942)
!948 = distinct !DISubprogram(name: "gl_error_name", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute13gl_error_nameEi", scope: !2, file: !6, line: 59, type: !949, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{!183, !263}
!951 = !{!952}
!952 = !DILocalVariable(name: "err", arg: 1, scope: !948, file: !6, line: 59, type: !263)
!953 = !DILocation(line: 0, scope: !948)
!954 = !DILocation(line: 60, column: 5, scope: !948)
!955 = !DILocation(line: 65, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !948, file: !6, line: 60, column: 18)
!957 = !DILocation(line: 68, column: 9, scope: !956)
!958 = !DILocation(line: 71, column: 9, scope: !956)
!959 = !DILocation(line: 74, column: 9, scope: !956)
!960 = !DILocation(line: 77, column: 9, scope: !956)
!961 = !DILocation(line: 80, column: 9, scope: !956)
!962 = !DILocation(line: 83, column: 9, scope: !956)
!963 = !DILocation(line: 86, column: 9, scope: !956)
!964 = !DILocation(line: 89, column: 5, scope: !948)
!965 = !DILocation(line: 90, column: 1, scope: !948)
!966 = distinct !DISubprogram(name: "find_kernel_by_name", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute19find_kernel_by_nameEPKcPKNS2_11ModuleStateE", scope: !2, file: !6, line: 114, type: !967, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !971)
!967 = !DISubroutineType(types: !968)
!968 = !{!191, !183, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!971 = !{!972, !973, !974}
!972 = !DILocalVariable(name: "kernel_name", arg: 1, scope: !966, file: !6, line: 114, type: !183)
!973 = !DILocalVariable(name: "module", arg: 2, scope: !966, file: !6, line: 114, type: !969)
!974 = !DILocalVariable(name: "kernel", scope: !966, file: !6, line: 115, type: !191)
!975 = !DILocation(line: 0, scope: !966)
!976 = !DILocation(line: 115, column: 34, scope: !966)
!977 = !{!770, !770, i64 0}
!978 = !DILocation(line: 116, column: 12, scope: !966)
!979 = !DILocation(line: 116, column: 19, scope: !966)
!980 = !DILocation(line: 116, column: 50, scope: !966)
!981 = !{!982, !770, i64 0}
!982 = !{!"_ZTSN6Halide7Runtime8Internal13OpenGLCompute10KernelInfoE", !770, i64 0, !774, i64 8, !770, i64 16}
!983 = !DILocation(line: 116, column: 22, scope: !966)
!984 = !DILocation(line: 116, column: 63, scope: !966)
!985 = !DILocation(line: 116, column: 5, scope: !966)
!986 = !DILocation(line: 117, column: 26, scope: !987)
!987 = distinct !DILexicalBlock(scope: !966, file: !6, line: 116, column: 69)
!988 = distinct !{!988, !985, !989, !621}
!989 = !DILocation(line: 118, column: 5, scope: !966)
!990 = !DILocation(line: 119, column: 5, scope: !966)
!991 = !DISubprogram(name: "strcmp", scope: !37, file: !37, line: 90, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !656)
!992 = !DISubroutineType(types: !993)
!993 = !{!63, !183, !183}
!994 = distinct !DISubprogram(name: "CheckAndReportError", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute11GlobalState19CheckAndReportErrorEPvPKc", scope: !7, file: !6, line: 135, type: !181, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !180, retainedNodes: !995)
!995 = !{!996, !998, !999, !1000}
!996 = !DILocalVariable(name: "this", arg: 1, scope: !994, type: !997, flags: DIFlagArtificial | DIFlagObjectPointer)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!998 = !DILocalVariable(name: "user_context", arg: 2, scope: !994, file: !6, line: 135, type: !127)
!999 = !DILocalVariable(name: "location", arg: 3, scope: !994, file: !6, line: 135, type: !183)
!1000 = !DILocalVariable(name: "err", scope: !994, file: !6, line: 136, type: !24)
!1001 = !DILocation(line: 0, scope: !994)
!1002 = !DILocation(line: 136, column: 18, scope: !994)
!1003 = !{!1004, !770, i64 112}
!1004 = !{!"_ZTSN6Halide7Runtime8Internal13OpenGLCompute11GlobalStateE", !1005, i64 0, !770, i64 8, !770, i64 16, !770, i64 24, !770, i64 32, !770, i64 40, !770, i64 48, !770, i64 56, !770, i64 64, !770, i64 72, !770, i64 80, !770, i64 88, !770, i64 96, !770, i64 104, !770, i64 112, !770, i64 120, !770, i64 128, !770, i64 136, !770, i64 144, !770, i64 152, !770, i64 160, !770, i64 168, !770, i64 176, !770, i64 184, !770, i64 192, !770, i64 200, !770, i64 208, !770, i64 216, !770, i64 224, !770, i64 232, !770, i64 240}
!1005 = !{!"bool", !613, i64 0}
!1006 = !DILocation(line: 137, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !994, file: !6, line: 137, column: 9)
!1008 = !DILocation(line: 137, column: 9, scope: !994)
!1009 = !DILocalVariable(name: "this", arg: 1, scope: !1010, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1010 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EEC2EPvPc", scope: !483, file: !401, line: 37, type: !492, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !491, retainedNodes: !1011)
!1011 = !{!1009, !1012, !1013}
!1012 = !DILocalVariable(name: "ctx", arg: 2, scope: !1010, file: !401, line: 37, type: !127)
!1013 = !DILocalVariable(name: "mem", arg: 3, scope: !1010, file: !401, line: 37, type: !195)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!1015 = !DILocation(line: 0, scope: !1010, inlinedAt: !1016)
!1016 = distinct !DILocation(line: 138, column: 9, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1007, file: !6, line: 137, column: 29)
!1018 = !DILocation(line: 44, column: 27, scope: !1019, inlinedAt: !1016)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !401, line: 43, column: 16)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !401, line: 41, column: 20)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !401, line: 39, column: 13)
!1022 = distinct !DILexicalBlock(scope: !1010, file: !401, line: 38, column: 54)
!1023 = !DILocation(line: 48, column: 13, scope: !1024, inlinedAt: !1016)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !401, line: 48, column: 13)
!1025 = !DILocation(line: 48, column: 13, scope: !1022, inlinedAt: !1016)
!1026 = !DILocation(line: 49, column: 23, scope: !1027, inlinedAt: !1016)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !401, line: 48, column: 18)
!1028 = !DILocation(line: 50, column: 18, scope: !1027, inlinedAt: !1016)
!1029 = !DILocation(line: 51, column: 9, scope: !1027, inlinedAt: !1016)
!1030 = !DILocation(line: 0, scope: !1024, inlinedAt: !1016)
!1031 = !DILocalVariable(name: "this", arg: 1, scope: !1032, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1032 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !483, file: !401, line: 57, type: !496, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !495, retainedNodes: !1033)
!1033 = !{!1031, !1034}
!1034 = !DILocalVariable(name: "arg", arg: 2, scope: !1032, file: !401, line: 57, type: !183)
!1035 = !DILocation(line: 0, scope: !1032, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 139, column: 13, scope: !1017)
!1037 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1036)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !401, line: 61, column: 16)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !401, line: 59, column: 13)
!1040 = !DILocation(line: 139, column: 35, scope: !1017)
!1041 = !DILocation(line: 0, scope: !1032, inlinedAt: !1042)
!1042 = distinct !DILocation(line: 139, column: 32, scope: !1017)
!1043 = !DILocation(line: 59, column: 17, scope: !1039, inlinedAt: !1042)
!1044 = !DILocation(line: 59, column: 13, scope: !1032, inlinedAt: !1042)
!1045 = !DILocation(line: 60, column: 19, scope: !1046, inlinedAt: !1042)
!1046 = distinct !DILexicalBlock(scope: !1039, file: !401, line: 59, column: 29)
!1047 = !DILocation(line: 61, column: 9, scope: !1046, inlinedAt: !1042)
!1048 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1042)
!1049 = !DILocation(line: 0, scope: !1039, inlinedAt: !1042)
!1050 = !DILocation(line: 0, scope: !1032, inlinedAt: !1051)
!1051 = distinct !DILocation(line: 140, column: 13, scope: !1017)
!1052 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1051)
!1053 = !DILocalVariable(name: "this", arg: 1, scope: !1054, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1054 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !483, file: !401, line: 72, type: !503, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !502, retainedNodes: !1055)
!1055 = !{!1053, !1056}
!1056 = !DILocalVariable(name: "arg", arg: 2, scope: !1054, file: !401, line: 72, type: !263)
!1057 = !DILocation(line: 0, scope: !1054, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 140, column: 20, scope: !1017)
!1059 = !DILocation(line: 73, column: 48, scope: !1054, inlinedAt: !1058)
!1060 = !DILocation(line: 73, column: 15, scope: !1054, inlinedAt: !1058)
!1061 = !DILocation(line: 0, scope: !1032, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 140, column: 32, scope: !1017)
!1063 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1062)
!1064 = !DILocation(line: 0, scope: !1032, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 141, column: 13, scope: !1017)
!1066 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1065)
!1067 = !DILocation(line: 0, scope: !1032, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 141, column: 23, scope: !1017)
!1069 = !DILocation(line: 59, column: 17, scope: !1039, inlinedAt: !1068)
!1070 = !DILocation(line: 59, column: 13, scope: !1032, inlinedAt: !1068)
!1071 = !DILocation(line: 60, column: 19, scope: !1046, inlinedAt: !1068)
!1072 = !DILocation(line: 61, column: 9, scope: !1046, inlinedAt: !1068)
!1073 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1068)
!1074 = !DILocation(line: 0, scope: !1039, inlinedAt: !1068)
!1075 = !DILocation(line: 0, scope: !1032, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 141, column: 35, scope: !1017)
!1077 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1076)
!1078 = !DILocalVariable(name: "this", arg: 1, scope: !1079, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1079 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EED2Ev", scope: !483, file: !401, line: 166, type: !533, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !546, retainedNodes: !1080)
!1080 = !{!1078}
!1081 = !DILocation(line: 0, scope: !1079, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 138, column: 9, scope: !1017)
!1083 = !DILocation(line: 167, column: 13, scope: !1084, inlinedAt: !1082)
!1084 = distinct !DILexicalBlock(scope: !1079, file: !401, line: 166, column: 16)
!1085 = !DILocation(line: 168, column: 13, scope: !1086, inlinedAt: !1082)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !401, line: 167, column: 19)
!1087 = distinct !DILexicalBlock(scope: !1084, file: !401, line: 167, column: 13)
!1088 = !DILocation(line: 169, column: 9, scope: !1086, inlinedAt: !1082)
!1089 = !DILocalVariable(name: "this", arg: 1, scope: !1090, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1090 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !483, file: !401, line: 162, type: !533, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !396, declaration: !545, retainedNodes: !1091)
!1091 = !{!1089}
!1092 = !DILocation(line: 0, scope: !1090, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 170, column: 13, scope: !1094, inlinedAt: !1082)
!1094 = distinct !DILexicalBlock(scope: !1087, file: !401, line: 169, column: 16)
!1095 = !DILocation(line: 163, column: 81, scope: !1090, inlinedAt: !1093)
!1096 = !DILocation(line: 163, column: 87, scope: !1090, inlinedAt: !1093)
!1097 = !DILocation(line: 163, column: 15, scope: !1090, inlinedAt: !1093)
!1098 = !DILocation(line: 172, column: 17, scope: !1099, inlinedAt: !1082)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !401, line: 171, column: 39)
!1100 = distinct !DILexicalBlock(scope: !1094, file: !401, line: 171, column: 17)
!1101 = !DILocation(line: 181, column: 13, scope: !1102, inlinedAt: !1082)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !401, line: 180, column: 40)
!1103 = distinct !DILexicalBlock(scope: !1084, file: !401, line: 180, column: 13)
!1104 = !DILocation(line: 142, column: 9, scope: !1017)
!1105 = !DILocation(line: 145, column: 1, scope: !994)
!1106 = distinct !DISubprogram(name: "debug_buffer", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute12debug_bufferEPvP15halide_buffer_t", scope: !2, file: !6, line: 154, type: !1107, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !1109)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !127, !560}
!1109 = !{!1110, !1111}
!1110 = !DILocalVariable(name: "user_context", arg: 1, scope: !1106, file: !6, line: 154, type: !127)
!1111 = !DILocalVariable(name: "buf", arg: 2, scope: !1106, file: !6, line: 154, type: !560)
!1112 = !DILocation(line: 0, scope: !1106)
!1113 = !DILocation(line: 155, column: 5, scope: !1106)
!1114 = !DILocation(line: 0, scope: !675, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 155, column: 5, scope: !1106)
!1116 = !DILocation(line: 38, column: 11, scope: !675, inlinedAt: !1115)
!1117 = !{!1118, !770, i64 24}
!1118 = !{!"_ZTSN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEE", !770, i64 0, !770, i64 8, !770, i64 16, !770, i64 24, !1005, i64 32, !613, i64 33}
!1119 = !DILocation(line: 38, column: 30, scope: !675, inlinedAt: !1115)
!1120 = !{!1118, !1005, i64 32}
!1121 = !DILocation(line: 44, column: 27, scope: !684, inlinedAt: !1115)
!1122 = !DILocation(line: 44, column: 13, scope: !684, inlinedAt: !1115)
!1123 = !DILocation(line: 44, column: 17, scope: !684, inlinedAt: !1115)
!1124 = !{!1118, !770, i64 0}
