; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::HexagonDma::desc_pool" = type { i8*, i8, %"struct.Halide::Runtime::Internal::HexagonDma::desc_pool"* }
%struct.halide_mutex = type { [1 x i32] }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dma_desc_pool", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma13dma_desc_poolE", scope: !2, file: !6, line: 64, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "HexagonDma", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_dma.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdesc_pool", scope: !2, file: !6, line: 62, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "desc_pool_t", scope: !2, file: !6, line: 60, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "desc_pool", scope: !2, file: !6, line: 56, size: 96, flags: DIFlagTypePassByValue, elements: !11, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma9desc_poolE")
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !10, file: !6, line: 57, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !10, file: !6, line: 58, baseType: !15, size: 8, offset: 32)
!15 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !6, line: 59, baseType: !17, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "hexagon_desc_mutex", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma18hexagon_desc_mutexE", scope: !2, file: !6, line: 65, type: !20, isLocal: false, isDefinition: true)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !21, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !22, identifier: "_ZTS12halide_mutex")
!21 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !20, file: !21, line: 121, baseType: !24, size: 32)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, elements: !29)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 68, baseType: !27)
!26 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 12, baseType: !28)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !{!30}
!30 = !DISubrange(count: 1)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "hexagon_dma_device_interface", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma28hexagon_dma_device_interfaceE", scope: !2, file: !6, line: 740, type: !33, isLocal: false, isDefinition: true)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !21, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !34, identifier: "_ZTS25halide_device_interface_t")
!34 = !{!35, !160, !164, !165, !169, !170, !171, !172, !173, !177, !182, !186, !187, !191, !192, !197}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !33, file: !21, line: 724, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !13, !40, !47}
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !21, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !42, identifier: "_ZTS15halide_buffer_t")
!42 = !{!43, !46, !49, !53, !54, !94, !96, !119, !120, !130, !134, !137, !138, !141, !142, !146, !149, !150, !151, !156, !159}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !41, file: !21, line: 1425, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !26, line: 10, baseType: !45)
!45 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !41, file: !21, line: 1428, baseType: !47, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !41, file: !21, line: 1433, baseType: !50, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !26, line: 16, baseType: !52)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !41, file: !21, line: 1436, baseType: !44, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !21, line: 1439, baseType: !55, size: 32, offset: 192)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !21, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !56, identifier: "_ZTS13halide_type_t")
!56 = !{!57, !66, !67, !70, !74, !77, !82, !86, !87, !88, !91}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !55, file: !21, line: 434, baseType: !58, size: 8, align: 8)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !21, line: 413, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !21, line: 403, baseType: !51, size: 8, elements: !60, identifier: "_ZTS18halide_type_code_t")
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !55, file: !21, line: 442, baseType: !51, size: 8, align: 8, offset: 8)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !55, file: !21, line: 446, baseType: !68, size: 16, align: 16, offset: 16)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 14, baseType: !69)
!69 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!70 = !DISubprogram(name: "halide_type_t", scope: !55, file: !21, line: 453, type: !71, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !58, !51, !68}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!74 = !DISubprogram(name: "halide_type_t", scope: !55, file: !21, line: 459, type: !75, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !73}
!77 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !55, file: !21, line: 463, type: !78, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!78 = !DISubroutineType(types: !79)
!79 = !{!55, !80, !68}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!82 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !55, file: !21, line: 468, type: !83, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!83 = !DISubroutineType(types: !84)
!84 = !{!15, !80, !85}
!85 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !81, size: 32)
!86 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !55, file: !21, line: 472, type: !83, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!87 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !55, file: !21, line: 476, type: !83, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !55, file: !21, line: 481, type: !89, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!89 = !DISubroutineType(types: !90)
!90 = !{!39, !80}
!91 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !55, file: !21, line: 485, type: !92, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubroutineType(types: !93)
!93 = !{!27, !80}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !41, file: !21, line: 1442, baseType: !95, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !26, line: 11, baseType: !39)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !41, file: !21, line: 1446, baseType: !97, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !21, line: 1409, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !21, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !100, identifier: "_ZTS18halide_dimension_t")
!100 = !{!101, !102, !103, !104, !105, !109, !112, !118}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !99, file: !21, line: 1383, baseType: !95, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !99, file: !21, line: 1383, baseType: !95, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !99, file: !21, line: 1383, baseType: !95, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !21, line: 1386, baseType: !27, size: 32, offset: 96)
!105 = !DISubprogram(name: "halide_dimension_t", scope: !99, file: !21, line: 1388, type: !106, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!109 = !DISubprogram(name: "halide_dimension_t", scope: !99, file: !21, line: 1389, type: !110, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !108, !95, !95, !95, !27}
!112 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !99, file: !21, line: 1393, type: !113, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{!15, !115, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!117 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !116, size: 32)
!118 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !99, file: !21, line: 1400, type: !113, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !41, file: !21, line: 1449, baseType: !13, size: 32, offset: 288)
!120 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !41, file: !21, line: 1454, type: !121, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!121 = !DISubroutineType(types: !122)
!122 = !{!15, !123, !125}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !21, line: 1416, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 1415, baseType: !28, size: 32, elements: !127, identifier: "_ZTS19halide_buffer_flags")
!127 = !{!128, !129}
!128 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!130 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !41, file: !21, line: 1458, type: !131, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !125, !15}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!134 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !41, file: !21, line: 1466, type: !135, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!135 = !DISubroutineType(types: !136)
!136 = !{!15, !123}
!137 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !41, file: !21, line: 1470, type: !135, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!138 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !41, file: !21, line: 1474, type: !139, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !133, !15}
!141 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !41, file: !21, line: 1478, type: !139, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !41, file: !21, line: 1485, type: !143, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !123}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 27, baseType: !28)
!146 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !41, file: !21, line: 1495, type: !147, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!147 = !DISubroutineType(types: !148)
!148 = !{!50, !123}
!149 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !41, file: !21, line: 1506, type: !147, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!150 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !41, file: !21, line: 1518, type: !143, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !41, file: !21, line: 1523, type: !152, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DISubroutineType(types: !153)
!153 = !{!50, !123, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!156 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !41, file: !21, line: 1534, type: !157, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!157 = !DISubroutineType(types: !158)
!158 = !{!39, !133, !13}
!159 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !41, file: !21, line: 1545, type: !135, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !33, file: !21, line: 726, baseType: !161, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!39, !13, !40}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !33, file: !21, line: 727, baseType: !161, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !33, file: !21, line: 728, baseType: !166, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !13, !47}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !33, file: !21, line: 730, baseType: !161, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !33, file: !21, line: 731, baseType: !36, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !33, file: !21, line: 733, baseType: !36, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !33, file: !21, line: 735, baseType: !161, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !33, file: !21, line: 736, baseType: !174, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{!39, !13, !40, !47, !40}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !33, file: !21, line: 738, baseType: !178, size: 32, offset: 288)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!39, !13, !181, !40}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !33, file: !21, line: 740, baseType: !183, size: 32, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!39, !13, !181, !39, !39, !40}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !33, file: !21, line: 742, baseType: !161, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !33, file: !21, line: 743, baseType: !188, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!39, !13, !40, !44, !47}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !33, file: !21, line: 745, baseType: !161, size: 32, offset: 416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !33, file: !21, line: 746, baseType: !193, size: 32, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!39, !13, !196, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !33, file: !21, line: 747, baseType: !198, size: 32, offset: 480)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !201, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !202, identifier: "_ZTS30halide_device_interface_impl_t")
!201 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!202 = !{!203, !207, !208, !209, !210, !211, !215, !216, !217, !218, !219, !220, !221, !222, !223, !227}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !200, file: !201, line: 16, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{null}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !200, file: !201, line: 17, baseType: !204, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !200, file: !201, line: 18, baseType: !161, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !200, file: !201, line: 19, baseType: !161, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !200, file: !201, line: 20, baseType: !161, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !200, file: !201, line: 21, baseType: !212, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{!39, !13}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !200, file: !201, line: 22, baseType: !161, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !200, file: !201, line: 23, baseType: !161, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !200, file: !201, line: 24, baseType: !161, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !200, file: !201, line: 25, baseType: !161, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !200, file: !201, line: 26, baseType: !174, size: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !200, file: !201, line: 28, baseType: !178, size: 32, offset: 352)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !200, file: !201, line: 31, baseType: !183, size: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !200, file: !201, line: 35, baseType: !161, size: 32, offset: 416)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !200, file: !201, line: 37, baseType: !224, size: 32, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!39, !13, !40, !44}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !200, file: !201, line: 38, baseType: !161, size: 32, offset: 480)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "hexagon_dma_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma33hexagon_dma_device_interface_implE", scope: !2, file: !6, line: 721, type: !200, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !231, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !232, retainedTypes: !335, globals: !507, imports: !508, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!232 = !{!59, !126, !233, !280, !298, !314, !328, !332}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !21, line: 990, baseType: !39, size: 32, elements: !234, identifier: "_ZTS19halide_error_code_t")
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!235 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!236 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!237 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!238 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!239 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!240 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!241 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!242 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!243 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!244 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!245 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!246 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!247 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!248 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!249 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!250 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!251 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!252 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!253 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!254 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!255 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!256 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!257 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!258 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!259 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!260 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!261 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!262 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!263 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!264 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!265 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!266 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!267 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!268 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!269 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!270 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!271 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!272 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!273 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!274 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!275 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!276 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!277 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!278 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!279 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 39, baseType: !28, size: 32, align: 32, elements: !282, identifier: "_ZTS9t_eDmaFmt")
!281 = !DIFile(filename: "src/runtime/mini_hexagon_dma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!283 = !DIEnumerator(name: "eDmaFmt_RawData", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "eDmaFmt_NV12", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "eDmaFmt_NV12_Y", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "eDmaFmt_NV12_UV", value: 3, isUnsigned: true)
!287 = !DIEnumerator(name: "eDmaFmt_P010", value: 4, isUnsigned: true)
!288 = !DIEnumerator(name: "eDmaFmt_P010_Y", value: 5, isUnsigned: true)
!289 = !DIEnumerator(name: "eDmaFmt_P010_UV", value: 6, isUnsigned: true)
!290 = !DIEnumerator(name: "eDmaFmt_TP10", value: 7, isUnsigned: true)
!291 = !DIEnumerator(name: "eDmaFmt_TP10_Y", value: 8, isUnsigned: true)
!292 = !DIEnumerator(name: "eDmaFmt_TP10_UV", value: 9, isUnsigned: true)
!293 = !DIEnumerator(name: "eDmaFmt_NV124R", value: 10, isUnsigned: true)
!294 = !DIEnumerator(name: "eDmaFmt_NV124R_Y", value: 11, isUnsigned: true)
!295 = !DIEnumerator(name: "eDmaFmt_NV124R_UV", value: 12, isUnsigned: true)
!296 = !DIEnumerator(name: "eDmaFmt_Invalid", value: 13, isUnsigned: true)
!297 = !DIEnumerator(name: "eDmaFmt_MAX", value: 14, isUnsigned: true)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 34, baseType: !28, size: 32, elements: !300, identifier: "_ZTS26halide_hexagon_image_fmt_t")
!299 = !DIFile(filename: "src/runtime/HalideRuntimeHexagonDma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!301 = !DIEnumerator(name: "halide_hexagon_fmt_RawData", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "halide_hexagon_fmt_NV12", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "halide_hexagon_fmt_NV12_Y", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "halide_hexagon_fmt_NV12_UV", value: 3, isUnsigned: true)
!305 = !DIEnumerator(name: "halide_hexagon_fmt_P010", value: 4, isUnsigned: true)
!306 = !DIEnumerator(name: "halide_hexagon_fmt_P010_Y", value: 5, isUnsigned: true)
!307 = !DIEnumerator(name: "halide_hexagon_fmt_P010_UV", value: 6, isUnsigned: true)
!308 = !DIEnumerator(name: "halide_hexagon_fmt_TP10", value: 7, isUnsigned: true)
!309 = !DIEnumerator(name: "halide_hexagon_fmt_TP10_Y", value: 8, isUnsigned: true)
!310 = !DIEnumerator(name: "halide_hexagon_fmt_TP10_UV", value: 9, isUnsigned: true)
!311 = !DIEnumerator(name: "halide_hexagon_fmt_NV124R", value: 10, isUnsigned: true)
!312 = !DIEnumerator(name: "halide_hexagon_fmt_NV124R_Y", value: 11, isUnsigned: true)
!313 = !DIEnumerator(name: "halide_hexagon_fmt_NV124R_UV", value: 12, isUnsigned: true)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_hexagon_power_mode_t", file: !315, line: 66, baseType: !28, size: 32, elements: !316, identifier: "_ZTS27halide_hexagon_power_mode_t")
!315 = !DIFile(filename: "src/runtime/HalideRuntimeHexagonHost.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!317 = !DIEnumerator(name: "halide_hexagon_power_low", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "halide_hexagon_power_nominal", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "halide_hexagon_power_turbo", value: 2, isUnsigned: true)
!320 = !DIEnumerator(name: "halide_hexagon_power_default", value: 3, isUnsigned: true)
!321 = !DIEnumerator(name: "halide_hexagon_power_low_plus", value: 4, isUnsigned: true)
!322 = !DIEnumerator(name: "halide_hexagon_power_low_2", value: 5, isUnsigned: true)
!323 = !DIEnumerator(name: "halide_hexagon_power_nominal_plus", value: 6, isUnsigned: true)
!324 = !DIEnumerator(name: "halide_hvx_power_low", value: 0, isUnsigned: true)
!325 = !DIEnumerator(name: "halide_hvx_power_nominal", value: 1, isUnsigned: true)
!326 = !DIEnumerator(name: "halide_hvx_power_turbo", value: 2, isUnsigned: true)
!327 = !DIEnumerator(name: "halide_hvx_power_default", value: 3, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDmaWrapper_TransationType", file: !281, line: 66, baseType: !28, size: 32, align: 32, elements: !329, identifier: "_ZTS26eDmaWrapper_TransationType")
!329 = !{!330, !331}
!330 = !DIEnumerator(name: "eDmaWrapper_DdrToL2", value: 0, isUnsigned: true)
!331 = !DIEnumerator(name: "eDmaWrapper_L2ToDdr", value: 1, isUnsigned: true)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !281, line: 23, baseType: !28, size: 32, align: 32, elements: !333)
!333 = !{!334}
!334 = !DIEnumerator(name: "QURT_EOK", value: 0, isUnsigned: true)
!335 = !{!13, !336, !44, !421, !488, !50, !145, !504, !505, !506, !7, !342}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !338, file: !337, line: 203, baseType: !339)
!337 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!338 = !DINamespace(scope: !3)
!339 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !338, file: !337, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !340, templateParams: !418)
!340 = !{!341, !344, !345, !346, !347, !348, !350, !354, !360, !365, !368, !371, !374, !378, !382, !387, !391, !394, !400, !403, !406, !411, !412, !415, !416, !417}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !339, file: !337, line: 32, baseType: !342, size: 32, flags: DIFlagPublic)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !339, file: !337, line: 32, baseType: !342, size: 32, offset: 32, flags: DIFlagPublic)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !339, file: !337, line: 32, baseType: !342, size: 32, offset: 64, flags: DIFlagPublic)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !339, file: !337, line: 33, baseType: !13, size: 32, offset: 96, flags: DIFlagPublic)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !339, file: !337, line: 34, baseType: !15, size: 8, offset: 128, flags: DIFlagPublic)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !339, file: !337, line: 35, baseType: !349, size: 8, offset: 136, flags: DIFlagPublic)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 8, elements: !29)
!350 = !DISubprogram(name: "Printer", scope: !339, file: !337, line: 37, type: !351, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !353, !13, !342}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!354 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !339, file: !337, line: 57, type: !355, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !353, !358}
!357 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !339, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!360 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !339, file: !337, line: 67, type: !361, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubroutineType(types: !362)
!362 = !{!357, !353, !363}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !26, line: 9, baseType: !364)
!364 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!365 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !339, file: !337, line: 72, type: !366, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!366 = !DISubroutineType(types: !367)
!367 = !{!357, !353, !95}
!368 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !339, file: !337, line: 77, type: !369, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DISubroutineType(types: !370)
!370 = !{!357, !353, !44}
!371 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !339, file: !337, line: 82, type: !372, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!357, !353, !27}
!374 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !339, file: !337, line: 87, type: !375, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!357, !353, !377}
!377 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!378 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !339, file: !337, line: 92, type: !379, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!379 = !DISubroutineType(types: !380)
!380 = !{!357, !353, !381}
!381 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!382 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !339, file: !337, line: 97, type: !383, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!383 = !DISubroutineType(types: !384)
!384 = !{!357, !353, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!387 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !339, file: !337, line: 102, type: !388, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!388 = !DISubroutineType(types: !389)
!389 = !{!357, !353, !390}
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!391 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !339, file: !337, line: 108, type: !392, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!392 = !DISubroutineType(types: !393)
!393 = !{!357, !353, !85}
!394 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !339, file: !337, line: 113, type: !395, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!395 = !DISubroutineType(types: !396)
!396 = !{!357, !353, !397}
!397 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !21, line: 1550, baseType: !41)
!400 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !339, file: !337, line: 119, type: !401, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{!358, !353}
!403 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !339, file: !337, line: 131, type: !404, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !353}
!406 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !339, file: !337, line: 139, type: !407, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubroutineType(types: !408)
!408 = !{!44, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!411 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !339, file: !337, line: 143, type: !407, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !339, file: !337, line: 148, type: !413, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !353, !39}
!415 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !339, file: !337, line: 158, type: !401, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!416 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !339, file: !337, line: 162, type: !404, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!417 = !DISubprogram(name: "~Printer", scope: !339, file: !337, line: 166, type: !404, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!418 = !{!419, !420}
!419 = !DITemplateValueParameter(name: "type", type: !39, value: i32 0)
!420 = !DITemplateValueParameter(name: "length", type: !45, value: i64 1024)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !338, file: !337, line: 199, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !338, file: !337, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !423, templateParams: !486)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !434, !438, !441, !444, !447, !450, !453, !456, !459, !462, !465, !468, !471, !474, !479, !480, !483, !484, !485}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !422, file: !337, line: 32, baseType: !342, size: 32, flags: DIFlagPublic)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !422, file: !337, line: 32, baseType: !342, size: 32, offset: 32, flags: DIFlagPublic)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !422, file: !337, line: 32, baseType: !342, size: 32, offset: 64, flags: DIFlagPublic)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !422, file: !337, line: 33, baseType: !13, size: 32, offset: 96, flags: DIFlagPublic)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !422, file: !337, line: 34, baseType: !15, size: 8, offset: 128, flags: DIFlagPublic)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !422, file: !337, line: 35, baseType: !349, size: 8, offset: 136, flags: DIFlagPublic)
!430 = !DISubprogram(name: "Printer", scope: !422, file: !337, line: 37, type: !431, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !433, !13, !342}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!434 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !422, file: !337, line: 57, type: !435, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !433, !358}
!437 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !422, size: 32)
!438 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !422, file: !337, line: 67, type: !439, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{!437, !433, !363}
!441 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !422, file: !337, line: 72, type: !442, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!437, !433, !95}
!444 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !422, file: !337, line: 77, type: !445, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!437, !433, !44}
!447 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !422, file: !337, line: 82, type: !448, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!448 = !DISubroutineType(types: !449)
!449 = !{!437, !433, !27}
!450 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !422, file: !337, line: 87, type: !451, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!437, !433, !377}
!453 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !422, file: !337, line: 92, type: !454, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubroutineType(types: !455)
!455 = !{!437, !433, !381}
!456 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !422, file: !337, line: 97, type: !457, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!457 = !DISubroutineType(types: !458)
!458 = !{!437, !433, !385}
!459 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !422, file: !337, line: 102, type: !460, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!460 = !DISubroutineType(types: !461)
!461 = !{!437, !433, !390}
!462 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !422, file: !337, line: 108, type: !463, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{!437, !433, !85}
!465 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !422, file: !337, line: 113, type: !466, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubroutineType(types: !467)
!467 = !{!437, !433, !397}
!468 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !422, file: !337, line: 119, type: !469, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!469 = !DISubroutineType(types: !470)
!470 = !{!358, !433}
!471 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !422, file: !337, line: 131, type: !472, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !433}
!474 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !422, file: !337, line: 139, type: !475, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!475 = !DISubroutineType(types: !476)
!476 = !{!44, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!479 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !422, file: !337, line: 143, type: !475, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!480 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !422, file: !337, line: 148, type: !481, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !433, !39}
!483 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !422, file: !337, line: 158, type: !469, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!484 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !422, file: !337, line: 162, type: !472, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DISubprogram(name: "~Printer", scope: !422, file: !337, line: 166, type: !472, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !{!487, !420}
!487 = !DITemplateValueParameter(name: "type", type: !39, value: i32 1)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_device_handle", scope: !2, file: !6, line: 21, size: 288, flags: DIFlagTypePassByValue, elements: !490, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma17dma_device_handleE")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !489, file: !6, line: 22, baseType: !50, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "offset_rdx", scope: !489, file: !6, line: 23, baseType: !68, size: 16, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "offset_rdy", scope: !489, file: !6, line: 24, baseType: !68, size: 16, offset: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "offset_wrx", scope: !489, file: !6, line: 25, baseType: !68, size: 16, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "offset_wry", scope: !489, file: !6, line: 26, baseType: !68, size: 16, offset: 80)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dma_engine", scope: !489, file: !6, line: 27, baseType: !13, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !489, file: !6, line: 28, baseType: !39, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !489, file: !6, line: 29, baseType: !39, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "frame_stride", scope: !489, file: !6, line: 30, baseType: !39, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "is_ubwc", scope: !489, file: !6, line: 31, baseType: !15, size: 8, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !489, file: !6, line: 32, baseType: !15, size: 8, offset: 232)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !489, file: !6, line: 33, baseType: !503, size: 32, align: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_eDmaFmt", file: !281, line: 55, baseType: !280)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !26, line: 28, baseType: !39)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !281, line: 11, baseType: !27)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !281, line: 10, baseType: !68)
!507 = !{!0, !18, !228, !31}
!508 = !{!509, !510}
!509 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !230, entity: !3, file: !26, line: 225)
!510 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !230, entity: !2, file: !6, line: 72)
!511 = !{i32 7, !"Dwarf Version", i32 4}
!512 = !{i32 2, !"Debug Info Version", i32 3}
!513 = !{i32 1, !"wchar_size", i32 4}
!514 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!515 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !516, line: 47, type: !517, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !533)
!516 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!517 = !DISubroutineType(types: !518)
!518 = !{null, !519, !39, !363, !363}
!519 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !516, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !522, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!522 = !{!523, !524, !525, !526, !530, !531, !532}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !521, file: !516, line: 35, baseType: !44, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !521, file: !516, line: 35, baseType: !44, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !521, file: !516, line: 37, baseType: !44, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !521, file: !516, line: 39, baseType: !527, size: 1024, offset: 192)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !521, file: !516, line: 41, baseType: !527, size: 1024, offset: 1216)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !521, file: !516, line: 42, baseType: !527, size: 1024, offset: 2240)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !521, file: !516, line: 44, baseType: !44, size: 64, offset: 3264)
!533 = !{!534, !535, !536, !537, !538, !541, !542}
!534 = !DILocalVariable(name: "copy", arg: 1, scope: !515, file: !516, line: 47, type: !519)
!535 = !DILocalVariable(name: "d", arg: 2, scope: !515, file: !516, line: 47, type: !39)
!536 = !DILocalVariable(name: "src_off", arg: 3, scope: !515, file: !516, line: 47, type: !363)
!537 = !DILocalVariable(name: "dst_off", arg: 4, scope: !515, file: !516, line: 47, type: !363)
!538 = !DILocalVariable(name: "from", scope: !539, file: !516, line: 54, type: !385)
!539 = distinct !DILexicalBlock(scope: !540, file: !516, line: 53, column: 18)
!540 = distinct !DILexicalBlock(scope: !515, file: !516, line: 53, column: 9)
!541 = !DILocalVariable(name: "to", scope: !539, file: !516, line: 55, type: !13)
!542 = !DILocalVariable(name: "i", scope: !543, file: !516, line: 58, type: !44)
!543 = distinct !DILexicalBlock(scope: !544, file: !516, line: 58, column: 9)
!544 = distinct !DILexicalBlock(scope: !540, file: !516, line: 57, column: 12)
!545 = !DILocation(line: 0, scope: !515)
!546 = !DILocation(line: 49, column: 14, scope: !515)
!547 = !DILocation(line: 49, column: 19, scope: !515)
!548 = !DILocation(line: 49, column: 22, scope: !515)
!549 = !{!550, !550, i64 0}
!550 = !{!"long long", !551, i64 0}
!551 = !{!"omnipotent char", !552, i64 0}
!552 = !{!"Simple C++ TBAA"}
!553 = !DILocation(line: 49, column: 37, scope: !515)
!554 = !DILocation(line: 49, column: 5, scope: !515)
!555 = !DILocation(line: 50, column: 10, scope: !556)
!556 = distinct !DILexicalBlock(scope: !515, file: !516, line: 49, column: 43)
!557 = distinct !{!557, !554, !558, !559}
!558 = !DILocation(line: 51, column: 5, scope: !515)
!559 = !{!"llvm.loop.mustprogress"}
!560 = !DILocation(line: 53, column: 11, scope: !540)
!561 = !DILocation(line: 53, column: 9, scope: !515)
!562 = !DILocation(line: 0, scope: !543)
!563 = !DILocation(line: 58, column: 34, scope: !564)
!564 = distinct !DILexicalBlock(scope: !543, file: !516, line: 58, column: 9)
!565 = !DILocation(line: 58, column: 32, scope: !564)
!566 = !DILocation(line: 58, column: 9, scope: !543)
!567 = !DILocation(line: 54, column: 42, scope: !539)
!568 = !{!569, !550, i64 0}
!569 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !550, i64 0, !550, i64 8, !550, i64 16, !551, i64 24, !551, i64 152, !551, i64 280, !550, i64 408}
!570 = !DILocation(line: 54, column: 46, scope: !539)
!571 = !DILocation(line: 54, column: 28, scope: !539)
!572 = !DILocation(line: 0, scope: !539)
!573 = !DILocation(line: 55, column: 34, scope: !539)
!574 = !{!569, !550, i64 8}
!575 = !DILocation(line: 55, column: 38, scope: !539)
!576 = !DILocation(line: 55, column: 20, scope: !539)
!577 = !DILocation(line: 56, column: 31, scope: !539)
!578 = !{!569, !550, i64 408}
!579 = !DILocation(line: 56, column: 26, scope: !539)
!580 = !DILocation(line: 56, column: 9, scope: !539)
!581 = !DILocation(line: 57, column: 5, scope: !539)
!582 = !DILocation(line: 59, column: 13, scope: !583)
!583 = distinct !DILexicalBlock(scope: !564, file: !516, line: 58, column: 55)
!584 = !DILocation(line: 60, column: 24, scope: !583)
!585 = !DILocation(line: 60, column: 21, scope: !583)
!586 = !DILocation(line: 61, column: 24, scope: !583)
!587 = !DILocation(line: 61, column: 21, scope: !583)
!588 = !DILocation(line: 58, column: 51, scope: !564)
!589 = distinct !{!589, !566, !590, !559}
!590 = !DILocation(line: 62, column: 9, scope: !543)
!591 = !DILocation(line: 64, column: 1, scope: !515)
!592 = !DISubprogram(name: "memcpy", scope: !26, file: !26, line: 94, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{!13, !13, !385, !28}
!595 = !{}
!596 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !516, line: 66, type: !597, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !519, !13}
!599 = !{!600, !601}
!600 = !DILocalVariable(name: "copy", arg: 1, scope: !596, file: !516, line: 66, type: !519)
!601 = !DILocalVariable(name: "user_context", arg: 2, scope: !596, file: !516, line: 66, type: !13)
!602 = !DILocation(line: 0, scope: !596)
!603 = !DILocation(line: 68, column: 14, scope: !604)
!604 = distinct !DILexicalBlock(scope: !596, file: !516, line: 68, column: 9)
!605 = !DILocation(line: 68, column: 26, scope: !604)
!606 = !DILocation(line: 68, column: 18, scope: !604)
!607 = !DILocation(line: 68, column: 9, scope: !596)
!608 = !DILocation(line: 69, column: 58, scope: !609)
!609 = distinct !DILexicalBlock(scope: !604, file: !516, line: 68, column: 31)
!610 = !{!569, !550, i64 16}
!611 = !DILocation(line: 69, column: 9, scope: !609)
!612 = !DILocation(line: 70, column: 5, scope: !609)
!613 = !DILocalVariable(name: "this", arg: 1, scope: !614, type: !618, flags: DIFlagArtificial | DIFlagObjectPointer)
!614 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !339, file: !337, line: 37, type: !351, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !350, retainedNodes: !615)
!615 = !{!613, !616, !617}
!616 = !DILocalVariable(name: "ctx", arg: 2, scope: !614, file: !337, line: 37, type: !13)
!617 = !DILocalVariable(name: "mem", arg: 3, scope: !614, file: !337, line: 37, type: !342)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!619 = !DILocation(line: 0, scope: !614, inlinedAt: !620)
!620 = distinct !DILocation(line: 71, column: 9, scope: !621)
!621 = distinct !DILexicalBlock(scope: !604, file: !516, line: 70, column: 12)
!622 = !DILocation(line: 44, column: 27, scope: !623, inlinedAt: !620)
!623 = distinct !DILexicalBlock(scope: !624, file: !337, line: 43, column: 16)
!624 = distinct !DILexicalBlock(scope: !625, file: !337, line: 41, column: 20)
!625 = distinct !DILexicalBlock(scope: !626, file: !337, line: 39, column: 13)
!626 = distinct !DILexicalBlock(scope: !614, file: !337, line: 38, column: 54)
!627 = !DILocation(line: 48, column: 13, scope: !628, inlinedAt: !620)
!628 = distinct !DILexicalBlock(scope: !626, file: !337, line: 48, column: 13)
!629 = !DILocation(line: 48, column: 13, scope: !626, inlinedAt: !620)
!630 = !DILocalVariable(name: "this", arg: 1, scope: !631, type: !618, flags: DIFlagArtificial | DIFlagObjectPointer)
!631 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !339, file: !337, line: 57, type: !355, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !354, retainedNodes: !632)
!632 = !{!630, !633}
!633 = !DILocalVariable(name: "arg", arg: 2, scope: !631, file: !337, line: 57, type: !358)
!634 = !DILocation(line: 0, scope: !631, inlinedAt: !635)
!635 = distinct !DILocation(line: 71, column: 29, scope: !621)
!636 = !DILocation(line: 62, column: 19, scope: !637, inlinedAt: !635)
!637 = distinct !DILexicalBlock(scope: !638, file: !337, line: 61, column: 16)
!638 = distinct !DILexicalBlock(scope: !631, file: !337, line: 59, column: 13)
!639 = !DILocalVariable(name: "this", arg: 1, scope: !640, type: !618, flags: DIFlagArtificial | DIFlagObjectPointer)
!640 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !339, file: !337, line: 166, type: !404, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !417, retainedNodes: !641)
!641 = !{!639}
!642 = !DILocation(line: 0, scope: !640, inlinedAt: !643)
!643 = distinct !DILocation(line: 71, column: 9, scope: !621)
!644 = !DILocation(line: 168, column: 13, scope: !645, inlinedAt: !643)
!645 = distinct !DILexicalBlock(scope: !646, file: !337, line: 167, column: 19)
!646 = distinct !DILexicalBlock(scope: !647, file: !337, line: 167, column: 13)
!647 = distinct !DILexicalBlock(scope: !640, file: !337, line: 166, column: 16)
!648 = !DILocation(line: 169, column: 9, scope: !645, inlinedAt: !643)
!649 = !DILocation(line: 49, column: 23, scope: !650, inlinedAt: !620)
!650 = distinct !DILexicalBlock(scope: !628, file: !337, line: 48, column: 18)
!651 = !DILocation(line: 50, column: 18, scope: !650, inlinedAt: !620)
!652 = !{!551, !551, i64 0}
!653 = !DILocalVariable(name: "this", arg: 1, scope: !654, type: !618, flags: DIFlagArtificial | DIFlagObjectPointer)
!654 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !339, file: !337, line: 162, type: !404, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !416, retainedNodes: !655)
!655 = !{!653}
!656 = !DILocation(line: 0, scope: !654, inlinedAt: !657)
!657 = distinct !DILocation(line: 170, column: 13, scope: !658, inlinedAt: !643)
!658 = distinct !DILexicalBlock(scope: !646, file: !337, line: 169, column: 16)
!659 = !DILocation(line: 163, column: 81, scope: !654, inlinedAt: !657)
!660 = !DILocation(line: 163, column: 87, scope: !654, inlinedAt: !657)
!661 = !DILocation(line: 163, column: 77, scope: !654, inlinedAt: !657)
!662 = !DILocation(line: 163, column: 15, scope: !654, inlinedAt: !657)
!663 = !DILocation(line: 174, column: 17, scope: !664, inlinedAt: !643)
!664 = distinct !DILexicalBlock(scope: !665, file: !337, line: 173, column: 46)
!665 = distinct !DILexicalBlock(scope: !666, file: !337, line: 173, column: 24)
!666 = distinct !DILexicalBlock(scope: !658, file: !337, line: 171, column: 17)
!667 = !DILocation(line: 181, column: 13, scope: !668, inlinedAt: !643)
!668 = distinct !DILexicalBlock(scope: !669, file: !337, line: 180, column: 40)
!669 = distinct !DILexicalBlock(scope: !647, file: !337, line: 180, column: 13)
!670 = !DILocation(line: 73, column: 1, scope: !596)
!671 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !516, line: 76, type: !672, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !675)
!672 = !DISubroutineType(types: !673)
!673 = !{!521, !674, !15, !674, !15}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!675 = !{!676, !677, !678, !679, !680, !681, !683, !685, !688, !691, !693, !696, !697, !698, !700}
!676 = !DILocalVariable(name: "src", arg: 1, scope: !671, file: !516, line: 76, type: !674)
!677 = !DILocalVariable(name: "src_host", arg: 2, scope: !671, file: !516, line: 76, type: !15)
!678 = !DILocalVariable(name: "dst", arg: 3, scope: !671, file: !516, line: 77, type: !674)
!679 = !DILocalVariable(name: "dst_host", arg: 4, scope: !671, file: !516, line: 77, type: !15)
!680 = !DILocalVariable(name: "c", scope: !671, file: !516, line: 79, type: !521)
!681 = !DILocalVariable(name: "i", scope: !682, file: !516, line: 83, type: !39)
!682 = distinct !DILexicalBlock(scope: !671, file: !516, line: 83, column: 5)
!683 = !DILocalVariable(name: "i", scope: !684, file: !516, line: 91, type: !39)
!684 = distinct !DILexicalBlock(scope: !671, file: !516, line: 91, column: 5)
!685 = !DILocalVariable(name: "zero", scope: !686, file: !516, line: 100, type: !521)
!686 = distinct !DILexicalBlock(scope: !687, file: !516, line: 98, column: 42)
!687 = distinct !DILexicalBlock(scope: !671, file: !516, line: 96, column: 9)
!688 = !DILocalVariable(name: "zero", scope: !689, file: !516, line: 107, type: !521)
!689 = distinct !DILexicalBlock(scope: !690, file: !516, line: 104, column: 28)
!690 = distinct !DILexicalBlock(scope: !671, file: !516, line: 104, column: 9)
!691 = !DILocalVariable(name: "i", scope: !692, file: !516, line: 115, type: !39)
!692 = distinct !DILexicalBlock(scope: !671, file: !516, line: 115, column: 5)
!693 = !DILocalVariable(name: "dst_stride_bytes", scope: !694, file: !516, line: 117, type: !44)
!694 = distinct !DILexicalBlock(scope: !695, file: !516, line: 115, column: 47)
!695 = distinct !DILexicalBlock(scope: !692, file: !516, line: 115, column: 5)
!696 = !DILocalVariable(name: "src_stride_bytes", scope: !694, file: !516, line: 118, type: !44)
!697 = !DILocalVariable(name: "insert", scope: !694, file: !516, line: 120, type: !39)
!698 = !DILocalVariable(name: "j", scope: !699, file: !516, line: 128, type: !39)
!699 = distinct !DILexicalBlock(scope: !694, file: !516, line: 128, column: 9)
!700 = !DILocalVariable(name: "j", scope: !701, file: !516, line: 151, type: !39)
!701 = distinct !DILexicalBlock(scope: !702, file: !516, line: 151, column: 9)
!702 = distinct !DILexicalBlock(scope: !671, file: !516, line: 145, column: 51)
!703 = !DILocation(line: 0, scope: !671)
!704 = !DILocation(line: 79, column: 5, scope: !671)
!705 = !DILocation(line: 79, column: 17, scope: !671)
!706 = !DILocation(line: 80, column: 13, scope: !671)
!707 = !DILocation(line: 80, column: 39, scope: !671)
!708 = !{!709, !710, i64 12}
!709 = !{!"_ZTS15halide_buffer_t", !550, i64 0, !710, i64 8, !710, i64 12, !550, i64 16, !711, i64 24, !714, i64 28, !710, i64 32, !710, i64 36}
!710 = !{!"any pointer", !551, i64 0}
!711 = !{!"_ZTS13halide_type_t", !712, i64 0, !551, i64 1, !713, i64 2}
!712 = !{!"_ZTS18halide_type_code_t", !551, i64 0}
!713 = !{!"short", !551, i64 0}
!714 = !{!"int", !551, i64 0}
!715 = !DILocation(line: 80, column: 24, scope: !671)
!716 = !DILocation(line: 80, column: 51, scope: !671)
!717 = !{!709, !550, i64 0}
!718 = !DILocation(line: 80, column: 7, scope: !671)
!719 = !DILocation(line: 80, column: 11, scope: !671)
!720 = !DILocation(line: 81, column: 13, scope: !671)
!721 = !DILocation(line: 81, column: 39, scope: !671)
!722 = !DILocation(line: 81, column: 24, scope: !671)
!723 = !DILocation(line: 81, column: 51, scope: !671)
!724 = !DILocation(line: 81, column: 7, scope: !671)
!725 = !DILocation(line: 81, column: 11, scope: !671)
!726 = !DILocalVariable(name: "this", arg: 1, scope: !727, type: !729, flags: DIFlagArtificial | DIFlagObjectPointer)
!727 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !55, file: !21, line: 481, type: !89, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !88, retainedNodes: !728)
!728 = !{!726}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!730 = !DILocation(line: 0, scope: !727, inlinedAt: !731)
!731 = distinct !DILocation(line: 82, column: 30, scope: !671)
!732 = !DILocation(line: 482, column: 17, scope: !727, inlinedAt: !731)
!733 = !{!711, !551, i64 1}
!734 = !DILocation(line: 482, column: 22, scope: !727, inlinedAt: !731)
!735 = !DILocation(line: 482, column: 27, scope: !727, inlinedAt: !731)
!736 = !DILocation(line: 82, column: 20, scope: !671)
!737 = !DILocation(line: 82, column: 7, scope: !671)
!738 = !DILocation(line: 82, column: 18, scope: !671)
!739 = !DILocation(line: 0, scope: !682)
!740 = !DILocation(line: 84, column: 9, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !516, line: 83, column: 45)
!742 = distinct !DILexicalBlock(scope: !682, file: !516, line: 83, column: 5)
!743 = !DILocation(line: 84, column: 21, scope: !741)
!744 = !DILocation(line: 85, column: 9, scope: !741)
!745 = !DILocation(line: 85, column: 31, scope: !741)
!746 = !DILocation(line: 86, column: 9, scope: !741)
!747 = !DILocation(line: 86, column: 31, scope: !741)
!748 = !DILocation(line: 90, column: 7, scope: !671)
!749 = !DILocation(line: 0, scope: !684)
!750 = !DILocation(line: 91, column: 30, scope: !751)
!751 = distinct !DILexicalBlock(scope: !684, file: !516, line: 91, column: 5)
!752 = !{!709, !714, i64 28}
!753 = !DILocation(line: 91, column: 23, scope: !751)
!754 = !DILocation(line: 91, column: 5, scope: !684)
!755 = !{!709, !710, i64 32}
!756 = !DILocation(line: 94, column: 17, scope: !671)
!757 = !DILocation(line: 94, column: 22, scope: !671)
!758 = !DILocation(line: 96, column: 33, scope: !687)
!759 = !DILocation(line: 96, column: 25, scope: !687)
!760 = !DILocation(line: 96, column: 44, scope: !687)
!761 = !DILocation(line: 92, column: 46, scope: !762)
!762 = distinct !DILexicalBlock(scope: !751, file: !516, line: 91, column: 47)
!763 = !{!764, !714, i64 8}
!764 = !{!"_ZTS18halide_dimension_t", !714, i64 0, !714, i64 4, !714, i64 8, !714, i64 12}
!765 = !DILocation(line: 92, column: 34, scope: !762)
!766 = !DILocation(line: 92, column: 68, scope: !762)
!767 = !{!764, !714, i64 0}
!768 = !DILocation(line: 92, column: 86, scope: !762)
!769 = !DILocation(line: 92, column: 72, scope: !762)
!770 = !DILocation(line: 92, column: 55, scope: !762)
!771 = !DILocation(line: 92, column: 53, scope: !762)
!772 = !DILocation(line: 92, column: 21, scope: !762)
!773 = !DILocation(line: 91, column: 43, scope: !751)
!774 = distinct !{!774, !754, !775, !559}
!775 = !DILocation(line: 93, column: 5, scope: !684)
!776 = !DILocation(line: 0, scope: !727, inlinedAt: !777)
!777 = distinct !DILocation(line: 97, column: 19, scope: !687)
!778 = !DILocation(line: 0, scope: !727, inlinedAt: !779)
!779 = distinct !DILocation(line: 97, column: 40, scope: !687)
!780 = !DILocation(line: 482, column: 17, scope: !727, inlinedAt: !779)
!781 = !DILocation(line: 482, column: 22, scope: !727, inlinedAt: !779)
!782 = !DILocation(line: 482, column: 27, scope: !727, inlinedAt: !779)
!783 = !DILocation(line: 97, column: 27, scope: !687)
!784 = !DILocation(line: 97, column: 48, scope: !687)
!785 = !DILocation(line: 100, column: 21, scope: !686)
!786 = !DILocation(line: 101, column: 9, scope: !686)
!787 = !DILocation(line: 104, column: 22, scope: !690)
!788 = !DILocation(line: 104, column: 9, scope: !671)
!789 = !DILocation(line: 0, scope: !692)
!790 = !DILocation(line: 115, column: 5, scope: !692)
!791 = !DILocation(line: 107, column: 21, scope: !689)
!792 = !DILocation(line: 108, column: 9, scope: !689)
!793 = !DILocation(line: 144, column: 14, scope: !671)
!794 = !DILocation(line: 144, column: 28, scope: !671)
!795 = !DILocation(line: 144, column: 25, scope: !671)
!796 = !DILocation(line: 144, column: 50, scope: !671)
!797 = !DILocation(line: 145, column: 28, scope: !671)
!798 = !DILocation(line: 117, column: 59, scope: !694)
!799 = !DILocation(line: 117, column: 47, scope: !694)
!800 = !DILocation(line: 0, scope: !727, inlinedAt: !801)
!801 = distinct !DILocation(line: 117, column: 78, scope: !694)
!802 = !DILocation(line: 117, column: 66, scope: !694)
!803 = !DILocation(line: 0, scope: !694)
!804 = !DILocation(line: 118, column: 59, scope: !694)
!805 = !DILocation(line: 118, column: 47, scope: !694)
!806 = !DILocation(line: 0, scope: !727, inlinedAt: !807)
!807 = distinct !DILocation(line: 118, column: 78, scope: !694)
!808 = !DILocation(line: 118, column: 66, scope: !694)
!809 = !DILocation(line: 121, column: 33, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !516, line: 121, column: 9)
!811 = distinct !DILexicalBlock(scope: !694, file: !516, line: 121, column: 9)
!812 = !DILocation(line: 121, column: 9, scope: !811)
!813 = !DILocation(line: 124, column: 36, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !516, line: 124, column: 17)
!815 = distinct !DILexicalBlock(scope: !810, file: !516, line: 121, column: 48)
!816 = !DILocation(line: 124, column: 34, scope: !814)
!817 = !DILocation(line: 124, column: 63, scope: !814)
!818 = !DILocation(line: 121, column: 44, scope: !810)
!819 = distinct !{!819, !812, !820, !559}
!820 = !DILocation(line: 127, column: 9, scope: !811)
!821 = !DILocation(line: 0, scope: !811)
!822 = !DILocation(line: 0, scope: !699)
!823 = !DILocation(line: 128, column: 27, scope: !824)
!824 = distinct !DILexicalBlock(scope: !699, file: !516, line: 128, column: 9)
!825 = !DILocation(line: 128, column: 9, scope: !699)
!826 = !DILocation(line: 133, column: 40, scope: !694)
!827 = !{!764, !714, i64 4}
!828 = !DILocation(line: 133, column: 28, scope: !694)
!829 = !DILocation(line: 133, column: 9, scope: !694)
!830 = !DILocation(line: 133, column: 26, scope: !694)
!831 = !DILocation(line: 135, column: 9, scope: !694)
!832 = !DILocation(line: 135, column: 36, scope: !694)
!833 = !DILocation(line: 136, column: 9, scope: !694)
!834 = !DILocation(line: 136, column: 36, scope: !694)
!835 = !DILocation(line: 115, column: 43, scope: !695)
!836 = !DILocation(line: 115, column: 23, scope: !695)
!837 = distinct !{!837, !790, !838, !559}
!838 = !DILocation(line: 137, column: 5, scope: !692)
!839 = !DILocation(line: 129, column: 38, scope: !840)
!840 = distinct !DILexicalBlock(scope: !824, file: !516, line: 128, column: 42)
!841 = !DILocation(line: 129, column: 27, scope: !840)
!842 = !DILocation(line: 129, column: 13, scope: !840)
!843 = !DILocation(line: 129, column: 25, scope: !840)
!844 = !DILocation(line: 130, column: 37, scope: !840)
!845 = !DILocation(line: 130, column: 13, scope: !840)
!846 = !DILocation(line: 130, column: 35, scope: !840)
!847 = !DILocation(line: 131, column: 37, scope: !840)
!848 = !DILocation(line: 131, column: 13, scope: !840)
!849 = !DILocation(line: 131, column: 35, scope: !840)
!850 = distinct !{!850, !825, !851, !559}
!851 = !DILocation(line: 132, column: 9, scope: !699)
!852 = !DILocation(line: 145, column: 25, scope: !671)
!853 = !DILocation(line: 144, column: 5, scope: !671)
!854 = !DILocation(line: 147, column: 25, scope: !702)
!855 = !DILocation(line: 147, column: 22, scope: !702)
!856 = !DILocation(line: 0, scope: !701)
!857 = !DILocation(line: 152, column: 31, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !516, line: 151, column: 49)
!859 = distinct !DILexicalBlock(scope: !701, file: !516, line: 151, column: 9)
!860 = !DILocation(line: 152, column: 29, scope: !858)
!861 = !DILocation(line: 153, column: 41, scope: !858)
!862 = !DILocation(line: 153, column: 39, scope: !858)
!863 = !DILocation(line: 154, column: 41, scope: !858)
!864 = !DILocation(line: 154, column: 39, scope: !858)
!865 = !DILocation(line: 156, column: 37, scope: !702)
!866 = !DILocation(line: 157, column: 47, scope: !702)
!867 = !DILocation(line: 158, column: 47, scope: !702)
!868 = distinct !{!868, !853, !869, !559}
!869 = !DILocation(line: 159, column: 5, scope: !671)
!870 = !DILocation(line: 160, column: 12, scope: !671)
!871 = !{i64 0, i64 8, !549, i64 8, i64 8, !549, i64 16, i64 8, !549, i64 24, i64 128, !652, i64 152, i64 128, !652, i64 280, i64 128, !652, i64 408, i64 8, !549}
!872 = !DILocation(line: 160, column: 5, scope: !671)
!873 = !DILocation(line: 161, column: 1, scope: !671)
!874 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !516, line: 163, type: !875, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!521, !674}
!877 = !{!878}
!878 = !DILocalVariable(name: "buf", arg: 1, scope: !874, file: !516, line: 163, type: !674)
!879 = !DILocation(line: 0, scope: !874)
!880 = !DILocation(line: 164, column: 12, scope: !874)
!881 = !DILocation(line: 164, column: 5, scope: !874)
!882 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !516, line: 167, type: !875, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !883)
!883 = !{!884}
!884 = !DILocalVariable(name: "buf", arg: 1, scope: !882, file: !516, line: 167, type: !674)
!885 = !DILocation(line: 0, scope: !882)
!886 = !DILocation(line: 168, column: 12, scope: !882)
!887 = !DILocation(line: 168, column: 5, scope: !882)
!888 = distinct !DISubprogram(name: "halide_hexagon_dma_device_malloc", scope: !6, file: !6, line: 363, type: !889, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, retainedNodes: !892)
!889 = !DISubroutineType(types: !890)
!890 = !{!39, !13, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!892 = !{!893, !894, !895, !896, !897}
!893 = !DILocalVariable(name: "user_context", arg: 1, scope: !888, file: !6, line: 363, type: !13)
!894 = !DILocalVariable(name: "buf", arg: 2, scope: !888, file: !6, line: 363, type: !891)
!895 = !DILocalVariable(name: "size", scope: !888, file: !6, line: 373, type: !145)
!896 = !DILocalVariable(name: "mem", scope: !888, file: !6, line: 376, type: !13)
!897 = !DILocalVariable(name: "err", scope: !888, file: !6, line: 382, type: !39)
!898 = !DILocation(line: 0, scope: !888)
!899 = !DILocation(line: 0, scope: !614, inlinedAt: !900)
!900 = distinct !DILocation(line: 364, column: 5, scope: !888)
!901 = !DILocation(line: 44, column: 27, scope: !623, inlinedAt: !900)
!902 = !DILocation(line: 48, column: 13, scope: !628, inlinedAt: !900)
!903 = !DILocation(line: 48, column: 13, scope: !626, inlinedAt: !900)
!904 = !DILocation(line: 49, column: 23, scope: !650, inlinedAt: !900)
!905 = !DILocation(line: 50, column: 18, scope: !650, inlinedAt: !900)
!906 = !DILocation(line: 51, column: 9, scope: !650, inlinedAt: !900)
!907 = !DILocation(line: 0, scope: !628, inlinedAt: !900)
!908 = !DILocation(line: 0, scope: !631, inlinedAt: !909)
!909 = distinct !DILocation(line: 365, column: 9, scope: !888)
!910 = !DILocation(line: 62, column: 19, scope: !637, inlinedAt: !909)
!911 = !DILocalVariable(name: "this", arg: 1, scope: !912, type: !618, flags: DIFlagArtificial | DIFlagObjectPointer)
!912 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !339, file: !337, line: 97, type: !383, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !382, retainedNodes: !913)
!913 = !{!911, !914}
!914 = !DILocalVariable(name: "arg", arg: 2, scope: !912, file: !337, line: 97, type: !385)
!915 = !DILocation(line: 0, scope: !912, inlinedAt: !916)
!916 = distinct !DILocation(line: 365, column: 72, scope: !888)
!917 = !DILocation(line: 98, column: 15, scope: !912, inlinedAt: !916)
!918 = !DILocation(line: 0, scope: !631, inlinedAt: !919)
!919 = distinct !DILocation(line: 366, column: 9, scope: !888)
!920 = !DILocation(line: 62, column: 19, scope: !637, inlinedAt: !919)
!921 = !DILocalVariable(name: "this", arg: 1, scope: !922, type: !618, flags: DIFlagArtificial | DIFlagObjectPointer)
!922 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !339, file: !337, line: 113, type: !395, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !394, retainedNodes: !923)
!923 = !{!921, !924}
!924 = !DILocalVariable(name: "buf", arg: 2, scope: !922, file: !337, line: 113, type: !397)
!925 = !DILocation(line: 0, scope: !922, inlinedAt: !926)
!926 = distinct !DILocation(line: 366, column: 22, scope: !888)
!927 = !DILocation(line: 114, column: 15, scope: !922, inlinedAt: !926)
!928 = !DILocation(line: 0, scope: !631, inlinedAt: !929)
!929 = distinct !DILocation(line: 366, column: 30, scope: !888)
!930 = !DILocation(line: 62, column: 19, scope: !637, inlinedAt: !929)
!931 = !DILocation(line: 0, scope: !640, inlinedAt: !932)
!932 = distinct !DILocation(line: 364, column: 5, scope: !888)
!933 = !DILocation(line: 167, column: 13, scope: !647, inlinedAt: !932)
!934 = !DILocation(line: 168, column: 13, scope: !645, inlinedAt: !932)
!935 = !DILocation(line: 169, column: 9, scope: !645, inlinedAt: !932)
!936 = !DILocation(line: 0, scope: !654, inlinedAt: !937)
!937 = distinct !DILocation(line: 170, column: 13, scope: !658, inlinedAt: !932)
!938 = !DILocation(line: 163, column: 81, scope: !654, inlinedAt: !937)
!939 = !DILocation(line: 163, column: 87, scope: !654, inlinedAt: !937)
!940 = !DILocation(line: 163, column: 77, scope: !654, inlinedAt: !937)
!941 = !DILocation(line: 163, column: 15, scope: !654, inlinedAt: !937)
!942 = !DILocation(line: 174, column: 17, scope: !664, inlinedAt: !932)
!943 = !DILocation(line: 181, column: 13, scope: !668, inlinedAt: !932)
!944 = !DILocation(line: 368, column: 14, scope: !945)
!945 = distinct !DILexicalBlock(scope: !888, file: !6, line: 368, column: 9)
!946 = !DILocation(line: 368, column: 9, scope: !945)
!947 = !DILocation(line: 368, column: 9, scope: !888)
!948 = !DILocation(line: 0, scope: !614, inlinedAt: !949)
!949 = distinct !DILocation(line: 369, column: 9, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !6, line: 368, column: 22)
!951 = !DILocation(line: 44, column: 27, scope: !623, inlinedAt: !949)
!952 = !DILocation(line: 48, column: 13, scope: !628, inlinedAt: !949)
!953 = !DILocation(line: 48, column: 13, scope: !626, inlinedAt: !949)
!954 = !DILocation(line: 0, scope: !631, inlinedAt: !955)
!955 = distinct !DILocation(line: 369, column: 29, scope: !950)
!956 = !DILocation(line: 62, column: 19, scope: !637, inlinedAt: !955)
!957 = !DILocation(line: 0, scope: !640, inlinedAt: !958)
!958 = distinct !DILocation(line: 369, column: 9, scope: !950)
!959 = !DILocation(line: 168, column: 13, scope: !645, inlinedAt: !958)
!960 = !DILocation(line: 169, column: 9, scope: !645, inlinedAt: !958)
!961 = !DILocation(line: 49, column: 23, scope: !650, inlinedAt: !949)
!962 = !DILocation(line: 50, column: 18, scope: !650, inlinedAt: !949)
!963 = !DILocation(line: 0, scope: !654, inlinedAt: !964)
!964 = distinct !DILocation(line: 170, column: 13, scope: !658, inlinedAt: !958)
!965 = !DILocation(line: 163, column: 81, scope: !654, inlinedAt: !964)
!966 = !DILocation(line: 163, column: 87, scope: !654, inlinedAt: !964)
!967 = !DILocation(line: 163, column: 77, scope: !654, inlinedAt: !964)
!968 = !DILocation(line: 163, column: 15, scope: !654, inlinedAt: !964)
!969 = !DILocation(line: 174, column: 17, scope: !664, inlinedAt: !958)
!970 = !DILocation(line: 181, column: 13, scope: !668, inlinedAt: !958)
!971 = !DILocation(line: 370, column: 9, scope: !950)
!972 = !DILocalVariable(name: "this", arg: 1, scope: !973, type: !181, flags: DIFlagArtificial | DIFlagObjectPointer)
!973 = distinct !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !41, file: !21, line: 1518, type: !143, scopeLine: 1518, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !150, retainedNodes: !974)
!974 = !{!972}
!975 = !DILocation(line: 0, scope: !973, inlinedAt: !976)
!976 = distinct !DILocation(line: 373, column: 24, scope: !888)
!977 = !DILocalVariable(name: "this", arg: 1, scope: !978, type: !181, flags: DIFlagArtificial | DIFlagObjectPointer)
!978 = distinct !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !41, file: !21, line: 1506, type: !147, scopeLine: 1506, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !149, retainedNodes: !979)
!979 = !{!977, !980, !981}
!980 = !DILocalVariable(name: "index", scope: !978, file: !21, line: 1507, type: !504)
!981 = !DILocalVariable(name: "i", scope: !982, file: !21, line: 1508, type: !39)
!982 = distinct !DILexicalBlock(scope: !978, file: !21, line: 1508, column: 9)
!983 = !DILocation(line: 0, scope: !978, inlinedAt: !984)
!984 = distinct !DILocation(line: 1519, column: 25, scope: !973, inlinedAt: !976)
!985 = !DILocation(line: 0, scope: !982, inlinedAt: !984)
!986 = !DILocation(line: 1508, column: 29, scope: !987, inlinedAt: !984)
!987 = distinct !DILexicalBlock(scope: !982, file: !21, line: 1508, column: 9)
!988 = !DILocation(line: 1508, column: 27, scope: !987, inlinedAt: !984)
!989 = !DILocation(line: 1508, column: 9, scope: !982, inlinedAt: !984)
!990 = !DILocation(line: 0, scope: !727, inlinedAt: !991)
!991 = distinct !DILocation(line: 1514, column: 36, scope: !978, inlinedAt: !984)
!992 = !DILocation(line: 482, column: 17, scope: !727, inlinedAt: !991)
!993 = !DILocalVariable(name: "this", arg: 1, scope: !994, type: !181, flags: DIFlagArtificial | DIFlagObjectPointer)
!994 = distinct !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !41, file: !21, line: 1495, type: !147, scopeLine: 1495, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !146, retainedNodes: !995)
!995 = !{!993, !996, !997}
!996 = !DILocalVariable(name: "index", scope: !994, file: !21, line: 1496, type: !504)
!997 = !DILocalVariable(name: "i", scope: !998, file: !21, line: 1497, type: !39)
!998 = distinct !DILexicalBlock(scope: !994, file: !21, line: 1497, column: 9)
!999 = !DILocation(line: 0, scope: !994, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 1519, column: 33, scope: !973, inlinedAt: !976)
!1001 = !DILocation(line: 0, scope: !998, inlinedAt: !1000)
!1002 = !DILocation(line: 1497, column: 9, scope: !998, inlinedAt: !1000)
!1003 = !DILocation(line: 1509, column: 24, scope: !1004, inlinedAt: !984)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !21, line: 1509, column: 17)
!1005 = distinct !DILexicalBlock(scope: !987, file: !21, line: 1508, column: 46)
!1006 = !DILocation(line: 1509, column: 31, scope: !1004, inlinedAt: !984)
!1007 = !DILocation(line: 1509, column: 17, scope: !1005, inlinedAt: !984)
!1008 = !DILocation(line: 1510, column: 61, scope: !1009, inlinedAt: !984)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !21, line: 1509, column: 36)
!1010 = !DILocation(line: 1510, column: 68, scope: !1009, inlinedAt: !984)
!1011 = !DILocation(line: 1510, column: 51, scope: !1009, inlinedAt: !984)
!1012 = !DILocation(line: 1510, column: 23, scope: !1009, inlinedAt: !984)
!1013 = !DILocation(line: 1511, column: 13, scope: !1009, inlinedAt: !984)
!1014 = !DILocation(line: 1508, column: 42, scope: !987, inlinedAt: !984)
!1015 = distinct !{!1015, !989, !1016, !559}
!1016 = !DILocation(line: 1512, column: 9, scope: !982, inlinedAt: !984)
!1017 = !DILocation(line: 1498, column: 24, scope: !1018, inlinedAt: !1000)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !21, line: 1498, column: 17)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !21, line: 1497, column: 46)
!1020 = distinct !DILexicalBlock(scope: !998, file: !21, line: 1497, column: 9)
!1021 = !DILocation(line: 1498, column: 31, scope: !1018, inlinedAt: !1000)
!1022 = !DILocation(line: 1498, column: 17, scope: !1019, inlinedAt: !1000)
!1023 = !DILocation(line: 1499, column: 61, scope: !1024, inlinedAt: !1000)
!1024 = distinct !DILexicalBlock(scope: !1018, file: !21, line: 1498, column: 36)
!1025 = !DILocation(line: 1499, column: 68, scope: !1024, inlinedAt: !1000)
!1026 = !DILocation(line: 1499, column: 51, scope: !1024, inlinedAt: !1000)
!1027 = !DILocation(line: 1499, column: 23, scope: !1024, inlinedAt: !1000)
!1028 = !DILocation(line: 1500, column: 13, scope: !1024, inlinedAt: !1000)
!1029 = !DILocation(line: 1497, column: 42, scope: !1020, inlinedAt: !1000)
!1030 = !DILocation(line: 1497, column: 27, scope: !1020, inlinedAt: !1000)
!1031 = distinct !{!1031, !1002, !1032, !559}
!1032 = !DILocation(line: 1501, column: 9, scope: !998, inlinedAt: !1000)
!1033 = !DILocation(line: 482, column: 22, scope: !727, inlinedAt: !991)
!1034 = !DILocation(line: 482, column: 27, scope: !727, inlinedAt: !991)
!1035 = !DILocation(line: 1513, column: 15, scope: !978, inlinedAt: !984)
!1036 = !DILocation(line: 0, scope: !727, inlinedAt: !1037)
!1037 = distinct !DILocation(line: 1502, column: 36, scope: !994, inlinedAt: !1000)
!1038 = !DILocation(line: 1519, column: 31, scope: !973, inlinedAt: !976)
!1039 = !DILocation(line: 374, column: 5, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !6, line: 374, column: 5)
!1041 = distinct !DILexicalBlock(scope: !888, file: !6, line: 374, column: 5)
!1042 = !DILocation(line: 374, column: 5, scope: !1041)
!1043 = !DILocation(line: 374, column: 5, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !6, line: 374, column: 5)
!1045 = !DILocation(line: 376, column: 17, scope: !888)
!1046 = !DILocation(line: 377, column: 10, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !888, file: !6, line: 377, column: 9)
!1048 = !DILocation(line: 377, column: 9, scope: !888)
!1049 = !DILocalVariable(name: "this", arg: 1, scope: !1050, type: !1054, flags: DIFlagArtificial | DIFlagObjectPointer)
!1050 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EEC2EPvPc", scope: !422, file: !337, line: 37, type: !431, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !430, retainedNodes: !1051)
!1051 = !{!1049, !1052, !1053}
!1052 = !DILocalVariable(name: "ctx", arg: 2, scope: !1050, file: !337, line: 37, type: !13)
!1053 = !DILocalVariable(name: "mem", arg: 3, scope: !1050, file: !337, line: 37, type: !342)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!1055 = !DILocation(line: 0, scope: !1050, inlinedAt: !1056)
!1056 = distinct !DILocation(line: 378, column: 9, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1047, file: !6, line: 377, column: 15)
!1058 = !DILocation(line: 44, column: 27, scope: !1059, inlinedAt: !1056)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !337, line: 43, column: 16)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !337, line: 41, column: 20)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !337, line: 39, column: 13)
!1062 = distinct !DILexicalBlock(scope: !1050, file: !337, line: 38, column: 54)
!1063 = !DILocation(line: 48, column: 13, scope: !1064, inlinedAt: !1056)
!1064 = distinct !DILexicalBlock(scope: !1062, file: !337, line: 48, column: 13)
!1065 = !DILocation(line: 48, column: 13, scope: !1062, inlinedAt: !1056)
!1066 = !DILocalVariable(name: "this", arg: 1, scope: !1067, type: !1054, flags: DIFlagArtificial | DIFlagObjectPointer)
!1067 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !422, file: !337, line: 57, type: !435, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !434, retainedNodes: !1068)
!1068 = !{!1066, !1069}
!1069 = !DILocalVariable(name: "arg", arg: 2, scope: !1067, file: !337, line: 57, type: !358)
!1070 = !DILocation(line: 0, scope: !1067, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 378, column: 29, scope: !1057)
!1072 = !DILocation(line: 62, column: 19, scope: !1073, inlinedAt: !1071)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !337, line: 61, column: 16)
!1074 = distinct !DILexicalBlock(scope: !1067, file: !337, line: 59, column: 13)
!1075 = !DILocalVariable(name: "this", arg: 1, scope: !1076, type: !1054, flags: DIFlagArtificial | DIFlagObjectPointer)
!1076 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EED2Ev", scope: !422, file: !337, line: 166, type: !472, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !485, retainedNodes: !1077)
!1077 = !{!1075}
!1078 = !DILocation(line: 0, scope: !1076, inlinedAt: !1079)
!1079 = distinct !DILocation(line: 378, column: 9, scope: !1057)
!1080 = !DILocation(line: 168, column: 13, scope: !1081, inlinedAt: !1079)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !337, line: 167, column: 19)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !337, line: 167, column: 13)
!1083 = distinct !DILexicalBlock(scope: !1076, file: !337, line: 166, column: 16)
!1084 = !DILocation(line: 169, column: 9, scope: !1081, inlinedAt: !1079)
!1085 = !DILocation(line: 49, column: 23, scope: !1086, inlinedAt: !1056)
!1086 = distinct !DILexicalBlock(scope: !1064, file: !337, line: 48, column: 18)
!1087 = !DILocation(line: 50, column: 18, scope: !1086, inlinedAt: !1056)
!1088 = !DILocalVariable(name: "this", arg: 1, scope: !1089, type: !1054, flags: DIFlagArtificial | DIFlagObjectPointer)
!1089 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !422, file: !337, line: 162, type: !472, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !230, declaration: !484, retainedNodes: !1090)
!1090 = !{!1088}
!1091 = !DILocation(line: 0, scope: !1089, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 170, column: 13, scope: !1093, inlinedAt: !1079)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !337, line: 169, column: 16)
!1094 = !DILocation(line: 163, column: 81, scope: !1089, inlinedAt: !1092)
!1095 = !DILocation(line: 163, column: 87, scope: !1089, inlinedAt: !1092)
!1096 = !DILocation(line: 163, column: 77, scope: !1089, inlinedAt: !1092)
!1097 = !DILocation(line: 163, column: 15, scope: !1089, inlinedAt: !1092)
!1098 = !DILocation(line: 172, column: 17, scope: !1099, inlinedAt: !1079)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !337, line: 171, column: 39)
!1100 = distinct !DILexicalBlock(scope: !1093, file: !337, line: 171, column: 17)
!1101 = !DILocation(line: 181, column: 13, scope: !1102, inlinedAt: !1079)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !337, line: 180, column: 40)
!1103 = distinct !DILexicalBlock(scope: !1083, file: !337, line: 180, column: 13)
!1104 = !DILocation(line: 379, column: 9, scope: !1057)
!1105 = !DILocation(line: 383, column: 53, scope: !888)
!1106 = !DILocation(line: 382, column: 15, scope: !888)
!1107 = !DILocation(line: 384, column: 13, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !888, file: !6, line: 384, column: 9)
!1109 = !DILocation(line: 384, column: 9, scope: !888)
!1110 = !DILocation(line: 385, column: 9, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1108, file: !6, line: 384, column: 19)
!1112 = !DILocation(line: 386, column: 9, scope: !1111)
!1113 = !DILocation(line: 390, column: 1, scope: !888)
!1114 = !DISubprogram(name: "halide_print", scope: !21, file: !21, line: 97, type: !1115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !595)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !13, !358}
!1117 = !DISubprogram(name: "abort", scope: !26, file: !26, line: 108, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !595)
!1118 = !DISubprogram(name: "halide_malloc", scope: !21, file: !21, line: 354, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !595)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!13, !13, !28}
