; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/device_interface.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/device_interface.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::device_copy" = type { i64, i64, i64, [16 x i64], [16 x i64], [16 x i64], i64 }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [2 x i8] }>
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }

!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 16, baseType: !22)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 1415, baseType: !14, size: 32, elements: !30, identifier: "_ZTS19halide_buffer_flags")
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !7, line: 990, baseType: !34, size: 32, elements: !35, identifier: "_ZTS19halide_error_code_t")
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!36 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!37 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!38 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!39 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!40 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!41 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!42 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!43 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!44 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!45 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!46 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!47 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!48 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!49 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!50 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!51 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!52 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!53 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!54 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!55 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!56 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!57 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!58 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!59 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!60 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!61 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!62 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!63 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!64 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!65 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!66 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!67 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!68 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!69 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!70 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!71 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!72 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!73 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!74 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!75 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!76 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!77 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!78 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!79 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!80 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!81 = !{!82, !83, !120, !195, !266, !314, !350, !89}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !85, file: !84, line: 203, baseType: !86)
!84 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!85 = !DINamespace(scope: !2)
!86 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !85, file: !84, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !87, templateParams: !347)
!87 = !{!88, !91, !92, !93, !94, !96, !98, !102, !108, !113, !117, !122, !125, !129, !133, !138, !144, !177, !329, !332, !335, !340, !341, !344, !345, !346}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !86, file: !84, line: 32, baseType: !89, size: 32, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !86, file: !84, line: 32, baseType: !89, size: 32, offset: 32, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !86, file: !84, line: 32, baseType: !89, size: 32, offset: 64, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !86, file: !84, line: 33, baseType: !82, size: 32, offset: 96, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !86, file: !84, line: 34, baseType: !95, size: 8, offset: 128, flags: DIFlagPublic)
!95 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !86, file: !84, line: 35, baseType: !97, size: 8, offset: 136, flags: DIFlagPublic)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 8, elements: !15)
!98 = !DISubprogram(name: "Printer", scope: !86, file: !84, line: 37, type: !99, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !82, !89}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!102 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !86, file: !84, line: 57, type: !103, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !101, !106}
!105 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !86, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!108 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !86, file: !84, line: 67, type: !109, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!109 = !DISubroutineType(types: !110)
!110 = !{!105, !101, !111}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !12, line: 9, baseType: !112)
!112 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!113 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !86, file: !84, line: 72, type: !114, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!114 = !DISubroutineType(types: !115)
!115 = !{!105, !101, !116}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !12, line: 11, baseType: !34)
!117 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !86, file: !84, line: 77, type: !118, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(types: !119)
!119 = !{!105, !101, !120}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 10, baseType: !121)
!121 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !86, file: !84, line: 82, type: !123, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{!105, !101, !13}
!125 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !86, file: !84, line: 87, type: !126, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!126 = !DISubroutineType(types: !127)
!127 = !{!105, !101, !128}
!128 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!129 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !86, file: !84, line: 92, type: !130, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{!105, !101, !132}
!132 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!133 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !86, file: !84, line: 97, type: !134, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!134 = !DISubroutineType(types: !135)
!135 = !{!105, !101, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!138 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !86, file: !84, line: 102, type: !139, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{!105, !101, !141}
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 14, baseType: !143)
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !86, file: !84, line: 108, type: !145, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{!105, !101, !147}
!147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !7, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !150, identifier: "_ZTS13halide_type_t")
!150 = !{!151, !153, !154, !155, !159, !162, !166, !169, !170, !171, !174}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !149, file: !7, line: 434, baseType: !152, size: 8, align: 8)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !7, line: 413, baseType: !20)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !149, file: !7, line: 442, baseType: !21, size: 8, align: 8, offset: 8)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !149, file: !7, line: 446, baseType: !142, size: 16, align: 16, offset: 16)
!155 = !DISubprogram(name: "halide_type_t", scope: !149, file: !7, line: 453, type: !156, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !158, !152, !21, !142}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!159 = !DISubprogram(name: "halide_type_t", scope: !149, file: !7, line: 459, type: !160, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !158}
!162 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !149, file: !7, line: 463, type: !163, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!163 = !DISubroutineType(types: !164)
!164 = !{!149, !165, !142}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!166 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !149, file: !7, line: 468, type: !167, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!167 = !DISubroutineType(types: !168)
!168 = !{!95, !165, !147}
!169 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !149, file: !7, line: 472, type: !167, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !149, file: !7, line: 476, type: !167, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !149, file: !7, line: 481, type: !172, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!172 = !DISubroutineType(types: !173)
!173 = !{!34, !165}
!174 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !149, file: !7, line: 485, type: !175, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{!13, !165}
!177 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !86, file: !84, line: 113, type: !178, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{!105, !101, !180}
!180 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !7, line: 1550, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !7, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !184, identifier: "_ZTS15halide_buffer_t")
!184 = !{!185, !186, !265, !267, !268, !269, !270, !293, !294, !299, !303, !306, !307, !310, !311, !315, !318, !319, !320, !325, !328}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !183, file: !7, line: 1425, baseType: !120, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !183, file: !7, line: 1428, baseType: !187, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !7, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTS25halide_device_interface_t")
!190 = !{!191, !196, !200, !201, !205, !206, !207, !208, !209, !213, !219, !223, !224, !228, !229, !234}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !189, file: !7, line: 724, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!34, !82, !195, !187}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !189, file: !7, line: 726, baseType: !197, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{!34, !82, !195}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !189, file: !7, line: 727, baseType: !197, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !189, file: !7, line: 728, baseType: !202, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !82, !187}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !189, file: !7, line: 730, baseType: !197, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !189, file: !7, line: 731, baseType: !192, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !189, file: !7, line: 733, baseType: !192, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !189, file: !7, line: 735, baseType: !197, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !189, file: !7, line: 736, baseType: !210, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!34, !82, !195, !187, !195}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !189, file: !7, line: 738, baseType: !214, size: 32, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!34, !82, !217, !195}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !189, file: !7, line: 740, baseType: !220, size: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{!34, !82, !217, !34, !34, !195}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !189, file: !7, line: 742, baseType: !197, size: 32, offset: 352)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !189, file: !7, line: 743, baseType: !225, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DISubroutineType(types: !227)
!227 = !{!34, !82, !195, !120, !187}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !189, file: !7, line: 745, baseType: !197, size: 32, offset: 416)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !189, file: !7, line: 746, baseType: !230, size: 32, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{!34, !82, !233, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !189, file: !7, line: 747, baseType: !235, size: 32, offset: 480)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !238, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !239, identifier: "_ZTS30halide_device_interface_impl_t")
!238 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!239 = !{!240, !244, !245, !246, !247, !248, !252, !253, !254, !255, !256, !257, !258, !259, !260, !264}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !237, file: !238, line: 16, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !237, file: !238, line: 17, baseType: !241, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !237, file: !238, line: 18, baseType: !197, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !237, file: !238, line: 19, baseType: !197, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !237, file: !238, line: 20, baseType: !197, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !237, file: !238, line: 21, baseType: !249, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{!34, !82}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !237, file: !238, line: 22, baseType: !197, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !237, file: !238, line: 23, baseType: !197, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !237, file: !238, line: 24, baseType: !197, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !237, file: !238, line: 25, baseType: !197, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !237, file: !238, line: 26, baseType: !210, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !237, file: !238, line: 28, baseType: !214, size: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !237, file: !238, line: 31, baseType: !220, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !237, file: !238, line: 35, baseType: !197, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !237, file: !238, line: 37, baseType: !261, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DISubroutineType(types: !263)
!263 = !{!34, !82, !195, !120}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !237, file: !238, line: 38, baseType: !197, size: 32, offset: 480)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !183, file: !7, line: 1433, baseType: !266, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !183, file: !7, line: 1436, baseType: !120, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, file: !7, line: 1439, baseType: !149, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !183, file: !7, line: 1442, baseType: !116, size: 32, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !183, file: !7, line: 1446, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !7, line: 1409, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !7, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !274, identifier: "_ZTS18halide_dimension_t")
!274 = !{!275, !276, !277, !278, !279, !283, !286, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !273, file: !7, line: 1383, baseType: !116, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !273, file: !7, line: 1383, baseType: !116, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !273, file: !7, line: 1383, baseType: !116, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !7, line: 1386, baseType: !13, size: 32, offset: 96)
!279 = !DISubprogram(name: "halide_dimension_t", scope: !273, file: !7, line: 1388, type: !280, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!283 = !DISubprogram(name: "halide_dimension_t", scope: !273, file: !7, line: 1389, type: !284, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !282, !116, !116, !116, !13}
!286 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !273, file: !7, line: 1393, type: !287, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!287 = !DISubroutineType(types: !288)
!288 = !{!95, !289, !291}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!291 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !290, size: 32)
!292 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !273, file: !7, line: 1400, type: !287, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !183, file: !7, line: 1449, baseType: !82, size: 32, offset: 288)
!294 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !183, file: !7, line: 1454, type: !295, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!295 = !DISubroutineType(types: !296)
!296 = !{!95, !297, !298}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !7, line: 1416, baseType: !29)
!299 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !183, file: !7, line: 1458, type: !300, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302, !298, !95}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!303 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !183, file: !7, line: 1466, type: !304, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!95, !297}
!306 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !183, file: !7, line: 1470, type: !304, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!307 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !183, file: !7, line: 1474, type: !308, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !302, !95}
!310 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !183, file: !7, line: 1478, type: !308, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !183, file: !7, line: 1485, type: !312, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DISubroutineType(types: !313)
!313 = !{!314, !297}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 27, baseType: !14)
!315 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !183, file: !7, line: 1495, type: !316, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{!266, !297}
!318 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !183, file: !7, line: 1506, type: !316, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !183, file: !7, line: 1518, type: !312, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !183, file: !7, line: 1523, type: !321, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{!266, !297, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!325 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !183, file: !7, line: 1534, type: !326, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!34, !302, !82}
!328 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !183, file: !7, line: 1545, type: !304, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !86, file: !84, line: 119, type: !330, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DISubroutineType(types: !331)
!331 = !{!106, !101}
!332 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !86, file: !84, line: 131, type: !333, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !101}
!335 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !86, file: !84, line: 139, type: !336, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!120, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!340 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !86, file: !84, line: 143, type: !336, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!341 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !86, file: !84, line: 148, type: !342, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !101, !34}
!344 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !86, file: !84, line: 158, type: !330, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !86, file: !84, line: 162, type: !333, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubprogram(name: "~Printer", scope: !86, file: !84, line: 166, type: !333, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !{!348, !349}
!348 = !DITemplateValueParameter(name: "type", type: !34, value: i32 0)
!349 = !DITemplateValueParameter(name: "length", type: !121, value: i64 1024)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !12, line: 28, baseType: !34)
!351 = !{!0}
!352 = !{!353}
!353 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !17, entity: !2, file: !12, line: 225)
!354 = !{i32 7, !"Dwarf Version", i32 4}
!355 = !{i32 2, !"Debug Info Version", i32 3}
!356 = !{i32 1, !"wchar_size", i32 4}
!357 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!358 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !2, file: !359, line: 47, type: !360, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !17, retainedNodes: !376)
!359 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362, !34, !111, !111}
!362 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !2, file: !359, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !365, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!365 = !{!366, !367, !368, !369, !373, !374, !375}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !364, file: !359, line: 35, baseType: !120, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !364, file: !359, line: 35, baseType: !120, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !364, file: !359, line: 37, baseType: !120, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !364, file: !359, line: 39, baseType: !370, size: 1024, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 1024, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 16)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !364, file: !359, line: 41, baseType: !370, size: 1024, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !364, file: !359, line: 42, baseType: !370, size: 1024, offset: 2240)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !364, file: !359, line: 44, baseType: !120, size: 64, offset: 3264)
!376 = !{!377, !378, !379, !380, !381, !384, !385}
!377 = !DILocalVariable(name: "copy", arg: 1, scope: !358, file: !359, line: 47, type: !362)
!378 = !DILocalVariable(name: "d", arg: 2, scope: !358, file: !359, line: 47, type: !34)
!379 = !DILocalVariable(name: "src_off", arg: 3, scope: !358, file: !359, line: 47, type: !111)
!380 = !DILocalVariable(name: "dst_off", arg: 4, scope: !358, file: !359, line: 47, type: !111)
!381 = !DILocalVariable(name: "from", scope: !382, file: !359, line: 54, type: !136)
!382 = distinct !DILexicalBlock(scope: !383, file: !359, line: 53, column: 18)
!383 = distinct !DILexicalBlock(scope: !358, file: !359, line: 53, column: 9)
!384 = !DILocalVariable(name: "to", scope: !382, file: !359, line: 55, type: !82)
!385 = !DILocalVariable(name: "i", scope: !386, file: !359, line: 58, type: !120)
!386 = distinct !DILexicalBlock(scope: !387, file: !359, line: 58, column: 9)
!387 = distinct !DILexicalBlock(scope: !383, file: !359, line: 57, column: 12)
!388 = !DILocation(line: 0, scope: !358)
!389 = !DILocation(line: 49, column: 14, scope: !358)
!390 = !DILocation(line: 49, column: 19, scope: !358)
!391 = !DILocation(line: 49, column: 22, scope: !358)
!392 = !{!393, !393, i64 0}
!393 = !{!"long long", !394, i64 0}
!394 = !{!"omnipotent char", !395, i64 0}
!395 = !{!"Simple C++ TBAA"}
!396 = !DILocation(line: 49, column: 37, scope: !358)
!397 = !DILocation(line: 49, column: 5, scope: !358)
!398 = !DILocation(line: 50, column: 10, scope: !399)
!399 = distinct !DILexicalBlock(scope: !358, file: !359, line: 49, column: 43)
!400 = distinct !{!400, !397, !401, !402}
!401 = !DILocation(line: 51, column: 5, scope: !358)
!402 = !{!"llvm.loop.mustprogress"}
!403 = !DILocation(line: 53, column: 11, scope: !383)
!404 = !DILocation(line: 53, column: 9, scope: !358)
!405 = !DILocation(line: 0, scope: !386)
!406 = !DILocation(line: 58, column: 34, scope: !407)
!407 = distinct !DILexicalBlock(scope: !386, file: !359, line: 58, column: 9)
!408 = !DILocation(line: 58, column: 32, scope: !407)
!409 = !DILocation(line: 58, column: 9, scope: !386)
!410 = !DILocation(line: 54, column: 42, scope: !382)
!411 = !{!412, !393, i64 0}
!412 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !393, i64 0, !393, i64 8, !393, i64 16, !394, i64 24, !394, i64 152, !394, i64 280, !393, i64 408}
!413 = !DILocation(line: 54, column: 46, scope: !382)
!414 = !DILocation(line: 54, column: 28, scope: !382)
!415 = !DILocation(line: 0, scope: !382)
!416 = !DILocation(line: 55, column: 34, scope: !382)
!417 = !{!412, !393, i64 8}
!418 = !DILocation(line: 55, column: 38, scope: !382)
!419 = !DILocation(line: 55, column: 20, scope: !382)
!420 = !DILocation(line: 56, column: 31, scope: !382)
!421 = !{!412, !393, i64 408}
!422 = !DILocation(line: 56, column: 26, scope: !382)
!423 = !DILocation(line: 56, column: 9, scope: !382)
!424 = !DILocation(line: 57, column: 5, scope: !382)
!425 = !DILocation(line: 59, column: 13, scope: !426)
!426 = distinct !DILexicalBlock(scope: !407, file: !359, line: 58, column: 55)
!427 = !DILocation(line: 60, column: 24, scope: !426)
!428 = !DILocation(line: 60, column: 21, scope: !426)
!429 = !DILocation(line: 61, column: 24, scope: !426)
!430 = !DILocation(line: 61, column: 21, scope: !426)
!431 = !DILocation(line: 58, column: 51, scope: !407)
!432 = distinct !{!432, !409, !433, !402}
!433 = !DILocation(line: 62, column: 9, scope: !386)
!434 = !DILocation(line: 64, column: 1, scope: !358)
!435 = !DISubprogram(name: "memcpy", scope: !12, file: !12, line: 94, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{!82, !82, !136, !14}
!438 = !{}
