; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_host.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_host.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::Hexagon::_remote_buffer__seq_octet" = type { i8*, i32 }
%"struct.Halide::Runtime::Internal::Hexagon::module_state" = type { i32, %"struct.Halide::Runtime::Internal::Hexagon::module_state"* }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "thread_lock", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon11thread_lockE", scope: !2, file: !6, line: 18, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Hexagon", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_host.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !8, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS12halide_mutex")
!8 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !7, file: !8, line: 121, baseType: !11, size: 32)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !16)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 68, baseType: !14)
!13 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 12, baseType: !15)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17}
!17 = !DISubrange(count: 1)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "remote_load_library", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon19remote_load_libraryE", scope: !2, file: !6, line: 48, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_load_library_fn", scope: !2, file: !6, line: 30, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !25, !24, !28, !24, !31}
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_hexagon_handle_t", file: !33, line: 21, baseType: !24)
!33 = !DIFile(filename: "src/runtime/HalideRuntimeHexagonHost.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "remote_get_symbol", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon17remote_get_symbolE", scope: !2, file: !6, line: 49, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_get_symbol_fn", scope: !2, file: !6, line: 31, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DISubroutineType(types: !39)
!39 = !{!24, !32, !25, !24, !31}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "remote_run", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon10remote_runE", scope: !2, file: !6, line: 50, type: !42, isLocal: false, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_run_fn", scope: !2, file: !6, line: 32, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DISubroutineType(types: !45)
!45 = !{!24, !32, !24, !46, !24, !46, !24, !55, !24}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_buffer", scope: !2, file: !6, line: 24, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "_remote_buffer__seq_octet", scope: !2, file: !6, line: 23, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_remote_buffer__seq_octet", scope: !2, file: !6, line: 25, size: 64, flags: DIFlagTypePassByValue, elements: !51, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon25_remote_buffer__seq_octetE")
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !6, line: 26, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dataLen", scope: !50, file: !6, line: 27, baseType: !24, size: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "remote_release_library", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon22remote_release_libraryE", scope: !2, file: !6, line: 51, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_release_library_fn", scope: !2, file: !6, line: 35, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DISubroutineType(types: !61)
!61 = !{!24, !32}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "remote_poll_log", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon15remote_poll_logE", scope: !2, file: !6, line: 52, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_poll_log_fn", scope: !2, file: !6, line: 36, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DISubroutineType(types: !67)
!67 = !{!24, !68, !24, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "remote_poll_profiler_state", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon26remote_poll_profiler_stateE", scope: !2, file: !6, line: 53, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_poll_profiler_state_fn", scope: !2, file: !6, line: 37, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !69, !69}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "remote_profiler_set_current_func", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon32remote_profiler_set_current_funcE", scope: !2, file: !6, line: 54, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_profiler_set_current_func_fn", scope: !2, file: !6, line: 38, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DISubroutineType(types: !81)
!81 = !{!24, !24}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "remote_power_hvx_on", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon19remote_power_hvx_onE", scope: !2, file: !6, line: 55, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_power_fn", scope: !2, file: !6, line: 39, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = !DISubroutineType(types: !87)
!87 = !{!24}
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "remote_power_hvx_off", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon20remote_power_hvx_offE", scope: !2, file: !6, line: 56, type: !84, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "remote_set_performance", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon22remote_set_performanceE", scope: !2, file: !6, line: 57, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_power_perf_fn", scope: !2, file: !6, line: 41, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DISubroutineType(types: !95)
!95 = !{!24, !24, !15, !15, !24, !15, !15, !24, !24}
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "remote_set_performance_mode", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon27remote_set_performance_modeE", scope: !2, file: !6, line: 58, type: !98, isLocal: false, isDefinition: true)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_power_mode_fn", scope: !2, file: !6, line: 40, baseType: !79)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "remote_set_thread_priority", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon26remote_set_thread_priorityE", scope: !2, file: !6, line: 59, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "remote_thread_priority_fn", scope: !2, file: !6, line: 42, baseType: !79)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "host_malloc_init", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon16host_malloc_initE", scope: !2, file: !6, line: 61, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "host_malloc_init_fn", scope: !2, file: !6, line: 44, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DISubroutineType(types: !107)
!107 = !{null}
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "host_malloc_deinit", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon18host_malloc_deinitE", scope: !2, file: !6, line: 62, type: !104, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "host_malloc", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon11host_mallocE", scope: !2, file: !6, line: 63, type: !112, isLocal: false, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "host_malloc_fn", scope: !2, file: !6, line: 45, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 27, baseType: !15)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "host_free", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon9host_freeE", scope: !2, file: !6, line: 64, type: !120, isLocal: false, isDefinition: true)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "host_free_fn", scope: !2, file: !6, line: 46, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !116}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "state_list", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon10state_listE", scope: !2, file: !6, line: 201, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_state", scope: !2, file: !6, line: 197, size: 64, flags: DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon12module_stateE")
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !127, file: !6, line: 198, baseType: !32, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !6, line: 199, baseType: !126, size: 32, offset: 32)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "shared_runtime", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon14shared_runtimeE", scope: !2, file: !6, line: 202, type: !32, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "unique_id", scope: !135, file: !6, line: 306, type: !24, isLocal: true, isDefinition: true)
!135 = distinct !DISubprogram(name: "halide_hexagon_initialize_kernels", scope: !6, file: !6, line: 239, type: !136, scopeLine: 241, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !612)
!136 = !DISubroutineType(types: !137)
!137 = !{!24, !116, !138, !139, !142, !139, !142}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 16, baseType: !30)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 10, baseType: !143)
!143 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!144 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !145, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !218, globals: !601, imports: !608, splitDebugInlining: false, nameTableKind: None)
!145 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_host.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!146 = !{!147, !154, !158, !205}
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !8, line: 403, baseType: !141, size: 8, elements: !148, identifier: "_ZTS18halide_type_code_t")
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!153 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 1415, baseType: !15, size: 32, elements: !155, identifier: "_ZTS19halide_buffer_flags")
!155 = !{!156, !157}
!156 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !8, line: 990, baseType: !24, size: 32, elements: !159, identifier: "_ZTS19halide_error_code_t")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!160 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!161 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!162 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!163 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!164 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!165 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!166 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!167 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!168 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!169 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!170 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!171 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!172 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!173 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!174 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!175 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!176 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!177 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!178 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!179 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!180 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!181 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!182 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!183 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!184 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!185 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!186 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!187 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!188 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!189 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!190 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!191 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!192 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!193 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!194 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!195 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!196 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!197 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!198 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!199 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!200 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!201 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!202 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!203 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!204 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_hexagon_power_mode_t", file: !33, line: 66, baseType: !15, size: 32, elements: !206, identifier: "_ZTS27halide_hexagon_power_mode_t")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!207 = !DIEnumerator(name: "halide_hexagon_power_low", value: 0, isUnsigned: true)
!208 = !DIEnumerator(name: "halide_hexagon_power_nominal", value: 1, isUnsigned: true)
!209 = !DIEnumerator(name: "halide_hexagon_power_turbo", value: 2, isUnsigned: true)
!210 = !DIEnumerator(name: "halide_hexagon_power_default", value: 3, isUnsigned: true)
!211 = !DIEnumerator(name: "halide_hexagon_power_low_plus", value: 4, isUnsigned: true)
!212 = !DIEnumerator(name: "halide_hexagon_power_low_2", value: 5, isUnsigned: true)
!213 = !DIEnumerator(name: "halide_hexagon_power_nominal_plus", value: 6, isUnsigned: true)
!214 = !DIEnumerator(name: "halide_hvx_power_low", value: 0, isUnsigned: true)
!215 = !DIEnumerator(name: "halide_hvx_power_nominal", value: 1, isUnsigned: true)
!216 = !DIEnumerator(name: "halide_hvx_power_turbo", value: 2, isUnsigned: true)
!217 = !DIEnumerator(name: "halide_hvx_power_default", value: 3, isUnsigned: true)
!218 = !{!116, !219, !142, !475, !476, !24, !117, !543, !126, !544, !392, !55, !577, !585, !243, !68, !586, !589, !592, !79, !105, !598, !121, !65, !73, !85, !93, !12}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !221, file: !220, line: 203, baseType: !222)
!220 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!221 = !DINamespace(scope: !3)
!222 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !221, file: !220, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !223, templateParams: !472)
!223 = !{!224, !225, !226, !227, !228, !230, !232, !236, !240, !245, !249, !252, !255, !259, !263, !268, !274, !307, !454, !457, !460, !465, !466, !469, !470, !471}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !222, file: !220, line: 32, baseType: !68, size: 32, flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !222, file: !220, line: 32, baseType: !68, size: 32, offset: 32, flags: DIFlagPublic)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !222, file: !220, line: 32, baseType: !68, size: 32, offset: 64, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !222, file: !220, line: 33, baseType: !116, size: 32, offset: 96, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !222, file: !220, line: 34, baseType: !229, size: 8, offset: 128, flags: DIFlagPublic)
!229 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !222, file: !220, line: 35, baseType: !231, size: 8, offset: 136, flags: DIFlagPublic)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !16)
!232 = !DISubprogram(name: "Printer", scope: !222, file: !220, line: 37, type: !233, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !235, !116, !68}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!236 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !222, file: !220, line: 57, type: !237, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !235, !25}
!239 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !222, size: 32)
!240 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !222, file: !220, line: 67, type: !241, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{!239, !235, !243}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 9, baseType: !244)
!244 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!245 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !222, file: !220, line: 72, type: !246, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!239, !235, !248}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 11, baseType: !24)
!249 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !222, file: !220, line: 77, type: !250, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!239, !235, !142}
!252 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !222, file: !220, line: 82, type: !253, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{!239, !235, !14}
!255 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !222, file: !220, line: 87, type: !256, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!239, !235, !258}
!258 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!259 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !222, file: !220, line: 92, type: !260, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DISubroutineType(types: !261)
!261 = !{!239, !235, !262}
!262 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!263 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !222, file: !220, line: 97, type: !264, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!239, !235, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!268 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !222, file: !220, line: 102, type: !269, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubroutineType(types: !270)
!270 = !{!239, !235, !271}
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 14, baseType: !273)
!273 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!274 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !222, file: !220, line: 108, type: !275, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!275 = !DISubroutineType(types: !276)
!276 = !{!239, !235, !277}
!277 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !8, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !280, identifier: "_ZTS13halide_type_t")
!280 = !{!281, !283, !284, !285, !289, !292, !296, !299, !300, !301, !304}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !279, file: !8, line: 434, baseType: !282, size: 8, align: 8)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !8, line: 413, baseType: !147)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !279, file: !8, line: 442, baseType: !141, size: 8, align: 8, offset: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !279, file: !8, line: 446, baseType: !272, size: 16, align: 16, offset: 16)
!285 = !DISubprogram(name: "halide_type_t", scope: !279, file: !8, line: 453, type: !286, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288, !282, !141, !272}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!289 = !DISubprogram(name: "halide_type_t", scope: !279, file: !8, line: 459, type: !290, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !288}
!292 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !279, file: !8, line: 463, type: !293, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!293 = !DISubroutineType(types: !294)
!294 = !{!279, !295, !272}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!296 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !279, file: !8, line: 468, type: !297, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!229, !295, !277}
!299 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !279, file: !8, line: 472, type: !297, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !279, file: !8, line: 476, type: !297, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!301 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !279, file: !8, line: 481, type: !302, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{!24, !295}
!304 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !279, file: !8, line: 485, type: !305, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!305 = !DISubroutineType(types: !306)
!306 = !{!14, !295}
!307 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !222, file: !220, line: 113, type: !308, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!308 = !DISubroutineType(types: !309)
!309 = !{!239, !235, !310}
!310 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !8, line: 1550, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !8, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !314, identifier: "_ZTS15halide_buffer_t")
!314 = !{!315, !316, !391, !393, !394, !395, !396, !419, !420, !425, !429, !432, !433, !436, !437, !440, !443, !444, !445, !450, !453}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !313, file: !8, line: 1425, baseType: !142, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !313, file: !8, line: 1428, baseType: !317, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !8, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !320, identifier: "_ZTS25halide_device_interface_t")
!320 = !{!321, !326, !330, !331, !335, !336, !337, !338, !339, !343, !349, !353, !354, !358, !359, !363}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !319, file: !8, line: 724, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!24, !116, !325, !317}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !319, file: !8, line: 726, baseType: !327, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{!24, !116, !325}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !319, file: !8, line: 727, baseType: !327, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !319, file: !8, line: 728, baseType: !332, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !116, !317}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !319, file: !8, line: 730, baseType: !327, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !319, file: !8, line: 731, baseType: !322, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !319, file: !8, line: 733, baseType: !322, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !319, file: !8, line: 735, baseType: !327, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !319, file: !8, line: 736, baseType: !340, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DISubroutineType(types: !342)
!342 = !{!24, !116, !325, !317, !325}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !319, file: !8, line: 738, baseType: !344, size: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DISubroutineType(types: !346)
!346 = !{!24, !116, !347, !325}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !319, file: !8, line: 740, baseType: !350, size: 32, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DISubroutineType(types: !352)
!352 = !{!24, !116, !347, !24, !24, !325}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !319, file: !8, line: 742, baseType: !327, size: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !319, file: !8, line: 743, baseType: !355, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DISubroutineType(types: !357)
!357 = !{!24, !116, !325, !142, !317}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !319, file: !8, line: 745, baseType: !327, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !319, file: !8, line: 746, baseType: !360, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{!24, !116, !69, !69}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !319, file: !8, line: 747, baseType: !364, size: 32, offset: 480)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !367, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !368, identifier: "_ZTS30halide_device_interface_impl_t")
!367 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!368 = !{!369, !370, !371, !372, !373, !374, !378, !379, !380, !381, !382, !383, !384, !385, !386, !390}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !366, file: !367, line: 16, baseType: !105, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !366, file: !367, line: 17, baseType: !105, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !366, file: !367, line: 18, baseType: !327, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !366, file: !367, line: 19, baseType: !327, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !366, file: !367, line: 20, baseType: !327, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !366, file: !367, line: 21, baseType: !375, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!24, !116}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !366, file: !367, line: 22, baseType: !327, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !366, file: !367, line: 23, baseType: !327, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !366, file: !367, line: 24, baseType: !327, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !366, file: !367, line: 25, baseType: !327, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !366, file: !367, line: 26, baseType: !340, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !366, file: !367, line: 28, baseType: !344, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !366, file: !367, line: 31, baseType: !350, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !366, file: !367, line: 35, baseType: !327, size: 32, offset: 416)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !366, file: !367, line: 37, baseType: !387, size: 32, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DISubroutineType(types: !389)
!389 = !{!24, !116, !325, !142}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !366, file: !367, line: 38, baseType: !327, size: 32, offset: 480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !313, file: !8, line: 1433, baseType: !392, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !8, line: 1436, baseType: !142, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !8, line: 1439, baseType: !279, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !313, file: !8, line: 1442, baseType: !248, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !313, file: !8, line: 1446, baseType: !397, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !8, line: 1409, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !8, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !400, identifier: "_ZTS18halide_dimension_t")
!400 = !{!401, !402, !403, !404, !405, !409, !412, !418}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !399, file: !8, line: 1383, baseType: !248, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !399, file: !8, line: 1383, baseType: !248, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !399, file: !8, line: 1383, baseType: !248, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !8, line: 1386, baseType: !14, size: 32, offset: 96)
!405 = !DISubprogram(name: "halide_dimension_t", scope: !399, file: !8, line: 1388, type: !406, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!409 = !DISubprogram(name: "halide_dimension_t", scope: !399, file: !8, line: 1389, type: !410, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !408, !248, !248, !248, !14}
!412 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !399, file: !8, line: 1393, type: !413, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubroutineType(types: !414)
!414 = !{!229, !415, !417}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!417 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !416, size: 32)
!418 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !399, file: !8, line: 1400, type: !413, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !313, file: !8, line: 1449, baseType: !116, size: 32, offset: 288)
!420 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !313, file: !8, line: 1454, type: !421, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{!229, !423, !424}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !8, line: 1416, baseType: !154)
!425 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !313, file: !8, line: 1458, type: !426, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428, !424, !229}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!429 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !313, file: !8, line: 1466, type: !430, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!430 = !DISubroutineType(types: !431)
!431 = !{!229, !423}
!432 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !313, file: !8, line: 1470, type: !430, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !313, file: !8, line: 1474, type: !434, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !428, !229}
!436 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !313, file: !8, line: 1478, type: !434, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !313, file: !8, line: 1485, type: !438, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{!117, !423}
!440 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !313, file: !8, line: 1495, type: !441, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!441 = !DISubroutineType(types: !442)
!442 = !{!392, !423}
!443 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !313, file: !8, line: 1506, type: !441, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!444 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !313, file: !8, line: 1518, type: !438, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !313, file: !8, line: 1523, type: !446, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubroutineType(types: !447)
!447 = !{!392, !423, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!450 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !313, file: !8, line: 1534, type: !451, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!24, !428, !116}
!453 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !313, file: !8, line: 1545, type: !430, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !222, file: !220, line: 119, type: !455, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubroutineType(types: !456)
!456 = !{!25, !235}
!457 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !222, file: !220, line: 131, type: !458, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !235}
!460 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !222, file: !220, line: 139, type: !461, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!461 = !DISubroutineType(types: !462)
!462 = !{!142, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!465 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !222, file: !220, line: 143, type: !461, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !222, file: !220, line: 148, type: !467, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !235, !24}
!469 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !222, file: !220, line: 158, type: !455, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !222, file: !220, line: 162, type: !458, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DISubprogram(name: "~Printer", scope: !222, file: !220, line: 166, type: !458, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !{!473, !474}
!473 = !DITemplateValueParameter(name: "type", type: !24, value: i32 0)
!474 = !DITemplateValueParameter(name: "length", type: !143, value: i64 1024)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "print", scope: !221, file: !220, line: 198, baseType: !222)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !221, file: !220, line: 199, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !221, file: !220, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !478, templateParams: !541)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !489, !493, !496, !499, !502, !505, !508, !511, !514, !517, !520, !523, !526, !529, !534, !535, !538, !539, !540}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !477, file: !220, line: 32, baseType: !68, size: 32, flags: DIFlagPublic)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !477, file: !220, line: 32, baseType: !68, size: 32, offset: 32, flags: DIFlagPublic)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !477, file: !220, line: 32, baseType: !68, size: 32, offset: 64, flags: DIFlagPublic)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !477, file: !220, line: 33, baseType: !116, size: 32, offset: 96, flags: DIFlagPublic)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !477, file: !220, line: 34, baseType: !229, size: 8, offset: 128, flags: DIFlagPublic)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !477, file: !220, line: 35, baseType: !231, size: 8, offset: 136, flags: DIFlagPublic)
!485 = !DISubprogram(name: "Printer", scope: !477, file: !220, line: 37, type: !486, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !488, !116, !68}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!489 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !477, file: !220, line: 57, type: !490, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !488, !25}
!492 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !477, size: 32)
!493 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !477, file: !220, line: 67, type: !494, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubroutineType(types: !495)
!495 = !{!492, !488, !243}
!496 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !477, file: !220, line: 72, type: !497, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DISubroutineType(types: !498)
!498 = !{!492, !488, !248}
!499 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !477, file: !220, line: 77, type: !500, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!492, !488, !142}
!502 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !477, file: !220, line: 82, type: !503, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!503 = !DISubroutineType(types: !504)
!504 = !{!492, !488, !14}
!505 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !477, file: !220, line: 87, type: !506, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!506 = !DISubroutineType(types: !507)
!507 = !{!492, !488, !258}
!508 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !477, file: !220, line: 92, type: !509, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubroutineType(types: !510)
!510 = !{!492, !488, !262}
!511 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !477, file: !220, line: 97, type: !512, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(types: !513)
!513 = !{!492, !488, !266}
!514 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !477, file: !220, line: 102, type: !515, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!515 = !DISubroutineType(types: !516)
!516 = !{!492, !488, !271}
!517 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !477, file: !220, line: 108, type: !518, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!518 = !DISubroutineType(types: !519)
!519 = !{!492, !488, !277}
!520 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !477, file: !220, line: 113, type: !521, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!521 = !DISubroutineType(types: !522)
!522 = !{!492, !488, !310}
!523 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !477, file: !220, line: 119, type: !524, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!25, !488}
!526 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !477, file: !220, line: 131, type: !527, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !488}
!529 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !477, file: !220, line: 139, type: !530, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DISubroutineType(types: !531)
!531 = !{!142, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!534 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !477, file: !220, line: 143, type: !530, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !477, file: !220, line: 148, type: !536, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !488, !24}
!538 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !477, file: !220, line: 158, type: !524, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !477, file: !220, line: 162, type: !527, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubprogram(name: "~Printer", scope: !477, file: !220, line: 166, type: !527, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !{!542, !474}
!542 = !DITemplateValueParameter(name: "type", type: !24, value: i32 1)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hexagon_device_pointer", scope: !546, file: !6, line: 356, size: 128, flags: DIFlagTypePassByValue, elements: !582)
!546 = distinct !DISubprogram(name: "map_arguments", scope: !547, file: !6, line: 345, type: !548, scopeLine: 347, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !551)
!547 = !DINamespace(scope: null)
!548 = !DISubroutineType(types: !549)
!549 = !{!24, !116, !24, !550, !138, !69, !24, !24, !55}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !563, !567, !572, !573, !574}
!552 = !DILocalVariable(name: "user_context", arg: 1, scope: !546, file: !6, line: 345, type: !116)
!553 = !DILocalVariable(name: "arg_count", arg: 2, scope: !546, file: !6, line: 345, type: !24)
!554 = !DILocalVariable(name: "arg_sizes", arg: 3, scope: !546, file: !6, line: 346, type: !550)
!555 = !DILocalVariable(name: "args", arg: 4, scope: !546, file: !6, line: 346, type: !138)
!556 = !DILocalVariable(name: "arg_flags", arg: 5, scope: !546, file: !6, line: 346, type: !69)
!557 = !DILocalVariable(name: "flag_mask", arg: 6, scope: !546, file: !6, line: 346, type: !24)
!558 = !DILocalVariable(name: "flag_value", arg: 7, scope: !546, file: !6, line: 346, type: !24)
!559 = !DILocalVariable(name: "mapped_args", arg: 8, scope: !546, file: !6, line: 347, type: !55)
!560 = !DILocalVariable(name: "mapped_count", scope: !546, file: !6, line: 348, type: !24)
!561 = !DILocalVariable(name: "i", scope: !562, file: !6, line: 349, type: !24)
!562 = distinct !DILexicalBlock(scope: !546, file: !6, line: 349, column: 5)
!563 = !DILocalVariable(name: "mapped_arg", scope: !564, file: !6, line: 353, type: !566)
!564 = distinct !DILexicalBlock(scope: !565, file: !6, line: 349, column: 41)
!565 = distinct !DILexicalBlock(scope: !562, file: !6, line: 349, column: 5)
!566 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !48, size: 32)
!567 = !DILocalVariable(name: "b", scope: !568, file: !6, line: 360, type: !570)
!568 = distinct !DILexicalBlock(scope: !569, file: !6, line: 354, column: 32)
!569 = distinct !DILexicalBlock(scope: !564, file: !6, line: 354, column: 13)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!572 = !DILocalVariable(name: "device", scope: !568, file: !6, line: 361, type: !142)
!573 = !DILocalVariable(name: "host", scope: !568, file: !6, line: 362, type: !392)
!574 = !DILocalVariable(name: "ion_handle", scope: !575, file: !6, line: 365, type: !577)
!575 = distinct !DILexicalBlock(scope: !576, file: !6, line: 363, column: 25)
!576 = distinct !DILexicalBlock(scope: !568, file: !6, line: 363, column: 17)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ion_device_handle", scope: !2, file: !6, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !579, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon17ion_device_handleE")
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !578, file: !6, line: 14, baseType: !116, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !578, file: !6, line: 15, baseType: !117, size: 32, offset: 32)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !545, file: !6, line: 357, baseType: !142, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !545, file: !6, line: 358, baseType: !392, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !13, line: 28, baseType: !24)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DISubroutineType(types: !588)
!588 = !{!24, !25, !24, !28, !24, !69}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!24, !24, !25, !24, !69}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{!24, !24, !24, !595, !24, !595, !24, !597, !24}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DISubroutineType(types: !600)
!600 = !{!116, !15}
!601 = !{!0, !18, !34, !40, !56, !62, !70, !76, !82, !88, !90, !96, !99, !102, !108, !110, !118, !124, !131, !133, !602, !604, !606}
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression(DW_OP_constu, 4096, DW_OP_stack_value))
!603 = distinct !DIGlobalVariable(name: "min_ion_allocation_size", scope: !144, file: !6, line: 531, type: !449, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "hexagon_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon29hexagon_device_interface_implE", scope: !2, file: !6, line: 1025, type: !366, isLocal: false, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "hexagon_device_interface", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon24hexagon_device_interfaceE", scope: !2, file: !6, line: 1044, type: !319, isLocal: false, isDefinition: true)
!608 = !{!609, !610, !611}
!609 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !144, entity: !3, file: !13, line: 225)
!610 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !144, entity: !3, file: !6, line: 229)
!611 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !144, entity: !2, file: !6, line: 230)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !634, !640, !641, !711, !712}
!613 = !DILocalVariable(name: "user_context", arg: 1, scope: !135, file: !6, line: 239, type: !116)
!614 = !DILocalVariable(name: "state_ptr", arg: 2, scope: !135, file: !6, line: 239, type: !138)
!615 = !DILocalVariable(name: "code", arg: 3, scope: !135, file: !6, line: 240, type: !139)
!616 = !DILocalVariable(name: "code_size", arg: 4, scope: !135, file: !6, line: 240, type: !142)
!617 = !DILocalVariable(name: "runtime", arg: 5, scope: !135, file: !6, line: 241, type: !139)
!618 = !DILocalVariable(name: "runtime_size", arg: 6, scope: !135, file: !6, line: 241, type: !142)
!619 = !DILocalVariable(name: "result", scope: !135, file: !6, line: 242, type: !24)
!620 = !DILocalVariable(name: "t_before", scope: !135, file: !6, line: 256, type: !142)
!621 = !DILocalVariable(name: "lock", scope: !135, file: !6, line: 265, type: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedMutexLock", scope: !3, file: !623, line: 11, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !624, identifier: "_ZTSN6Halide7Runtime8Internal15ScopedMutexLockE")
!623 = !DIFile(filename: "src/runtime/scoped_mutex_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!624 = !{!625, !627, !631}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !622, file: !623, line: 12, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!627 = !DISubprogram(name: "ScopedMutexLock", scope: !622, file: !623, line: 14, type: !628, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630, !626}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!631 = !DISubprogram(name: "~ScopedMutexLock", scope: !622, file: !623, line: 19, type: !632, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !630}
!634 = !DILocalVariable(name: "soname", scope: !635, file: !6, line: 270, type: !637)
!635 = distinct !DILexicalBlock(scope: !636, file: !6, line: 268, column: 26)
!636 = distinct !DILexicalBlock(scope: !135, file: !6, line: 268, column: 9)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 28)
!640 = !DILocalVariable(name: "state", scope: !135, file: !6, line: 294, type: !543)
!641 = !DILocalVariable(name: "soname", scope: !642, file: !6, line: 307, type: !644)
!642 = distinct !DILexicalBlock(scope: !643, file: !6, line: 305, column: 28)
!643 = distinct !DILexicalBlock(scope: !135, file: !6, line: 305, column: 9)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringstream", scope: !221, file: !220, line: 200, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 1024>", scope: !221, file: !220, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !646, templateParams: !709)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !657, !661, !664, !667, !670, !673, !676, !679, !682, !685, !688, !691, !694, !697, !702, !703, !706, !707, !708}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !645, file: !220, line: 32, baseType: !68, size: 32, flags: DIFlagPublic)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !645, file: !220, line: 32, baseType: !68, size: 32, offset: 32, flags: DIFlagPublic)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !645, file: !220, line: 32, baseType: !68, size: 32, offset: 64, flags: DIFlagPublic)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !645, file: !220, line: 33, baseType: !116, size: 32, offset: 96, flags: DIFlagPublic)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !645, file: !220, line: 34, baseType: !229, size: 8, offset: 128, flags: DIFlagPublic)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !645, file: !220, line: 35, baseType: !231, size: 8, offset: 136, flags: DIFlagPublic)
!653 = !DISubprogram(name: "Printer", scope: !645, file: !220, line: 37, type: !654, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !656, !116, !68}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!657 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !645, file: !220, line: 57, type: !658, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !656, !25}
!660 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !645, size: 32)
!661 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEx", scope: !645, file: !220, line: 67, type: !662, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DISubroutineType(types: !663)
!663 = !{!660, !656, !243}
!664 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEi", scope: !645, file: !220, line: 72, type: !665, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!665 = !DISubroutineType(types: !666)
!666 = !{!660, !656, !248}
!667 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEy", scope: !645, file: !220, line: 77, type: !668, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!668 = !DISubroutineType(types: !669)
!669 = !{!660, !656, !142}
!670 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEj", scope: !645, file: !220, line: 82, type: !671, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!671 = !DISubroutineType(types: !672)
!672 = !{!660, !656, !14}
!673 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEd", scope: !645, file: !220, line: 87, type: !674, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!674 = !DISubroutineType(types: !675)
!675 = !{!660, !656, !258}
!676 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEf", scope: !645, file: !220, line: 92, type: !677, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!677 = !DISubroutineType(types: !678)
!678 = !{!660, !656, !262}
!679 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKv", scope: !645, file: !220, line: 97, type: !680, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!680 = !DISubroutineType(types: !681)
!681 = !{!660, !656, !266}
!682 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE23write_float16_from_bitsEt", scope: !645, file: !220, line: 102, type: !683, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!683 = !DISubroutineType(types: !684)
!684 = !{!660, !656, !271}
!685 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK13halide_type_t", scope: !645, file: !220, line: 108, type: !686, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!686 = !DISubroutineType(types: !687)
!687 = !{!660, !656, !277}
!688 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK15halide_buffer_t", scope: !645, file: !220, line: 113, type: !689, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!689 = !DISubroutineType(types: !690)
!690 = !{!660, !656, !310}
!691 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE3strEv", scope: !645, file: !220, line: 119, type: !692, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!692 = !DISubroutineType(types: !693)
!693 = !{!25, !656}
!694 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5clearEv", scope: !645, file: !220, line: 131, type: !695, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !656}
!697 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE4sizeEv", scope: !645, file: !220, line: 139, type: !698, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!698 = !DISubroutineType(types: !699)
!699 = !{!142, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!702 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE8capacityEv", scope: !645, file: !220, line: 143, type: !698, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!703 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5eraseEi", scope: !645, file: !220, line: 148, type: !704, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !656, !24}
!706 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE16allocation_errorEv", scope: !645, file: !220, line: 158, type: !692, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!707 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE28msan_annotate_is_initializedEv", scope: !645, file: !220, line: 162, type: !695, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!708 = !DISubprogram(name: "~Printer", scope: !645, file: !220, line: 166, type: !695, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!709 = !{!710, !474}
!710 = !DITemplateValueParameter(name: "type", type: !24, value: i32 2)
!711 = !DILocalVariable(name: "module", scope: !642, file: !6, line: 314, type: !32)
!712 = !DILocalVariable(name: "t_after", scope: !135, file: !6, line: 329, type: !142)
!713 = !{i32 7, !"Dwarf Version", i32 4}
!714 = !{i32 2, !"Debug Info Version", i32 3}
!715 = !{i32 1, !"wchar_size", i32 4}
!716 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!717 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !718, line: 47, type: !719, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !735)
!718 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!719 = !DISubroutineType(types: !720)
!720 = !{null, !721, !24, !243, !243}
!721 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !718, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !724, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!724 = !{!725, !726, !727, !728, !732, !733, !734}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !723, file: !718, line: 35, baseType: !142, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !723, file: !718, line: 35, baseType: !142, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !723, file: !718, line: 37, baseType: !142, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !723, file: !718, line: 39, baseType: !729, size: 1024, offset: 192)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1024, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !723, file: !718, line: 41, baseType: !729, size: 1024, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !723, file: !718, line: 42, baseType: !729, size: 1024, offset: 2240)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !723, file: !718, line: 44, baseType: !142, size: 64, offset: 3264)
!735 = !{!736, !737, !738, !739, !740, !743, !744}
!736 = !DILocalVariable(name: "copy", arg: 1, scope: !717, file: !718, line: 47, type: !721)
!737 = !DILocalVariable(name: "d", arg: 2, scope: !717, file: !718, line: 47, type: !24)
!738 = !DILocalVariable(name: "src_off", arg: 3, scope: !717, file: !718, line: 47, type: !243)
!739 = !DILocalVariable(name: "dst_off", arg: 4, scope: !717, file: !718, line: 47, type: !243)
!740 = !DILocalVariable(name: "from", scope: !741, file: !718, line: 54, type: !266)
!741 = distinct !DILexicalBlock(scope: !742, file: !718, line: 53, column: 18)
!742 = distinct !DILexicalBlock(scope: !717, file: !718, line: 53, column: 9)
!743 = !DILocalVariable(name: "to", scope: !741, file: !718, line: 55, type: !116)
!744 = !DILocalVariable(name: "i", scope: !745, file: !718, line: 58, type: !142)
!745 = distinct !DILexicalBlock(scope: !746, file: !718, line: 58, column: 9)
!746 = distinct !DILexicalBlock(scope: !742, file: !718, line: 57, column: 12)
!747 = !DILocation(line: 0, scope: !717)
!748 = !DILocation(line: 49, column: 14, scope: !717)
!749 = !DILocation(line: 49, column: 19, scope: !717)
!750 = !DILocation(line: 49, column: 22, scope: !717)
!751 = !{!752, !752, i64 0}
!752 = !{!"long long", !753, i64 0}
!753 = !{!"omnipotent char", !754, i64 0}
!754 = !{!"Simple C++ TBAA"}
!755 = !DILocation(line: 49, column: 37, scope: !717)
!756 = !DILocation(line: 49, column: 5, scope: !717)
!757 = !DILocation(line: 50, column: 10, scope: !758)
!758 = distinct !DILexicalBlock(scope: !717, file: !718, line: 49, column: 43)
!759 = distinct !{!759, !756, !760, !761}
!760 = !DILocation(line: 51, column: 5, scope: !717)
!761 = !{!"llvm.loop.mustprogress"}
!762 = !DILocation(line: 53, column: 11, scope: !742)
!763 = !DILocation(line: 53, column: 9, scope: !717)
!764 = !DILocation(line: 0, scope: !745)
!765 = !DILocation(line: 58, column: 34, scope: !766)
!766 = distinct !DILexicalBlock(scope: !745, file: !718, line: 58, column: 9)
!767 = !DILocation(line: 58, column: 32, scope: !766)
!768 = !DILocation(line: 58, column: 9, scope: !745)
!769 = !DILocation(line: 54, column: 42, scope: !741)
!770 = !{!771, !752, i64 0}
!771 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !752, i64 0, !752, i64 8, !752, i64 16, !753, i64 24, !753, i64 152, !753, i64 280, !752, i64 408}
!772 = !DILocation(line: 54, column: 46, scope: !741)
!773 = !DILocation(line: 54, column: 28, scope: !741)
!774 = !DILocation(line: 0, scope: !741)
!775 = !DILocation(line: 55, column: 34, scope: !741)
!776 = !{!771, !752, i64 8}
!777 = !DILocation(line: 55, column: 38, scope: !741)
!778 = !DILocation(line: 55, column: 20, scope: !741)
!779 = !DILocation(line: 56, column: 31, scope: !741)
!780 = !{!771, !752, i64 408}
!781 = !DILocation(line: 56, column: 26, scope: !741)
!782 = !DILocation(line: 56, column: 9, scope: !741)
!783 = !DILocation(line: 57, column: 5, scope: !741)
!784 = !DILocation(line: 59, column: 13, scope: !785)
!785 = distinct !DILexicalBlock(scope: !766, file: !718, line: 58, column: 55)
!786 = !DILocation(line: 60, column: 24, scope: !785)
!787 = !DILocation(line: 60, column: 21, scope: !785)
!788 = !DILocation(line: 61, column: 24, scope: !785)
!789 = !DILocation(line: 61, column: 21, scope: !785)
!790 = !DILocation(line: 58, column: 51, scope: !766)
!791 = distinct !{!791, !768, !792, !761}
!792 = !DILocation(line: 62, column: 9, scope: !745)
!793 = !DILocation(line: 64, column: 1, scope: !717)
!794 = !DISubprogram(name: "memcpy", scope: !13, file: !13, line: 94, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!116, !116, !266, !15}
!797 = !{}
!798 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !718, line: 66, type: !799, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !721, !116}
!801 = !{!802, !803}
!802 = !DILocalVariable(name: "copy", arg: 1, scope: !798, file: !718, line: 66, type: !721)
!803 = !DILocalVariable(name: "user_context", arg: 2, scope: !798, file: !718, line: 66, type: !116)
!804 = !DILocation(line: 0, scope: !798)
!805 = !DILocation(line: 68, column: 14, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !718, line: 68, column: 9)
!807 = !DILocation(line: 68, column: 26, scope: !806)
!808 = !DILocation(line: 68, column: 18, scope: !806)
!809 = !DILocation(line: 68, column: 9, scope: !798)
!810 = !DILocation(line: 69, column: 58, scope: !811)
!811 = distinct !DILexicalBlock(scope: !806, file: !718, line: 68, column: 31)
!812 = !{!771, !752, i64 16}
!813 = !DILocation(line: 69, column: 9, scope: !811)
!814 = !DILocation(line: 70, column: 5, scope: !811)
!815 = !DILocalVariable(name: "this", arg: 1, scope: !816, type: !820, flags: DIFlagArtificial | DIFlagObjectPointer)
!816 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !222, file: !220, line: 37, type: !233, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !232, retainedNodes: !817)
!817 = !{!815, !818, !819}
!818 = !DILocalVariable(name: "ctx", arg: 2, scope: !816, file: !220, line: 37, type: !116)
!819 = !DILocalVariable(name: "mem", arg: 3, scope: !816, file: !220, line: 37, type: !68)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!821 = !DILocation(line: 0, scope: !816, inlinedAt: !822)
!822 = distinct !DILocation(line: 71, column: 9, scope: !823)
!823 = distinct !DILexicalBlock(scope: !806, file: !718, line: 70, column: 12)
!824 = !DILocation(line: 44, column: 27, scope: !825, inlinedAt: !822)
!825 = distinct !DILexicalBlock(scope: !826, file: !220, line: 43, column: 16)
!826 = distinct !DILexicalBlock(scope: !827, file: !220, line: 41, column: 20)
!827 = distinct !DILexicalBlock(scope: !828, file: !220, line: 39, column: 13)
!828 = distinct !DILexicalBlock(scope: !816, file: !220, line: 38, column: 54)
!829 = !DILocation(line: 48, column: 13, scope: !830, inlinedAt: !822)
!830 = distinct !DILexicalBlock(scope: !828, file: !220, line: 48, column: 13)
!831 = !DILocation(line: 48, column: 13, scope: !828, inlinedAt: !822)
!832 = !DILocalVariable(name: "this", arg: 1, scope: !833, type: !820, flags: DIFlagArtificial | DIFlagObjectPointer)
!833 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !222, file: !220, line: 57, type: !237, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !236, retainedNodes: !834)
!834 = !{!832, !835}
!835 = !DILocalVariable(name: "arg", arg: 2, scope: !833, file: !220, line: 57, type: !25)
!836 = !DILocation(line: 0, scope: !833, inlinedAt: !837)
!837 = distinct !DILocation(line: 71, column: 29, scope: !823)
!838 = !DILocation(line: 62, column: 19, scope: !839, inlinedAt: !837)
!839 = distinct !DILexicalBlock(scope: !840, file: !220, line: 61, column: 16)
!840 = distinct !DILexicalBlock(scope: !833, file: !220, line: 59, column: 13)
!841 = !DILocalVariable(name: "this", arg: 1, scope: !842, type: !820, flags: DIFlagArtificial | DIFlagObjectPointer)
!842 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !222, file: !220, line: 166, type: !458, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !471, retainedNodes: !843)
!843 = !{!841}
!844 = !DILocation(line: 0, scope: !842, inlinedAt: !845)
!845 = distinct !DILocation(line: 71, column: 9, scope: !823)
!846 = !DILocation(line: 168, column: 13, scope: !847, inlinedAt: !845)
!847 = distinct !DILexicalBlock(scope: !848, file: !220, line: 167, column: 19)
!848 = distinct !DILexicalBlock(scope: !849, file: !220, line: 167, column: 13)
!849 = distinct !DILexicalBlock(scope: !842, file: !220, line: 166, column: 16)
!850 = !DILocation(line: 169, column: 9, scope: !847, inlinedAt: !845)
!851 = !DILocation(line: 49, column: 23, scope: !852, inlinedAt: !822)
!852 = distinct !DILexicalBlock(scope: !830, file: !220, line: 48, column: 18)
!853 = !DILocation(line: 50, column: 18, scope: !852, inlinedAt: !822)
!854 = !{!753, !753, i64 0}
!855 = !DILocalVariable(name: "this", arg: 1, scope: !856, type: !820, flags: DIFlagArtificial | DIFlagObjectPointer)
!856 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !222, file: !220, line: 162, type: !458, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !470, retainedNodes: !857)
!857 = !{!855}
!858 = !DILocation(line: 0, scope: !856, inlinedAt: !859)
!859 = distinct !DILocation(line: 170, column: 13, scope: !860, inlinedAt: !845)
!860 = distinct !DILexicalBlock(scope: !848, file: !220, line: 169, column: 16)
!861 = !DILocation(line: 163, column: 81, scope: !856, inlinedAt: !859)
!862 = !DILocation(line: 163, column: 87, scope: !856, inlinedAt: !859)
!863 = !DILocation(line: 163, column: 77, scope: !856, inlinedAt: !859)
!864 = !DILocation(line: 163, column: 15, scope: !856, inlinedAt: !859)
!865 = !DILocation(line: 174, column: 17, scope: !866, inlinedAt: !845)
!866 = distinct !DILexicalBlock(scope: !867, file: !220, line: 173, column: 46)
!867 = distinct !DILexicalBlock(scope: !868, file: !220, line: 173, column: 24)
!868 = distinct !DILexicalBlock(scope: !860, file: !220, line: 171, column: 17)
!869 = !DILocation(line: 181, column: 13, scope: !870, inlinedAt: !845)
!870 = distinct !DILexicalBlock(scope: !871, file: !220, line: 180, column: 40)
!871 = distinct !DILexicalBlock(scope: !849, file: !220, line: 180, column: 13)
!872 = !DILocation(line: 73, column: 1, scope: !798)
!873 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !718, line: 76, type: !874, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !877)
!874 = !DISubroutineType(types: !875)
!875 = !{!723, !876, !229, !876, !229}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!877 = !{!878, !879, !880, !881, !882, !883, !885, !887, !890, !893, !895, !898, !899, !900, !902}
!878 = !DILocalVariable(name: "src", arg: 1, scope: !873, file: !718, line: 76, type: !876)
!879 = !DILocalVariable(name: "src_host", arg: 2, scope: !873, file: !718, line: 76, type: !229)
!880 = !DILocalVariable(name: "dst", arg: 3, scope: !873, file: !718, line: 77, type: !876)
!881 = !DILocalVariable(name: "dst_host", arg: 4, scope: !873, file: !718, line: 77, type: !229)
!882 = !DILocalVariable(name: "c", scope: !873, file: !718, line: 79, type: !723)
!883 = !DILocalVariable(name: "i", scope: !884, file: !718, line: 83, type: !24)
!884 = distinct !DILexicalBlock(scope: !873, file: !718, line: 83, column: 5)
!885 = !DILocalVariable(name: "i", scope: !886, file: !718, line: 91, type: !24)
!886 = distinct !DILexicalBlock(scope: !873, file: !718, line: 91, column: 5)
!887 = !DILocalVariable(name: "zero", scope: !888, file: !718, line: 100, type: !723)
!888 = distinct !DILexicalBlock(scope: !889, file: !718, line: 98, column: 42)
!889 = distinct !DILexicalBlock(scope: !873, file: !718, line: 96, column: 9)
!890 = !DILocalVariable(name: "zero", scope: !891, file: !718, line: 107, type: !723)
!891 = distinct !DILexicalBlock(scope: !892, file: !718, line: 104, column: 28)
!892 = distinct !DILexicalBlock(scope: !873, file: !718, line: 104, column: 9)
!893 = !DILocalVariable(name: "i", scope: !894, file: !718, line: 115, type: !24)
!894 = distinct !DILexicalBlock(scope: !873, file: !718, line: 115, column: 5)
!895 = !DILocalVariable(name: "dst_stride_bytes", scope: !896, file: !718, line: 117, type: !142)
!896 = distinct !DILexicalBlock(scope: !897, file: !718, line: 115, column: 47)
!897 = distinct !DILexicalBlock(scope: !894, file: !718, line: 115, column: 5)
!898 = !DILocalVariable(name: "src_stride_bytes", scope: !896, file: !718, line: 118, type: !142)
!899 = !DILocalVariable(name: "insert", scope: !896, file: !718, line: 120, type: !24)
!900 = !DILocalVariable(name: "j", scope: !901, file: !718, line: 128, type: !24)
!901 = distinct !DILexicalBlock(scope: !896, file: !718, line: 128, column: 9)
!902 = !DILocalVariable(name: "j", scope: !903, file: !718, line: 151, type: !24)
!903 = distinct !DILexicalBlock(scope: !904, file: !718, line: 151, column: 9)
!904 = distinct !DILexicalBlock(scope: !873, file: !718, line: 145, column: 51)
!905 = !DILocation(line: 0, scope: !873)
!906 = !DILocation(line: 79, column: 5, scope: !873)
!907 = !DILocation(line: 79, column: 17, scope: !873)
!908 = !DILocation(line: 80, column: 13, scope: !873)
!909 = !DILocation(line: 80, column: 39, scope: !873)
!910 = !{!911, !912, i64 12}
!911 = !{!"_ZTS15halide_buffer_t", !752, i64 0, !912, i64 8, !912, i64 12, !752, i64 16, !913, i64 24, !916, i64 28, !912, i64 32, !912, i64 36}
!912 = !{!"any pointer", !753, i64 0}
!913 = !{!"_ZTS13halide_type_t", !914, i64 0, !753, i64 1, !915, i64 2}
!914 = !{!"_ZTS18halide_type_code_t", !753, i64 0}
!915 = !{!"short", !753, i64 0}
!916 = !{!"int", !753, i64 0}
!917 = !DILocation(line: 80, column: 24, scope: !873)
!918 = !DILocation(line: 80, column: 51, scope: !873)
!919 = !{!911, !752, i64 0}
!920 = !DILocation(line: 80, column: 7, scope: !873)
!921 = !DILocation(line: 80, column: 11, scope: !873)
!922 = !DILocation(line: 81, column: 13, scope: !873)
!923 = !DILocation(line: 81, column: 39, scope: !873)
!924 = !DILocation(line: 81, column: 24, scope: !873)
!925 = !DILocation(line: 81, column: 51, scope: !873)
!926 = !DILocation(line: 81, column: 7, scope: !873)
!927 = !DILocation(line: 81, column: 11, scope: !873)
!928 = !DILocalVariable(name: "this", arg: 1, scope: !929, type: !931, flags: DIFlagArtificial | DIFlagObjectPointer)
!929 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !279, file: !8, line: 481, type: !302, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, declaration: !301, retainedNodes: !930)
!930 = !{!928}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!932 = !DILocation(line: 0, scope: !929, inlinedAt: !933)
!933 = distinct !DILocation(line: 82, column: 30, scope: !873)
!934 = !DILocation(line: 482, column: 17, scope: !929, inlinedAt: !933)
!935 = !{!913, !753, i64 1}
!936 = !DILocation(line: 482, column: 22, scope: !929, inlinedAt: !933)
!937 = !DILocation(line: 482, column: 27, scope: !929, inlinedAt: !933)
!938 = !DILocation(line: 82, column: 20, scope: !873)
!939 = !DILocation(line: 82, column: 7, scope: !873)
!940 = !DILocation(line: 82, column: 18, scope: !873)
!941 = !DILocation(line: 0, scope: !884)
!942 = !DILocation(line: 84, column: 9, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !718, line: 83, column: 45)
!944 = distinct !DILexicalBlock(scope: !884, file: !718, line: 83, column: 5)
!945 = !DILocation(line: 84, column: 21, scope: !943)
!946 = !DILocation(line: 85, column: 9, scope: !943)
!947 = !DILocation(line: 85, column: 31, scope: !943)
!948 = !DILocation(line: 86, column: 9, scope: !943)
!949 = !DILocation(line: 86, column: 31, scope: !943)
!950 = !DILocation(line: 90, column: 7, scope: !873)
!951 = !DILocation(line: 0, scope: !886)
!952 = !DILocation(line: 91, column: 30, scope: !953)
!953 = distinct !DILexicalBlock(scope: !886, file: !718, line: 91, column: 5)
!954 = !{!911, !916, i64 28}
!955 = !DILocation(line: 91, column: 23, scope: !953)
!956 = !DILocation(line: 91, column: 5, scope: !886)
!957 = !{!911, !912, i64 32}
!958 = !DILocation(line: 94, column: 17, scope: !873)
!959 = !DILocation(line: 94, column: 22, scope: !873)
!960 = !DILocation(line: 96, column: 33, scope: !889)
!961 = !DILocation(line: 96, column: 25, scope: !889)
!962 = !DILocation(line: 96, column: 44, scope: !889)
!963 = !DILocation(line: 92, column: 46, scope: !964)
!964 = distinct !DILexicalBlock(scope: !953, file: !718, line: 91, column: 47)
!965 = !{!966, !916, i64 8}
!966 = !{!"_ZTS18halide_dimension_t", !916, i64 0, !916, i64 4, !916, i64 8, !916, i64 12}
!967 = !DILocation(line: 92, column: 34, scope: !964)
!968 = !DILocation(line: 92, column: 68, scope: !964)
!969 = !{!966, !916, i64 0}
!970 = !DILocation(line: 92, column: 86, scope: !964)
!971 = !DILocation(line: 92, column: 72, scope: !964)
!972 = !DILocation(line: 92, column: 55, scope: !964)
!973 = !DILocation(line: 92, column: 53, scope: !964)
!974 = !DILocation(line: 92, column: 21, scope: !964)
!975 = !DILocation(line: 91, column: 43, scope: !953)
!976 = distinct !{!976, !956, !977, !761}
!977 = !DILocation(line: 93, column: 5, scope: !886)
!978 = !DILocation(line: 0, scope: !929, inlinedAt: !979)
!979 = distinct !DILocation(line: 97, column: 19, scope: !889)
!980 = !DILocation(line: 0, scope: !929, inlinedAt: !981)
!981 = distinct !DILocation(line: 97, column: 40, scope: !889)
!982 = !DILocation(line: 482, column: 17, scope: !929, inlinedAt: !981)
!983 = !DILocation(line: 482, column: 22, scope: !929, inlinedAt: !981)
!984 = !DILocation(line: 482, column: 27, scope: !929, inlinedAt: !981)
!985 = !DILocation(line: 97, column: 27, scope: !889)
!986 = !DILocation(line: 97, column: 48, scope: !889)
!987 = !DILocation(line: 100, column: 21, scope: !888)
!988 = !DILocation(line: 101, column: 9, scope: !888)
!989 = !DILocation(line: 104, column: 22, scope: !892)
!990 = !DILocation(line: 104, column: 9, scope: !873)
!991 = !DILocation(line: 0, scope: !894)
!992 = !DILocation(line: 115, column: 5, scope: !894)
!993 = !DILocation(line: 107, column: 21, scope: !891)
!994 = !DILocation(line: 108, column: 9, scope: !891)
!995 = !DILocation(line: 144, column: 14, scope: !873)
!996 = !DILocation(line: 144, column: 28, scope: !873)
!997 = !DILocation(line: 144, column: 25, scope: !873)
!998 = !DILocation(line: 144, column: 50, scope: !873)
!999 = !DILocation(line: 145, column: 28, scope: !873)
!1000 = !DILocation(line: 117, column: 59, scope: !896)
!1001 = !DILocation(line: 117, column: 47, scope: !896)
!1002 = !DILocation(line: 0, scope: !929, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 117, column: 78, scope: !896)
!1004 = !DILocation(line: 117, column: 66, scope: !896)
!1005 = !DILocation(line: 0, scope: !896)
!1006 = !DILocation(line: 118, column: 59, scope: !896)
!1007 = !DILocation(line: 118, column: 47, scope: !896)
!1008 = !DILocation(line: 0, scope: !929, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 118, column: 78, scope: !896)
!1010 = !DILocation(line: 118, column: 66, scope: !896)
!1011 = !DILocation(line: 121, column: 33, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !718, line: 121, column: 9)
!1013 = distinct !DILexicalBlock(scope: !896, file: !718, line: 121, column: 9)
!1014 = !DILocation(line: 121, column: 9, scope: !1013)
!1015 = !DILocation(line: 124, column: 36, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !718, line: 124, column: 17)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !718, line: 121, column: 48)
!1018 = !DILocation(line: 124, column: 34, scope: !1016)
!1019 = !DILocation(line: 124, column: 63, scope: !1016)
!1020 = !DILocation(line: 121, column: 44, scope: !1012)
!1021 = distinct !{!1021, !1014, !1022, !761}
!1022 = !DILocation(line: 127, column: 9, scope: !1013)
!1023 = !DILocation(line: 0, scope: !1013)
!1024 = !DILocation(line: 0, scope: !901)
!1025 = !DILocation(line: 128, column: 27, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !901, file: !718, line: 128, column: 9)
!1027 = !DILocation(line: 128, column: 9, scope: !901)
!1028 = !DILocation(line: 133, column: 40, scope: !896)
!1029 = !{!966, !916, i64 4}
!1030 = !DILocation(line: 133, column: 28, scope: !896)
!1031 = !DILocation(line: 133, column: 9, scope: !896)
!1032 = !DILocation(line: 133, column: 26, scope: !896)
!1033 = !DILocation(line: 135, column: 9, scope: !896)
!1034 = !DILocation(line: 135, column: 36, scope: !896)
!1035 = !DILocation(line: 136, column: 9, scope: !896)
!1036 = !DILocation(line: 136, column: 36, scope: !896)
!1037 = !DILocation(line: 115, column: 43, scope: !897)
!1038 = !DILocation(line: 115, column: 23, scope: !897)
!1039 = distinct !{!1039, !992, !1040, !761}
!1040 = !DILocation(line: 137, column: 5, scope: !894)
!1041 = !DILocation(line: 129, column: 38, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1026, file: !718, line: 128, column: 42)
!1043 = !DILocation(line: 129, column: 27, scope: !1042)
!1044 = !DILocation(line: 129, column: 13, scope: !1042)
!1045 = !DILocation(line: 129, column: 25, scope: !1042)
!1046 = !DILocation(line: 130, column: 37, scope: !1042)
!1047 = !DILocation(line: 130, column: 13, scope: !1042)
!1048 = !DILocation(line: 130, column: 35, scope: !1042)
!1049 = !DILocation(line: 131, column: 37, scope: !1042)
!1050 = !DILocation(line: 131, column: 13, scope: !1042)
!1051 = !DILocation(line: 131, column: 35, scope: !1042)
!1052 = distinct !{!1052, !1027, !1053, !761}
!1053 = !DILocation(line: 132, column: 9, scope: !901)
!1054 = !DILocation(line: 145, column: 25, scope: !873)
!1055 = !DILocation(line: 144, column: 5, scope: !873)
!1056 = !DILocation(line: 147, column: 25, scope: !904)
!1057 = !DILocation(line: 147, column: 22, scope: !904)
!1058 = !DILocation(line: 0, scope: !903)
!1059 = !DILocation(line: 152, column: 31, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !718, line: 151, column: 49)
!1061 = distinct !DILexicalBlock(scope: !903, file: !718, line: 151, column: 9)
!1062 = !DILocation(line: 152, column: 29, scope: !1060)
!1063 = !DILocation(line: 153, column: 41, scope: !1060)
!1064 = !DILocation(line: 153, column: 39, scope: !1060)
!1065 = !DILocation(line: 154, column: 41, scope: !1060)
!1066 = !DILocation(line: 154, column: 39, scope: !1060)
!1067 = !DILocation(line: 156, column: 37, scope: !904)
!1068 = !DILocation(line: 157, column: 47, scope: !904)
!1069 = !DILocation(line: 158, column: 47, scope: !904)
!1070 = distinct !{!1070, !1055, !1071, !761}
!1071 = !DILocation(line: 159, column: 5, scope: !873)
!1072 = !DILocation(line: 160, column: 12, scope: !873)
!1073 = !{i64 0, i64 8, !751, i64 8, i64 8, !751, i64 16, i64 8, !751, i64 24, i64 128, !854, i64 152, i64 128, !854, i64 280, i64 128, !854, i64 408, i64 8, !751}
!1074 = !DILocation(line: 160, column: 5, scope: !873)
!1075 = !DILocation(line: 161, column: 1, scope: !873)
