; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/matlab.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/matlab.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.mxArray = type opaque
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>
%struct.halide_filter_metadata_t = type { i32, i32, %struct.halide_filter_argument_t*, i8*, i8* }
%struct.halide_filter_argument_t = type { i8*, i32, i32, %struct.halide_type_t, %struct.halide_scalar_value_t*, %struct.halide_scalar_value_t*, %struct.halide_scalar_value_t*, %struct.halide_scalar_value_t*, i64** }
%struct.halide_type_t = type { i8, i8, i16 }
%struct.halide_scalar_value_t = type { %union.anon }
%union.anon = type { double }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer.0" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }

!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 1415, baseType: !50, size: 32, elements: !126, identifier: "_ZTS19halide_buffer_flags")
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_argument_kind_t", file: !116, line: 1598, baseType: !50, size: 32, elements: !130, identifier: "_ZTS22halide_argument_kind_t")
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "halide_argument_kind_input_scalar", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "halide_argument_kind_input_buffer", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "halide_argument_kind_output_buffer", value: 2, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !116, line: 990, baseType: !28, size: 32, elements: !135, identifier: "_ZTS19halide_error_code_t")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!136 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!137 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!138 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!139 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!140 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!141 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!142 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!143 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!144 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!145 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!146 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!147 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!148 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!149 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!150 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!151 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!152 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!153 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!154 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!155 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!156 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!157 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!158 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!159 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!160 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!161 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!162 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!163 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!164 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!165 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!166 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!167 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!168 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!169 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!170 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!171 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!172 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!173 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!174 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!175 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!176 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!177 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!178 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!179 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!180 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!181 = !{!182, !337, !214, !418, !419, !421, !422, !424, !425, !209, !426, !117, !240, !427, !223, !428, !218, !429, !230, !430, !94, !431, !432, !433, !342, !189, !6, !434, !25, !437, !38, !45, !75, !81, !91, !442, !109, !331}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !184, file: !183, line: 199, baseType: !186)
!183 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!184 = !DINamespace(scope: !185)
!185 = !DINamespace(name: "Internal", scope: !3)
!186 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !184, file: !183, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !187, templateParams: !415)
!187 = !{!188, !190, !191, !192, !193, !194, !198, !202, !206, !211, !215, !220, !224, !227, !231, !236, !242, !275, !397, !400, !403, !408, !409, !412, !413, !414}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !186, file: !183, line: 32, baseType: !189, size: 64, flags: DIFlagPublic)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !186, file: !183, line: 32, baseType: !189, size: 64, offset: 64, flags: DIFlagPublic)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !186, file: !183, line: 32, baseType: !189, size: 64, offset: 128, flags: DIFlagPublic)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !186, file: !183, line: 33, baseType: !78, size: 64, offset: 192, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !186, file: !183, line: 34, baseType: !84, size: 8, offset: 256, flags: DIFlagPublic)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !186, file: !183, line: 35, baseType: !195, size: 8, offset: 264, flags: DIFlagPublic)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DISubprogram(name: "Printer", scope: !186, file: !183, line: 37, type: !199, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201, !78, !189}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!202 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !186, file: !183, line: 57, type: !203, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !201, !9}
!205 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !186, size: 64)
!206 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !186, file: !183, line: 67, type: !207, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!207 = !DISubroutineType(types: !208)
!208 = !{!205, !201, !209}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !18, line: 9, baseType: !210)
!210 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!211 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !186, file: !183, line: 72, type: !212, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!212 = !DISubroutineType(types: !213)
!213 = !{!205, !201, !214}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 11, baseType: !28)
!215 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !186, file: !183, line: 77, type: !216, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubroutineType(types: !217)
!217 = !{!205, !201, !218}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 10, baseType: !219)
!219 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!220 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !186, file: !183, line: 82, type: !221, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{!205, !201, !223}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 12, baseType: !50)
!224 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !186, file: !183, line: 87, type: !225, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{!205, !201, !94}
!227 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !186, file: !183, line: 92, type: !228, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{!205, !201, !230}
!230 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!231 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !186, file: !183, line: 97, type: !232, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubroutineType(types: !233)
!233 = !{!205, !201, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!236 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !186, file: !183, line: 102, type: !237, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{!205, !201, !239}
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 14, baseType: !241)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !186, file: !183, line: 108, type: !243, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!205, !201, !245}
!245 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !116, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !248, identifier: "_ZTS13halide_type_t")
!248 = !{!249, !251, !252, !253, !257, !260, !264, !267, !268, !269, !272}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !247, file: !116, line: 434, baseType: !250, size: 8, align: 8)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !116, line: 413, baseType: !115)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !247, file: !116, line: 442, baseType: !117, size: 8, align: 8, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !247, file: !116, line: 446, baseType: !240, size: 16, align: 16, offset: 16)
!253 = !DISubprogram(name: "halide_type_t", scope: !247, file: !116, line: 453, type: !254, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !256, !250, !117, !240}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!257 = !DISubprogram(name: "halide_type_t", scope: !247, file: !116, line: 459, type: !258, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !256}
!260 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !247, file: !116, line: 463, type: !261, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!247, !263, !240}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!264 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !247, file: !116, line: 468, type: !265, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{!84, !263, !245}
!267 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !247, file: !116, line: 472, type: !265, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !247, file: !116, line: 476, type: !265, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !247, file: !116, line: 481, type: !270, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!28, !263}
!272 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !247, file: !116, line: 485, type: !273, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!273 = !DISubroutineType(types: !274)
!274 = !{!223, !263}
!275 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !186, file: !183, line: 113, type: !276, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DISubroutineType(types: !277)
!277 = !{!205, !201, !278}
!278 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !116, line: 1550, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !116, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !282, identifier: "_ZTS15halide_buffer_t")
!282 = !{!283, !284, !336, !338, !339, !340, !341, !364, !365, !370, !374, !377, !378, !381, !382, !385, !388, !389, !390, !393, !396}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !281, file: !116, line: 1425, baseType: !218, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !281, file: !116, line: 1428, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !116, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !288, identifier: "_ZTS25halide_device_interface_t")
!288 = !{!289, !294, !298, !299, !303, !304, !305, !306, !307, !311, !317, !321, !322, !326, !327, !332}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !287, file: !116, line: 724, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!28, !78, !293, !285}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !287, file: !116, line: 726, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!28, !78, !293}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !287, file: !116, line: 727, baseType: !295, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !287, file: !116, line: 728, baseType: !300, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !78, !285}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !287, file: !116, line: 730, baseType: !295, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !287, file: !116, line: 731, baseType: !290, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !287, file: !116, line: 733, baseType: !290, size: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !287, file: !116, line: 735, baseType: !295, size: 64, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !287, file: !116, line: 736, baseType: !308, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!28, !78, !293, !285, !293}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !287, file: !116, line: 738, baseType: !312, size: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!28, !78, !315, !293}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !287, file: !116, line: 740, baseType: !318, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!28, !78, !315, !28, !28, !293}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !287, file: !116, line: 742, baseType: !295, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !287, file: !116, line: 743, baseType: !323, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!28, !78, !293, !218, !285}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !287, file: !116, line: 745, baseType: !295, size: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !287, file: !116, line: 746, baseType: !328, size: 64, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!28, !78, !331, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !287, file: !116, line: 747, baseType: !333, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !116, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !281, file: !116, line: 1433, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !116, line: 1436, baseType: !218, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !281, file: !116, line: 1439, baseType: !247, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !281, file: !116, line: 1442, baseType: !214, size: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !281, file: !116, line: 1446, baseType: !342, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !116, line: 1409, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !116, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !345, identifier: "_ZTS18halide_dimension_t")
!345 = !{!346, !347, !348, !349, !350, !354, !357, !363}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !344, file: !116, line: 1383, baseType: !214, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !344, file: !116, line: 1383, baseType: !214, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !344, file: !116, line: 1383, baseType: !214, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !116, line: 1386, baseType: !223, size: 32, offset: 96)
!350 = !DISubprogram(name: "halide_dimension_t", scope: !344, file: !116, line: 1388, type: !351, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!354 = !DISubprogram(name: "halide_dimension_t", scope: !344, file: !116, line: 1389, type: !355, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !353, !214, !214, !214, !223}
!357 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !344, file: !116, line: 1393, type: !358, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!84, !360, !362}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!362 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !361, size: 64)
!363 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !344, file: !116, line: 1400, type: !358, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !281, file: !116, line: 1449, baseType: !78, size: 64, offset: 384)
!365 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !281, file: !116, line: 1454, type: !366, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!366 = !DISubroutineType(types: !367)
!367 = !{!84, !368, !369}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !116, line: 1416, baseType: !125)
!370 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !281, file: !116, line: 1458, type: !371, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !373, !369, !84}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!374 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !281, file: !116, line: 1466, type: !375, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!84, !368}
!377 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !281, file: !116, line: 1470, type: !375, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!378 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !281, file: !116, line: 1474, type: !379, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !373, !84}
!381 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !281, file: !116, line: 1478, type: !379, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!382 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !281, file: !116, line: 1485, type: !383, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!383 = !DISubroutineType(types: !384)
!384 = !{!17, !368}
!385 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !281, file: !116, line: 1495, type: !386, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!386 = !DISubroutineType(types: !387)
!387 = !{!337, !368}
!388 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !281, file: !116, line: 1506, type: !386, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !281, file: !116, line: 1518, type: !383, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!390 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !281, file: !116, line: 1523, type: !391, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!391 = !DISubroutineType(types: !392)
!392 = !{!337, !368, !41}
!393 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !281, file: !116, line: 1534, type: !394, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!28, !373, !78}
!396 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !281, file: !116, line: 1545, type: !375, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!397 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !186, file: !183, line: 119, type: !398, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!398 = !DISubroutineType(types: !399)
!399 = !{!9, !201}
!400 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !186, file: !183, line: 131, type: !401, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !201}
!403 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !186, file: !183, line: 139, type: !404, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{!218, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!408 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !186, file: !183, line: 143, type: !404, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !186, file: !183, line: 148, type: !410, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !201, !28}
!412 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !186, file: !183, line: 158, type: !398, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !186, file: !183, line: 162, type: !401, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !DISubprogram(name: "~Printer", scope: !186, file: !183, line: 166, type: !401, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!415 = !{!416, !417}
!416 = !DITemplateValueParameter(name: "type", type: !28, value: i32 1)
!417 = !DITemplateValueParameter(name: "length", type: !219, value: i64 1024)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !18, line: 15, baseType: !420)
!420 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 13, baseType: !423)
!423 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!19, !20}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !20}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!102, !19, !19, !48, !103}
!445 = !{!0, !12, !23, !29, !36, !43, !73, !79, !85, !87, !89, !95, !97, !107}
!446 = !{!447, !448}
!447 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !112, entity: !185, file: !18, line: 225)
!448 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !112, entity: !2, file: !49, line: 214)
!449 = !{i32 7, !"Dwarf Version", i32 4}
!450 = !{i32 2, !"Debug Info Version", i32 3}
!451 = !{i32 1, !"wchar_size", i32 4}
!452 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!453 = distinct !DISubprogram(name: "get_class_id", linkageName: "_ZN6Halide7Runtime3mex12get_class_idEii", scope: !2, file: !49, line: 78, type: !454, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !112, retainedNodes: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!48, !214, !214}
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "type_code", arg: 1, scope: !453, file: !49, line: 78, type: !214)
!458 = !DILocalVariable(name: "type_bits", arg: 2, scope: !453, file: !49, line: 78, type: !214)
!459 = !DILocation(line: 0, scope: !453)
!460 = !DILocation(line: 79, column: 5, scope: !453)
!461 = !DILocation(line: 81, column: 9, scope: !462)
!462 = distinct !DILexicalBlock(scope: !453, file: !49, line: 79, column: 24)
!463 = !DILocation(line: 85, column: 13, scope: !464)
!464 = distinct !DILexicalBlock(scope: !462, file: !49, line: 81, column: 28)
!465 = !DILocation(line: 87, column: 13, scope: !464)
!466 = !DILocation(line: 89, column: 13, scope: !464)
!467 = !DILocation(line: 91, column: 13, scope: !464)
!468 = !DILocation(line: 93, column: 9, scope: !462)
!469 = !DILocation(line: 95, column: 9, scope: !462)
!470 = !DILocation(line: 99, column: 13, scope: !471)
!471 = distinct !DILexicalBlock(scope: !462, file: !49, line: 95, column: 28)
!472 = !DILocation(line: 101, column: 13, scope: !471)
!473 = !DILocation(line: 103, column: 13, scope: !471)
!474 = !DILocation(line: 105, column: 13, scope: !471)
!475 = !DILocation(line: 107, column: 9, scope: !462)
!476 = !DILocation(line: 109, column: 9, scope: !462)
!477 = !DILocation(line: 118, column: 1, scope: !453)
!478 = distinct !DISubprogram(name: "get_class_name", linkageName: "_ZN6Halide7Runtime3mex14get_class_nameENS1_9mxClassIDE", scope: !2, file: !49, line: 121, type: !479, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !112, retainedNodes: !481)
!479 = !DISubroutineType(types: !480)
!480 = !{!9, !48}
!481 = !{!482}
!482 = !DILocalVariable(name: "id", arg: 1, scope: !478, file: !49, line: 121, type: !48)
!483 = !DILocation(line: 0, scope: !478)
!484 = !DILocation(line: 122, column: 5, scope: !478)
!485 = !DILocation(line: 126, column: 9, scope: !486)
!486 = distinct !DILexicalBlock(scope: !478, file: !49, line: 122, column: 17)
!487 = !DILocation(line: 128, column: 9, scope: !486)
!488 = !DILocation(line: 130, column: 9, scope: !486)
!489 = !DILocation(line: 132, column: 9, scope: !486)
!490 = !DILocation(line: 134, column: 9, scope: !486)
!491 = !DILocation(line: 136, column: 9, scope: !486)
!492 = !DILocation(line: 138, column: 9, scope: !486)
!493 = !DILocation(line: 140, column: 9, scope: !486)
!494 = !DILocation(line: 142, column: 9, scope: !486)
!495 = !DILocation(line: 144, column: 9, scope: !486)
!496 = !DILocation(line: 146, column: 9, scope: !486)
!497 = !DILocation(line: 148, column: 9, scope: !486)
!498 = !DILocation(line: 150, column: 9, scope: !486)
!499 = !DILocation(line: 152, column: 9, scope: !486)
!500 = !DILocation(line: 154, column: 9, scope: !486)
!501 = !DILocation(line: 156, column: 9, scope: !486)
!502 = !DILocation(line: 158, column: 9, scope: !486)
!503 = !DILocation(line: 160, column: 9, scope: !486)
!504 = !DILocation(line: 0, scope: !486)
!505 = !DILocation(line: 162, column: 1, scope: !478)
!506 = distinct !DISubprogram(name: "halide_matlab_describe_pipeline", scope: !49, file: !49, line: 218, type: !507, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !112, retainedNodes: !608)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509, !577}
!509 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringstream", scope: !184, file: !183, line: 200, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 1024>", scope: !184, file: !183, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !512, templateParams: !575)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !523, !527, !530, !533, !536, !539, !542, !545, !548, !551, !554, !557, !560, !563, !568, !569, !572, !573, !574}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !511, file: !183, line: 32, baseType: !189, size: 64, flags: DIFlagPublic)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !511, file: !183, line: 32, baseType: !189, size: 64, offset: 64, flags: DIFlagPublic)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !511, file: !183, line: 32, baseType: !189, size: 64, offset: 128, flags: DIFlagPublic)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !511, file: !183, line: 33, baseType: !78, size: 64, offset: 192, flags: DIFlagPublic)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !511, file: !183, line: 34, baseType: !84, size: 8, offset: 256, flags: DIFlagPublic)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !511, file: !183, line: 35, baseType: !195, size: 8, offset: 264, flags: DIFlagPublic)
!519 = !DISubprogram(name: "Printer", scope: !511, file: !183, line: 37, type: !520, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522, !78, !189}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!523 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !511, file: !183, line: 57, type: !524, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!526, !522, !9}
!526 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !511, size: 64)
!527 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEx", scope: !511, file: !183, line: 67, type: !528, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{!526, !522, !209}
!530 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEi", scope: !511, file: !183, line: 72, type: !531, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(types: !532)
!532 = !{!526, !522, !214}
!533 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEy", scope: !511, file: !183, line: 77, type: !534, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!526, !522, !218}
!536 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEj", scope: !511, file: !183, line: 82, type: !537, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!537 = !DISubroutineType(types: !538)
!538 = !{!526, !522, !223}
!539 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEd", scope: !511, file: !183, line: 87, type: !540, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubroutineType(types: !541)
!541 = !{!526, !522, !94}
!542 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEf", scope: !511, file: !183, line: 92, type: !543, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubroutineType(types: !544)
!544 = !{!526, !522, !230}
!545 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKv", scope: !511, file: !183, line: 97, type: !546, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubroutineType(types: !547)
!547 = !{!526, !522, !234}
!548 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE23write_float16_from_bitsEt", scope: !511, file: !183, line: 102, type: !549, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(types: !550)
!550 = !{!526, !522, !239}
!551 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK13halide_type_t", scope: !511, file: !183, line: 108, type: !552, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(types: !553)
!553 = !{!526, !522, !245}
!554 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK15halide_buffer_t", scope: !511, file: !183, line: 113, type: !555, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubroutineType(types: !556)
!556 = !{!526, !522, !278}
!557 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE3strEv", scope: !511, file: !183, line: 119, type: !558, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!558 = !DISubroutineType(types: !559)
!559 = !{!9, !522}
!560 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5clearEv", scope: !511, file: !183, line: 131, type: !561, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !522}
!563 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE4sizeEv", scope: !511, file: !183, line: 139, type: !564, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubroutineType(types: !565)
!565 = !{!218, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!568 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE8capacityEv", scope: !511, file: !183, line: 143, type: !564, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5eraseEi", scope: !511, file: !183, line: 148, type: !570, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !522, !28}
!572 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE16allocation_errorEv", scope: !511, file: !183, line: 158, type: !558, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE28msan_annotate_is_initializedEv", scope: !511, file: !183, line: 162, type: !561, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubprogram(name: "~Printer", scope: !511, file: !183, line: 166, type: !561, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !{!576, !417}
!576 = !DITemplateValueParameter(name: "type", type: !28, value: i32 2)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_filter_metadata_t", file: !116, line: 1648, size: 256, flags: DIFlagTypePassByValue, elements: !580, identifier: "_ZTS24halide_filter_metadata_t")
!580 = !{!581, !583, !584, !585, !606, !607}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "VERSION", scope: !579, file: !116, line: 1650, baseType: !582, flags: DIFlagStaticMember, extraData: i32 1)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !579, file: !116, line: 1654, baseType: !214, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "num_arguments", scope: !579, file: !116, line: 1657, baseType: !214, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !579, file: !116, line: 1663, baseType: !586, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_filter_argument_t", file: !116, line: 1631, size: 512, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !589, identifier: "_ZTS24halide_filter_argument_t")
!589 = !{!590, !591, !592, !593, !594, !598, !599, !600, !601}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !116, line: 1632, baseType: !9, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !588, file: !116, line: 1633, baseType: !214, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !588, file: !116, line: 1634, baseType: !214, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !116, line: 1635, baseType: !247, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_def", scope: !588, file: !116, line: 1639, baseType: !595, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_scalar_value_t", file: !116, line: 1576, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS21halide_scalar_value_t")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_min", scope: !588, file: !116, line: 1639, baseType: !595, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_max", scope: !588, file: !116, line: 1639, baseType: !595, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_estimate", scope: !588, file: !116, line: 1639, baseType: !595, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_estimates", scope: !588, file: !116, line: 1645, baseType: !602, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !579, file: !116, line: 1667, baseType: !9, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !116, line: 1670, baseType: !9, size: 64, offset: 192)
!608 = !{!609, !610, !611, !613}
!609 = !DILocalVariable(name: "desc", arg: 1, scope: !506, file: !49, line: 218, type: !509)
!610 = !DILocalVariable(name: "metadata", arg: 2, scope: !506, file: !49, line: 218, type: !577)
!611 = !DILocalVariable(name: "i", scope: !612, file: !49, line: 220, type: !28)
!612 = distinct !DILexicalBlock(scope: !506, file: !49, line: 220, column: 5)
!613 = !DILocalVariable(name: "arg", scope: !614, file: !49, line: 221, type: !586)
!614 = distinct !DILexicalBlock(scope: !615, file: !49, line: 220, column: 55)
!615 = distinct !DILexicalBlock(scope: !612, file: !49, line: 220, column: 5)
!616 = !DILocation(line: 0, scope: !506)
!617 = !DILocalVariable(name: "this", arg: 1, scope: !618, type: !621, flags: DIFlagArtificial | DIFlagObjectPointer)
!618 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !511, file: !183, line: 57, type: !524, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !112, declaration: !523, retainedNodes: !619)
!619 = !{!617, !620}
!620 = !DILocalVariable(name: "arg", arg: 2, scope: !618, file: !183, line: 57, type: !9)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!622 = !DILocation(line: 0, scope: !618, inlinedAt: !623)
!623 = distinct !DILocation(line: 219, column: 10, scope: !506)
!624 = !DILocation(line: 62, column: 43, scope: !625, inlinedAt: !623)
!625 = distinct !DILexicalBlock(scope: !626, file: !183, line: 61, column: 16)
!626 = distinct !DILexicalBlock(scope: !618, file: !183, line: 59, column: 13)
!627 = !{!628, !629, i64 8}
!628 = !{!"_ZTSN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EEE", !629, i64 0, !629, i64 8, !629, i64 16, !629, i64 24, !632, i64 32, !630, i64 33}
!629 = !{!"any pointer", !630, i64 0}
!630 = !{!"omnipotent char", !631, i64 0}
!631 = !{!"Simple C++ TBAA"}
!632 = !{!"bool", !630, i64 0}
!633 = !DILocation(line: 62, column: 48, scope: !625, inlinedAt: !623)
!634 = !{!628, !629, i64 16}
!635 = !DILocation(line: 62, column: 19, scope: !625, inlinedAt: !623)
!636 = !DILocation(line: 62, column: 17, scope: !625, inlinedAt: !623)
!637 = !DILocation(line: 219, column: 33, scope: !506)
!638 = !{!639, !629, i64 24}
!639 = !{!"_ZTS24halide_filter_metadata_t", !640, i64 0, !640, i64 4, !629, i64 8, !629, i64 16, !629, i64 24}
!640 = !{!"int", !630, i64 0}
!641 = !DILocation(line: 0, scope: !618, inlinedAt: !642)
!642 = distinct !DILocation(line: 219, column: 20, scope: !506)
!643 = !DILocation(line: 59, column: 17, scope: !626, inlinedAt: !642)
!644 = !DILocation(line: 0, scope: !626, inlinedAt: !642)
!645 = !DILocation(line: 59, column: 13, scope: !618, inlinedAt: !642)
!646 = !DILocation(line: 60, column: 19, scope: !647, inlinedAt: !642)
!647 = distinct !DILexicalBlock(scope: !626, file: !183, line: 59, column: 29)
!648 = !DILocation(line: 61, column: 9, scope: !647, inlinedAt: !642)
!649 = !DILocation(line: 62, column: 19, scope: !625, inlinedAt: !642)
!650 = !DILocation(line: 0, scope: !618, inlinedAt: !651)
!651 = distinct !DILocation(line: 219, column: 38, scope: !506)
!652 = !DILocation(line: 62, column: 48, scope: !625, inlinedAt: !651)
!653 = !DILocation(line: 62, column: 19, scope: !625, inlinedAt: !651)
!654 = !DILocation(line: 62, column: 17, scope: !625, inlinedAt: !651)
!655 = !DILocation(line: 0, scope: !612)
!656 = !DILocation(line: 220, column: 35, scope: !615)
!657 = !{!639, !640, i64 4}
!658 = !DILocation(line: 220, column: 23, scope: !615)
!659 = !DILocation(line: 220, column: 5, scope: !612)
!660 = !DILocation(line: 221, column: 58, scope: !614)
!661 = !{!639, !629, i64 8}
!662 = !DILocation(line: 0, scope: !614)
!663 = !DILocation(line: 225, column: 18, scope: !664)
