; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cache.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cache.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::CacheEntry" = type { %"struct.Halide::Runtime::Internal::CacheEntry"*, %"struct.Halide::Runtime::Internal::CacheEntry"*, %"struct.Halide::Runtime::Internal::CacheEntry"*, i8*, i64, i8*, i32, i32, i32, i32, %struct.halide_dimension_t*, %struct.halide_buffer_t*, i64, i8, [7 x i8] }
%struct.halide_dimension_t = type { i32, i32, i32, i32 }
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "memoization_lock", linkageName: "_ZN6Halide7Runtime8Internal16memoization_lockE", scope: !2, file: !5, line: 196, type: !6, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Internal", scope: !3)
!3 = !DINamespace(name: "Runtime", scope: !4)
!4 = !DINamespace(name: "Halide", scope: null)
!5 = !DIFile(filename: "src/runtime/cache.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !7, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !8, identifier: "_ZTS12halide_mutex")
!7 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !6, file: !7, line: 121, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !15)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 61, baseType: !13)
!12 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 10, baseType: !14)
!14 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !{!16}
!16 = !DISubrange(count: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "cache_entries", linkageName: "_ZN6Halide7Runtime8Internal13cache_entriesE", scope: !2, file: !5, line: 200, type: !19, isLocal: false, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 16384, elements: !227)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CacheEntry", scope: !2, file: !5, line: 70, size: 768, flags: DIFlagTypePassByValue, elements: !22, identifier: "_ZTSN6Halide7Runtime8Internal10CacheEntryE")
!22 = !{!23, !24, !25, !26, !30, !33, !34, !37, !38, !39, !42, !66, !209, !210, !211, !220, !223}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !5, line: 71, baseType: !20, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "more_recent", scope: !21, file: !5, line: 72, baseType: !20, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "less_recent", scope: !21, file: !5, line: 73, baseType: !20, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_storage", scope: !21, file: !5, line: 74, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 16, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !21, file: !5, line: 75, baseType: !31, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 27, baseType: !32)
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !21, file: !5, line: 76, baseType: !27, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !21, file: !5, line: 77, baseType: !35, size: 32, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 12, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "in_use_count", scope: !21, file: !5, line: 78, baseType: !35, size: 32, offset: 416)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tuple_count", scope: !21, file: !5, line: 79, baseType: !35, size: 32, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !21, file: !5, line: 81, baseType: !40, size: 32, offset: 480)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !12, line: 11, baseType: !41)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "computed_bounds", scope: !21, file: !5, line: 82, baseType: !43, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !7, line: 1409, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !7, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !46, identifier: "_ZTS18halide_dimension_t")
!46 = !{!47, !48, !49, !50, !51, !55, !58, !65}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !45, file: !7, line: 1383, baseType: !40, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !45, file: !7, line: 1383, baseType: !40, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !45, file: !7, line: 1383, baseType: !40, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !7, line: 1386, baseType: !35, size: 32, offset: 96)
!51 = !DISubprogram(name: "halide_dimension_t", scope: !45, file: !7, line: 1388, type: !52, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!55 = !DISubprogram(name: "halide_dimension_t", scope: !45, file: !7, line: 1389, type: !56, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !54, !40, !40, !40, !35}
!58 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !45, file: !7, line: 1393, type: !59, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !62, !64}
!61 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!64 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !63, size: 64)
!65 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !45, file: !7, line: 1400, type: !59, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !21, file: !5, line: 84, baseType: !67, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !7, line: 1550, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !7, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !70, identifier: "_ZTS15halide_buffer_t")
!70 = !{!71, !72, !126, !127, !128, !168, !169, !170, !171, !180, !184, !187, !188, !191, !192, !195, !198, !199, !200, !205, !208}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !69, file: !7, line: 1425, baseType: !13, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !69, file: !7, line: 1428, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !7, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !76, identifier: "_ZTS25halide_device_interface_t")
!76 = !{!77, !83, !87, !88, !92, !93, !94, !95, !96, !100, !106, !110, !111, !115, !116, !121}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !75, file: !7, line: 724, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!41, !81, !82, !73}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !75, file: !7, line: 726, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!41, !81, !82}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !75, file: !7, line: 727, baseType: !84, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !75, file: !7, line: 728, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !81, !73}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !75, file: !7, line: 730, baseType: !84, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !75, file: !7, line: 731, baseType: !78, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !75, file: !7, line: 733, baseType: !78, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !75, file: !7, line: 735, baseType: !84, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !75, file: !7, line: 736, baseType: !97, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!41, !81, !82, !73, !82}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !75, file: !7, line: 738, baseType: !101, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!41, !81, !104, !82}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !75, file: !7, line: 740, baseType: !107, size: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!41, !81, !104, !41, !41, !82}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !75, file: !7, line: 742, baseType: !84, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !75, file: !7, line: 743, baseType: !112, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!41, !81, !82, !13, !73}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !75, file: !7, line: 745, baseType: !84, size: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !75, file: !7, line: 746, baseType: !117, size: 64, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!41, !81, !120, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !75, file: !7, line: 747, baseType: !122, size: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !125, line: 10, size: 1024, flags: DIFlagFwdDecl, identifier: "_ZTS30halide_device_interface_impl_t")
!125 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!126 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !69, file: !7, line: 1433, baseType: !27, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !7, line: 1436, baseType: !13, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !7, line: 1439, baseType: !129, size: 32, offset: 256)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !7, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !130, identifier: "_ZTS13halide_type_t")
!130 = !{!131, !140, !141, !144, !148, !151, !156, !160, !161, !162, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !129, file: !7, line: 434, baseType: !132, size: 8, align: 8)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !7, line: 413, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !7, line: 403, baseType: !28, size: 8, elements: !134, identifier: "_ZTS18halide_type_code_t")
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!136 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!137 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!138 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!139 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !129, file: !7, line: 442, baseType: !28, size: 8, align: 8, offset: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !129, file: !7, line: 446, baseType: !142, size: 16, align: 16, offset: 16)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 14, baseType: !143)
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !DISubprogram(name: "halide_type_t", scope: !129, file: !7, line: 453, type: !145, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !132, !28, !142}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!148 = !DISubprogram(name: "halide_type_t", scope: !129, file: !7, line: 459, type: !149, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !147}
!151 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !129, file: !7, line: 463, type: !152, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DISubroutineType(types: !153)
!153 = !{!129, !154, !142}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!156 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !129, file: !7, line: 468, type: !157, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!157 = !DISubroutineType(types: !158)
!158 = !{!61, !154, !159}
!159 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !155, size: 64)
!160 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !129, file: !7, line: 472, type: !157, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!161 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !129, file: !7, line: 476, type: !157, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !129, file: !7, line: 481, type: !163, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!163 = !DISubroutineType(types: !164)
!164 = !{!41, !154}
!165 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !129, file: !7, line: 485, type: !166, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!166 = !DISubroutineType(types: !167)
!167 = !{!35, !154}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !69, file: !7, line: 1442, baseType: !40, size: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !69, file: !7, line: 1446, baseType: !43, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !69, file: !7, line: 1449, baseType: !81, size: 64, offset: 384)
!171 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !69, file: !7, line: 1454, type: !172, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!172 = !DISubroutineType(types: !173)
!173 = !{!61, !174, !175}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !7, line: 1416, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 1415, baseType: !36, size: 32, elements: !177, identifier: "_ZTS19halide_buffer_flags")
!177 = !{!178, !179}
!178 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!179 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!180 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !69, file: !7, line: 1458, type: !181, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !183, !175, !61}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!184 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !69, file: !7, line: 1466, type: !185, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubroutineType(types: !186)
!186 = !{!61, !174}
!187 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !69, file: !7, line: 1470, type: !185, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !69, file: !7, line: 1474, type: !189, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !183, !61}
!191 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !69, file: !7, line: 1478, type: !189, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !69, file: !7, line: 1485, type: !193, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubroutineType(types: !194)
!194 = !{!31, !174}
!195 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !69, file: !7, line: 1495, type: !196, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!27, !174}
!198 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !69, file: !7, line: 1506, type: !196, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !69, file: !7, line: 1518, type: !193, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !69, file: !7, line: 1523, type: !201, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!201 = !DISubroutineType(types: !202)
!202 = !{!27, !174, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!205 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !69, file: !7, line: 1534, type: !206, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{!41, !183, !81}
!208 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !69, file: !7, line: 1545, type: !185, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "eviction_key", scope: !21, file: !5, line: 85, baseType: !13, size: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "has_eviction_key", scope: !21, file: !5, line: 86, baseType: !61, size: 8, offset: 704)
!211 = !DISubprogram(name: "init", linkageName: "_ZN6Halide7Runtime8Internal10CacheEntry4initEPKhmjPK15halide_buffer_tiPPS5_by", scope: !21, file: !5, line: 88, type: !212, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!212 = !DISubroutineType(types: !213)
!213 = !{!61, !214, !215, !31, !35, !217, !40, !219, !61, !13}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!220 = !DISubprogram(name: "destroy", linkageName: "_ZN6Halide7Runtime8Internal10CacheEntry7destroyEv", scope: !21, file: !5, line: 93, type: !221, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !214}
!223 = !DISubprogram(name: "buffer", linkageName: "_ZN6Halide7Runtime8Internal10CacheEntry6bufferEi", scope: !21, file: !5, line: 94, type: !224, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !214, !40}
!226 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !68, size: 64)
!227 = !{!228}
!228 = !DISubrange(count: 256)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "most_recently_used", linkageName: "_ZN6Halide7Runtime8Internal18most_recently_usedE", scope: !2, file: !5, line: 202, type: !20, isLocal: false, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "least_recently_used", linkageName: "_ZN6Halide7Runtime8Internal19least_recently_usedE", scope: !2, file: !5, line: 203, type: !20, isLocal: false, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "max_cache_size", linkageName: "_ZN6Halide7Runtime8Internal14max_cache_sizeE", scope: !2, file: !5, line: 206, type: !235, isLocal: false, isDefinition: true)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !12, line: 9, baseType: !236)
!236 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "current_cache_size", linkageName: "_ZN6Halide7Runtime8Internal18current_cache_sizeE", scope: !2, file: !5, line: 207, type: !235, isLocal: false, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !240, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !241, retainedTypes: !242, globals: !331, imports: !338, splitDebugInlining: false, nameTableKind: None)
!240 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cache.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!241 = !{!133, !176}
!242 = !{!81, !243, !13, !324, !27, !67, !43, !31, !35, !20, !329, !249}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !245, file: !244, line: 203, baseType: !246)
!244 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!245 = !DINamespace(scope: !2)
!246 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !245, file: !244, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !247, templateParams: !321)
!247 = !{!248, !251, !252, !253, !254, !255, !257, !261, !267, !270, !273, !276, !279, !283, !287, !292, !296, !299, !303, !306, !309, !314, !315, !318, !319, !320}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !246, file: !244, line: 32, baseType: !249, size: 64, flags: DIFlagPublic)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !246, file: !244, line: 32, baseType: !249, size: 64, offset: 64, flags: DIFlagPublic)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !246, file: !244, line: 32, baseType: !249, size: 64, offset: 128, flags: DIFlagPublic)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !246, file: !244, line: 33, baseType: !81, size: 64, offset: 192, flags: DIFlagPublic)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !246, file: !244, line: 34, baseType: !61, size: 8, offset: 256, flags: DIFlagPublic)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !246, file: !244, line: 35, baseType: !256, size: 8, offset: 264, flags: DIFlagPublic)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 8, elements: !15)
!257 = !DISubprogram(name: "Printer", scope: !246, file: !244, line: 37, type: !258, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !260, !81, !249}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!261 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !246, file: !244, line: 57, type: !262, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !260, !265}
!264 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !246, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!267 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !246, file: !244, line: 67, type: !268, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{!264, !260, !235}
!270 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !246, file: !244, line: 72, type: !271, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{!264, !260, !40}
!273 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !246, file: !244, line: 77, type: !274, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{!264, !260, !13}
!276 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !246, file: !244, line: 82, type: !277, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!277 = !DISubroutineType(types: !278)
!278 = !{!264, !260, !35}
!279 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !246, file: !244, line: 87, type: !280, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DISubroutineType(types: !281)
!281 = !{!264, !260, !282}
!282 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!283 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !246, file: !244, line: 92, type: !284, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!284 = !DISubroutineType(types: !285)
!285 = !{!264, !260, !286}
!286 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!287 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !246, file: !244, line: 97, type: !288, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!288 = !DISubroutineType(types: !289)
!289 = !{!264, !260, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!292 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !246, file: !244, line: 102, type: !293, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!293 = !DISubroutineType(types: !294)
!294 = !{!264, !260, !295}
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!296 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !246, file: !244, line: 108, type: !297, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!264, !260, !159}
!299 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !246, file: !244, line: 113, type: !300, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{!264, !260, !302}
!302 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !218, size: 64)
!303 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !246, file: !244, line: 119, type: !304, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!265, !260}
!306 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !246, file: !244, line: 131, type: !307, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !260}
!309 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !246, file: !244, line: 139, type: !310, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DISubroutineType(types: !311)
!311 = !{!13, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!314 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !246, file: !244, line: 143, type: !310, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !246, file: !244, line: 148, type: !316, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !260, !41}
!318 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !246, file: !244, line: 158, type: !304, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !246, file: !244, line: 162, type: !307, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubprogram(name: "~Printer", scope: !246, file: !244, line: 166, type: !307, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !{!322, !323}
!322 = !DITemplateValueParameter(name: "type", type: !41, value: i32 0)
!323 = !DITemplateValueParameter(name: "length", type: !14, value: i64 1024)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CacheBlockHeader", scope: !2, file: !5, line: 97, size: 128, flags: DIFlagTypePassByValue, elements: !326, identifier: "_ZTSN6Halide7Runtime8Internal16CacheBlockHeaderE")
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !325, file: !5, line: 98, baseType: !20, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !325, file: !5, line: 99, baseType: !35, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !12, line: 28, baseType: !330)
!330 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!331 = !{!0, !17, !229, !231, !233, !237, !332, !335}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!333 = distinct !DIGlobalVariable(name: "kHashTableSize", scope: !2, file: !5, line: 198, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression(DW_OP_constu, 1048576, DW_OP_stack_value))
!336 = distinct !DIGlobalVariable(name: "kDefaultCacheSize", scope: !2, file: !5, line: 205, type: !337, isLocal: true, isDefinition: true)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!338 = !{!339}
!339 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !239, entity: !2, file: !12, line: 225)
!340 = !{i32 7, !"Dwarf Version", i32 4}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = !{i32 1, !"wchar_size", i32 4}
!343 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!344 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !2, file: !345, line: 47, type: !346, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !362)
!345 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348, !41, !235, !235}
!348 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !2, file: !345, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !351, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!351 = !{!352, !353, !354, !355, !359, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !350, file: !345, line: 35, baseType: !13, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !350, file: !345, line: 35, baseType: !13, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !350, file: !345, line: 37, baseType: !13, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !350, file: !345, line: 39, baseType: !356, size: 1024, offset: 192)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 16)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !350, file: !345, line: 41, baseType: !356, size: 1024, offset: 1216)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !350, file: !345, line: 42, baseType: !356, size: 1024, offset: 2240)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !350, file: !345, line: 44, baseType: !13, size: 64, offset: 3264)
!362 = !{!363, !364, !365, !366, !367, !370, !371}
!363 = !DILocalVariable(name: "copy", arg: 1, scope: !344, file: !345, line: 47, type: !348)
!364 = !DILocalVariable(name: "d", arg: 2, scope: !344, file: !345, line: 47, type: !41)
!365 = !DILocalVariable(name: "src_off", arg: 3, scope: !344, file: !345, line: 47, type: !235)
!366 = !DILocalVariable(name: "dst_off", arg: 4, scope: !344, file: !345, line: 47, type: !235)
!367 = !DILocalVariable(name: "from", scope: !368, file: !345, line: 54, type: !290)
!368 = distinct !DILexicalBlock(scope: !369, file: !345, line: 53, column: 18)
!369 = distinct !DILexicalBlock(scope: !344, file: !345, line: 53, column: 9)
!370 = !DILocalVariable(name: "to", scope: !368, file: !345, line: 55, type: !81)
!371 = !DILocalVariable(name: "i", scope: !372, file: !345, line: 58, type: !13)
!372 = distinct !DILexicalBlock(scope: !373, file: !345, line: 58, column: 9)
!373 = distinct !DILexicalBlock(scope: !369, file: !345, line: 57, column: 12)
!374 = !DILocation(line: 0, scope: !344)
!375 = !DILocation(line: 49, column: 14, scope: !344)
!376 = !DILocation(line: 49, column: 19, scope: !344)
!377 = !DILocation(line: 49, column: 22, scope: !344)
!378 = !{!379, !379, i64 0}
!379 = !{!"long long", !380, i64 0}
!380 = !{!"omnipotent char", !381, i64 0}
!381 = !{!"Simple C++ TBAA"}
!382 = !DILocation(line: 49, column: 37, scope: !344)
!383 = !DILocation(line: 49, column: 5, scope: !344)
!384 = !DILocation(line: 50, column: 10, scope: !385)
!385 = distinct !DILexicalBlock(scope: !344, file: !345, line: 49, column: 43)
!386 = distinct !{!386, !383, !387, !388}
!387 = !DILocation(line: 51, column: 5, scope: !344)
!388 = !{!"llvm.loop.mustprogress"}
!389 = !DILocation(line: 53, column: 11, scope: !369)
!390 = !DILocation(line: 53, column: 9, scope: !344)
!391 = !DILocation(line: 0, scope: !372)
!392 = !DILocation(line: 58, column: 34, scope: !393)
!393 = distinct !DILexicalBlock(scope: !372, file: !345, line: 58, column: 9)
!394 = !DILocation(line: 58, column: 32, scope: !393)
!395 = !DILocation(line: 58, column: 9, scope: !372)
!396 = !DILocation(line: 54, column: 42, scope: !368)
!397 = !{!398, !379, i64 0}
!398 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !379, i64 0, !379, i64 8, !379, i64 16, !380, i64 24, !380, i64 152, !380, i64 280, !379, i64 408}
!399 = !DILocation(line: 54, column: 46, scope: !368)
!400 = !DILocation(line: 54, column: 28, scope: !368)
!401 = !DILocation(line: 0, scope: !368)
!402 = !DILocation(line: 55, column: 34, scope: !368)
!403 = !{!398, !379, i64 8}
!404 = !DILocation(line: 55, column: 38, scope: !368)
!405 = !DILocation(line: 55, column: 20, scope: !368)
!406 = !DILocation(line: 56, column: 31, scope: !368)
!407 = !{!398, !379, i64 408}
!408 = !DILocation(line: 56, column: 9, scope: !368)
!409 = !DILocation(line: 57, column: 5, scope: !368)
!410 = !DILocation(line: 59, column: 13, scope: !411)
!411 = distinct !DILexicalBlock(scope: !393, file: !345, line: 58, column: 55)
!412 = !DILocation(line: 60, column: 24, scope: !411)
!413 = !DILocation(line: 60, column: 21, scope: !411)
!414 = !DILocation(line: 61, column: 24, scope: !411)
!415 = !DILocation(line: 61, column: 21, scope: !411)
!416 = !DILocation(line: 58, column: 51, scope: !393)
!417 = distinct !{!417, !395, !418, !388}
!418 = !DILocation(line: 62, column: 9, scope: !372)
!419 = !DILocation(line: 64, column: 1, scope: !344)
!420 = !DISubprogram(name: "memcpy", scope: !12, file: !12, line: 94, type: !421, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!81, !81, !290, !32}
!423 = !{}
