; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_threads.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_threads.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-windows-msvc19.11.0"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, [4 x i8], %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8, [7 x i8] }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32, [4 x i8] }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i64] }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::spawned_thread" = type { void (i8*)*, i8*, i8* }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "?table_storage@Synchronization@Internal@Runtime@Halide@@3PADA", scope: !2, file: !6, line: 478, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Synchronization", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b400fbacf7de8493908f4259eb79919f")
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 196608, elements: !9)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!10}
!10 = !DISubrange(count: 24576)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "?work_queue@Internal@Runtime@Halide@@3Uwork_queue_t@123@A", scope: !3, file: !13, line: 166, type: !14, isLocal: false, isDefinition: true)
!13 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "385167390ae95a5e646994afa54aa508")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !3, file: !13, line: 94, size: 17024, flags: DIFlagTypePassByValue, elements: !15, identifier: ".?AUwork_queue_t@Internal@Runtime@Halide@@")
!15 = !{!16, !28, !30, !31, !89, !90, !91, !92, !96, !97, !98, !99, !100, !106, !107, !108, !109, !114, !117}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !14, file: !13, line: 96, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !18, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !19, identifier: ".?AUhalide_mutex@@")
!18 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !17, file: !18, line: 121, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !26)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 61, baseType: !24)
!23 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "0c7b3d8a4f3a5581b3edea53998e0f01")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 10, baseType: !25)
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 1)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !14, file: !13, line: 99, baseType: !29, size: 32, offset: 64)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !14, file: !13, line: 103, baseType: !29, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !14, file: !13, line: 106, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !3, file: !13, line: 26, size: 1024, flags: DIFlagTypePassByValue, elements: !34, identifier: ".?AUwork@Internal@Runtime@Halide@@")
!34 = !{!35, !65, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !84}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !33, file: !13, line: 27, baseType: !36, size: 448)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !18, line: 201, size: 448, flags: DIFlagTypePassByValue, elements: !37, identifier: ".?AUhalide_parallel_task_t@@")
!37 = !{!38, !47, !48, !51, !59, !60, !61, !62, !63}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !36, file: !18, line: 204, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !18, line: 192, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!29, !43, !29, !29, !44, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 16, baseType: !46)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !36, file: !18, line: 207, baseType: !44, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !18, line: 210, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !36, file: !18, line: 214, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !18, line: 177, size: 128, flags: DIFlagTypePassByValue, elements: !54, identifier: ".?AUhalide_semaphore_acquire_t@@")
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !53, file: !18, line: 178, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !18, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: ".?AUhalide_semaphore_t@@")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !18, line: 179, baseType: !29, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !36, file: !18, line: 215, baseType: !29, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 288)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !36, file: !18, line: 238, baseType: !29, size: 32, offset: 352)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !36, file: !18, line: 243, baseType: !64, size: 8, offset: 384)
!64 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !33, file: !13, line: 31, baseType: !66, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !18, line: 158, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!29, !43, !29, !44}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !33, file: !13, line: 33, baseType: !32, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !33, file: !13, line: 34, baseType: !32, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !33, file: !13, line: 35, baseType: !29, size: 32, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !33, file: !13, line: 36, baseType: !32, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !33, file: !13, line: 37, baseType: !29, size: 32, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !33, file: !13, line: 39, baseType: !43, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !33, file: !13, line: 40, baseType: !29, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !33, file: !13, line: 41, baseType: !29, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !33, file: !13, line: 42, baseType: !29, size: 32, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !33, file: !13, line: 44, baseType: !64, size: 8, offset: 992)
!80 = !DISubprogram(name: "make_runnable", linkageName: "?make_runnable@work@Internal@Runtime@Halide@@QEAA_NXZ", scope: !33, file: !13, line: 46, type: !81, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{!64, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!84 = !DISubprogram(name: "running", linkageName: "?running@work@Internal@Runtime@Halide@@QEBA_NXZ", scope: !33, file: !13, line: 62, type: !85, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{!64, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !14, file: !13, line: 109, baseType: !29, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !14, file: !13, line: 122, baseType: !93, size: 64, offset: 320)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !18, line: 125, size: 64, flags: DIFlagTypePassByValue, elements: !94, identifier: ".?AUhalide_cond@@")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !93, file: !18, line: 126, baseType: !21, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !14, file: !13, line: 122, baseType: !93, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !14, file: !13, line: 122, baseType: !93, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 544)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !14, file: !13, line: 129, baseType: !101, size: 16384, offset: 576)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 16384, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !18, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AUhalide_thread@@")
!104 = !{!105}
!105 = !DISubrange(count: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 16960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 16968)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !14, file: !13, line: 139, baseType: !29, size: 32, offset: 16992)
!109 = !DISubprogram(name: "running", linkageName: "?running@work_queue_t@Internal@Runtime@Halide@@QEBA_NXZ", scope: !14, file: !13, line: 141, type: !110, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!64, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!114 = !DISubprogram(name: "assert_zeroed", linkageName: "?assert_zeroed@work_queue_t@Internal@Runtime@Halide@@QEBAXXZ", scope: !14, file: !13, line: 146, type: !115, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !112}
!117 = !DISubprogram(name: "reset", linkageName: "?reset@work_queue_t@Internal@Runtime@Halide@@QEAAXXZ", scope: !14, file: !13, line: 158, type: !118, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "?custom_do_task@Internal@Runtime@Halide@@3P6AHPEAXP6AH0HPEAE@ZH1@ZEA", scope: !3, file: !13, line: 567, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !18, line: 259, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!29, !43, !66, !29, !44}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "?custom_do_loop_task@Internal@Runtime@Halide@@3P6AHPEAXP6AH0HHPEAE0@ZHH10@ZEA", scope: !3, file: !13, line: 568, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !18, line: 268, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!29, !43, !39, !29, !29, !44, !43}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "?custom_do_par_for@Internal@Runtime@Halide@@3P6AHPEAXP6AH0HPEAE@ZHH1@ZEA", scope: !3, file: !13, line: 569, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !18, line: 167, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!29, !43, !66, !29, !29, !44}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "?custom_do_parallel_tasks@Internal@Runtime@Halide@@3P6AHPEAXHPEAUhalide_parallel_task_t@@0@ZEA", scope: !3, file: !13, line: 570, type: !141, isLocal: false, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !18, line: 281, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!29, !43, !29, !145, !43}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "?custom_semaphore_init@Internal@Runtime@Halide@@3P6AHPEAUhalide_semaphore_t@@H@ZEA", scope: !3, file: !13, line: 571, type: !148, isLocal: false, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !18, line: 184, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!29, !56, !29}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "?custom_semaphore_try_acquire@Internal@Runtime@Halide@@3P6A_NPEAUhalide_semaphore_t@@H@ZEA", scope: !3, file: !13, line: 572, type: !154, isLocal: false, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !18, line: 186, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!64, !56, !29}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "?custom_semaphore_release@Internal@Runtime@Halide@@3P6AHPEAUhalide_semaphore_t@@H@ZEA", scope: !3, file: !13, line: 573, type: !160, isLocal: false, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !18, line: 185, baseType: !149)
!161 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !162, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !163, retainedTypes: !164, globals: !371, imports: !379, splitDebugInlining: false, nameTableKind: None)
!162 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "6b47adcd64c88f8a38b8b1700cd2db58")
!163 = !{}
!164 = !{!165, !102, !22, !176, !227, !262, !263, !303, !328, !338, !309, !348, !361, !365, !32, !366, !298, !49, !370}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !3, file: !167, line: 38, size: 192, flags: DIFlagTypePassByValue, elements: !168, identifier: ".?AUspawned_thread@Internal@Runtime@Halide@@")
!167 = !DIFile(filename: "src/runtime/windows_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "6b47adcd64c88f8a38b8b1700cd2db58")
!168 = !{!169, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !166, file: !167, line: 39, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !43}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !166, file: !167, line: 40, baseType: !43, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !166, file: !167, line: 41, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", file: !167, line: 17, baseType: !43)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !2, file: !6, line: 254, size: 640, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !178, identifier: ".?AUword_lock_queue_data@Synchronization@Internal@Runtime@Halide@@")
!178 = !{!179, !219, !220, !221, !222, !226}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !177, file: !6, line: 255, baseType: !180, size: 448)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !2, file: !167, line: 87, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !181, identifier: ".?AUthread_parker@Synchronization@Internal@Runtime@Halide@@")
!181 = !{!182, !190, !192, !193, !199, !203, !207, !210, !213, !214, !215, !216, !217, !218}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "critical_section", scope: !180, file: !167, line: 88, baseType: !183, size: 320)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "CriticalSection", file: !167, line: 20, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CriticalSection", file: !167, line: 18, size: 320, flags: DIFlagTypePassByValue, elements: !185, identifier: ".?AUCriticalSection@@")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !184, file: !167, line: 19, baseType: !187, size: 320)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 320, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 5)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !180, file: !167, line: 89, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", file: !167, line: 16, baseType: !24)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !180, file: !167, line: 90, baseType: !64, size: 8, offset: 384)
!193 = !DISubprogram(name: "thread_parker", scope: !180, file: !167, line: 92, type: !194, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196, !197}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!197 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!199 = !DISubprogram(name: "operator=", linkageName: "??4thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAAEAU01234@AEBU01234@@Z", scope: !180, file: !167, line: 93, type: !200, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !196, !197}
!202 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !180, size: 64)
!203 = !DISubprogram(name: "thread_parker", scope: !180, file: !167, line: 94, type: !204, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !196, !206}
!206 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !180, size: 64)
!207 = !DISubprogram(name: "operator=", linkageName: "??4thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAAEAU01234@$$QEAU01234@@Z", scope: !180, file: !167, line: 95, type: !208, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!208 = !DISubroutineType(types: !209)
!209 = !{!202, !196, !206}
!210 = !DISubprogram(name: "thread_parker", scope: !180, file: !167, line: 97, type: !211, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !196}
!213 = !DISubprogram(name: "~thread_parker", scope: !180, file: !167, line: 102, type: !211, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DISubprogram(name: "prepare_park", linkageName: "?prepare_park@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 107, type: !211, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubprogram(name: "park", linkageName: "?park@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 111, type: !211, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubprogram(name: "unpark_start", linkageName: "?unpark_start@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 119, type: !211, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubprogram(name: "unpark", linkageName: "?unpark@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 123, type: !211, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubprogram(name: "unpark_finish", linkageName: "?unpark_finish@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 128, type: !211, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !6, line: 273, baseType: !176, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !6, line: 274, baseType: !176, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !177, file: !6, line: 275, baseType: !176, size: 64, offset: 576)
!222 = !DISubprogram(name: "word_lock_queue_data", scope: !177, file: !6, line: 277, type: !223, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!226 = !DISubprogram(name: "~word_lock_queue_data", scope: !177, file: !6, line: 280, type: !223, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !2, file: !6, line: 475, size: 196608, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !229, identifier: ".?AUhash_table@Synchronization@Internal@Runtime@Halide@@")
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !228, file: !6, line: 476, baseType: !231, size: 196608)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 196608, elements: !260)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !2, file: !6, line: 463, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !233, identifier: ".?AUhash_bucket@Synchronization@Internal@Runtime@Halide@@")
!233 = !{!234, !246, !259}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !232, file: !6, line: 464, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !2, file: !6, line: 283, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !236, identifier: ".?AVword_lock@Synchronization@Internal@Runtime@Halide@@")
!236 = !{!237, !238, !242, !243, !244, !245}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !235, file: !6, line: 284, baseType: !22, size: 64)
!238 = !DISubprogram(name: "lock_full", linkageName: "?lock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AEAAXXZ", scope: !235, file: !6, line: 286, type: !239, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!242 = !DISubprogram(name: "unlock_full", linkageName: "?unlock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AEAAXXZ", scope: !235, file: !6, line: 287, type: !239, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubprogram(name: "word_lock", scope: !235, file: !6, line: 290, type: !239, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubprogram(name: "lock", linkageName: "?lock@word_lock@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !235, file: !6, line: 291, type: !239, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!245 = !DISubprogram(name: "unlock", linkageName: "?unlock@word_lock@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !235, file: !6, line: 304, type: !239, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !232, file: !6, line: 466, baseType: !247, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !2, file: !6, line: 448, size: 640, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !249, identifier: ".?AUqueue_data@Synchronization@Internal@Runtime@Halide@@")
!249 = !{!250, !251, !252, !253, !254, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !248, file: !6, line: 449, baseType: !180, size: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !248, file: !6, line: 451, baseType: !22, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !6, line: 452, baseType: !247, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !248, file: !6, line: 453, baseType: !22, size: 64, offset: 576)
!254 = !DISubprogram(name: "queue_data", scope: !248, file: !6, line: 455, type: !255, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!258 = !DISubprogram(name: "~queue_data", scope: !248, file: !6, line: 457, type: !255, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !232, file: !6, line: 467, baseType: !247, size: 64, offset: 128)
!260 = !{!261}
!261 = !DISubrange(count: 1024)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !2, file: !6, line: 829, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !265, identifier: ".?AUmutex_parking_control@Synchronization@Internal@Runtime@Halide@@")
!265 = !{!266, !297, !299}
!266 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !264, baseType: !267, extraData: i32 0)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !2, file: !6, line: 592, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !268, identifier: ".?AUparking_control@Synchronization@Internal@Runtime@Halide@@")
!268 = !{!269, !282, !283, !287, !293}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !267, file: !6, line: 593, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!64, !43, !273}
!273 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !2, file: !6, line: 576, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !275, identifier: ".?AUvalidate_action@Synchronization@Internal@Runtime@Halide@@")
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !274, file: !6, line: 577, baseType: !64, size: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !274, file: !6, line: 578, baseType: !22, size: 64, offset: 64)
!278 = !DISubprogram(name: "validate_action", scope: !274, file: !6, line: 580, type: !279, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !267, file: !6, line: 594, baseType: !170, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !267, file: !6, line: 595, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!22, !43, !29, !64}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !267, file: !6, line: 596, baseType: !288, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !43, !291, !64, !64}
!291 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!293 = !DISubprogram(name: "parking_control", scope: !267, file: !6, line: 598, type: !294, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !264, file: !6, line: 830, baseType: !298, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!299 = !DISubprogram(name: "mutex_parking_control", scope: !264, file: !6, line: 832, type: !300, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302, !298}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !2, file: !6, line: 958, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !305, identifier: ".?AUsignal_parking_control@Synchronization@Internal@Runtime@Halide@@")
!305 = !{!306, !307, !308, !324}
!306 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !304, baseType: !267, extraData: i32 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !304, file: !6, line: 959, baseType: !298, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !304, file: !6, line: 960, baseType: !309, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !2, file: !6, line: 859, size: 64, flags: DIFlagTypePassByValue, elements: !311, identifier: ".?AVfast_mutex@Synchronization@Internal@Runtime@Halide@@")
!311 = !{!312, !313, !317, !318, !319, !320, !323}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !6, line: 860, baseType: !22, size: 64)
!313 = !DISubprogram(name: "lock_full", linkageName: "?lock_full@fast_mutex@Synchronization@Internal@Runtime@Halide@@AEAAXXZ", scope: !310, file: !6, line: 862, type: !314, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!317 = !DISubprogram(name: "unlock_full", linkageName: "?unlock_full@fast_mutex@Synchronization@Internal@Runtime@Halide@@AEAAXXZ", scope: !310, file: !6, line: 906, type: !314, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubprogram(name: "lock", linkageName: "?lock@fast_mutex@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !310, file: !6, line: 920, type: !314, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubprogram(name: "unlock", linkageName: "?unlock@fast_mutex@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !310, file: !6, line: 929, type: !314, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubprogram(name: "make_parked_if_locked", linkageName: "?make_parked_if_locked@fast_mutex@Synchronization@Internal@Runtime@Halide@@QEAA_NXZ", scope: !310, file: !6, line: 938, type: !321, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubroutineType(types: !322)
!322 = !{!64, !316}
!323 = !DISubprogram(name: "make_parked", linkageName: "?make_parked@fast_mutex@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !310, file: !6, line: 953, type: !314, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DISubprogram(name: "signal_parking_control", scope: !304, file: !6, line: 962, type: !325, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !327, !298, !309}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !2, file: !6, line: 985, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !330, identifier: ".?AUbroadcast_parking_control@Synchronization@Internal@Runtime@Halide@@")
!330 = !{!331, !332, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !329, baseType: !267, extraData: i32 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !329, file: !6, line: 986, baseType: !298, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !329, file: !6, line: 987, baseType: !309, size: 64, offset: 320)
!334 = !DISubprogram(name: "broadcast_parking_control", scope: !329, file: !6, line: 989, type: !335, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337, !298, !309}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !2, file: !6, line: 1026, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !340, identifier: ".?AUwait_parking_control@Synchronization@Internal@Runtime@Halide@@")
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !339, baseType: !267, extraData: i32 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !339, file: !6, line: 1027, baseType: !298, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !339, file: !6, line: 1028, baseType: !309, size: 64, offset: 320)
!344 = !DISubprogram(name: "wait_parking_control", scope: !339, file: !6, line: 1030, type: !345, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347, !298, !309}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !2, file: !6, line: 1072, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !350, identifier: ".?AVfast_cond@Synchronization@Internal@Runtime@Halide@@")
!350 = !{!351, !352, !356, !357, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !349, file: !6, line: 1073, baseType: !22, size: 64)
!352 = !DISubprogram(name: "fast_cond", scope: !349, file: !6, line: 1076, type: !353, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!356 = !DISubprogram(name: "signal", linkageName: "?signal@fast_cond@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !349, file: !6, line: 1078, type: !353, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubprogram(name: "broadcast", linkageName: "?broadcast@fast_cond@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !349, file: !6, line: 1092, type: !353, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubprogram(name: "wait", linkageName: "?wait@fast_cond@Synchronization@Internal@Runtime@Halide@@QEAAXPEAVfast_mutex@2345@@Z", scope: !349, file: !6, line: 1105, type: !359, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !355, !309}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !6, line: 1164, size: 64, flags: DIFlagTypePassByValue, elements: !363, identifier: ".?AUhalide_mutex_array@@")
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !362, file: !6, line: 1165, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !13, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !368, identifier: ".?AUhalide_semaphore_impl_t@@")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !367, file: !13, line: 712, baseType: !29, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!371 = !{!372, !375, !0, !377, !11, !121, !127, !133, !139, !146, !152, !158}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!373 = distinct !DIGlobalVariable(name: "lock_bit", scope: !2, file: !6, line: 250, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!376 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !2, file: !6, line: 251, type: !374, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!378 = distinct !DIGlobalVariable(name: "parked_bit", scope: !2, file: !6, line: 252, type: !374, isLocal: true, isDefinition: true)
!379 = !{!380, !381}
!380 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !23, line: 225)
!381 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !13, line: 579)
!382 = !{i32 2, !"CodeView", i32 1}
!383 = !{i32 2, !"Debug Info Version", i32 3}
!384 = !{i32 1, !"wchar_size", i32 4}
!385 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!386 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "?spawn_thread_helper@Internal@Runtime@Halide@@YAPEAXPEAX@Z", scope: !3, file: !167, line: 43, type: !387, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!43, !43}
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "arg", arg: 1, scope: !386, file: !167, line: 43, type: !43)
!391 = !DILocalVariable(name: "t", scope: !386, file: !167, line: 44, type: !165)
!392 = !DILocation(line: 0, scope: !386)
!393 = !DILocation(line: 45, scope: !386)
!394 = !{!395, !396, i64 0}
!395 = !{!"?AUspawned_thread@Internal@Runtime@Halide@@", !396, i64 0, !396, i64 8, !396, i64 16}
!396 = !{!"any pointer", !397, i64 0}
!397 = !{!"omnipotent char", !398, i64 0}
!398 = !{!"Simple C++ TBAA"}
!399 = !{!395, !396, i64 8}
!400 = !DILocation(line: 46, scope: !386)
!401 = distinct !DISubprogram(name: "halide_host_cpu_count", scope: !167, file: !167, line: 55, type: !402, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{!29}
!404 = !{!405}
!405 = !DILocalVariable(name: "num_cores", scope: !401, file: !167, line: 57, type: !370)
!406 = !DILocation(line: 57, scope: !401)
!407 = !DILocation(line: 0, scope: !401)
!408 = !DILocation(line: 58, scope: !401)
!409 = !DILocation(line: 59, scope: !410)
!410 = distinct !DILexicalBlock(scope: !411, file: !167, line: 58)
!411 = distinct !DILexicalBlock(scope: !401, file: !167, line: 58)
!412 = !DILocation(line: 0, scope: !411)
!413 = !DILocation(line: 63, scope: !401)
!414 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !167, file: !167, line: 65, type: !415, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{!102, !170, !43}
!417 = !{!418, !419, !420}
!418 = !DILocalVariable(name: "closure", arg: 2, scope: !414, file: !167, line: 65, type: !43)
!419 = !DILocalVariable(name: "f", arg: 1, scope: !414, file: !167, line: 65, type: !170)
!420 = !DILocalVariable(name: "t", scope: !414, file: !167, line: 66, type: !165)
!421 = !DILocation(line: 0, scope: !414)
!422 = !DILocation(line: 66, scope: !414)
!423 = !DILocation(line: 67, scope: !414)
!424 = !DILocation(line: 68, scope: !414)
!425 = !DILocation(line: 69, scope: !414)
!426 = !{!395, !396, i64 16}
!427 = !DILocation(line: 70, scope: !414)
!428 = distinct !DISubprogram(name: "halide_join_thread", scope: !167, file: !167, line: 73, type: !429, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !102}
!431 = !{!432, !433}
!432 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !428, file: !167, line: 73, type: !102)
!433 = !DILocalVariable(name: "thread", scope: !428, file: !167, line: 74, type: !165)
!434 = !DILocation(line: 0, scope: !428)
!435 = !DILocation(line: 74, scope: !428)
!436 = !DILocation(line: 75, scope: !428)
!437 = !DILocation(line: 76, scope: !428)
!438 = !DILocation(line: 77, scope: !428)
!439 = distinct !DISubprogram(name: "lock_full", linkageName: "?lock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AEAAXXZ", scope: !235, file: !6, line: 321, type: !239, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !238, retainedNodes: !440)
!440 = !{!441, !443, !455, !456, !460, !461, !462}
!441 = !DILocalVariable(name: "this", arg: 1, scope: !439, type: !442, flags: DIFlagArtificial | DIFlagObjectPointer)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!443 = !DILocalVariable(name: "spinner", scope: !439, file: !6, line: 322, type: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !2, file: !6, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !445, identifier: ".?AVspin_control@Synchronization@Internal@Runtime@Halide@@")
!445 = !{!446, !447, !451, !454}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !444, file: !6, line: 231, baseType: !29, size: 32)
!447 = !DISubprogram(name: "spin_control", scope: !444, file: !6, line: 235, type: !448, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!451 = !DISubprogram(name: "should_spin", linkageName: "?should_spin@spin_control@Synchronization@Internal@Runtime@Halide@@QEAA_NXZ", scope: !444, file: !6, line: 237, type: !452, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!452 = !DISubroutineType(types: !453)
!453 = !{!64, !450}
!454 = !DISubprogram(name: "reset", linkageName: "?reset@spin_control@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !444, file: !6, line: 244, type: !448, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DILocalVariable(name: "expected", scope: !439, file: !6, line: 323, type: !22)
!456 = !DILocalVariable(name: "desired", scope: !457, file: !6, line: 328, type: !22)
!457 = distinct !DILexicalBlock(scope: !458, file: !6, line: 327)
!458 = distinct !DILexicalBlock(scope: !459, file: !6, line: 327)
!459 = distinct !DILexicalBlock(scope: !439, file: !6, line: 326)
!460 = !DILocalVariable(name: "node", scope: !459, file: !6, line: 342, type: !177)
!461 = !DILocalVariable(name: "head", scope: !459, file: !6, line: 347, type: !176)
!462 = !DILocalVariable(name: "desired", scope: !459, file: !6, line: 359, type: !22)
!463 = !DILocation(line: 0, scope: !439)
!464 = !DILocation(line: 324, scope: !439)
!465 = !DILocalVariable(name: "val", arg: 2, scope: !466, file: !6, line: 200, type: !470)
!466 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned long long>", linkageName: "??$atomic_load_relaxed@_K@?A0xE93CD500@Synchronization@Internal@Runtime@Halide@@YAXPEA_K0@Z", scope: !467, file: !6, line: 200, type: !468, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !473, retainedNodes: !471)
!467 = !DINamespace(scope: !2)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !470, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!471 = !{!465, !472}
!472 = !DILocalVariable(name: "addr", arg: 1, scope: !466, file: !6, line: 200, type: !470)
!473 = !{!474}
!474 = !DITemplateTypeParameter(name: "T", type: !25)
!475 = !DILocation(line: 0, scope: !466, inlinedAt: !476)
!476 = distinct !DILocation(line: 324, scope: !439)
!477 = !DILocation(line: 201, scope: !466, inlinedAt: !476)
!478 = !DILocation(line: 326, scope: !439)
!479 = !DILocation(line: 327, scope: !459)
!480 = !DILocation(line: 328, scope: !457)
!481 = !DILocation(line: 0, scope: !457)
!482 = !DILocalVariable(name: "desired", arg: 3, scope: !483, file: !6, line: 191, type: !298)
!483 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "?atomic_cas_weak_acquire_relaxed@?A0xE93CD500@Synchronization@Internal@Runtime@Halide@@YA_NPEA_K00@Z", scope: !467, file: !6, line: 191, type: !484, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!64, !298, !298, !298}
!486 = !{!482, !487, !488}
!487 = !DILocalVariable(name: "expected", arg: 2, scope: !483, file: !6, line: 191, type: !298)
!488 = !DILocalVariable(name: "addr", arg: 1, scope: !483, file: !6, line: 191, type: !298)
!489 = !DILocation(line: 0, scope: !483, inlinedAt: !490)
!490 = distinct !DILocation(line: 330, scope: !457)
!491 = !DILocation(line: 192, scope: !483, inlinedAt: !490)
!492 = !DILocation(line: 336, scope: !459)
!493 = !DILocalVariable(name: "this", arg: 1, scope: !494, type: !496, flags: DIFlagArtificial | DIFlagObjectPointer)
!494 = distinct !DISubprogram(name: "should_spin", linkageName: "?should_spin@spin_control@Synchronization@Internal@Runtime@Halide@@QEAA_NXZ", scope: !444, file: !6, line: 237, type: !452, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !451, retainedNodes: !495)
!495 = !{!493}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!497 = !DILocation(line: 0, scope: !494, inlinedAt: !498)
!498 = distinct !DILocation(line: 336, scope: !459)
!499 = !DILocation(line: 241, scope: !494, inlinedAt: !498)
!500 = !DILocation(line: 239, scope: !501, inlinedAt: !498)
!501 = distinct !DILexicalBlock(scope: !502, file: !6, line: 238)
!502 = distinct !DILexicalBlock(scope: !494, file: !6, line: 238)
!503 = !DILocation(line: 337, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !6, line: 336)
!505 = distinct !DILexicalBlock(scope: !459, file: !6, line: 336)
!506 = !DILocation(line: 0, scope: !466, inlinedAt: !507)
!507 = distinct !DILocation(line: 338, scope: !504)
!508 = !DILocation(line: 201, scope: !466, inlinedAt: !507)
!509 = !DILocation(line: 339, scope: !504)
!510 = !DILocation(line: 342, scope: !459)
!511 = !DILocalVariable(name: "this", arg: 1, scope: !512, type: !176, flags: DIFlagArtificial | DIFlagObjectPointer)
!512 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "??0word_lock_queue_data@Synchronization@Internal@Runtime@Halide@@QEAA@XZ", scope: !177, file: !6, line: 277, type: !223, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !222, retainedNodes: !513)
!513 = !{!511}
!514 = !DILocation(line: 0, scope: !512, inlinedAt: !515)
!515 = distinct !DILocation(line: 342, scope: !459)
!516 = !DILocalVariable(name: "this", arg: 1, scope: !517, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!517 = distinct !DISubprogram(name: "thread_parker", linkageName: "??0thread_parker@Synchronization@Internal@Runtime@Halide@@QEAA@XZ", scope: !180, file: !167, line: 97, type: !211, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !210, retainedNodes: !518)
!518 = !{!516}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!520 = !DILocation(line: 0, scope: !517, inlinedAt: !521)
!521 = distinct !DILocation(line: 277, scope: !512, inlinedAt: !515)
!522 = !DILocation(line: 97, scope: !517, inlinedAt: !521)
!523 = !{!524, !527, i64 48}
!524 = !{!"?AUthread_parker@Synchronization@Internal@Runtime@Halide@@", !525, i64 0, !526, i64 40, !527, i64 48}
!525 = !{!"?AUCriticalSection@@", !397, i64 0}
!526 = !{!"long long", !397, i64 0}
!527 = !{!"bool", !397, i64 0}
!528 = !DILocation(line: 98, scope: !529, inlinedAt: !521)
!529 = distinct !DILexicalBlock(scope: !517, file: !167, line: 97)
!530 = !DILocation(line: 99, scope: !529, inlinedAt: !521)
!531 = !DILocation(line: 277, scope: !512, inlinedAt: !515)
!532 = !{!533, !396, i64 56}
!533 = !{!"?AUword_lock_queue_data@Synchronization@Internal@Runtime@Halide@@", !524, i64 0, !396, i64 56, !396, i64 64, !396, i64 72}
!534 = !{!533, !396, i64 64}
!535 = !{!533, !396, i64 72}
!536 = !DILocalVariable(name: "this", arg: 1, scope: !537, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!537 = distinct !DISubprogram(name: "prepare_park", linkageName: "?prepare_park@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 107, type: !211, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !214, retainedNodes: !538)
!538 = !{!536}
!539 = !DILocation(line: 0, scope: !537, inlinedAt: !540)
!540 = distinct !DILocation(line: 344, scope: !459)
!541 = !DILocation(line: 108, scope: !537, inlinedAt: !540)
!542 = !DILocation(line: 347, scope: !459)
!543 = !DILocation(line: 0, scope: !459)
!544 = !DILocation(line: 348, scope: !459)
!545 = !DILocation(line: 349, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !6, line: 348)
!547 = distinct !DILexicalBlock(scope: !459, file: !6, line: 348)
!548 = !DILocation(line: 351, scope: !546)
!549 = !DILocation(line: 356, scope: !550)
!550 = distinct !DILexicalBlock(scope: !547, file: !6, line: 351)
!551 = !DILocation(line: 357, scope: !550)
!552 = !DILocation(line: 359, scope: !459)
!553 = !DILocalVariable(name: "desired", arg: 3, scope: !554, file: !6, line: 183, type: !298)
!554 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "?atomic_cas_weak_release_relaxed@?A0xE93CD500@Synchronization@Internal@Runtime@Halide@@YA_NPEA_K00@Z", scope: !467, file: !6, line: 183, type: !484, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !555)
!555 = !{!553, !556, !557}
!556 = !DILocalVariable(name: "expected", arg: 2, scope: !554, file: !6, line: 183, type: !298)
!557 = !DILocalVariable(name: "addr", arg: 1, scope: !554, file: !6, line: 183, type: !298)
!558 = !DILocation(line: 0, scope: !554, inlinedAt: !559)
!559 = distinct !DILocation(line: 360, scope: !459)
!560 = !DILocation(line: 184, scope: !554, inlinedAt: !559)
!561 = !DILocalVariable(name: "this", arg: 1, scope: !562, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!562 = distinct !DISubprogram(name: "park", linkageName: "?park@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 111, type: !211, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !215, retainedNodes: !563)
!563 = !{!561}
!564 = !DILocation(line: 0, scope: !562, inlinedAt: !565)
!565 = distinct !DILocation(line: 361, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !6, line: 360)
!567 = distinct !DILexicalBlock(scope: !459, file: !6, line: 360)
!568 = !DILocation(line: 112, scope: !562, inlinedAt: !565)
!569 = !DILocation(line: 113, scope: !562, inlinedAt: !565)
!570 = !{i8 0, i8 2}
!571 = !DILocation(line: 114, scope: !572, inlinedAt: !565)
!572 = distinct !DILexicalBlock(scope: !562, file: !167, line: 113)
!573 = distinct !{!573, !569, !574, !575}
!574 = !DILocation(line: 115, scope: !562, inlinedAt: !565)
!575 = !{!"llvm.loop.mustprogress"}
!576 = !DILocation(line: 116, scope: !562, inlinedAt: !565)
!577 = !DILocation(line: 0, scope: !466, inlinedAt: !578)
!578 = distinct !DILocation(line: 363, scope: !566)
!579 = !DILocation(line: 201, scope: !466, inlinedAt: !578)
!580 = !DILocation(line: 364, scope: !566)
!581 = !DILocalVariable(name: "this", arg: 1, scope: !582, type: !176, flags: DIFlagArtificial | DIFlagObjectPointer)
!582 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "??1word_lock_queue_data@Synchronization@Internal@Runtime@Halide@@QEAA@XZ", scope: !177, file: !6, line: 280, type: !223, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !226, retainedNodes: !583)
!583 = !{!581}
!584 = !DILocation(line: 0, scope: !582, inlinedAt: !585)
!585 = distinct !DILocation(line: 365, scope: !459)
!586 = !DILocalVariable(name: "this", arg: 1, scope: !587, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!587 = distinct !DISubprogram(name: "~thread_parker", linkageName: "??1thread_parker@Synchronization@Internal@Runtime@Halide@@QEAA@XZ", scope: !180, file: !167, line: 102, type: !211, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !213, retainedNodes: !588)
!588 = !{!586}
!589 = !DILocation(line: 0, scope: !587, inlinedAt: !590)
!590 = distinct !DILocation(line: 280, scope: !591, inlinedAt: !585)
!591 = distinct !DILexicalBlock(scope: !582, file: !6, line: 280)
!592 = !DILocation(line: 104, scope: !593, inlinedAt: !590)
!593 = distinct !DILexicalBlock(scope: !587, file: !167, line: 102)
!594 = !DILocation(line: 365, scope: !459)
!595 = distinct !{!595, !478, !596}
!596 = !DILocation(line: 365, scope: !439)
!597 = !DILocation(line: 366, scope: !439)
!598 = distinct !DISubprogram(name: "unlock_full", linkageName: "?unlock_full@word_lock@Synchronization@Internal@Runtime@Halide@@AEAAXXZ", scope: !235, file: !6, line: 368, type: !239, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !242, retainedNodes: !599)
!599 = !{!600, !601, !602, !604, !605, !606, !608, !609, !610, !611, !613, !616, !617, !620}
!600 = !DILocalVariable(name: "this", arg: 1, scope: !598, type: !442, flags: DIFlagArtificial | DIFlagObjectPointer)
!601 = !DILocalVariable(name: "expected", scope: !598, file: !6, line: 369, type: !22)
!602 = !DILocalVariable(name: "thread_queuing", scope: !603, file: !6, line: 375, type: !64)
!603 = distinct !DILexicalBlock(scope: !598, file: !6, line: 372)
!604 = !DILocalVariable(name: "none_queued", scope: !603, file: !6, line: 377, type: !64)
!605 = !DILocalVariable(name: "desired", scope: !603, file: !6, line: 382, type: !22)
!606 = !DILocalVariable(name: "head", scope: !607, file: !6, line: 389, type: !176)
!607 = distinct !DILexicalBlock(scope: !598, file: !6, line: 388)
!608 = !DILocalVariable(name: "current", scope: !607, file: !6, line: 390, type: !176)
!609 = !DILocalVariable(name: "tail", scope: !607, file: !6, line: 391, type: !176)
!610 = !DILocalVariable(name: "times_through", scope: !607, file: !6, line: 392, type: !29)
!611 = !DILocalVariable(name: "next", scope: !612, file: !6, line: 394, type: !176)
!612 = distinct !DILexicalBlock(scope: !607, file: !6, line: 393)
!613 = !DILocalVariable(name: "desired", scope: !614, file: !6, line: 406, type: !22)
!614 = distinct !DILexicalBlock(scope: !615, file: !6, line: 405)
!615 = distinct !DILexicalBlock(scope: !607, file: !6, line: 405)
!616 = !DILocalVariable(name: "new_tail", scope: !607, file: !6, line: 414, type: !176)
!617 = !DILocalVariable(name: "continue_outer", scope: !618, file: !6, line: 416, type: !64)
!618 = distinct !DILexicalBlock(scope: !619, file: !6, line: 415)
!619 = distinct !DILexicalBlock(scope: !607, file: !6, line: 415)
!620 = !DILocalVariable(name: "desired", scope: !621, file: !6, line: 418, type: !22)
!621 = distinct !DILexicalBlock(scope: !618, file: !6, line: 417)
!622 = !DILocation(line: 0, scope: !598)
!623 = !DILocation(line: 370, scope: !598)
!624 = !DILocation(line: 0, scope: !466, inlinedAt: !625)
!625 = distinct !DILocation(line: 370, scope: !598)
!626 = !DILocation(line: 201, scope: !466, inlinedAt: !625)
!627 = !DILocation(line: 372, scope: !598)
!628 = !DILocation(line: 375, scope: !603)
!629 = !DILocation(line: 0, scope: !603)
!630 = !DILocation(line: 378, scope: !603)
!631 = !DILocation(line: 382, scope: !603)
!632 = !DILocation(line: 0, scope: !483, inlinedAt: !633)
!633 = distinct !DILocation(line: 383, scope: !603)
!634 = !DILocation(line: 192, scope: !483, inlinedAt: !633)
!635 = !DILocation(line: 389, scope: !607)
!636 = !DILocation(line: 0, scope: !607)
!637 = !DILocation(line: 391, scope: !607)
!638 = !DILocation(line: 393, scope: !607)
!639 = !DILocation(line: 394, scope: !612)
!640 = !DILocation(line: 0, scope: !612)
!641 = !DILocation(line: 395, scope: !642)
!642 = distinct !DILexicalBlock(scope: !612, file: !6, line: 395)
!643 = !DILocation(line: 395, scope: !644)
!644 = distinct !DILexicalBlock(scope: !645, file: !6, line: 395)
!645 = distinct !DILexicalBlock(scope: !642, file: !6, line: 395)
!646 = !DILocation(line: 396, scope: !612)
!647 = !DILocation(line: 398, scope: !612)
!648 = distinct !{!648, !638, !649, !575}
!649 = !DILocation(line: 400, scope: !607)
!650 = !DILocation(line: 401, scope: !607)
!651 = !DILocation(line: 405, scope: !607)
!652 = !DILocation(line: 406, scope: !614)
!653 = !DILocation(line: 0, scope: !614)
!654 = !DILocalVariable(name: "desired", arg: 3, scope: !655, file: !6, line: 179, type: !470)
!655 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned long long>", linkageName: "??$atomic_cas_weak_relacq_relaxed@_K@?A0xE93CD500@Synchronization@Internal@Runtime@Halide@@YA_NPEA_K00@Z", scope: !467, file: !6, line: 179, type: !656, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !473, retainedNodes: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{!64, !470, !470, !470}
!658 = !{!654, !659, !660}
!659 = !DILocalVariable(name: "expected", arg: 2, scope: !655, file: !6, line: 179, type: !470)
!660 = !DILocalVariable(name: "addr", arg: 1, scope: !655, file: !6, line: 179, type: !470)
!661 = !DILocation(line: 0, scope: !655, inlinedAt: !662)
!662 = distinct !DILocation(line: 407, scope: !614)
!663 = !DILocation(line: 180, scope: !655, inlinedAt: !662)
!664 = distinct !{!664, !665, !666}
!665 = !DILocation(line: 388, scope: !598)
!666 = !DILocation(line: 445, scope: !598)
!667 = !DILocation(line: 414, scope: !607)
!668 = !DILocation(line: 415, scope: !607)
!669 = !DILocation(line: 0, scope: !618)
!670 = !DILocation(line: 418, scope: !621)
!671 = !DILocation(line: 0, scope: !621)
!672 = !DILocation(line: 0, scope: !655, inlinedAt: !673)
!673 = distinct !DILocation(line: 419, scope: !621)
!674 = !DILocation(line: 180, scope: !655, inlinedAt: !673)
!675 = !DILocation(line: 422, scope: !621)
!676 = distinct !{!676, !677, !678, !575}
!677 = !DILocation(line: 417, scope: !618)
!678 = !DILocation(line: 428, scope: !618)
!679 = !DILocation(line: 434, scope: !680)
!680 = distinct !DILexicalBlock(scope: !619, file: !6, line: 433)
!681 = !DILocalVariable(name: "val", arg: 2, scope: !682, file: !6, line: 165, type: !22)
!682 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "?atomic_and_fetch_release@?A0xE93CD500@Synchronization@Internal@Runtime@Halide@@YA_KPEA_K_K@Z", scope: !467, file: !6, line: 165, type: !683, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{!22, !298, !22}
!685 = !{!681, !686}
!686 = !DILocalVariable(name: "addr", arg: 1, scope: !682, file: !6, line: 165, type: !298)
!687 = !DILocation(line: 0, scope: !682, inlinedAt: !688)
!688 = distinct !DILocation(line: 435, scope: !680)
!689 = !DILocation(line: 166, scope: !682, inlinedAt: !688)
!690 = !DILocation(line: 436, scope: !680)
!691 = !DILocalVariable(name: "this", arg: 1, scope: !692, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!692 = distinct !DISubprogram(name: "unpark_start", linkageName: "?unpark_start@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 119, type: !211, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !216, retainedNodes: !693)
!693 = !{!691}
!694 = !DILocation(line: 0, scope: !692, inlinedAt: !695)
!695 = distinct !DILocation(line: 441, scope: !607)
!696 = !DILocation(line: 120, scope: !692, inlinedAt: !695)
!697 = !DILocalVariable(name: "this", arg: 1, scope: !698, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!698 = distinct !DISubprogram(name: "unpark", linkageName: "?unpark@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 123, type: !211, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !217, retainedNodes: !699)
!699 = !{!697}
!700 = !DILocation(line: 0, scope: !698, inlinedAt: !701)
!701 = distinct !DILocation(line: 442, scope: !607)
!702 = !DILocation(line: 124, scope: !698, inlinedAt: !701)
!703 = !DILocation(line: 125, scope: !698, inlinedAt: !701)
!704 = !DILocalVariable(name: "this", arg: 1, scope: !705, type: !519, flags: DIFlagArtificial | DIFlagObjectPointer)
!705 = distinct !DISubprogram(name: "unpark_finish", linkageName: "?unpark_finish@thread_parker@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !180, file: !167, line: 128, type: !211, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !218, retainedNodes: !706)
!706 = !{!704}
!707 = !DILocation(line: 0, scope: !705, inlinedAt: !708)
!708 = distinct !DILocation(line: 443, scope: !607)
!709 = !DILocation(line: 129, scope: !705, inlinedAt: !708)
!710 = !DILocation(line: 444, scope: !607)
!711 = !DILocation(line: 446, scope: !598)
!712 = distinct !DISubprogram(name: "lock_bucket", linkageName: "?lock_bucket@Synchronization@Internal@Runtime@Halide@@YAAEAUhash_bucket@1234@_K@Z", scope: !2, file: !6, line: 509, type: !713, scopeLine: 509, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !716)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !22}
!715 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !232, size: 64)
!716 = !{!717, !718, !719}
!717 = !DILocalVariable(name: "addr", arg: 1, scope: !712, file: !6, line: 509, type: !22)
!718 = !DILocalVariable(name: "hash", scope: !712, file: !6, line: 510, type: !22)
!719 = !DILocalVariable(name: "bucket", scope: !712, file: !6, line: 515, type: !715)
!720 = !DILocation(line: 0, scope: !712)
!721 = !DILocalVariable(name: "bits", arg: 2, scope: !722, file: !6, line: 499, type: !725)
!722 = distinct !DISubprogram(name: "addr_hash", linkageName: "?addr_hash@Synchronization@Internal@Runtime@Halide@@YA_K_KI@Z", scope: !2, file: !6, line: 499, type: !723, scopeLine: 499, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !727)
!723 = !DISubroutineType(types: !724)
!724 = !{!22, !22, !725}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 12, baseType: !726)
!726 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!727 = !{!721, !728}
!728 = !DILocalVariable(name: "addr", arg: 1, scope: !722, file: !6, line: 499, type: !22)
!729 = !DILocation(line: 0, scope: !722, inlinedAt: !730)
!730 = distinct !DILocation(line: 510, scope: !712)
!731 = !DILocation(line: 503, scope: !732, inlinedAt: !730)
!732 = distinct !DILexicalBlock(scope: !733, file: !6, line: 502)
!733 = distinct !DILexicalBlock(scope: !722, file: !6, line: 502)
!734 = !DILocation(line: 515, scope: !712)
!735 = !DILocalVariable(name: "this", arg: 1, scope: !736, type: !442, flags: DIFlagArtificial | DIFlagObjectPointer)
!736 = distinct !DISubprogram(name: "lock", linkageName: "?lock@word_lock@Synchronization@Internal@Runtime@Halide@@QEAAXXZ", scope: !235, file: !6, line: 291, type: !239, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !244, retainedNodes: !737)
!737 = !{!735, !738, !739}
!738 = !DILocalVariable(name: "expected", scope: !736, file: !6, line: 294, type: !22)
!739 = !DILocalVariable(name: "desired", scope: !736, file: !6, line: 295, type: !22)
!740 = !DILocation(line: 0, scope: !736, inlinedAt: !741)
!741 = distinct !DILocation(line: 517, scope: !712)
!742 = !DILocation(line: 297, scope: !736, inlinedAt: !741)
!743 = !DILocation(line: 0, scope: !483, inlinedAt: !744)
!744 = distinct !DILocation(line: 297, scope: !736, inlinedAt: !741)
!745 = !DILocation(line: 192, scope: !483, inlinedAt: !744)
!746 = !DILocation(line: 517, scope: !712)
!747 = !DILocation(line: 298, scope: !748, inlinedAt: !741)
!748 = distinct !DILexicalBlock(scope: !749, file: !6, line: 297)
!749 = distinct !DILexicalBlock(scope: !736, file: !6, line: 297)
!750 = !DILocation(line: 299, scope: !748, inlinedAt: !741)
!751 = !DILocation(line: 519, scope: !712)
!752 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "?lock_bucket_pair@Synchronization@Internal@Runtime@Halide@@YA?AUbucket_pair@1234@_K0@Z", scope: !2, file: !6, line: 531, type: !753, scopeLine: 531, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !763)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !22, !22}
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !2, file: !6, line: 522, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !756, identifier: ".?AUbucket_pair@Synchronization@Internal@Runtime@Halide@@")
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !755, file: !6, line: 523, baseType: !715, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !755, file: !6, line: 524, baseType: !715, size: 64, offset: 64)
!759 = !DISubprogram(name: "bucket_pair", scope: !755, file: !6, line: 526, type: !760, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !762, !715, !715}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!763 = !{!764, !765, !766, !767, !768, !771, !774, !775, !777}
!764 = !DILocalVariable(name: "addr_to", arg: 2, scope: !752, file: !6, line: 531, type: !22)
!765 = !DILocalVariable(name: "addr_from", arg: 1, scope: !752, file: !6, line: 531, type: !22)
!766 = !DILocalVariable(name: "hash_from", scope: !752, file: !6, line: 533, type: !22)
!767 = !DILocalVariable(name: "hash_to", scope: !752, file: !6, line: 534, type: !22)
!768 = !DILocalVariable(name: "first", scope: !769, file: !6, line: 542, type: !715)
!769 = distinct !DILexicalBlock(scope: !770, file: !6, line: 541)
!770 = distinct !DILexicalBlock(scope: !752, file: !6, line: 541)
!771 = !DILocalVariable(name: "first", scope: !772, file: !6, line: 546, type: !715)
!772 = distinct !DILexicalBlock(scope: !773, file: !6, line: 545)
!773 = distinct !DILexicalBlock(scope: !770, file: !6, line: 545)
!774 = !DILocalVariable(name: "second", scope: !772, file: !6, line: 547, type: !715)
!775 = !DILocalVariable(name: "first", scope: !776, file: !6, line: 552, type: !715)
!776 = distinct !DILexicalBlock(scope: !773, file: !6, line: 551)
!777 = !DILocalVariable(name: "second", scope: !776, file: !6, line: 553, type: !715)
!778 = !DILocation(line: 0, scope: !752)
!779 = !DILocation(line: 0, scope: !722, inlinedAt: !780)
!780 = distinct !DILocation(line: 533, scope: !752)
!781 = !DILocation(line: 503, scope: !732, inlinedAt: !780)
!782 = !DILocation(line: 0, scope: !722, inlinedAt: !783)
!783 = distinct !DILocation(line: 534, scope: !752)
!784 = !DILocation(line: 503, scope: !732, inlinedAt: !783)
!785 = !DILocation(line: 541, scope: !752)
!786 = !DILocation(line: 542, scope: !769)
!787 = !DILocation(line: 0, scope: !769)
!788 = !DILocation(line: 0, scope: !736, inlinedAt: !789)
!789 = distinct !DILocation(line: 543, scope: !769)
!790 = !DILocation(line: 297, scope: !736, inlinedAt: !789)
!791 = !DILocation(line: 0, scope: !483, inlinedAt: !792)
!792 = distinct !DILocation(line: 297, scope: !736, inlinedAt: !789)
!793 = !DILocation(line: 192, scope: !483, inlinedAt: !792)
!794 = !DILocation(line: 543, scope: !769)
!795 = !DILocation(line: 298, scope: !748, inlinedAt: !789)
!796 = !DILocation(line: 299, scope: !748, inlinedAt: !789)
!797 = !DILocation(line: 545, scope: !770)
!798 = !DILocation(line: 546, scope: !772)
!799 = !DILocation(line: 0, scope: !772)
!800 = !DILocation(line: 547, scope: !772)
!801 = !DILocation(line: 0, scope: !736, inlinedAt: !802)
!802 = distinct !DILocation(line: 548, scope: !772)
!803 = !DILocation(line: 297, scope: !736, inlinedAt: !802)
!804 = !DILocation(line: 0, scope: !483, inlinedAt: !805)
!805 = distinct !DILocation(line: 297, scope: !736, inlinedAt: !802)
!806 = !DILocation(line: 192, scope: !483, inlinedAt: !805)
!807 = !DILocation(line: 548, scope: !772)
!808 = !DILocation(line: 298, scope: !748, inlinedAt: !802)
!809 = !DILocation(line: 299, scope: !748, inlinedAt: !802)
!810 = !DILocation(line: 0, scope: !736, inlinedAt: !811)
!811 = distinct !DILocation(line: 549, scope: !772)
!812 = !DILocation(line: 297, scope: !736, inlinedAt: !811)
!813 = !DILocation(line: 0, scope: !483, inlinedAt: !814)
!814 = distinct !DILocation(line: 297, scope: !736, inlinedAt: !811)
!815 = !DILocation(line: 192, scope: !483, inlinedAt: !814)
!816 = !DILocation(line: 549, scope: !772)
!817 = !DILocation(line: 298, scope: !748, inlinedAt: !811)
!818 = !DILocation(line: 299, scope: !748, inlinedAt: !811)
!819 = !DILocation(line: 552, scope: !776)
!820 = !DILocation(line: 0, scope: !776)
!821 = !DILocation(line: 553, scope: !776)
