; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_cuda.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_cuda.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-windows-msvc19.11.0"

%"struct.Halide::Runtime::Internal::Cuda::CUctx_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUmod_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUfunc_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUDA_MEMCPY3D_st" = type { i64, i64, i64, i64, i32, i8*, i64, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i64, i64, i64, i64, i64, i64, i32, i8*, i64, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i64, i64, i64, i64, i64 }
%"struct.Halide::Runtime::Internal::Cuda::CUarray_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUstream_st" = type opaque
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::Cuda::FreeListItem" = type { i64, %"struct.Halide::Runtime::Internal::Cuda::CUctx_st"*, %"struct.Halide::Runtime::Internal::Cuda::CUstream_st"*, i64, %"struct.Halide::Runtime::Internal::Cuda::FreeListItem"* }
%"class.Halide::Internal::GPUCompilationCache" = type { %struct.halide_mutex, i32, %"struct.Halide::Internal::GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *, Halide::Runtime::Internal::Cuda::CUmod_st *>::CachedCompilation"*, i32, i32 }

!326 = distinct !DIGlobalVariable(name: "cuCtxPushCurrent", linkageName: "?cuCtxPushCurrent@Cuda@Internal@Runtime@Halide@@3P6A?AW4CUresult@1234@PEAUCUctx_st@1234@@ZEA", scope: !2, file: !6, line: 43, type: !210, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "cuCtxPopCurrent", linkageName: "?cuCtxPopCurrent@Cuda@Internal@Runtime@Halide@@3P6A?AW4CUresult@1234@PEAPEAUCUctx_st@1234@@ZEA", scope: !2, file: !6, line: 44, type: !329, isLocal: false, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!10, !204}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "cuPointerGetAttribute", linkageName: "?cuPointerGetAttribute@Cuda@Internal@Runtime@Halide@@3P6A?AW4CUresult@1234@PEAXH_K@ZEA", scope: !2, file: !6, line: 46, type: !334, isLocal: false, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!10, !261, !13, !284}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "cuStreamSynchronize", linkageName: "?cuStreamSynchronize@Cuda@Internal@Runtime@Halide@@3P6A?AW4CUresult@1234@PEAUCUstream_st@1234@@ZEA", scope: !2, file: !6, line: 48, type: !339, isLocal: false, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!10, !320}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "lib_cuda", linkageName: "?lib_cuda@Cuda@Internal@Runtime@Halide@@3PEAXEA", scope: !2, file: !344, line: 31, type: !261, isLocal: false, isDefinition: true)
!344 = !DIFile(filename: "src/runtime/cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "7f7473b8bd931831df4144c8e0824960")
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "lib_cuda_lock", linkageName: "?lib_cuda_lock@Cuda@Internal@Runtime@Halide@@3DC", scope: !2, file: !344, line: 32, type: !347, isLocal: false, isDefinition: true)
!347 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !350, file: !349, line: 11, baseType: !189)
!349 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "5cf5ff4091fc972c00e0f2f3144d40ad")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !349, line: 9, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !351, identifier: ".?AUScopedSpinLock@Internal@Runtime@Halide@@")
!351 = !{!348, !352, !355, !359}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !349, line: 13, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!355 = !DISubprogram(name: "ScopedSpinLock", scope: !350, file: !349, line: 15, type: !356, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358, !354}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!359 = !DISubprogram(name: "~ScopedSpinLock", scope: !350, file: !349, line: 22, type: !360, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !358}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "context", linkageName: "?context@Cuda@Internal@Runtime@Halide@@3PEAUCUctx_st@1234@EA", scope: !2, file: !344, line: 106, type: !205, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "context_lock", linkageName: "?context_lock@Cuda@Internal@Runtime@Halide@@3Uhalide_mutex@@A", scope: !2, file: !344, line: 108, type: !366, isLocal: false, isDefinition: true)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !367, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !368, identifier: ".?AUhalide_mutex@@")
!367 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !366, file: !367, line: 121, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 64, elements: !373)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !197, line: 61, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !197, line: 10, baseType: !285)
!373 = !{!374}
!374 = !DISubrange(count: 1)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "free_list", linkageName: "?free_list@Cuda@Internal@Runtime@Halide@@3PEAUFreeListItem@1234@EA", scope: !2, file: !344, line: 117, type: !377, isLocal: false, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreeListItem", scope: !2, file: !344, line: 111, size: 320, flags: DIFlagTypePassByValue, elements: !379, identifier: ".?AUFreeListItem@Cuda@Internal@Runtime@Halide@@")
!379 = !{!380, !381, !382, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !378, file: !344, line: 112, baseType: !284, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !378, file: !344, line: 113, baseType: !205, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !378, file: !344, line: 114, baseType: !320, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !344, line: 115, baseType: !196, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !344, line: 116, baseType: !377, size: 64, offset: 256)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "free_list_lock", linkageName: "?free_list_lock@Cuda@Internal@Runtime@Halide@@3Uhalide_mutex@@A", scope: !2, file: !344, line: 118, type: !366, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "?compilation_cache@Cuda@Internal@Runtime@Halide@@3V?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@24@A", scope: !2, file: !344, line: 248, type: !389, isLocal: false, isDefinition: true)
!389 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *,Halide::Runtime::Internal::Cuda::CUmod_st *>", scope: !391, file: !390, line: 8, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !392, templateParams: !443, identifier: ".?AV?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@")
!390 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "24284584ab13511a21d3d0444c1ab74f")
!391 = !DINamespace(name: "Internal", scope: !5)
!392 = !{!393, !404, !405, !408, !410, !411, !413, !414, !416, !417, !418, !421, !428, !433, !437, !440}
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !389, file: !390, line: 9, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !394, identifier: ".?AUCachedCompilation@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@")
!394 = !{!395, !396, !397, !399, !400}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !393, file: !390, line: 10, baseType: !206, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !393, file: !390, line: 11, baseType: !236, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !393, file: !390, line: 12, baseType: !398, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !197, line: 12, baseType: !70)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !393, file: !390, line: 13, baseType: !398, size: 32, offset: 160)
!400 = !DISubprogram(name: "CachedCompilation", scope: !393, file: !390, line: 15, type: !401, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403, !206, !236, !398, !398}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !389, file: !390, line: 22, baseType: !366, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !389, file: !390, line: 24, baseType: !406, flags: DIFlagStaticMember)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !389, file: !390, line: 25, baseType: !409, flags: DIFlagStaticMember)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !389, file: !390, line: 26, baseType: !13, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !389, file: !390, line: 27, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !389, file: !390, line: 28, baseType: !13, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !389, file: !390, line: 30, baseType: !415, flags: DIFlagStaticMember)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !389, file: !390, line: 31, baseType: !415, flags: DIFlagStaticMember)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !389, file: !390, line: 33, baseType: !398, size: 32, offset: 224)
!418 = !DISubprogram(name: "kernel_hash", linkageName: "?kernel_hash@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@SA_KPEAUCUctx_st@Cuda@2Runtime@3@II@Z", scope: !389, file: !390, line: 36, type: !419, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!371, !206, !398, !398}
!421 = !DISubprogram(name: "insert", linkageName: "?insert@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@QEAA_NAEBUCachedCompilation@123@@Z", scope: !389, file: !390, line: 47, type: !422, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !425, !426}
!424 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!426 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!428 = !DISubprogram(name: "find_internal", linkageName: "?find_internal@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@QEAA_NPEAUCUctx_st@Cuda@2Runtime@3@IAEAPEAPEAUCUmod_st@5263@H@Z", scope: !389, file: !390, line: 73, type: !429, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{!424, !425, !206, !398, !431, !13}
!431 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!433 = !DISubprogram(name: "lookup", linkageName: "?lookup@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@QEAA_NPEAUCUctx_st@Cuda@2Runtime@3@PEAXAEAPEAUCUmod_st@5263@@Z", scope: !389, file: !390, line: 97, type: !434, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!424, !425, !206, !261, !436}
!436 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !236, size: 64)
!437 = !DISubprogram(name: "resize_table", linkageName: "?resize_table@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@QEAA_NH@Z", scope: !389, file: !390, line: 108, type: !438, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{!424, !425, !13}
!440 = !DISubprogram(name: "release_hold", linkageName: "?release_hold@?$GPUCompilationCache@PEAUCUctx_st@Cuda@Internal@Runtime@Halide@@PEAUCUmod_st@2345@@Internal@Halide@@QEAAXPEAXPEAUCUctx_st@Cuda@2Runtime@3@0@Z", scope: !389, file: !390, line: 211, type: !441, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !425, !261, !206, !261}
!443 = !{!444, !445}
!444 = !DITemplateTypeParameter(name: "ContextT", type: !206)
!445 = !DITemplateTypeParameter(name: "ModuleStateT", type: !236)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "cuda_allocation_pool", scope: !3, file: !344, line: 569, type: !448, isLocal: false, isDefinition: true)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_allocation_pool", file: !367, line: 1887, size: 128, flags: DIFlagTypePassByValue, elements: !449, identifier: ".?AUhalide_device_allocation_pool@@")
!449 = !{!450, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "release_unused", scope: !448, file: !367, line: 1888, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!13, !261}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !367, line: 1889, baseType: !455, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "cuda_device_interface", linkageName: "?cuda_device_interface@Cuda@Internal@Runtime@Halide@@3Uhalide_device_interface_t@@A", scope: !2, file: !344, line: 1405, type: !458, isLocal: false, isDefinition: true)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !367, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !459, identifier: ".?AUhalide_device_interface_t@@")
!459 = !{!460, !580, !584, !585, !589, !590, !591, !592, !593, !597, !602, !606, !607, !611, !612, !616}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !458, file: !367, line: 724, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!13, !261, !464, !469}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !367, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !466, identifier: ".?AUhalide_buffer_t@@")
!466 = !{!467, !468, !471, !475, !476, !516, !518, !541, !542, !552, !556, !559, !560, !563, !564, !567, !570, !571, !572, !576, !579}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !465, file: !367, line: 1425, baseType: !372, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !465, file: !367, line: 1428, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !465, file: !367, line: 1433, baseType: !472, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !197, line: 16, baseType: !474)
!474 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !367, line: 1436, baseType: !372, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !367, line: 1439, baseType: !477, size: 32, offset: 256)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !367, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !478, identifier: ".?AUhalide_type_t@@")
!478 = !{!479, !488, !489, !492, !496, !499, !504, !508, !509, !510, !513}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !477, file: !367, line: 434, baseType: !480, size: 8, align: 8)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !367, line: 413, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !367, line: 403, baseType: !473, size: 8, elements: !482, identifier: ".?AW4halide_type_code_t@@")
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!484 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!485 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!486 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!487 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !477, file: !367, line: 442, baseType: !473, size: 8, align: 8, offset: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !477, file: !367, line: 446, baseType: !490, size: 16, align: 16, offset: 16)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !197, line: 14, baseType: !491)
!491 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!492 = !DISubprogram(name: "halide_type_t", scope: !477, file: !367, line: 453, type: !493, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495, !480, !473, !490}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!496 = !DISubprogram(name: "halide_type_t", scope: !477, file: !367, line: 459, type: !497, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !495}
!499 = !DISubprogram(name: "with_lanes", linkageName: "?with_lanes@halide_type_t@@QEBA?AU1@G@Z", scope: !477, file: !367, line: 463, type: !500, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!477, !502, !490}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!504 = !DISubprogram(name: "operator==", linkageName: "??8halide_type_t@@QEBA_NAEBU0@@Z", scope: !477, file: !367, line: 468, type: !505, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!505 = !DISubroutineType(types: !506)
!506 = !{!424, !502, !507}
!507 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !503, size: 64)
!508 = !DISubprogram(name: "operator!=", linkageName: "??9halide_type_t@@QEBA_NAEBU0@@Z", scope: !477, file: !367, line: 472, type: !505, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubprogram(name: "operator<", linkageName: "??Mhalide_type_t@@QEBA_NAEBU0@@Z", scope: !477, file: !367, line: 476, type: !505, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QEBAHXZ", scope: !477, file: !367, line: 481, type: !511, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!511 = !DISubroutineType(types: !512)
!512 = !{!13, !502}
!513 = !DISubprogram(name: "as_u32", linkageName: "?as_u32@halide_type_t@@QEBAIXZ", scope: !477, file: !367, line: 485, type: !514, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!514 = !DISubroutineType(types: !515)
!515 = !{!398, !502}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !465, file: !367, line: 1442, baseType: !517, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !197, line: 11, baseType: !13)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !465, file: !367, line: 1446, baseType: !519, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !367, line: 1409, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !367, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !522, identifier: ".?AUhalide_dimension_t@@")
!522 = !{!523, !524, !525, !526, !527, !531, !534, !540}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !521, file: !367, line: 1383, baseType: !517, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !521, file: !367, line: 1383, baseType: !517, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !521, file: !367, line: 1383, baseType: !517, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !521, file: !367, line: 1386, baseType: !398, size: 32, offset: 96)
!527 = !DISubprogram(name: "halide_dimension_t", scope: !521, file: !367, line: 1388, type: !528, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!531 = !DISubprogram(name: "halide_dimension_t", scope: !521, file: !367, line: 1389, type: !532, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !530, !517, !517, !517, !398}
!534 = !DISubprogram(name: "operator==", linkageName: "??8halide_dimension_t@@QEBA_NAEBU0@@Z", scope: !521, file: !367, line: 1393, type: !535, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubroutineType(types: !536)
!536 = !{!424, !537, !539}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!539 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !538, size: 64)
!540 = !DISubprogram(name: "operator!=", linkageName: "??9halide_dimension_t@@QEBA_NAEBU0@@Z", scope: !521, file: !367, line: 1400, type: !535, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !465, file: !367, line: 1449, baseType: !261, size: 64, offset: 384)
!542 = !DISubprogram(name: "get_flag", linkageName: "?get_flag@halide_buffer_t@@QEBA_NW4halide_buffer_flags@@@Z", scope: !465, file: !367, line: 1454, type: !543, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubroutineType(types: !544)
!544 = !{!424, !545, !547}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !367, line: 1416, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !367, line: 1415, baseType: !13, size: 32, elements: !549, identifier: ".?AW4halide_buffer_flags@@")
!549 = !{!550, !551}
!550 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1)
!551 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2)
!552 = !DISubprogram(name: "set_flag", linkageName: "?set_flag@halide_buffer_t@@QEAAXW4halide_buffer_flags@@_N@Z", scope: !465, file: !367, line: 1458, type: !553, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !555, !547, !424}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!556 = !DISubprogram(name: "host_dirty", linkageName: "?host_dirty@halide_buffer_t@@QEBA_NXZ", scope: !465, file: !367, line: 1466, type: !557, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(types: !558)
!558 = !{!424, !545}
!559 = !DISubprogram(name: "device_dirty", linkageName: "?device_dirty@halide_buffer_t@@QEBA_NXZ", scope: !465, file: !367, line: 1470, type: !557, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubprogram(name: "set_host_dirty", linkageName: "?set_host_dirty@halide_buffer_t@@QEAAX_N@Z", scope: !465, file: !367, line: 1474, type: !561, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !555, !424}
!563 = !DISubprogram(name: "set_device_dirty", linkageName: "?set_device_dirty@halide_buffer_t@@QEAAX_N@Z", scope: !465, file: !367, line: 1478, type: !561, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubprogram(name: "number_of_elements", linkageName: "?number_of_elements@halide_buffer_t@@QEBAKXZ", scope: !465, file: !367, line: 1485, type: !565, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DISubroutineType(types: !566)
!566 = !{!196, !545}
!567 = !DISubprogram(name: "begin", linkageName: "?begin@halide_buffer_t@@QEBAPEAEXZ", scope: !465, file: !367, line: 1495, type: !568, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!568 = !DISubroutineType(types: !569)
!569 = !{!472, !545}
!570 = !DISubprogram(name: "end", linkageName: "?end@halide_buffer_t@@QEBAPEAEXZ", scope: !465, file: !367, line: 1506, type: !568, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubprogram(name: "size_in_bytes", linkageName: "?size_in_bytes@halide_buffer_t@@QEBAKXZ", scope: !465, file: !367, line: 1518, type: !565, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubprogram(name: "address_of", linkageName: "?address_of@halide_buffer_t@@QEBAPEAEPEBH@Z", scope: !465, file: !367, line: 1523, type: !573, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubroutineType(types: !574)
!574 = !{!472, !545, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!576 = !DISubprogram(name: "device_sync", linkageName: "?device_sync@halide_buffer_t@@QEAAHPEAX@Z", scope: !465, file: !367, line: 1534, type: !577, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubroutineType(types: !578)
!578 = !{!13, !555, !261}
!579 = !DISubprogram(name: "is_bounds_query", linkageName: "?is_bounds_query@halide_buffer_t@@QEBA_NXZ", scope: !465, file: !367, line: 1545, type: !557, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !458, file: !367, line: 726, baseType: !581, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!13, !261, !464}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !458, file: !367, line: 727, baseType: !581, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !458, file: !367, line: 728, baseType: !586, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !261, !469}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !458, file: !367, line: 730, baseType: !581, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !458, file: !367, line: 731, baseType: !461, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !458, file: !367, line: 733, baseType: !461, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !458, file: !367, line: 735, baseType: !581, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !458, file: !367, line: 736, baseType: !594, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!13, !261, !464, !469, !464}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !458, file: !367, line: 738, baseType: !598, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!13, !261, !601, !464}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !458, file: !367, line: 740, baseType: !603, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!13, !261, !601, !13, !13, !464}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !458, file: !367, line: 742, baseType: !581, size: 64, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !458, file: !367, line: 743, baseType: !608, size: 64, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!13, !261, !464, !372, !469}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !458, file: !367, line: 745, baseType: !581, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !458, file: !367, line: 746, baseType: !613, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!13, !261, !76, !76}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !458, file: !367, line: 747, baseType: !617, size: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !620, line: 10, size: 1024, flags: DIFlagTypePassByValue, elements: !621, identifier: ".?AUhalide_device_interface_impl_t@@")
!620 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "973e1c360c8f9d0d9344920815b6525d")
!621 = !{!622, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !643}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !619, file: !620, line: 16, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !619, file: !620, line: 17, baseType: !623, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !619, file: !620, line: 18, baseType: !581, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !619, file: !620, line: 19, baseType: !581, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !619, file: !620, line: 20, baseType: !581, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !619, file: !620, line: 21, baseType: !451, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !619, file: !620, line: 22, baseType: !581, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !619, file: !620, line: 23, baseType: !581, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !619, file: !620, line: 24, baseType: !581, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !619, file: !620, line: 25, baseType: !581, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !619, file: !620, line: 26, baseType: !594, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !619, file: !620, line: 28, baseType: !598, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !619, file: !620, line: 31, baseType: !603, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !619, file: !620, line: 35, baseType: !581, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !619, file: !620, line: 37, baseType: !640, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!13, !261, !464, !372}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !619, file: !620, line: 38, baseType: !581, size: 64, offset: 960)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "cuda_device_interface_impl", linkageName: "?cuda_device_interface_impl@Cuda@Internal@Runtime@Halide@@3Uhalide_device_interface_impl_t@@A", scope: !2, file: !344, line: 1386, type: !619, isLocal: false, isDefinition: true)
!646 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !647, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !648, retainedTypes: !696, globals: !926, imports: !973, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "c931c080956aea8bd054fc653f238906")
!648 = !{!481, !548, !12, !90, !247, !649}
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !367, line: 990, baseType: !13, size: 32, elements: !650, identifier: ".?AW4halide_error_code_t@@")
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!651 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!652 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!653 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!654 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!655 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!656 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!657 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!658 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!659 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!660 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!661 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!662 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!663 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!664 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!665 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!666 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!667 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!668 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!669 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!670 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!671 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!672 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!673 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!674 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!675 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!676 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!677 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!678 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!679 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!680 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!681 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!682 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!683 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!684 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!685 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!686 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!687 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!688 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!689 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!690 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!691 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!692 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!693 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!694 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!695 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!696 = !{!261, !697, !372, !775, !13, !371, !284, !377, !260, !842, !843, !196, !844, !720, !188, !846, !849, !852, !855, !858, !861, !865, !869, !872, !875, !878, !881, !885, !888, !892, !896, !899, !902, !905, !908, !913, !916, !919, !922, !925, !412, !398, !389}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !699, file: !698, line: 203, baseType: !700)
!698 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a97d2909b01229a33f8a6f2cb0fa6ab8")
!699 = !DINamespace(scope: !3)
!700 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0,1024>", scope: !699, file: !698, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !701, templateParams: !772, identifier: ".?AV?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@")
!701 = !{!702, !703, !704, !705, !706, !707, !709, !713, !717, !722, !725, !728, !731, !735, !738, !741, !745, !748, !754, !757, !760, !765, !766, !769, !770, !771}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !700, file: !698, line: 32, baseType: !188, size: 64, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !700, file: !698, line: 32, baseType: !188, size: 64, offset: 64, flags: DIFlagPublic)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !700, file: !698, line: 32, baseType: !188, size: 64, offset: 128, flags: DIFlagPublic)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !700, file: !698, line: 33, baseType: !261, size: 64, offset: 192, flags: DIFlagPublic)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !700, file: !698, line: 34, baseType: !424, size: 8, offset: 256, flags: DIFlagPublic)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !700, file: !698, line: 35, baseType: !708, size: 8, offset: 264, flags: DIFlagPublic)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !373)
!709 = !DISubprogram(name: "Printer", scope: !700, file: !698, line: 37, type: !710, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712, !261, !188}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!713 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@PEBD@Z", scope: !700, file: !698, line: 57, type: !714, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !712, !276}
!716 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !700, size: 64)
!717 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@_J@Z", scope: !700, file: !698, line: 67, type: !718, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!718 = !DISubroutineType(types: !719)
!719 = !{!716, !712, !720}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !197, line: 9, baseType: !721)
!721 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!722 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@H@Z", scope: !700, file: !698, line: 72, type: !723, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DISubroutineType(types: !724)
!724 = !{!716, !712, !517}
!725 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@_K@Z", scope: !700, file: !698, line: 77, type: !726, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!726 = !DISubroutineType(types: !727)
!727 = !{!716, !712, !372}
!728 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@I@Z", scope: !700, file: !698, line: 82, type: !729, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!729 = !DISubroutineType(types: !730)
!730 = !{!716, !712, !398}
!731 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@N@Z", scope: !700, file: !698, line: 87, type: !732, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!732 = !DISubroutineType(types: !733)
!733 = !{!716, !712, !734}
!734 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!735 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@M@Z", scope: !700, file: !698, line: 92, type: !736, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DISubroutineType(types: !737)
!737 = !{!716, !712, !407}
!738 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@PEBX@Z", scope: !700, file: !698, line: 97, type: !739, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubroutineType(types: !740)
!740 = !{!716, !712, !238}
!741 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV1?A0x6F7B8F51@234@G@Z", scope: !700, file: !698, line: 102, type: !742, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{!716, !712, !744}
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!745 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@AEBUhalide_type_t@@@Z", scope: !700, file: !698, line: 108, type: !746, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!746 = !DISubroutineType(types: !747)
!747 = !{!716, !712, !507}
!748 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@AEBUhalide_buffer_t@@@Z", scope: !700, file: !698, line: 113, type: !749, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!716, !712, !751}
!751 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !367, line: 1550, baseType: !465)
!754 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !700, file: !698, line: 119, type: !755, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{!276, !712}
!757 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXXZ", scope: !700, file: !698, line: 131, type: !758, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !712}
!760 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEBA_KXZ", scope: !700, file: !698, line: 139, type: !761, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!761 = !DISubroutineType(types: !762)
!762 = !{!372, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!765 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEBA_KXZ", scope: !700, file: !698, line: 143, type: !761, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXH@Z", scope: !700, file: !698, line: 148, type: !767, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !712, !13}
!769 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !700, file: !698, line: 158, type: !755, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXXZ", scope: !700, file: !698, line: 162, type: !758, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DISubprogram(name: "~Printer", scope: !700, file: !698, line: 166, type: !758, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!772 = !{!773, !774}
!773 = !DITemplateValueParameter(name: "type", type: !13, value: i32 0)
!774 = !DITemplateValueParameter(name: "length", type: !285, value: i64 1024)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !699, file: !698, line: 199, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1,1024>", scope: !699, file: !698, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !777, templateParams: !840, identifier: ".?AV?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@")
!777 = !{!778, !779, !780, !781, !782, !783, !784, !788, !792, !795, !798, !801, !804, !807, !810, !813, !816, !819, !822, !825, !828, !833, !834, !837, !838, !839}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !776, file: !698, line: 32, baseType: !188, size: 64, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !776, file: !698, line: 32, baseType: !188, size: 64, offset: 64, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !776, file: !698, line: 32, baseType: !188, size: 64, offset: 128, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !776, file: !698, line: 33, baseType: !261, size: 64, offset: 192, flags: DIFlagPublic)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !776, file: !698, line: 34, baseType: !424, size: 8, offset: 256, flags: DIFlagPublic)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !776, file: !698, line: 35, baseType: !708, size: 8, offset: 264, flags: DIFlagPublic)
!784 = !DISubprogram(name: "Printer", scope: !776, file: !698, line: 37, type: !785, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !787, !261, !188}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!788 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@PEBD@Z", scope: !776, file: !698, line: 57, type: !789, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!791, !787, !276}
!791 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !776, size: 64)
!792 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@_J@Z", scope: !776, file: !698, line: 67, type: !793, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!791, !787, !720}
!795 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@H@Z", scope: !776, file: !698, line: 72, type: !796, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DISubroutineType(types: !797)
!797 = !{!791, !787, !517}
!798 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@_K@Z", scope: !776, file: !698, line: 77, type: !799, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DISubroutineType(types: !800)
!800 = !{!791, !787, !372}
!801 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@I@Z", scope: !776, file: !698, line: 82, type: !802, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!802 = !DISubroutineType(types: !803)
!803 = !{!791, !787, !398}
!804 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@N@Z", scope: !776, file: !698, line: 87, type: !805, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DISubroutineType(types: !806)
!806 = !{!791, !787, !734}
!807 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@M@Z", scope: !776, file: !698, line: 92, type: !808, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{!791, !787, !407}
!810 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@PEBX@Z", scope: !776, file: !698, line: 97, type: !811, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!811 = !DISubroutineType(types: !812)
!812 = !{!791, !787, !238}
!813 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV1?A0x6F7B8F51@234@G@Z", scope: !776, file: !698, line: 102, type: !814, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubroutineType(types: !815)
!815 = !{!791, !787, !744}
!816 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@AEBUhalide_type_t@@@Z", scope: !776, file: !698, line: 108, type: !817, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!817 = !DISubroutineType(types: !818)
!818 = !{!791, !787, !507}
!819 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@AEBUhalide_buffer_t@@@Z", scope: !776, file: !698, line: 113, type: !820, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{!791, !787, !751}
!822 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !776, file: !698, line: 119, type: !823, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DISubroutineType(types: !824)
!824 = !{!276, !787}
!825 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXXZ", scope: !776, file: !698, line: 131, type: !826, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !787}
!828 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEBA_KXZ", scope: !776, file: !698, line: 139, type: !829, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!829 = !DISubroutineType(types: !830)
!830 = !{!372, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!833 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEBA_KXZ", scope: !776, file: !698, line: 143, type: !829, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!834 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXH@Z", scope: !776, file: !698, line: 148, type: !835, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !787, !13}
!837 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !776, file: !698, line: 158, type: !823, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXXZ", scope: !776, file: !698, line: 162, type: !826, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DISubprogram(name: "~Printer", scope: !776, file: !698, line: 166, type: !826, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!840 = !{!841, !774}
!841 = !DITemplateValueParameter(name: "type", type: !13, value: i32 1)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !197, line: 28, baseType: !845)
!845 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!12, !70}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!12, !76}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!12, !76, !13}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!12, !76, !90, !13}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!12, !188, !13, !13}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!12, !864, !13}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!12, !868, !70, !13}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!12, !206}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!12}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!12, !206, !223}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!12, !432, !238}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!12, !432, !238, !70, !884, !260}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!12, !236}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!12, !891, !236, !276}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!12, !895, !198}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!12, !285}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!12, !285, !238, !198}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!12, !261, !285, !198}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!12, !285, !285, !198}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!12, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!12, !274, !70, !70, !70, !70, !70, !70, !70, !321, !260, !260}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!12, !868}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!12, !261, !13, !285}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!12, !321}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!926 = !{!0, !71, !77, !84, !183, !190, !199, !208, !213, !218, !224, !229, !240, !262, !267, !278, !286, !291, !296, !301, !306, !315, !323, !325, !327, !332, !337, !342, !345, !362, !364, !375, !385, !927, !387, !929, !931, !933, !935, !937, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !959, !961, !446, !963, !965, !967, !644, !456, !969, !971}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!928 = distinct !DIGlobalVariable(name: "CUDA_SUCCESS", scope: !646, file: !11, line: 44, type: !12, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression(DW_OP_constu, 301, DW_OP_stack_value))
!930 = distinct !DIGlobalVariable(name: "CUDA_ERROR_FILE_NOT_FOUND", scope: !646, file: !11, line: 76, type: !12, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression(DW_OP_constu, 100, DW_OP_stack_value))
!932 = distinct !DIGlobalVariable(name: "CUDA_ERROR_NO_DEVICE", scope: !646, file: !11, line: 53, type: !12, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!934 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT", scope: !646, file: !11, line: 119, type: !90, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!936 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_BLOCK", scope: !646, file: !11, line: 102, type: !90, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression(DW_OP_constu, 10, DW_OP_stack_value))
!938 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_WARP_SIZE", scope: !646, file: !11, line: 112, type: !90, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!940 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_X", scope: !646, file: !11, line: 103, type: !90, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!942 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Y", scope: !646, file: !11, line: 104, type: !90, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!944 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Z", scope: !646, file: !11, line: 105, type: !90, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!946 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_X", scope: !646, file: !11, line: 106, type: !90, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!948 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Y", scope: !646, file: !11, line: 107, type: !90, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression(DW_OP_constu, 7, DW_OP_stack_value))
!950 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Z", scope: !646, file: !11, line: 108, type: !90, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!952 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_SHARED_MEMORY_PER_BLOCK", scope: !646, file: !11, line: 110, type: !90, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression(DW_OP_constu, 9, DW_OP_stack_value))
!954 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_TOTAL_CONSTANT_MEMORY", scope: !646, file: !11, line: 111, type: !90, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression(DW_OP_constu, 75, DW_OP_stack_value))
!956 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MAJOR", scope: !646, file: !11, line: 181, type: !90, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression(DW_OP_constu, 76, DW_OP_stack_value))
!958 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MINOR", scope: !646, file: !11, line: 182, type: !90, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression(DW_OP_constu, 86, DW_OP_stack_value))
!960 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX", scope: !646, file: !11, line: 192, type: !90, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!962 = distinct !DIGlobalVariable(name: "halide_error_code_generic_error", scope: !646, file: !367, line: 995, type: !649, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!964 = distinct !DIGlobalVariable(name: "CUDA_ERROR_DEINITIALIZED", scope: !646, file: !11, line: 48, type: !12, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!966 = distinct !DIGlobalVariable(name: "CUDA_ERROR_OUT_OF_MEMORY", scope: !646, file: !11, line: 46, type: !12, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression(DW_OP_constu, 18446744073709551574, DW_OP_stack_value))
!968 = distinct !DIGlobalVariable(name: "halide_error_code_incompatible_device_interface", scope: !646, file: !367, line: 1164, type: !649, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!970 = distinct !DIGlobalVariable(name: "halide_buffer_flag_device_dirty", scope: !646, file: !367, line: 1416, type: !548, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!972 = distinct !DIGlobalVariable(name: "halide_buffer_flag_host_dirty", scope: !646, file: !367, line: 1415, type: !548, isLocal: true, isDefinition: true)
!973 = !{!974, !975, !976}
!974 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !646, entity: !3, file: !197, line: 225)
!975 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !646, entity: !3, file: !344, line: 125)
!976 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !646, entity: !2, file: !344, line: 126)
!977 = !{i32 2, !"CodeView", i32 1}
!978 = !{i32 2, !"Debug Info Version", i32 3}
!979 = !{i32 1, !"wchar_size", i32 4}
!980 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!981 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "?copy_memory_helper@Internal@Runtime@Halide@@YAXAEBUdevice_copy@123@H_J1@Z", scope: !3, file: !982, line: 47, type: !983, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !999)
!982 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "01ded04610775bfbd39cee48a3f67c54")
!983 = !DISubroutineType(types: !984)
!984 = !{null, !985, !13, !720, !720}
!985 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !982, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !988, identifier: ".?AUdevice_copy@Internal@Runtime@Halide@@")
!988 = !{!989, !990, !991, !992, !996, !997, !998}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !987, file: !982, line: 35, baseType: !372, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !987, file: !982, line: 35, baseType: !372, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !987, file: !982, line: 37, baseType: !372, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !987, file: !982, line: 39, baseType: !993, size: 1024, offset: 192)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1024, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 16)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !987, file: !982, line: 41, baseType: !993, size: 1024, offset: 1216)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !987, file: !982, line: 42, baseType: !993, size: 1024, offset: 2240)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !987, file: !982, line: 44, baseType: !372, size: 64, offset: 3264)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1007, !1008}
!1000 = !DILocalVariable(name: "dst_off", arg: 4, scope: !981, file: !982, line: 47, type: !720)
!1001 = !DILocalVariable(name: "src_off", arg: 3, scope: !981, file: !982, line: 47, type: !720)
!1002 = !DILocalVariable(name: "d", arg: 2, scope: !981, file: !982, line: 47, type: !13)
!1003 = !DILocalVariable(name: "copy", arg: 1, scope: !981, file: !982, line: 47, type: !985)
!1004 = !DILocalVariable(name: "from", scope: !1005, file: !982, line: 54, type: !238)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !982, line: 53)
!1006 = distinct !DILexicalBlock(scope: !981, file: !982, line: 53)
!1007 = !DILocalVariable(name: "to", scope: !1005, file: !982, line: 55, type: !261)
!1008 = !DILocalVariable(name: "i", scope: !1009, file: !982, line: 58, type: !372)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !982, line: 58)
!1010 = distinct !DILexicalBlock(scope: !1006, file: !982, line: 57)
!1011 = !DILocation(line: 0, scope: !981)
!1012 = !DILocation(line: 49, scope: !981)
!1013 = !{!1014, !1014, i64 0}
!1014 = !{!"long long", !1015, i64 0}
!1015 = !{!"omnipotent char", !1016, i64 0}
!1016 = !{!"Simple C++ TBAA"}
!1017 = !DILocation(line: 50, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !981, file: !982, line: 49)
!1019 = distinct !{!1019, !1012, !1020, !1021}
!1020 = !DILocation(line: 51, scope: !981)
!1021 = !{!"llvm.loop.mustprogress"}
!1022 = !DILocation(line: 53, scope: !981)
!1023 = !DILocation(line: 0, scope: !1009)
!1024 = !DILocation(line: 58, scope: !1009)
!1025 = !DILocation(line: 54, scope: !1005)
!1026 = !{!1027, !1014, i64 0}
!1027 = !{!"?AUdevice_copy@Internal@Runtime@Halide@@", !1014, i64 0, !1014, i64 8, !1014, i64 16, !1015, i64 24, !1015, i64 152, !1015, i64 280, !1014, i64 408}
!1028 = !DILocation(line: 0, scope: !1005)
!1029 = !DILocation(line: 55, scope: !1005)
!1030 = !{!1027, !1014, i64 8}
!1031 = !DILocation(line: 56, scope: !1005)
!1032 = !{!1027, !1014, i64 408}
!1033 = !DILocation(line: 57, scope: !1005)
!1034 = !DILocation(line: 59, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !982, line: 58)
!1036 = distinct !DILexicalBlock(scope: !1009, file: !982, line: 58)
!1037 = !DILocation(line: 60, scope: !1035)
!1038 = !DILocation(line: 61, scope: !1035)
!1039 = !DILocation(line: 58, scope: !1036)
!1040 = distinct !{!1040, !1024, !1041, !1021}
!1041 = !DILocation(line: 62, scope: !1009)
!1042 = !DILocation(line: 64, scope: !981)
!1043 = distinct !DISubprogram(name: "copy_memory", linkageName: "?copy_memory@Internal@Runtime@Halide@@YAXAEBUdevice_copy@123@PEAX@Z", scope: !3, file: !982, line: 66, type: !1044, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1046)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{null, !985, !261}
!1046 = !{!1047, !1048}
!1047 = !DILocalVariable(name: "user_context", arg: 2, scope: !1043, file: !982, line: 66, type: !261)
!1048 = !DILocalVariable(name: "copy", arg: 1, scope: !1043, file: !982, line: 66, type: !985)
!1049 = !DILocation(line: 0, scope: !1043)
!1050 = !DILocation(line: 68, scope: !1043)
!1051 = !DILocation(line: 69, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !982, line: 68)
!1053 = distinct !DILexicalBlock(scope: !1043, file: !982, line: 68)
!1054 = !{!1027, !1014, i64 16}
!1055 = !DILocation(line: 70, scope: !1052)
!1056 = !DILocalVariable(name: "mem", arg: 3, scope: !1057, file: !698, line: 37, type: !188)
!1057 = distinct !DISubprogram(name: "Printer", linkageName: "??0?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAA@PEAXPEAD@Z", scope: !700, file: !698, line: 37, type: !710, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !709, retainedNodes: !1058)
!1058 = !{!1056, !1059, !1060}
!1059 = !DILocalVariable(name: "ctx", arg: 2, scope: !1057, file: !698, line: 37, type: !261)
!1060 = !DILocalVariable(name: "this", arg: 1, scope: !1057, type: !1061, flags: DIFlagArtificial | DIFlagObjectPointer)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!1062 = !DILocation(line: 0, scope: !1057, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 71, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1053, file: !982, line: 70)
!1065 = !DILocation(line: 44, scope: !1066, inlinedAt: !1063)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !698, line: 43)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !698, line: 41)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !698, line: 39)
!1069 = distinct !DILexicalBlock(scope: !1057, file: !698, line: 38)
!1070 = !DILocation(line: 48, scope: !1069, inlinedAt: !1063)
!1071 = !DILocalVariable(name: "arg", arg: 2, scope: !1072, file: !698, line: 57, type: !276)
!1072 = distinct !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@PEBD@Z", scope: !700, file: !698, line: 57, type: !714, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !713, retainedNodes: !1073)
!1073 = !{!1071, !1074}
!1074 = !DILocalVariable(name: "this", arg: 1, scope: !1072, type: !1061, flags: DIFlagArtificial | DIFlagObjectPointer)
!1075 = !DILocation(line: 0, scope: !1072, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 71, scope: !1064)
!1077 = !DILocation(line: 62, scope: !1078, inlinedAt: !1076)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !698, line: 61)
!1079 = distinct !DILexicalBlock(scope: !1072, file: !698, line: 59)
!1080 = !DILocalVariable(name: "this", arg: 1, scope: !1081, type: !1061, flags: DIFlagArtificial | DIFlagObjectPointer)
!1081 = distinct !DISubprogram(name: "~Printer", linkageName: "??1?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAA@XZ", scope: !700, file: !698, line: 166, type: !758, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !771, retainedNodes: !1082)
!1082 = !{!1080}
!1083 = !DILocation(line: 0, scope: !1081, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 71, scope: !1064)
!1085 = !DILocation(line: 168, scope: !1086, inlinedAt: !1084)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !698, line: 167)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !698, line: 167)
!1088 = distinct !DILexicalBlock(scope: !1081, file: !698, line: 166)
!1089 = !DILocation(line: 169, scope: !1086, inlinedAt: !1084)
!1090 = !DILocation(line: 49, scope: !1091, inlinedAt: !1063)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !698, line: 48)
!1092 = distinct !DILexicalBlock(scope: !1069, file: !698, line: 48)
!1093 = !DILocation(line: 50, scope: !1091, inlinedAt: !1063)
!1094 = !{!1015, !1015, i64 0}
!1095 = !DILocalVariable(name: "this", arg: 1, scope: !1096, type: !1061, flags: DIFlagArtificial | DIFlagObjectPointer)
!1096 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAXXZ", scope: !700, file: !698, line: 162, type: !758, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !770, retainedNodes: !1097)
!1097 = !{!1095}
!1098 = !DILocation(line: 0, scope: !1096, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 170, scope: !1100, inlinedAt: !1084)
!1100 = distinct !DILexicalBlock(scope: !1087, file: !698, line: 169)
!1101 = !DILocation(line: 163, scope: !1096, inlinedAt: !1099)
!1102 = !DILocation(line: 174, scope: !1103, inlinedAt: !1084)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !698, line: 173)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !698, line: 173)
!1105 = distinct !DILexicalBlock(scope: !1100, file: !698, line: 171)
!1106 = !DILocation(line: 178, scope: !1100, inlinedAt: !1084)
!1107 = !DILocation(line: 181, scope: !1108, inlinedAt: !1084)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !698, line: 180)
!1109 = distinct !DILexicalBlock(scope: !1088, file: !698, line: 180)
!1110 = !DILocation(line: 72, scope: !1064)
!1111 = !DILocation(line: 73, scope: !1043)
!1112 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "?make_buffer_copy@Internal@Runtime@Halide@@YA?AUdevice_copy@123@PEBUhalide_buffer_t@@_N01@Z", scope: !3, file: !982, line: 76, type: !1113, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1116)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!987, !1115, !424, !1115, !424}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1124, !1126, !1129, !1132, !1134, !1137, !1138, !1139, !1141}
!1117 = !DILocalVariable(name: "dst_host", arg: 4, scope: !1112, file: !982, line: 77, type: !424)
!1118 = !DILocalVariable(name: "dst", arg: 3, scope: !1112, file: !982, line: 77, type: !1115)
!1119 = !DILocalVariable(name: "src_host", arg: 2, scope: !1112, file: !982, line: 76, type: !424)
!1120 = !DILocalVariable(name: "src", arg: 1, scope: !1112, file: !982, line: 76, type: !1115)
!1121 = !DILocalVariable(name: "c", scope: !1112, file: !982, line: 79, type: !987)
!1122 = !DILocalVariable(name: "i", scope: !1123, file: !982, line: 83, type: !13)
!1123 = distinct !DILexicalBlock(scope: !1112, file: !982, line: 83)
!1124 = !DILocalVariable(name: "i", scope: !1125, file: !982, line: 91, type: !13)
!1125 = distinct !DILexicalBlock(scope: !1112, file: !982, line: 91)
!1126 = !DILocalVariable(name: "zero", scope: !1127, file: !982, line: 100, type: !987)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !982, line: 98)
!1128 = distinct !DILexicalBlock(scope: !1112, file: !982, line: 96)
!1129 = !DILocalVariable(name: "zero", scope: !1130, file: !982, line: 107, type: !987)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !982, line: 104)
!1131 = distinct !DILexicalBlock(scope: !1112, file: !982, line: 104)
!1132 = !DILocalVariable(name: "i", scope: !1133, file: !982, line: 115, type: !13)
!1133 = distinct !DILexicalBlock(scope: !1112, file: !982, line: 115)
!1134 = !DILocalVariable(name: "dst_stride_bytes", scope: !1135, file: !982, line: 117, type: !372)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !982, line: 115)
!1136 = distinct !DILexicalBlock(scope: !1133, file: !982, line: 115)
!1137 = !DILocalVariable(name: "src_stride_bytes", scope: !1135, file: !982, line: 118, type: !372)
!1138 = !DILocalVariable(name: "insert", scope: !1135, file: !982, line: 120, type: !13)
!1139 = !DILocalVariable(name: "j", scope: !1140, file: !982, line: 128, type: !13)
!1140 = distinct !DILexicalBlock(scope: !1135, file: !982, line: 128)
!1141 = !DILocalVariable(name: "j", scope: !1142, file: !982, line: 151, type: !13)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !982, line: 151)
!1143 = distinct !DILexicalBlock(scope: !1112, file: !982, line: 145)
!1144 = !DILocation(line: 0, scope: !1112)
!1145 = !DILocation(line: 79, scope: !1112)
!1146 = !DILocation(line: 80, scope: !1112)
!1147 = !{!1148, !1149, i64 16}
!1148 = !{!"?AUhalide_buffer_t@@", !1014, i64 0, !1149, i64 8, !1149, i64 16, !1014, i64 24, !1150, i64 32, !1153, i64 36, !1149, i64 40, !1149, i64 48}
!1149 = !{!"any pointer", !1015, i64 0}
!1150 = !{!"?AUhalide_type_t@@", !1151, i64 0, !1015, i64 1, !1152, i64 2}
!1151 = !{!"?AW4halide_type_code_t@@", !1015, i64 0}
!1152 = !{!"short", !1015, i64 0}
!1153 = !{!"int", !1015, i64 0}
!1154 = !{!1148, !1014, i64 0}
!1155 = !DILocation(line: 81, scope: !1112)
!1156 = !DILocalVariable(name: "this", arg: 1, scope: !1157, type: !1159, flags: DIFlagArtificial | DIFlagObjectPointer)
!1157 = distinct !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QEBAHXZ", scope: !477, file: !367, line: 481, type: !511, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !510, retainedNodes: !1158)
!1158 = !{!1156}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!1160 = !DILocation(line: 0, scope: !1157, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 82, scope: !1112)
!1162 = !DILocation(line: 482, scope: !1157, inlinedAt: !1161)
!1163 = !{!1150, !1015, i64 1}
!1164 = !DILocation(line: 82, scope: !1112)
!1165 = !DILocation(line: 0, scope: !1123)
!1166 = !DILocation(line: 84, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !982, line: 83)
!1168 = distinct !DILexicalBlock(scope: !1123, file: !982, line: 83)
!1169 = !DILocation(line: 85, scope: !1167)
!1170 = !DILocation(line: 86, scope: !1167)
!1171 = !DILocation(line: 90, scope: !1112)
!1172 = !DILocation(line: 0, scope: !1125)
!1173 = !DILocation(line: 91, scope: !1125)
!1174 = !{!1148, !1153, i64 36}
!1175 = !{!1148, !1149, i64 40}
!1176 = !DILocation(line: 94, scope: !1112)
!1177 = !DILocation(line: 96, scope: !1112)
!1178 = !DILocation(line: 92, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !982, line: 91)
!1180 = distinct !DILexicalBlock(scope: !1125, file: !982, line: 91)
!1181 = !{!1182, !1153, i64 8}
!1182 = !{!"?AUhalide_dimension_t@@", !1153, i64 0, !1153, i64 4, !1153, i64 8, !1153, i64 12}
!1183 = !{!1182, !1153, i64 0}
!1184 = !DILocation(line: 91, scope: !1180)
!1185 = distinct !{!1185, !1173, !1186, !1021}
!1186 = !DILocation(line: 93, scope: !1125)
!1187 = !DILocation(line: 0, scope: !1157, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 96, scope: !1112)
!1189 = !DILocation(line: 0, scope: !1157, inlinedAt: !1190)
!1190 = distinct !DILocation(line: 96, scope: !1112)
!1191 = !DILocation(line: 482, scope: !1157, inlinedAt: !1190)
!1192 = !DILocation(line: 100, scope: !1127)
!1193 = !DILocation(line: 101, scope: !1127)
!1194 = !DILocation(line: 104, scope: !1112)
!1195 = !DILocation(line: 0, scope: !1133)
!1196 = !DILocation(line: 115, scope: !1133)
!1197 = !DILocation(line: 107, scope: !1130)
!1198 = !DILocation(line: 108, scope: !1130)
!1199 = !DILocation(line: 144, scope: !1112)
!1200 = !DILocation(line: 117, scope: !1135)
!1201 = !DILocation(line: 0, scope: !1157, inlinedAt: !1202)
!1202 = distinct !DILocation(line: 117, scope: !1135)
!1203 = !DILocation(line: 0, scope: !1135)
!1204 = !DILocation(line: 118, scope: !1135)
!1205 = !DILocation(line: 0, scope: !1157, inlinedAt: !1206)
!1206 = distinct !DILocation(line: 118, scope: !1135)
!1207 = !DILocation(line: 121, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1135, file: !982, line: 121)
!1209 = !DILocation(line: 128, scope: !1140)
!1210 = !DILocation(line: 124, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !982, line: 121)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !982, line: 121)
!1213 = !DILocation(line: 121, scope: !1212)
!1214 = distinct !{!1214, !1207, !1215, !1021}
!1215 = !DILocation(line: 127, scope: !1208)
!1216 = !DILocation(line: 0, scope: !1208)
!1217 = !DILocation(line: 0, scope: !1140)
!1218 = !DILocation(line: 133, scope: !1135)
!1219 = !{!1182, !1153, i64 4}
!1220 = !DILocation(line: 135, scope: !1135)
!1221 = !DILocation(line: 136, scope: !1135)
!1222 = !DILocation(line: 115, scope: !1136)
!1223 = distinct !{!1223, !1196, !1224, !1021}
!1224 = !DILocation(line: 137, scope: !1133)
!1225 = !DILocation(line: 129, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !982, line: 128)
!1227 = distinct !DILexicalBlock(scope: !1140, file: !982, line: 128)
!1228 = !DILocation(line: 130, scope: !1226)
!1229 = !DILocation(line: 131, scope: !1226)
!1230 = distinct !{!1230, !1209, !1231, !1021}
!1231 = !DILocation(line: 132, scope: !1140)
!1232 = !DILocation(line: 147, scope: !1143)
!1233 = !DILocation(line: 0, scope: !1142)
!1234 = !DILocation(line: 152, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !982, line: 151)
!1236 = distinct !DILexicalBlock(scope: !1142, file: !982, line: 151)
!1237 = !DILocation(line: 153, scope: !1235)
!1238 = !DILocation(line: 154, scope: !1235)
!1239 = !DILocation(line: 156, scope: !1143)
!1240 = !DILocation(line: 157, scope: !1143)
!1241 = !DILocation(line: 158, scope: !1143)
!1242 = distinct !{!1242, !1199, !1243, !1021}
!1243 = !DILocation(line: 159, scope: !1112)
!1244 = !DILocation(line: 160, scope: !1112)
!1245 = !{i64 0, i64 8, !1013, i64 8, i64 8, !1013, i64 16, i64 8, !1013, i64 24, i64 128, !1094, i64 152, i64 128, !1094, i64 280, i64 128, !1094, i64 408, i64 8, !1013}
!1246 = !DILocation(line: 161, scope: !1112)
!1247 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "?make_host_to_device_copy@Internal@Runtime@Halide@@YA?AUdevice_copy@123@PEBUhalide_buffer_t@@@Z", scope: !3, file: !982, line: 163, type: !1248, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1250)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!987, !1115}
!1250 = !{!1251}
!1251 = !DILocalVariable(name: "buf", arg: 1, scope: !1247, file: !982, line: 163, type: !1115)
!1252 = !DILocation(line: 0, scope: !1247)
!1253 = !DILocation(line: 164, scope: !1247)
!1254 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "?make_device_to_host_copy@Internal@Runtime@Halide@@YA?AUdevice_copy@123@PEBUhalide_buffer_t@@@Z", scope: !3, file: !982, line: 167, type: !1248, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1255)
!1255 = !{!1256}
!1256 = !DILocalVariable(name: "buf", arg: 1, scope: !1254, file: !982, line: 167, type: !1115)
!1257 = !DILocation(line: 0, scope: !1254)
!1258 = !DILocation(line: 168, scope: !1254)
!1259 = distinct !DISubprogram(name: "halide_cuda_get_symbol", scope: !344, file: !344, line: 34, type: !1260, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1262)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!261, !261, !276}
!1262 = !{!1263, !1264, !1265, !1266, !1268}
!1263 = !DILocalVariable(name: "name", arg: 2, scope: !1259, file: !344, line: 34, type: !276)
!1264 = !DILocalVariable(name: "user_context", arg: 1, scope: !1259, file: !344, line: 34, type: !261)
!1265 = !DILocalVariable(name: "symbol", scope: !1259, file: !344, line: 38, type: !261)
!1266 = !DILocalVariable(name: "lib_names", scope: !1259, file: !344, line: 43, type: !1267)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !373)
!1268 = !DILocalVariable(name: "i", scope: !1269, file: !344, line: 52, type: !196)
!1269 = distinct !DILexicalBlock(scope: !1259, file: !344, line: 52)
!1270 = !DILocation(line: 0, scope: !1259)
!1271 = !DILocation(line: 38, scope: !1259)
!1272 = !{!1149, !1149, i64 0}
!1273 = !DILocation(line: 39, scope: !1259)
!1274 = !DILocation(line: 0, scope: !1269)
!1275 = !DILocation(line: 53, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1277, file: !344, line: 52)
!1277 = distinct !DILexicalBlock(scope: !1269, file: !344, line: 52)
!1278 = !DILocation(line: 54, scope: !1276)
!1279 = !DILocation(line: 0, scope: !1057, inlinedAt: !1280)
!1280 = distinct !DILocation(line: 55, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1282, file: !344, line: 54)
!1282 = distinct !DILexicalBlock(scope: !1276, file: !344, line: 54)
!1283 = !DILocation(line: 44, scope: !1066, inlinedAt: !1280)
!1284 = !DILocation(line: 48, scope: !1069, inlinedAt: !1280)
!1285 = !DILocation(line: 49, scope: !1091, inlinedAt: !1280)
!1286 = !DILocation(line: 50, scope: !1091, inlinedAt: !1280)
!1287 = !DILocation(line: 51, scope: !1091, inlinedAt: !1280)
!1288 = !DILocation(line: 0, scope: !1092, inlinedAt: !1280)
!1289 = !DILocation(line: 0, scope: !1072, inlinedAt: !1290)
!1290 = distinct !DILocation(line: 55, scope: !1281)
!1291 = !DILocation(line: 62, scope: !1078, inlinedAt: !1290)
!1292 = !DILocation(line: 0, scope: !1072, inlinedAt: !1293)
!1293 = distinct !DILocation(line: 55, scope: !1281)
!1294 = !DILocation(line: 62, scope: !1078, inlinedAt: !1293)
!1295 = !DILocation(line: 0, scope: !1072, inlinedAt: !1296)
!1296 = distinct !DILocation(line: 55, scope: !1281)
!1297 = !DILocation(line: 62, scope: !1078, inlinedAt: !1296)
!1298 = !DILocation(line: 0, scope: !1081, inlinedAt: !1299)
!1299 = distinct !DILocation(line: 55, scope: !1281)
!1300 = !DILocation(line: 167, scope: !1088, inlinedAt: !1299)
!1301 = !DILocation(line: 168, scope: !1086, inlinedAt: !1299)
!1302 = !DILocation(line: 169, scope: !1086, inlinedAt: !1299)
!1303 = !DILocation(line: 0, scope: !1096, inlinedAt: !1304)
!1304 = distinct !DILocation(line: 170, scope: !1100, inlinedAt: !1299)
!1305 = !DILocation(line: 163, scope: !1096, inlinedAt: !1304)
!1306 = !DILocation(line: 174, scope: !1103, inlinedAt: !1299)
!1307 = !DILocation(line: 178, scope: !1100, inlinedAt: !1299)
!1308 = !DILocation(line: 181, scope: !1108, inlinedAt: !1299)
!1309 = !DILocation(line: 60, scope: !1259)
!1310 = !DILocation(line: 56, scope: !1281)
!1311 = !DILocation(line: 61, scope: !1259)
!1312 = distinct !DISubprogram(name: "load_libcuda", linkageName: "?load_libcuda@Cuda@Internal@Runtime@Halide@@YAXPEAX@Z", scope: !2, file: !344, line: 73, type: !1313, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1315)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !261}
!1315 = !{!1316}
!1316 = !DILocalVariable(name: "user_context", arg: 1, scope: !1312, file: !344, line: 73, type: !261)
!1317 = !DILocation(line: 0, scope: !1312)
!1318 = !DILocation(line: 0, scope: !1057, inlinedAt: !1319)
!1319 = distinct !DILocation(line: 74, scope: !1312)
!1320 = !DILocation(line: 44, scope: !1066, inlinedAt: !1319)
!1321 = !DILocation(line: 48, scope: !1069, inlinedAt: !1319)
!1322 = !DILocation(line: 49, scope: !1091, inlinedAt: !1319)
!1323 = !DILocation(line: 50, scope: !1091, inlinedAt: !1319)
!1324 = !DILocation(line: 51, scope: !1091, inlinedAt: !1319)
!1325 = !DILocation(line: 0, scope: !1092, inlinedAt: !1319)
!1326 = !DILocation(line: 0, scope: !1072, inlinedAt: !1327)
!1327 = distinct !DILocation(line: 74, scope: !1312)
!1328 = !DILocation(line: 62, scope: !1078, inlinedAt: !1327)
!1329 = !DILocalVariable(name: "arg", arg: 2, scope: !1330, file: !698, line: 97, type: !238)
!1330 = distinct !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAAAEAV0?A0x6F7B8F51@123@PEBX@Z", scope: !700, file: !698, line: 97, type: !739, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !738, retainedNodes: !1331)
!1331 = !{!1329, !1332}
!1332 = !DILocalVariable(name: "this", arg: 1, scope: !1330, type: !1061, flags: DIFlagArtificial | DIFlagObjectPointer)
!1333 = !DILocation(line: 0, scope: !1330, inlinedAt: !1334)
!1334 = distinct !DILocation(line: 74, scope: !1312)
!1335 = !DILocation(line: 98, scope: !1330, inlinedAt: !1334)
!1336 = !DILocation(line: 0, scope: !1072, inlinedAt: !1337)
!1337 = distinct !DILocation(line: 74, scope: !1312)
!1338 = !DILocation(line: 62, scope: !1078, inlinedAt: !1337)
!1339 = !DILocation(line: 0, scope: !1081, inlinedAt: !1340)
!1340 = distinct !DILocation(line: 74, scope: !1312)
!1341 = !DILocation(line: 167, scope: !1088, inlinedAt: !1340)
!1342 = !DILocation(line: 168, scope: !1086, inlinedAt: !1340)
!1343 = !DILocation(line: 169, scope: !1086, inlinedAt: !1340)
!1344 = !DILocation(line: 0, scope: !1096, inlinedAt: !1345)
!1345 = distinct !DILocation(line: 170, scope: !1100, inlinedAt: !1340)
!1346 = !DILocation(line: 163, scope: !1096, inlinedAt: !1345)
!1347 = !DILocation(line: 174, scope: !1103, inlinedAt: !1340)
!1348 = !DILocation(line: 178, scope: !1100, inlinedAt: !1340)
!1349 = !DILocation(line: 181, scope: !1108, inlinedAt: !1340)
!1350 = !DILocation(line: 75, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1312, file: !344, line: 75)
!1352 = !DILocation(line: 75, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1354, file: !344, line: 75)
!1354 = distinct !DILexicalBlock(scope: !1351, file: !344, line: 75)
!1355 = !DILocalVariable(name: "optional", arg: 3, scope: !1356, file: !344, line: 64, type: !424)
!1356 = distinct !DISubprogram(name: "get_cuda_symbol<Halide::Runtime::Internal::Cuda::CUresult (*)(unsigned int)>", linkageName: "??$get_cuda_symbol@P6A?AW4CUresult@Cuda@Internal@Runtime@Halide@@I@Z@Cuda@Internal@Runtime@Halide@@YAP6A?AW4CUresult@0123@I@ZPEAXPEBD_N@Z", scope: !2, file: !344, line: 64, type: !1357, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, templateParams: !1363, retainedNodes: !1359)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!846, !261, !276, !424}
!1359 = !{!1355, !1360, !1361, !1362}
!1360 = !DILocalVariable(name: "name", arg: 2, scope: !1356, file: !344, line: 64, type: !276)
!1361 = !DILocalVariable(name: "user_context", arg: 1, scope: !1356, file: !344, line: 64, type: !261)
!1362 = !DILocalVariable(name: "s", scope: !1356, file: !344, line: 65, type: !846)
!1363 = !{!1364}
!1364 = !DITemplateTypeParameter(name: "T", type: !846)
!1365 = !DILocation(line: 0, scope: !1356, inlinedAt: !1366)
!1366 = distinct !DILocation(line: 19, scope: !1367)
!1367 = !DILexicalBlockFile(scope: !1312, file: !6, discriminator: 0)
!1368 = !DILocation(line: 65, scope: !1356, inlinedAt: !1366)
!1369 = !DILocation(line: 66, scope: !1356, inlinedAt: !1366)
!1370 = !DILocalVariable(name: "mem", arg: 3, scope: !1371, file: !698, line: 37, type: !188)
!1371 = distinct !DISubprogram(name: "Printer", linkageName: "??0?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QEAA@PEAXPEAD@Z", scope: !776, file: !698, line: 37, type: !785, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !784, retainedNodes: !1372)
!1372 = !{!1370, !1373, !1374}
!1373 = !DILocalVariable(name: "ctx", arg: 2, scope: !1371, file: !698, line: 37, type: !261)
!1374 = !DILocalVariable(name: "this", arg: 1, scope: !1371, type: !1375, flags: DIFlagArtificial | DIFlagObjectPointer)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!1376 = !DILocation(line: 0, scope: !1371, inlinedAt: !1377)
!1377 = distinct !DILocation(line: 67, scope: !1378, inlinedAt: !1366)
!1378 = distinct !DILexicalBlock(scope: !1379, file: !344, line: 66)
!1379 = distinct !DILexicalBlock(scope: !1356, file: !344, line: 66)
!1380 = !DILocation(line: 44, scope: !1381, inlinedAt: !1377)
!1381 = distinct !DILexicalBlock(scope: !1382, file: !698, line: 43)
!1382 = distinct !DILexicalBlock(scope: !1383, file: !698, line: 41)
!1383 = distinct !DILexicalBlock(scope: !1384, file: !698, line: 39)
!1384 = distinct !DILexicalBlock(scope: !1371, file: !698, line: 38)
!1385 = !DILocation(line: 48, scope: !1384, inlinedAt: !1377)
!1386 = !DILocation(line: 49, scope: !1387, inlinedAt: !1377)
!1387 = distinct !DILexicalBlock(scope: !1388, file: !698, line: 48)
!1388 = distinct !DILexicalBlock(scope: !1384, file: !698, line: 48)
!1389 = !DILocation(line: 50, scope: !1387, inlinedAt: !1377)
!1390 = !DILocation(line: 51, scope: !1387, inlinedAt: !1377)
!1391 = !DILocation(line: 0, scope: !1388, inlinedAt: !1377)
