; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_opencl.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_opencl.cpp"
target datalayout = "e-m:x-p:32:32-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:32-n8:16:32-a:0:32-S32"
target triple = "i386-unknown-windows-msvc19.11.0"

%struct._cl_platform_id = type opaque
%struct._cl_device_id = type opaque
%struct._cl_context = type opaque
%struct._cl_command_queue = type opaque
%struct._cl_mem = type opaque
%struct._cl_image_format = type { i32, i32 }
%struct._cl_image_desc = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._cl_mem* }
%struct._cl_program = type opaque
%struct._cl_kernel = type opaque
%struct._cl_event = type opaque
%"class.Halide::Internal::GPUCompilationCache" = type { %struct.halide_mutex, i32, %"struct.Halide::Internal::GPUCompilationCache<_cl_context *, _cl_program *>::CachedCompilation"*, i32, i32 }
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Internal::GPUCompilationCache<_cl_context *, _cl_program *>::CachedCompilation" = type { %struct._cl_context*, %struct._cl_program*, i32, i32 }

!101 = distinct !DIGlobalVariable(name: "clReleaseContext", linkageName: "?clReleaseContext@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_context@@@ZA", scope: !2, file: !6, line: 76, type: !97, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "clGetContextInfo", linkageName: "?clGetContextInfo@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_context@@IIPAXPAI@ZA", scope: !2, file: !6, line: 79, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !106)
!106 = !{!10, !73, !107, !29, !30, !31}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_context_info", file: !11, line: 79, baseType: !15)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "clCreateCommandQueue", linkageName: "?clCreateCommandQueue@OpenCL@Internal@Runtime@Halide@@3P6GPAU_cl_command_queue@@PAU_cl_context@@PAU_cl_device_id@@_KPAH@ZA", scope: !2, file: !6, line: 87, type: !110, isLocal: false, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !112)
!112 = !{!113, !73, !43, !116, !89}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_command_queue", file: !11, line: 58, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_command_queue", file: !11, line: 58, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_command_queue@@")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_command_queue_properties", file: !11, line: 74, baseType: !38)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "clRetainCommandQueue", linkageName: "?clRetainCommandQueue@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@@ZA", scope: !2, file: !6, line: 93, type: !119, isLocal: false, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !121)
!121 = !{!10, !113}
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "clReleaseCommandQueue", linkageName: "?clReleaseCommandQueue@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@@ZA", scope: !2, file: !6, line: 96, type: !119, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "clGetCommandQueueInfo", linkageName: "?clGetCommandQueueInfo@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@IIPAXPAI@ZA", scope: !2, file: !6, line: 99, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !128)
!128 = !{!10, !113, !129, !29, !30, !31}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_command_queue_info", file: !11, line: 80, baseType: !15)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "clCreateBuffer", linkageName: "?clCreateBuffer@OpenCL@Internal@Runtime@Halide@@3P6GPAU_cl_mem@@PAU_cl_context@@_KIPAXPAH@ZA", scope: !2, file: !6, line: 107, type: !132, isLocal: false, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !134)
!134 = !{!135, !73, !138, !29, !30, !89}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem", file: !11, line: 59, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_mem", file: !11, line: 59, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_mem@@")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem_flags", file: !11, line: 83, baseType: !38)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "clCreateSubBuffer", linkageName: "?clCreateSubBuffer@OpenCL@Internal@Runtime@Halide@@3P6GPAU_cl_mem@@PAU5@_KIPBXPAH@ZA", scope: !2, file: !6, line: 114, type: !141, isLocal: false, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !143)
!143 = !{!135, !135, !138, !144, !87, !89}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_buffer_create_type", file: !11, line: 88, baseType: !15)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "clCreateImage", linkageName: "?clCreateImage@OpenCL@Internal@Runtime@Halide@@3P6GPAU_cl_mem@@PAU_cl_context@@_KPBU_cl_image_format@@PBU_cl_image_desc@@PAXPAH@ZA", scope: !2, file: !6, line: 121, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !149)
!149 = !{!135, !73, !138, !150, !159, !30, !89}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_image_format", file: !11, line: 110, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_image_format", file: !11, line: 107, size: 64, flags: DIFlagTypePassByValue, elements: !154, identifier: ".?AU_cl_image_format@@")
!154 = !{!155, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "image_channel_order", scope: !153, file: !11, line: 108, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_channel_order", file: !11, line: 81, baseType: !15)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "image_channel_data_type", scope: !153, file: !11, line: 109, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_channel_type", file: !11, line: 82, baseType: !15)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_image_desc", file: !11, line: 123, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_image_desc", file: !11, line: 112, size: 320, flags: DIFlagTypePassByValue, elements: !163, identifier: ".?AU_cl_image_desc@@")
!163 = !{!164, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "image_type", scope: !162, file: !11, line: 113, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem_object_type", file: !11, line: 84, baseType: !15)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !162, file: !11, line: 114, baseType: !29, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !162, file: !11, line: 115, baseType: !29, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "image_depth", scope: !162, file: !11, line: 116, baseType: !29, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "image_array_size", scope: !162, file: !11, line: 117, baseType: !29, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "image_row_pitch", scope: !162, file: !11, line: 118, baseType: !29, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "image_slice_pitch", scope: !162, file: !11, line: 119, baseType: !29, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "num_mip_levels", scope: !162, file: !11, line: 120, baseType: !15, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "num_samples", scope: !162, file: !11, line: 121, baseType: !15, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !162, file: !11, line: 122, baseType: !135, size: 32, offset: 288)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "clRetainMemObject", linkageName: "?clRetainMemObject@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_mem@@@ZA", scope: !2, file: !6, line: 129, type: !177, isLocal: false, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !179)
!179 = !{!10, !135}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "clReleaseMemObject", linkageName: "?clReleaseMemObject@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_mem@@@ZA", scope: !2, file: !6, line: 132, type: !177, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "clGetSupportedImageFormats", linkageName: "?clGetSupportedImageFormats@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_context@@_KIIPAU_cl_image_format@@PAI@ZA", scope: !2, file: !6, line: 135, type: !184, isLocal: false, isDefinition: true)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !186)
!186 = !{!10, !73, !138, !165, !15, !187, !22}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "clGetMemObjectInfo", linkageName: "?clGetMemObjectInfo@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_mem@@IIPAXPAI@ZA", scope: !2, file: !6, line: 143, type: !190, isLocal: false, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !192)
!192 = !{!10, !135, !193, !29, !30, !31}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem_info", file: !11, line: 85, baseType: !15)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "clGetImageInfo", linkageName: "?clGetImageInfo@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_mem@@IIPAXPAI@ZA", scope: !2, file: !6, line: 150, type: !196, isLocal: false, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !198)
!198 = !{!10, !135, !199, !29, !30, !31}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_image_info", file: !11, line: 87, baseType: !15)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "clSetMemObjectDestructorCallback", linkageName: "?clSetMemObjectDestructorCallback@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_mem@@P6GX0PAX@Z1@ZA", scope: !2, file: !6, line: 157, type: !202, isLocal: false, isDefinition: true)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !204)
!204 = !{!10, !135, !205, !30}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !207)
!207 = !{null, !135, !30}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "clCreateProgramWithSource", linkageName: "?clCreateProgramWithSource@OpenCL@Internal@Runtime@Halide@@3P6GPAU_cl_program@@PAU_cl_context@@IPAPBDPBIPAH@ZA", scope: !2, file: !6, line: 163, type: !210, isLocal: false, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !212)
!212 = !{!213, !73, !15, !216, !217, !89}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_program", file: !11, line: 60, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_program", file: !11, line: 60, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_program@@")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "clRetainProgram", linkageName: "?clRetainProgram@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_program@@@ZA", scope: !2, file: !6, line: 169, type: !221, isLocal: false, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !223)
!223 = !{!10, !213}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "clReleaseProgram", linkageName: "?clReleaseProgram@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_program@@@ZA", scope: !2, file: !6, line: 172, type: !221, isLocal: false, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "clBuildProgram", linkageName: "?clBuildProgram@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_program@@IPBQAU_cl_device_id@@PBDP6GX0PAX@Z3@ZA", scope: !2, file: !6, line: 175, type: !228, isLocal: false, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !230)
!230 = !{!10, !213, !15, !79, !84, !231, !30}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !233)
!233 = !{null, !213, !30}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "clGetProgramBuildInfo", linkageName: "?clGetProgramBuildInfo@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_program@@PAU_cl_device_id@@IIPAXPAI@ZA", scope: !2, file: !6, line: 183, type: !236, isLocal: false, isDefinition: true)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !238)
!238 = !{!10, !213, !43, !239, !29, !30, !31}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_program_build_info", file: !11, line: 94, baseType: !15)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "clCreateKernel", linkageName: "?clCreateKernel@OpenCL@Internal@Runtime@Halide@@3P6GPAU_cl_kernel@@PAU_cl_program@@PBDPAH@ZA", scope: !2, file: !6, line: 192, type: !242, isLocal: false, isDefinition: true)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !244)
!244 = !{!245, !213, !84, !89}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_kernel", file: !11, line: 61, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_kernel", file: !11, line: 61, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_kernel@@")
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "clRetainKernel", linkageName: "?clRetainKernel@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_kernel@@@ZA", scope: !2, file: !6, line: 197, type: !250, isLocal: false, isDefinition: true)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !252)
!252 = !{!10, !245}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "clReleaseKernel", linkageName: "?clReleaseKernel@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_kernel@@@ZA", scope: !2, file: !6, line: 200, type: !250, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "clSetKernelArg", linkageName: "?clSetKernelArg@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_kernel@@IIPBX@ZA", scope: !2, file: !6, line: 203, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !259)
!259 = !{!10, !245, !15, !29, !87}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "clFlush", linkageName: "?clFlush@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@@ZA", scope: !2, file: !6, line: 210, type: !119, isLocal: false, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "clFinish", linkageName: "?clFinish@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@@ZA", scope: !2, file: !6, line: 213, type: !119, isLocal: false, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "clEnqueueReadBuffer", linkageName: "?clEnqueueReadBuffer@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@IIIPAXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 217, type: !266, isLocal: false, isDefinition: true)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !268)
!268 = !{!10, !113, !135, !269, !29, !29, !30, !15, !270, !275}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_bool", file: !11, line: 65, baseType: !15)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_event", file: !11, line: 62, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_event", file: !11, line: 62, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_event@@")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "clEnqueueReadBufferRect", linkageName: "?clEnqueueReadBufferRect@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@IPBI22IIIIPAXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 228, type: !278, isLocal: false, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !280)
!280 = !{!10, !113, !135, !269, !217, !217, !217, !29, !29, !29, !29, !30, !15, !270, !275}
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "clEnqueueWriteBuffer", linkageName: "?clEnqueueWriteBuffer@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@IIIPBXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 244, type: !283, isLocal: false, isDefinition: true)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !285)
!285 = !{!10, !113, !135, !269, !29, !29, !87, !15, !270, !275}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "clEnqueueWriteBufferRect", linkageName: "?clEnqueueWriteBufferRect@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@IPBI22IIIIPBXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 255, type: !288, isLocal: false, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !290)
!290 = !{!10, !113, !135, !269, !217, !217, !217, !29, !29, !29, !29, !87, !15, !270, !275}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "clEnqueueCopyBuffer", linkageName: "?clEnqueueCopyBuffer@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@1IIIIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 272, type: !293, isLocal: false, isDefinition: true)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !295)
!295 = !{!10, !113, !135, !135, !29, !29, !29, !15, !270, !275}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "clEnqueueReadImage", linkageName: "?clEnqueueReadImage@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@IPBI2IIPAXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 283, type: !298, isLocal: false, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !300)
!300 = !{!10, !113, !135, !269, !217, !217, !29, !29, !30, !15, !270, !275}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "clEnqueueWriteImage", linkageName: "?clEnqueueWriteImage@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@IPBI2IIPBXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 296, type: !303, isLocal: false, isDefinition: true)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !305)
!305 = !{!10, !113, !135, !269, !217, !217, !29, !29, !87, !15, !270, !275}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "clEnqueueMapBuffer", linkageName: "?clEnqueueMapBuffer@OpenCL@Internal@Runtime@Halide@@3P6GPAXPAU_cl_command_queue@@PAU_cl_mem@@I_KIIIPBQAU_cl_event@@PAPAU7@PAH@ZA", scope: !2, file: !6, line: 309, type: !308, isLocal: false, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !310)
!310 = !{!30, !113, !135, !269, !311, !29, !29, !15, !270, !275, !89}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_map_flags", file: !11, line: 92, baseType: !38)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "clEnqueueMapImage", linkageName: "?clEnqueueMapImage@OpenCL@Internal@Runtime@Halide@@3P6GPAXPAU_cl_command_queue@@PAU_cl_mem@@I_KPBI3PAI4IPBQAU_cl_event@@PAPAU7@PAH@ZA", scope: !2, file: !6, line: 321, type: !314, isLocal: false, isDefinition: true)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !316)
!316 = !{!30, !113, !135, !269, !311, !217, !217, !31, !31, !15, !270, !275, !89}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "clEnqueueUnmapMemObject", linkageName: "?clEnqueueUnmapMemObject@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_mem@@PAXIPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 335, type: !319, isLocal: false, isDefinition: true)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !321)
!321 = !{!10, !113, !135, !30, !15, !270, !275}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "clEnqueueNDRangeKernel", linkageName: "?clEnqueueNDRangeKernel@OpenCL@Internal@Runtime@Halide@@3P6GHPAU_cl_command_queue@@PAU_cl_kernel@@IPBI22IPBQAU_cl_event@@PAPAU7@@ZA", scope: !2, file: !6, line: 343, type: !324, isLocal: false, isDefinition: true)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !326)
!326 = !{!10, !113, !245, !15, !217, !217, !217, !15, !270, !275}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "lib_opencl", linkageName: "?lib_opencl@OpenCL@Internal@Runtime@Halide@@3PAXA", scope: !2, file: !329, line: 26, type: !30, isLocal: false, isDefinition: true)
!329 = !DIFile(filename: "src/runtime/opencl.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a2eaa692364ff55491af6d94d2d38fe2")
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "context", linkageName: "?context@OpenCL@Internal@Runtime@Halide@@3PAU_cl_context@@A", scope: !2, file: !329, line: 86, type: !73, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "command_queue", linkageName: "?command_queue@OpenCL@Internal@Runtime@Halide@@3PAU_cl_command_queue@@A", scope: !2, file: !329, line: 87, type: !113, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "thread_lock", linkageName: "?thread_lock@OpenCL@Internal@Runtime@Halide@@3DC", scope: !2, file: !329, line: 88, type: !336, isLocal: false, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !339, file: !338, line: 11, baseType: !86)
!338 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "5cf5ff4091fc972c00e0f2f3144d40ad")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !338, line: 9, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !340, identifier: ".?AUScopedSpinLock@Internal@Runtime@Halide@@")
!340 = !{!337, !341, !344, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !338, line: 13, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!344 = !DISubprogram(name: "ScopedSpinLock", scope: !339, file: !338, line: 15, type: !345, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !346)
!346 = !{null, !347, !343}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!348 = !DISubprogram(name: "~ScopedSpinLock", scope: !339, file: !338, line: 22, type: !349, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !350)
!350 = !{null, !347}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "platform_name", linkageName: "?platform_name@OpenCL@Internal@Runtime@Halide@@3PADA", scope: !2, file: !329, line: 90, type: !353, isLocal: false, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 2048, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 256)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "platform_name_lock", linkageName: "?platform_name_lock@OpenCL@Internal@Runtime@Halide@@3DA", scope: !2, file: !329, line: 91, type: !337, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "platform_name_initialized", linkageName: "?platform_name_initialized@OpenCL@Internal@Runtime@Halide@@3_NA", scope: !2, file: !329, line: 92, type: !360, isLocal: false, isDefinition: true)
!360 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "device_type", linkageName: "?device_type@OpenCL@Internal@Runtime@Halide@@3PADA", scope: !2, file: !329, line: 94, type: !353, isLocal: false, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "device_type_lock", linkageName: "?device_type_lock@OpenCL@Internal@Runtime@Halide@@3DA", scope: !2, file: !329, line: 95, type: !337, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "device_type_initialized", linkageName: "?device_type_initialized@OpenCL@Internal@Runtime@Halide@@3_NA", scope: !2, file: !329, line: 96, type: !360, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "build_options", linkageName: "?build_options@OpenCL@Internal@Runtime@Halide@@3PADA", scope: !2, file: !329, line: 98, type: !369, isLocal: false, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8192, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 1024)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "build_options_lock", linkageName: "?build_options_lock@OpenCL@Internal@Runtime@Halide@@3DA", scope: !2, file: !329, line: 99, type: !337, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "build_options_initialized", linkageName: "?build_options_initialized@OpenCL@Internal@Runtime@Halide@@3_NA", scope: !2, file: !329, line: 100, type: !360, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "?compilation_cache@OpenCL@Internal@Runtime@Halide@@3V?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@24@A", scope: !2, file: !329, line: 298, type: !378, isLocal: false, isDefinition: true)
!378 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<_cl_context *,_cl_program *>", scope: !380, file: !379, line: 8, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !381, templateParams: !438, identifier: ".?AV?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@")
!379 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "24284584ab13511a21d3d0444c1ab74f")
!380 = !DINamespace(name: "Internal", scope: !5)
!381 = !{!382, !392, !401, !404, !406, !407, !409, !410, !412, !413, !414, !417, !423, !428, !432, !435}
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !378, file: !379, line: 9, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !383, identifier: ".?AUCachedCompilation@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@")
!383 = !{!384, !385, !386, !387, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !382, file: !379, line: 10, baseType: !74, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !382, file: !379, line: 11, baseType: !214, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !382, file: !379, line: 12, baseType: !16, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !382, file: !379, line: 13, baseType: !16, size: 32, offset: 96)
!388 = !DISubprogram(name: "CachedCompilation", scope: !382, file: !379, line: 15, type: !389, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !390)
!390 = !{null, !391, !74, !214, !16, !16}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !378, file: !379, line: 22, baseType: !393, size: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !394, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !395, identifier: ".?AUhalide_mutex@@")
!394 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !393, file: !394, line: 121, baseType: !397, size: 32)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 32, elements: !399)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 68, baseType: !16)
!399 = !{!400}
!400 = !DISubrange(count: 1)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !378, file: !379, line: 24, baseType: !402, flags: DIFlagStaticMember)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !378, file: !379, line: 25, baseType: !405, flags: DIFlagStaticMember)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !378, file: !379, line: 26, baseType: !14, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !378, file: !379, line: 27, baseType: !408, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !378, file: !379, line: 28, baseType: !14, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !378, file: !379, line: 30, baseType: !411, flags: DIFlagStaticMember)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !378, file: !379, line: 31, baseType: !411, flags: DIFlagStaticMember)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !378, file: !379, line: 33, baseType: !16, size: 32, offset: 128)
!414 = !DISubprogram(name: "kernel_hash", linkageName: "?kernel_hash@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@SAIPAU_cl_context@@II@Z", scope: !378, file: !379, line: 36, type: !415, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!415 = !DISubroutineType(types: !416)
!416 = !{!398, !74, !16, !16}
!417 = !DISubprogram(name: "insert", linkageName: "?insert@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@QAE_NABUCachedCompilation@123@@Z", scope: !378, file: !379, line: 47, type: !418, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!418 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !419)
!419 = !{!360, !420, !421}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!421 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!423 = !DISubprogram(name: "find_internal", linkageName: "?find_internal@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@QAE_NPAU_cl_context@@IAAPAPAU_cl_program@@H@Z", scope: !378, file: !379, line: 73, type: !424, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !425)
!425 = !{!360, !420, !74, !16, !426, !14}
!426 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!428 = !DISubprogram(name: "lookup", linkageName: "?lookup@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@QAE_NPAU_cl_context@@PAXAAPAU_cl_program@@@Z", scope: !378, file: !379, line: 97, type: !429, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !430)
!430 = !{!360, !420, !74, !30, !431}
!431 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !214, size: 32)
!432 = !DISubprogram(name: "resize_table", linkageName: "?resize_table@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@QAE_NH@Z", scope: !378, file: !379, line: 108, type: !433, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !434)
!434 = !{!360, !420, !14}
!435 = !DISubprogram(name: "release_hold", linkageName: "?release_hold@?$GPUCompilationCache@PAU_cl_context@@PAU_cl_program@@@Internal@Halide@@QAEXPAXPAU_cl_context@@0@Z", scope: !378, file: !379, line: 211, type: !436, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !437)
!437 = !{null, !420, !30, !74, !30}
!438 = !{!439, !440}
!439 = !DITemplateTypeParameter(name: "ContextT", type: !74)
!440 = !DITemplateTypeParameter(name: "ModuleStateT", type: !214)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "opencl_device_interface", linkageName: "?opencl_device_interface@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_t@@A", scope: !2, file: !329, line: 1516, type: !443, isLocal: false, isDefinition: true)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !394, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !444, identifier: ".?AUhalide_device_interface_t@@")
!444 = !{!445, !564, !568, !569, !573, !574, !575, !576, !577, !581, !586, !590, !591, !595, !596, !601}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !443, file: !394, line: 724, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DISubroutineType(types: !448)
!448 = !{!14, !30, !449, !454}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !394, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !451, identifier: ".?AUhalide_buffer_t@@")
!451 = !{!452, !453, !456, !460, !461, !501, !502, !525, !526, !536, !540, !543, !544, !547, !548, !551, !554, !555, !556, !560, !563}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !450, file: !394, line: 1425, baseType: !40, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !450, file: !394, line: 1428, baseType: !454, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !450, file: !394, line: 1433, baseType: !457, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 16, baseType: !459)
!459 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !394, line: 1436, baseType: !40, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !394, line: 1439, baseType: !462, size: 32, offset: 192)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !394, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !463, identifier: ".?AUhalide_type_t@@")
!463 = !{!464, !473, !474, !477, !481, !484, !489, !493, !494, !495, !498}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !462, file: !394, line: 434, baseType: !465, size: 8, align: 8)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !394, line: 413, baseType: !466)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !394, line: 403, baseType: !458, size: 8, elements: !467, identifier: ".?AW4halide_type_code_t@@")
!467 = !{!468, !469, !470, !471, !472}
!468 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!469 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!470 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!471 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!472 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !462, file: !394, line: 442, baseType: !458, size: 8, align: 8, offset: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !462, file: !394, line: 446, baseType: !475, size: 16, align: 16, offset: 16)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 14, baseType: !476)
!476 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!477 = !DISubprogram(name: "halide_type_t", scope: !462, file: !394, line: 453, type: !478, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !479)
!479 = !{null, !480, !465, !458, !475}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!481 = !DISubprogram(name: "halide_type_t", scope: !462, file: !394, line: 459, type: !482, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!482 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !483)
!483 = !{null, !480}
!484 = !DISubprogram(name: "with_lanes", linkageName: "?with_lanes@halide_type_t@@QBE?AU1@G@Z", scope: !462, file: !394, line: 463, type: !485, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !486)
!486 = !{!462, !487, !475}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!489 = !DISubprogram(name: "operator==", linkageName: "??8halide_type_t@@QBE_NABU0@@Z", scope: !462, file: !394, line: 468, type: !490, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !491)
!491 = !{!360, !487, !492}
!492 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !488, size: 32)
!493 = !DISubprogram(name: "operator!=", linkageName: "??9halide_type_t@@QBE_NABU0@@Z", scope: !462, file: !394, line: 472, type: !490, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubprogram(name: "operator<", linkageName: "??Mhalide_type_t@@QBE_NABU0@@Z", scope: !462, file: !394, line: 476, type: !490, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!495 = !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QBEHXZ", scope: !462, file: !394, line: 481, type: !496, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !497)
!497 = !{!14, !487}
!498 = !DISubprogram(name: "as_u32", linkageName: "?as_u32@halide_type_t@@QBEIXZ", scope: !462, file: !394, line: 485, type: !499, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !500)
!500 = !{!16, !487}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !450, file: !394, line: 1442, baseType: !12, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !450, file: !394, line: 1446, baseType: !503, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !394, line: 1409, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !394, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !506, identifier: ".?AUhalide_dimension_t@@")
!506 = !{!507, !508, !509, !510, !511, !515, !518, !524}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !505, file: !394, line: 1383, baseType: !12, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !505, file: !394, line: 1383, baseType: !12, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !505, file: !394, line: 1383, baseType: !12, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !505, file: !394, line: 1386, baseType: !16, size: 32, offset: 96)
!511 = !DISubprogram(name: "halide_dimension_t", scope: !505, file: !394, line: 1388, type: !512, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !513)
!513 = !{null, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!515 = !DISubprogram(name: "halide_dimension_t", scope: !505, file: !394, line: 1389, type: !516, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !517)
!517 = !{null, !514, !12, !12, !12, !16}
!518 = !DISubprogram(name: "operator==", linkageName: "??8halide_dimension_t@@QBE_NABU0@@Z", scope: !505, file: !394, line: 1393, type: !519, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !520)
!520 = !{!360, !521, !523}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!523 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !522, size: 32)
!524 = !DISubprogram(name: "operator!=", linkageName: "??9halide_dimension_t@@QBE_NABU0@@Z", scope: !505, file: !394, line: 1400, type: !519, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !450, file: !394, line: 1449, baseType: !30, size: 32, offset: 288)
!526 = !DISubprogram(name: "get_flag", linkageName: "?get_flag@halide_buffer_t@@QBE_NW4halide_buffer_flags@@@Z", scope: !450, file: !394, line: 1454, type: !527, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !528)
!528 = !{!360, !529, !531}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !394, line: 1416, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 1415, baseType: !14, size: 32, elements: !533, identifier: ".?AW4halide_buffer_flags@@")
!533 = !{!534, !535}
!534 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1)
!535 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2)
!536 = !DISubprogram(name: "set_flag", linkageName: "?set_flag@halide_buffer_t@@QAEXW4halide_buffer_flags@@_N@Z", scope: !450, file: !394, line: 1458, type: !537, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!537 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !538)
!538 = !{null, !539, !531, !360}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!540 = !DISubprogram(name: "host_dirty", linkageName: "?host_dirty@halide_buffer_t@@QBE_NXZ", scope: !450, file: !394, line: 1466, type: !541, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !542)
!542 = !{!360, !529}
!543 = !DISubprogram(name: "device_dirty", linkageName: "?device_dirty@halide_buffer_t@@QBE_NXZ", scope: !450, file: !394, line: 1470, type: !541, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DISubprogram(name: "set_host_dirty", linkageName: "?set_host_dirty@halide_buffer_t@@QAEX_N@Z", scope: !450, file: !394, line: 1474, type: !545, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !546)
!546 = !{null, !539, !360}
!547 = !DISubprogram(name: "set_device_dirty", linkageName: "?set_device_dirty@halide_buffer_t@@QAEX_N@Z", scope: !450, file: !394, line: 1478, type: !545, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!548 = !DISubprogram(name: "number_of_elements", linkageName: "?number_of_elements@halide_buffer_t@@QBEIXZ", scope: !450, file: !394, line: 1485, type: !549, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !550)
!550 = !{!29, !529}
!551 = !DISubprogram(name: "begin", linkageName: "?begin@halide_buffer_t@@QBEPAEXZ", scope: !450, file: !394, line: 1495, type: !552, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !553)
!553 = !{!457, !529}
!554 = !DISubprogram(name: "end", linkageName: "?end@halide_buffer_t@@QBEPAEXZ", scope: !450, file: !394, line: 1506, type: !552, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubprogram(name: "size_in_bytes", linkageName: "?size_in_bytes@halide_buffer_t@@QBEIXZ", scope: !450, file: !394, line: 1518, type: !549, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubprogram(name: "address_of", linkageName: "?address_of@halide_buffer_t@@QBEPAEPBH@Z", scope: !450, file: !394, line: 1523, type: !557, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !558)
!558 = !{!457, !529, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!560 = !DISubprogram(name: "device_sync", linkageName: "?device_sync@halide_buffer_t@@QAEHPAX@Z", scope: !450, file: !394, line: 1534, type: !561, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !562)
!562 = !{!14, !539, !30}
!563 = !DISubprogram(name: "is_bounds_query", linkageName: "?is_bounds_query@halide_buffer_t@@QBE_NXZ", scope: !450, file: !394, line: 1545, type: !541, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !443, file: !394, line: 726, baseType: !565, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DISubroutineType(types: !567)
!567 = !{!14, !30, !449}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !443, file: !394, line: 727, baseType: !565, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !443, file: !394, line: 728, baseType: !570, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !30, !454}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !443, file: !394, line: 730, baseType: !565, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !443, file: !394, line: 731, baseType: !446, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !443, file: !394, line: 733, baseType: !446, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !443, file: !394, line: 735, baseType: !565, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !443, file: !394, line: 736, baseType: !578, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DISubroutineType(types: !580)
!580 = !{!14, !30, !449, !454, !449}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !443, file: !394, line: 738, baseType: !582, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DISubroutineType(types: !584)
!584 = !{!14, !30, !585, !449}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !443, file: !394, line: 740, baseType: !587, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DISubroutineType(types: !589)
!589 = !{!14, !30, !585, !14, !14, !449}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !443, file: !394, line: 742, baseType: !565, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !443, file: !394, line: 743, baseType: !592, size: 32, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{!14, !30, !449, !40, !454}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !443, file: !394, line: 745, baseType: !565, size: 32, offset: 416)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !443, file: !394, line: 746, baseType: !597, size: 32, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!14, !30, !600, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !443, file: !394, line: 747, baseType: !602, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !605, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !606, identifier: ".?AUhalide_device_interface_impl_t@@")
!605 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "973e1c360c8f9d0d9344920815b6525d")
!606 = !{!607, !611, !612, !613, !614, !615, !619, !620, !621, !622, !623, !624, !625, !626, !627, !631}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !604, file: !605, line: 16, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{null}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !604, file: !605, line: 17, baseType: !608, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !604, file: !605, line: 18, baseType: !565, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !604, file: !605, line: 19, baseType: !565, size: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !604, file: !605, line: 20, baseType: !565, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !604, file: !605, line: 21, baseType: !616, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{!14, !30}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !604, file: !605, line: 22, baseType: !565, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !604, file: !605, line: 23, baseType: !565, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !604, file: !605, line: 24, baseType: !565, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !604, file: !605, line: 25, baseType: !565, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !604, file: !605, line: 26, baseType: !578, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !604, file: !605, line: 28, baseType: !582, size: 32, offset: 352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !604, file: !605, line: 31, baseType: !587, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !604, file: !605, line: 35, baseType: !565, size: 32, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !604, file: !605, line: 37, baseType: !628, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!14, !30, !449, !40}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !604, file: !605, line: 38, baseType: !565, size: 32, offset: 480)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "opencl_image_device_interface", linkageName: "?opencl_image_device_interface@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_t@@A", scope: !2, file: !329, line: 1908, type: !443, isLocal: false, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "opencl_device_interface_impl", linkageName: "?opencl_device_interface_impl@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_impl_t@@A", scope: !2, file: !329, line: 1497, type: !604, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "opencl_image_device_interface_impl", linkageName: "?opencl_image_device_interface_impl@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_impl_t@@A", scope: !2, file: !329, line: 1889, type: !604, isLocal: false, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !639, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !688, globals: !983, imports: !1008, nameTableKind: None)
!639 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_opencl.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "06f9b16887f2917afcaaf7cdb8c0b33d")
!640 = !{!466, !532, !641}
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !394, line: 990, baseType: !14, size: 32, elements: !642, identifier: ".?AW4halide_error_code_t@@")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!643 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!644 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!645 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!646 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!647 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!648 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!649 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!650 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!651 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!652 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!653 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!654 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!655 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!656 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!657 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!658 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!659 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!660 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!661 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!662 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!663 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!664 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!665 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!666 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!667 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!668 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!669 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!670 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!671 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!672 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!673 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!674 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!675 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!676 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!677 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!678 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!679 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!680 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!681 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!682 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!683 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!684 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!685 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!686 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!687 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!688 = !{!30, !689, !40, !768, !773, !14, !78, !135, !29, !840, !841, !842, !398, !843, !713, !695, !844, !849, !852, !856, !859, !862, !865, !873, !876, !879, !882, !885, !888, !891, !894, !897, !904, !907, !911, !914, !920, !925, !928, !934, !937, !940, !943, !946, !952, !955, !958, !961, !964, !967, !970, !973, !976, !979, !982, !408, !16, !378}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !691, file: !690, line: 203, baseType: !692)
!690 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a97d2909b01229a33f8a6f2cb0fa6ab8")
!691 = !DINamespace(scope: !3)
!692 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0,1024>", scope: !691, file: !690, line: 30, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !693, templateParams: !765, identifier: ".?AV?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@")
!693 = !{!694, !696, !697, !698, !699, !700, !702, !706, !710, !715, !718, !721, !724, !728, !731, !734, !738, !741, !747, !750, !753, !758, !759, !762, !763, !764}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !692, file: !690, line: 32, baseType: !695, size: 32, flags: DIFlagPublic)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !692, file: !690, line: 32, baseType: !695, size: 32, offset: 32, flags: DIFlagPublic)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !692, file: !690, line: 32, baseType: !695, size: 32, offset: 64, flags: DIFlagPublic)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !692, file: !690, line: 33, baseType: !30, size: 32, offset: 96, flags: DIFlagPublic)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !692, file: !690, line: 34, baseType: !360, size: 8, offset: 128, flags: DIFlagPublic)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !692, file: !690, line: 35, baseType: !701, size: 8, offset: 136, flags: DIFlagPublic)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8, elements: !399)
!702 = !DISubprogram(name: "Printer", scope: !692, file: !690, line: 37, type: !703, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!703 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !704)
!704 = !{null, !705, !30, !695}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!706 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@PBD@Z", scope: !692, file: !690, line: 57, type: !707, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!707 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !708)
!708 = !{!709, !705, !84}
!709 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !692, size: 32)
!710 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@_J@Z", scope: !692, file: !690, line: 67, type: !711, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!711 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !712)
!712 = !{!709, !705, !713}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 9, baseType: !714)
!714 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!715 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@H@Z", scope: !692, file: !690, line: 72, type: !716, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!716 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !717)
!717 = !{!709, !705, !12}
!718 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@_K@Z", scope: !692, file: !690, line: 77, type: !719, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!719 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !720)
!720 = !{!709, !705, !40}
!721 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@I@Z", scope: !692, file: !690, line: 82, type: !722, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !723)
!723 = !{!709, !705, !16}
!724 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@N@Z", scope: !692, file: !690, line: 87, type: !725, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !726)
!726 = !{!709, !705, !727}
!727 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!728 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@M@Z", scope: !692, file: !690, line: 92, type: !729, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!729 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !730)
!730 = !{!709, !705, !403}
!731 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@PBX@Z", scope: !692, file: !690, line: 97, type: !732, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!732 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !733)
!733 = !{!709, !705, !87}
!734 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV1?A0xEE9BEA30@234@G@Z", scope: !692, file: !690, line: 102, type: !735, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !736)
!736 = !{!709, !705, !737}
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!738 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@ABUhalide_type_t@@@Z", scope: !692, file: !690, line: 108, type: !739, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !740)
!740 = !{!709, !705, !492}
!741 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@ABUhalide_buffer_t@@@Z", scope: !692, file: !690, line: 113, type: !742, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !743)
!743 = !{!709, !705, !744}
!744 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !394, line: 1550, baseType: !450)
!747 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEPBDXZ", scope: !692, file: !690, line: 119, type: !748, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !749)
!749 = !{!84, !705}
!750 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEXXZ", scope: !692, file: !690, line: 131, type: !751, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !752)
!752 = !{null, !705}
!753 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QBE_KXZ", scope: !692, file: !690, line: 139, type: !754, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !755)
!755 = !{!40, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!758 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QBE_KXZ", scope: !692, file: !690, line: 143, type: !754, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!759 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEXH@Z", scope: !692, file: !690, line: 148, type: !760, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !761)
!761 = !{null, !705, !14}
!762 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEPBDXZ", scope: !692, file: !690, line: 158, type: !748, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!763 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEXXZ", scope: !692, file: !690, line: 162, type: !751, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!764 = !DISubprogram(name: "~Printer", scope: !692, file: !690, line: 166, type: !751, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !{!766, !767}
!766 = !DITemplateValueParameter(name: "type", type: !14, value: i32 0)
!767 = !DITemplateValueParameter(name: "length", type: !41, value: i64 1024)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_handle", scope: !2, file: !329, line: 290, size: 128, flags: DIFlagTypePassByValue, elements: !770, identifier: ".?AUdevice_handle@OpenCL@Internal@Runtime@Halide@@")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !769, file: !329, line: 294, baseType: !40, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !769, file: !329, line: 295, baseType: !135, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !691, file: !690, line: 199, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1,1024>", scope: !691, file: !690, line: 30, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !775, templateParams: !838, identifier: ".?AV?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@")
!775 = !{!776, !777, !778, !779, !780, !781, !782, !786, !790, !793, !796, !799, !802, !805, !808, !811, !814, !817, !820, !823, !826, !831, !832, !835, !836, !837}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !774, file: !690, line: 32, baseType: !695, size: 32, flags: DIFlagPublic)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !774, file: !690, line: 32, baseType: !695, size: 32, offset: 32, flags: DIFlagPublic)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !774, file: !690, line: 32, baseType: !695, size: 32, offset: 64, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !774, file: !690, line: 33, baseType: !30, size: 32, offset: 96, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !774, file: !690, line: 34, baseType: !360, size: 8, offset: 128, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !774, file: !690, line: 35, baseType: !701, size: 8, offset: 136, flags: DIFlagPublic)
!782 = !DISubprogram(name: "Printer", scope: !774, file: !690, line: 37, type: !783, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!783 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !784)
!784 = !{null, !785, !30, !695}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!786 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@PBD@Z", scope: !774, file: !690, line: 57, type: !787, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!787 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !788)
!788 = !{!789, !785, !84}
!789 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !774, size: 32)
!790 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@_J@Z", scope: !774, file: !690, line: 67, type: !791, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!791 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !792)
!792 = !{!789, !785, !713}
!793 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@H@Z", scope: !774, file: !690, line: 72, type: !794, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!794 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !795)
!795 = !{!789, !785, !12}
!796 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@_K@Z", scope: !774, file: !690, line: 77, type: !797, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !798)
!798 = !{!789, !785, !40}
!799 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@I@Z", scope: !774, file: !690, line: 82, type: !800, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!800 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !801)
!801 = !{!789, !785, !16}
!802 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@N@Z", scope: !774, file: !690, line: 87, type: !803, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !804)
!804 = !{!789, !785, !727}
!805 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@M@Z", scope: !774, file: !690, line: 92, type: !806, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!806 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !807)
!807 = !{!789, !785, !403}
!808 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@PBX@Z", scope: !774, file: !690, line: 97, type: !809, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !810)
!810 = !{!789, !785, !87}
!811 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV1?A0xEE9BEA30@234@G@Z", scope: !774, file: !690, line: 102, type: !812, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!812 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !813)
!813 = !{!789, !785, !737}
!814 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@ABUhalide_type_t@@@Z", scope: !774, file: !690, line: 108, type: !815, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !816)
!816 = !{!789, !785, !492}
!817 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEAAV0?A0xEE9BEA30@123@ABUhalide_buffer_t@@@Z", scope: !774, file: !690, line: 113, type: !818, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !819)
!819 = !{!789, !785, !744}
!820 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEPBDXZ", scope: !774, file: !690, line: 119, type: !821, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!821 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !822)
!822 = !{!84, !785}
!823 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEXXZ", scope: !774, file: !690, line: 131, type: !824, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!824 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !825)
!825 = !{null, !785}
!826 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QBE_KXZ", scope: !774, file: !690, line: 139, type: !827, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!827 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !828)
!828 = !{!40, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!831 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QBE_KXZ", scope: !774, file: !690, line: 143, type: !827, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEXH@Z", scope: !774, file: !690, line: 148, type: !833, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !834)
!834 = !{null, !785, !14}
!835 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEPBDXZ", scope: !774, file: !690, line: 158, type: !821, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QAEXXZ", scope: !774, file: !690, line: 162, type: !824, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubprogram(name: "~Printer", scope: !774, file: !690, line: 166, type: !824, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !{!839, !767}
!839 = !DITemplateValueParameter(name: "type", type: !14, value: i32 1)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !13, line: 28, baseType: !14)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !846)
!846 = !{!14, !17, !847, !848}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !851)
!851 = !{!14, !20, !17, !17, !30, !848}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !854)
!854 = !{!14, !20, !41, !17, !855, !848}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !858)
!858 = !{!14, !44, !17, !17, !30, !848}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !861)
!861 = !{!14, !44, !559, !17, !855, !848}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !864)
!864 = !{!14, !44}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !867)
!867 = !{!74, !559, !17, !868, !870, !30, !600}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !872)
!872 = !{null, !84, !87, !17, !30}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !875)
!875 = !{!74, !559, !41, !870, !30, !600}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !878)
!878 = !{!14, !74}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !881)
!881 = !{!14, !74, !17, !17, !30, !848}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !884)
!884 = !{!114, !74, !44, !41, !600}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !887)
!887 = !{!14, !114}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !890)
!890 = !{!14, !114, !17, !17, !30, !848}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !893)
!893 = !{!136, !74, !41, !17, !30, !600}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !896)
!896 = !{!136, !136, !41, !17, !87, !600}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !899)
!899 = !{!136, !74, !41, !900, !902, !30, !600}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !906)
!906 = !{!14, !136}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !909)
!909 = !{!14, !74, !41, !17, !17, !910, !848}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !913)
!913 = !{!14, !136, !17, !17, !30, !848}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !916)
!916 = !{!14, !136, !917, !30}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !919)
!919 = !{null, !136, !30}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !922)
!922 = !{!214, !74, !17, !216, !923, !600}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !927)
!927 = !{!14, !214}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !930)
!930 = !{!14, !214, !17, !868, !84, !931, !30}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !933)
!933 = !{null, !214, !30}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !936)
!936 = !{!14, !214, !44, !17, !17, !30, !848}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !939)
!939 = !{!246, !214, !84, !600}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !942)
!942 = !{!14, !246}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !945)
!945 = !{!14, !246, !17, !17, !87}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !948)
!948 = !{!14, !114, !136, !17, !17, !17, !30, !17, !949, !951}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !954)
!954 = !{!14, !114, !136, !17, !923, !923, !923, !17, !17, !17, !17, !30, !17, !949, !951}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !957)
!957 = !{!14, !114, !136, !17, !17, !17, !87, !17, !949, !951}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !960)
!960 = !{!14, !114, !136, !17, !923, !923, !923, !17, !17, !17, !17, !87, !17, !949, !951}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !963)
!963 = !{!14, !114, !136, !136, !17, !17, !17, !17, !949, !951}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !966)
!966 = !{!14, !114, !136, !17, !923, !923, !17, !17, !30, !17, !949, !951}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !969)
!969 = !{!14, !114, !136, !17, !923, !923, !17, !17, !87, !17, !949, !951}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !972)
!972 = !{!30, !114, !136, !17, !41, !17, !17, !17, !949, !951, !600}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !975)
!975 = !{!30, !114, !136, !17, !41, !923, !923, !848, !848, !17, !949, !951, !600}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !978)
!978 = !{!14, !114, !136, !30, !17, !949, !951}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !981)
!981 = !{!14, !114, !246, !17, !923, !923, !923, !17, !949, !951}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!983 = !{!0, !23, !32, !46, !52, !61, !66, !68, !90, !95, !100, !102, !108, !117, !122, !124, !130, !139, !145, !175, !180, !182, !188, !194, !200, !208, !219, !224, !226, !234, !240, !248, !253, !255, !260, !262, !264, !276, !281, !286, !291, !296, !301, !306, !312, !317, !322, !327, !330, !332, !334, !351, !356, !358, !361, !363, !365, !367, !372, !374, !376, !984, !986, !988, !634, !441, !990, !992, !994, !996, !998, !1000, !1002, !636, !632, !1004, !1006}
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!985 = distinct !DIGlobalVariable(name: "halide_error_code_generic_error", scope: !638, file: !394, line: 995, type: !641, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression(DW_OP_constu, 18446744073709551574, DW_OP_stack_value))
!987 = distinct !DIGlobalVariable(name: "halide_error_code_incompatible_device_interface", scope: !638, file: !394, line: 1164, type: !641, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression(DW_OP_constu, 18446744073709551605, DW_OP_stack_value))
!989 = distinct !DIGlobalVariable(name: "halide_error_code_out_of_memory", scope: !638, file: !394, line: 1035, type: !641, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!991 = distinct !DIGlobalVariable(name: "halide_type_int", scope: !638, file: !394, line: 408, type: !466, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!993 = distinct !DIGlobalVariable(name: "halide_type_uint", scope: !638, file: !394, line: 409, type: !466, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!995 = distinct !DIGlobalVariable(name: "halide_type_float", scope: !638, file: !394, line: 410, type: !466, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression(DW_OP_constu, 18446744073709551600, DW_OP_stack_value))
!997 = distinct !DIGlobalVariable(name: "halide_error_code_device_malloc_failed", scope: !638, file: !394, line: 1057, type: !641, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression(DW_OP_constu, 18446744073709551577, DW_OP_stack_value))
!999 = distinct !DIGlobalVariable(name: "halide_error_code_device_buffer_copy_failed", scope: !638, file: !394, line: 1150, type: !641, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression(DW_OP_constu, 18446744073709551584, DW_OP_stack_value))
!1001 = distinct !DIGlobalVariable(name: "halide_error_code_device_wrap_native_failed", scope: !638, file: !394, line: 1118, type: !641, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression(DW_OP_constu, 18446744073709551576, DW_OP_stack_value))
!1003 = distinct !DIGlobalVariable(name: "halide_error_code_device_crop_unsupported", scope: !638, file: !394, line: 1154, type: !641, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!1005 = distinct !DIGlobalVariable(name: "halide_buffer_flag_device_dirty", scope: !638, file: !394, line: 1416, type: !532, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!1007 = distinct !DIGlobalVariable(name: "halide_buffer_flag_host_dirty", scope: !638, file: !394, line: 1415, type: !532, isLocal: true, isDefinition: true)
!1008 = !{!1009, !1010}
!1009 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !638, entity: !3, file: !13, line: 225)
!1010 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !638, entity: !2, file: !329, line: 107)
!1011 = !{i32 1, !"NumRegisterParameters", i32 0}
!1012 = !{i32 2, !"CodeView", i32 1}
!1013 = !{i32 2, !"Debug Info Version", i32 3}
!1014 = !{i32 1, !"wchar_size", i32 2}
!1015 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!1016 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "?copy_memory_helper@Internal@Runtime@Halide@@YAXABUdevice_copy@123@H_J1@Z", scope: !3, file: !1017, line: 47, type: !1018, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !638, retainedNodes: !1034)
!1017 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "01ded04610775bfbd39cee48a3f67c54")
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !1020, !14, !713, !713}
!1020 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1021, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !1017, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !1023, identifier: ".?AUdevice_copy@Internal@Runtime@Halide@@")
!1023 = !{!1024, !1025, !1026, !1027, !1031, !1032, !1033}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1022, file: !1017, line: 35, baseType: !40, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !1022, file: !1017, line: 35, baseType: !40, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !1022, file: !1017, line: 37, baseType: !40, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !1022, file: !1017, line: 39, baseType: !1028, size: 1024, offset: 192)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 16)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !1022, file: !1017, line: 41, baseType: !1028, size: 1024, offset: 1216)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !1022, file: !1017, line: 42, baseType: !1028, size: 1024, offset: 2240)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1022, file: !1017, line: 44, baseType: !40, size: 64, offset: 3264)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1042, !1043}
!1035 = !DILocalVariable(name: "dst_off", arg: 4, scope: !1016, file: !1017, line: 47, type: !713)
!1036 = !DILocalVariable(name: "src_off", arg: 3, scope: !1016, file: !1017, line: 47, type: !713)
!1037 = !DILocalVariable(name: "d", arg: 2, scope: !1016, file: !1017, line: 47, type: !14)
!1038 = !DILocalVariable(name: "copy", arg: 1, scope: !1016, file: !1017, line: 47, type: !1020)
!1039 = !DILocalVariable(name: "from", scope: !1040, file: !1017, line: 54, type: !87)
