; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma_pool.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma_pool.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::HexagonDma::hexagon_dma_pool_t" = type { [8 x %"struct.Halide::Runtime::Internal::HexagonDma::hexagon_dma_engine_t"], [8 x %"struct.Halide::Runtime::Internal::HexagonDma::hexagon_dma_virtual_engine_t"] }
%"struct.Halide::Runtime::Internal::HexagonDma::hexagon_dma_engine_t" = type { i8, i8, i8* }
%"struct.Halide::Runtime::Internal::HexagonDma::hexagon_dma_virtual_engine_t" = type { i8, i8, [4 x i8] }
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>

@_ZN6Halide7Runtime8Internal10HexagonDma16hexagon_dma_poolE = weak dso_local local_unnamed_addr global %"struct.Halide::Runtime::Internal::HexagonDma::hexagon_dma_pool_t"* null, align 8, !dbg !0
@_ZN6Halide7Runtime8Internal10HexagonDma22hexagon_dma_pool_mutexE = weak dso_local global %struct.halide_mutex zeroinitializer, align 8, !dbg !37

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hexagon_dma_pool", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma16hexagon_dma_poolE", scope: !2, file: !6, line: 32, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "HexagonDma", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_dma_pool.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "hexagon_dma_pool_t", scope: !2, file: !6, line: 30, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !6, line: 27, size: 1408, flags: DIFlagTypePassByValue, elements: !10, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma18hexagon_dma_pool_tE")
!10 = !{!11, !23}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "dma_engine_list", scope: !9, file: !6, line: 28, baseType: !12, size: 1024)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !21)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "hexagon_dma_engine_t", scope: !2, file: !6, line: 25, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !6, line: 21, size: 128, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma20hexagon_dma_engine_tE")
!15 = !{!16, !18, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !14, file: !6, line: 22, baseType: !17, size: 8)
!17 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "assigned", scope: !14, file: !6, line: 23, baseType: !17, size: 8, offset: 8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "engine_addr", scope: !14, file: !6, line: 24, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !{!22}
!22 = !DISubrange(count: 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_engine_list", scope: !9, file: !6, line: 29, baseType: !24, size: 384, offset: 1024)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 384, elements: !21)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "hexagon_dma_virtual_engine_t", scope: !2, file: !6, line: 19, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !6, line: 15, size: 48, flags: DIFlagTypePassByValue, elements: !27, identifier: "_ZTSN6Halide7Runtime8Internal10HexagonDma28hexagon_dma_virtual_engine_tE")
!27 = !{!28, !29, !33}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !26, file: !6, line: 16, baseType: !17, size: 8)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_engines", scope: !26, file: !6, line: 17, baseType: !30, size: 8, offset: 8)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 16, baseType: !32)
!31 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_engines", scope: !26, file: !6, line: 18, baseType: !34, size: 32, offset: 16)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 4)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "hexagon_dma_pool_mutex", linkageName: "_ZN6Halide7Runtime8Internal10HexagonDma22hexagon_dma_pool_mutexE", scope: !2, file: !6, line: 33, type: !39, isLocal: false, isDefinition: true)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !40, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !41, identifier: "_ZTS12halide_mutex")
!40 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !39, file: !40, line: 121, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !47)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 61, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 10, baseType: !46)
!46 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!47 = !{!48}
!48 = !DISubrange(count: 1)
!49 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !50, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !51, retainedTypes: !112, globals: !235, imports: !236, splitDebugInlining: false, nameTableKind: None)
!50 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_dma_pool.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!51 = !{!52, !100, !105}
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !40, line: 990, baseType: !53, size: 32, elements: !54, identifier: "_ZTS19halide_error_code_t")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!55 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!56 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!57 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!58 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!59 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!60 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!61 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!62 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!63 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!64 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!65 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!66 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!67 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!68 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!69 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!70 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!71 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!72 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!73 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!74 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!75 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!76 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!77 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!78 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!79 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!80 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!81 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!82 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!83 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!84 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!85 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!86 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!87 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!88 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!89 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!90 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!91 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!92 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!93 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!94 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!95 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!96 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!97 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!98 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!99 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 23, baseType: !102, size: 32, align: 32, elements: !103)
!101 = !DIFile(filename: "src/runtime/mini_hexagon_dma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !{!104}
!104 = !DIEnumerator(name: "QURT_EOK", value: 0, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !40, line: 403, baseType: !30, size: 8, elements: !106, identifier: "_ZTS18halide_type_code_t")
!106 = !{!107, !108, !109, !110, !111}
!107 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!108 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!110 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!111 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!112 = !{!113, !114, !115, !7, !20, !121}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_DmaWrapper_DmaEngineHandle", file: !101, line: 168, baseType: !20)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !117, file: !116, line: 199, baseType: !118)
!116 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!117 = !DINamespace(scope: !3)
!118 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !117, file: !116, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !119, templateParams: !232)
!119 = !{!120, !123, !124, !125, !126, !127, !129, !133, !139, !144, !148, !151, !155, !159, !163, !168, !174, !207, !214, !217, !220, !225, !226, !229, !230, !231}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !118, file: !116, line: 32, baseType: !121, size: 64, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !118, file: !116, line: 32, baseType: !121, size: 64, offset: 64, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !118, file: !116, line: 32, baseType: !121, size: 64, offset: 128, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !118, file: !116, line: 33, baseType: !20, size: 64, offset: 192, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !118, file: !116, line: 34, baseType: !17, size: 8, offset: 256, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !118, file: !116, line: 35, baseType: !128, size: 8, offset: 264, flags: DIFlagPublic)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 8, elements: !47)
!129 = !DISubprogram(name: "Printer", scope: !118, file: !116, line: 37, type: !130, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !132, !20, !121}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!133 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !118, file: !116, line: 57, type: !134, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !132, !137}
!136 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !118, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!139 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !118, file: !116, line: 67, type: !140, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!140 = !DISubroutineType(types: !141)
!141 = !{!136, !132, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !31, line: 9, baseType: !143)
!143 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!144 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !118, file: !116, line: 72, type: !145, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{!136, !132, !147}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !31, line: 11, baseType: !53)
!148 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !118, file: !116, line: 77, type: !149, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!149 = !DISubroutineType(types: !150)
!150 = !{!136, !132, !45}
!151 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !118, file: !116, line: 82, type: !152, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DISubroutineType(types: !153)
!153 = !{!136, !132, !154}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 12, baseType: !102)
!155 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !118, file: !116, line: 87, type: !156, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DISubroutineType(types: !157)
!157 = !{!136, !132, !158}
!158 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!159 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !118, file: !116, line: 92, type: !160, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubroutineType(types: !161)
!161 = !{!136, !132, !162}
!162 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!163 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !118, file: !116, line: 97, type: !164, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!164 = !DISubroutineType(types: !165)
!165 = !{!136, !132, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!168 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !118, file: !116, line: 102, type: !169, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{!136, !132, !171}
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 14, baseType: !173)
!173 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!174 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !118, file: !116, line: 108, type: !175, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{!136, !132, !177}
!177 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !40, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !180, identifier: "_ZTS13halide_type_t")
!180 = !{!181, !183, !184, !185, !189, !192, !196, !199, !200, !201, !204}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !179, file: !40, line: 434, baseType: !182, size: 8, align: 8)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !40, line: 413, baseType: !105)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !179, file: !40, line: 442, baseType: !30, size: 8, align: 8, offset: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !179, file: !40, line: 446, baseType: !172, size: 16, align: 16, offset: 16)
!185 = !DISubprogram(name: "halide_type_t", scope: !179, file: !40, line: 453, type: !186, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !188, !182, !30, !172}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!189 = !DISubprogram(name: "halide_type_t", scope: !179, file: !40, line: 459, type: !190, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !188}
!192 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !179, file: !40, line: 463, type: !193, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubroutineType(types: !194)
!194 = !{!179, !195, !172}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!196 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !179, file: !40, line: 468, type: !197, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!197 = !DISubroutineType(types: !198)
!198 = !{!17, !195, !177}
!199 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !179, file: !40, line: 472, type: !197, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !179, file: !40, line: 476, type: !197, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!201 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !179, file: !40, line: 481, type: !202, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubroutineType(types: !203)
!203 = !{!53, !195}
!204 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !179, file: !40, line: 485, type: !205, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{!154, !195}
!207 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !118, file: !116, line: 113, type: !208, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!208 = !DISubroutineType(types: !209)
!209 = !{!136, !132, !210}
!210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !40, line: 1550, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !40, line: 1423, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15halide_buffer_t")
!214 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !118, file: !116, line: 119, type: !215, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubroutineType(types: !216)
!216 = !{!137, !132}
!217 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !118, file: !116, line: 131, type: !218, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !132}
!220 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !118, file: !116, line: 139, type: !221, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{!45, !223}
