; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_profiler.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_profiler.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-windows-msvc19.11.0"

%struct.halide_profiler_state = type { %struct.halide_mutex, i32, i32, i32, i32, %struct.halide_profiler_pipeline_stats*, void (i32*, i32*)*, %struct.halide_thread* }
%struct.halide_mutex = type { [1 x i64] }
%struct.halide_profiler_pipeline_stats = type { i64, i64, i64, i64, i64, i64, i8*, %struct.halide_profiler_func_stats*, i8*, i32, i32, i32, i32, i32, [4 x i8] }
%struct.halide_profiler_func_stats = type { i64, i64, i64, i64, i64, i64, i64, i8*, i32, [4 x i8] }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type { i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }

$"??_C@_0HC@NOIAIGCC@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0HC@MJAJLJCF@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0GM@GJMNAOKK@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0HM@KEKFGDCE@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0HC@PMOKBCNB@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0GM@CDNILHME@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s", scope: !2, file: !3, line: 12, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "halide_profiler_get_state", scope: !3, file: !3, line: 11, type: !4, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !96)
!3 = !DIFile(filename: "src/runtime/profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "900600451b4b8bae854b3e4a030fb5c9")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_state", file: !8, line: 1766, size: 384, flags: DIFlagTypePassByValue, elements: !9, identifier: ".?AUhalide_profiler_state@@")
!8 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!9 = !{!10, !21, !23, !24, !25, !26, !60, !65}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !7, file: !8, line: 1770, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !8, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !12, identifier: ".?AUhalide_mutex@@")
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !11, file: !8, line: 121, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !19)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 61, baseType: !17)
!16 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "0c7b3d8a4f3a5581b3edea53998e0f01")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 10, baseType: !18)
!18 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !{!20}
!20 = !DISubrange(count: 1)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_time", scope: !7, file: !8, line: 1774, baseType: !22, size: 32, offset: 64)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "first_free_id", scope: !7, file: !8, line: 1777, baseType: !22, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "current_func", scope: !7, file: !8, line: 1781, baseType: !22, size: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads", scope: !7, file: !8, line: 1784, baseType: !22, size: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pipelines", scope: !7, file: !8, line: 1787, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_pipeline_stats", file: !8, line: 1721, size: 768, flags: DIFlagTypePassByValue, elements: !29, identifier: ".?AUhalide_profiler_pipeline_stats@@")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !40, !53, !55, !56, !57, !58, !59}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !28, file: !8, line: 1723, baseType: !17, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !28, file: !8, line: 1726, baseType: !17, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !28, file: !8, line: 1729, baseType: !17, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !28, file: !8, line: 1732, baseType: !17, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !28, file: !8, line: 1736, baseType: !17, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !28, file: !8, line: 1736, baseType: !17, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !8, line: 1739, baseType: !37, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !28, file: !8, line: 1742, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_func_stats", file: !8, line: 1693, size: 576, flags: DIFlagTypePassByValue, elements: !43, identifier: ".?AUhalide_profiler_func_stats@@")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !42, file: !8, line: 1695, baseType: !17, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !42, file: !8, line: 1698, baseType: !17, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !42, file: !8, line: 1701, baseType: !17, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !42, file: !8, line: 1704, baseType: !17, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stack_peak", scope: !42, file: !8, line: 1707, baseType: !17, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !42, file: !8, line: 1710, baseType: !17, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !42, file: !8, line: 1710, baseType: !17, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !8, line: 1713, baseType: !37, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !42, file: !8, line: 1716, baseType: !22, size: 32, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !8, line: 1746, baseType: !54, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num_funcs", scope: !28, file: !8, line: 1749, baseType: !22, size: 32, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "first_func_id", scope: !28, file: !8, line: 1752, baseType: !22, size: 32, offset: 608)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "runs", scope: !28, file: !8, line: 1755, baseType: !22, size: 32, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !28, file: !8, line: 1758, baseType: !22, size: 32, offset: 672)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !28, file: !8, line: 1761, baseType: !22, size: 32, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "get_remote_profiler_state", scope: !7, file: !8, line: 1792, baseType: !61, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_thread", scope: !7, file: !8, line: 1795, baseType: !66, size: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AUhalide_thread@@")
!68 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !69, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !84, globals: !86, imports: !91, splitDebugInlining: false, nameTableKind: None)
!69 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "3382dfd7821992c2e028aabed8bd4d40")
!70 = !{!71, !75}
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 1799, baseType: !22, size: 32, elements: !72, identifier: ".?AW4<unnamed-enum-halide_profiler_outside_of_halide>@@")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "halide_profiler_outside_of_halide", value: -1)
!74 = !DIEnumerator(name: "halide_profiler_please_stop", value: -2)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !8, line: 403, baseType: !76, size: 8, elements: !78, identifier: ".?AW4halide_type_code_t@@")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 16, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!84 = !{!27, !41, !37, !6, !85, !17}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!86 = !{!0, !87, !89}
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression(DW_OP_constu, 18446744073709551614, DW_OP_stack_value))
!88 = distinct !DIGlobalVariable(name: "halide_profiler_please_stop", scope: !68, file: !8, line: 1805, type: !71, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!90 = distinct !DIGlobalVariable(name: "halide_profiler_outside_of_halide", scope: !68, file: !8, line: 1801, type: !71, isLocal: true, isDefinition: true)
!91 = !{!92}
!92 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !68, entity: !93, file: !16, line: 225)
!93 = !DINamespace(name: "Internal", scope: !94)
!94 = !DINamespace(name: "Runtime", scope: !95)
!95 = !DINamespace(name: "Halide", scope: null)
!96 = !{}
!97 = !{i32 2, !"CodeView", i32 1}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{i32 1, !"wchar_size", i32 4}
!100 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!101 = !DILocation(line: 13, scope: !2)
!102 = distinct !DISubprogram(name: "find_or_create_pipeline", linkageName: "?find_or_create_pipeline@Internal@Runtime@Halide@@YAPEAUhalide_profiler_pipeline_stats@@PEBDHPEB_K@Z", scope: !93, file: !3, line: 21, type: !103, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !107)
!103 = !DISubroutineType(types: !104)
!104 = !{!27, !37, !22, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!107 = !{!108, !109, !110, !111, !112, !114, !115}
!108 = !DILocalVariable(name: "func_names", arg: 3, scope: !102, file: !3, line: 21, type: !105)
!109 = !DILocalVariable(name: "num_funcs", arg: 2, scope: !102, file: !3, line: 21, type: !22)
!110 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !102, file: !3, line: 21, type: !37)
!111 = !DILocalVariable(name: "s", scope: !102, file: !3, line: 22, type: !6)
!112 = !DILocalVariable(name: "p", scope: !113, file: !3, line: 24, type: !27)
!113 = distinct !DILexicalBlock(scope: !102, file: !3, line: 24)
!114 = !DILocalVariable(name: "p", scope: !102, file: !3, line: 34, type: !27)
!115 = !DILocalVariable(name: "i", scope: !116, file: !3, line: 57, type: !22)
!116 = distinct !DILexicalBlock(scope: !102, file: !3, line: 57)
!117 = !DILocation(line: 0, scope: !102)
!118 = !DILocation(line: 22, scope: !102)
!119 = !DILocation(line: 24, scope: !113)
!120 = !DILocation(line: 0, scope: !113)
!121 = !{!122, !122, i64 0}
!122 = !{!"any pointer", !123, i64 0}
!123 = !{!"omnipotent char", !124, i64 0}
!124 = !{!"Simple C++ TBAA"}
!125 = !DILocation(line: 28, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !3, line: 25)
!127 = distinct !DILexicalBlock(scope: !113, file: !3, line: 24)
!128 = !{!129, !122, i64 48}
!129 = !{!"?AUhalide_profiler_pipeline_stats@@", !130, i64 0, !130, i64 8, !130, i64 16, !130, i64 24, !130, i64 32, !130, i64 40, !122, i64 48, !122, i64 56, !122, i64 64, !131, i64 72, !131, i64 76, !131, i64 80, !131, i64 84, !131, i64 88}
!130 = !{!"long long", !123, i64 0}
!131 = !{!"int", !123, i64 0}
!132 = !{!129, !131, i64 72}
!133 = !DILocation(line: 25, scope: !127)
!134 = distinct !{!134, !119, !135, !136}
!135 = !DILocation(line: 32, scope: !113)
!136 = !{!"llvm.loop.mustprogress"}
!137 = !DILocation(line: 34, scope: !102)
!138 = !DILocation(line: 36, scope: !102)
!139 = !DILocation(line: 39, scope: !102)
!140 = !{!141, !122, i64 24}
!141 = !{!"?AUhalide_profiler_state@@", !142, i64 0, !131, i64 8, !131, i64 12, !131, i64 16, !131, i64 20, !122, i64 24, !122, i64 32, !122, i64 40}
!142 = !{!"?AUhalide_mutex@@", !123, i64 0}
!143 = !{!129, !122, i64 64}
!144 = !DILocation(line: 40, scope: !102)
!145 = !DILocation(line: 41, scope: !102)
!146 = !{!141, !131, i64 12}
!147 = !{!129, !131, i64 76}
!148 = !DILocation(line: 42, scope: !102)
!149 = !DILocation(line: 43, scope: !102)
!150 = !{!129, !131, i64 80}
!151 = !DILocation(line: 44, scope: !102)
!152 = !{!129, !130, i64 0}
!153 = !DILocation(line: 45, scope: !102)
!154 = !{!129, !131, i64 84}
!155 = !DILocation(line: 46, scope: !102)
!156 = !{!129, !130, i64 8}
!157 = !DILocation(line: 47, scope: !102)
!158 = !{!129, !130, i64 16}
!159 = !DILocation(line: 48, scope: !102)
!160 = !{!129, !130, i64 24}
!161 = !DILocation(line: 49, scope: !102)
!162 = !{!129, !131, i64 88}
!163 = !DILocation(line: 50, scope: !102)
!164 = !{!129, !130, i64 32}
!165 = !DILocation(line: 51, scope: !102)
!166 = !{!129, !130, i64 40}
!167 = !DILocation(line: 52, scope: !102)
!168 = !{!129, !122, i64 56}
!169 = !DILocation(line: 53, scope: !102)
!170 = !DILocation(line: 0, scope: !116)
!171 = !DILocation(line: 57, scope: !116)
!172 = !DILocation(line: 54, scope: !173)
!173 = distinct !DILexicalBlock(scope: !174, file: !3, line: 53)
!174 = distinct !DILexicalBlock(scope: !102, file: !3, line: 53)
!175 = !DILocation(line: 55, scope: !173)
!176 = !DILocation(line: 68, scope: !102)
!177 = !DILocation(line: 69, scope: !102)
!178 = !DILocation(line: 70, scope: !102)
!179 = !DILocation(line: 58, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 57)
!181 = distinct !DILexicalBlock(scope: !116, file: !3, line: 57)
!182 = !{!183, !130, i64 0}
!183 = !{!"?AUhalide_profiler_func_stats@@", !130, i64 0, !130, i64 8, !130, i64 16, !130, i64 24, !130, i64 32, !130, i64 40, !130, i64 48, !122, i64 56, !131, i64 64}
!184 = !DILocation(line: 59, scope: !180)
!185 = !{!130, !130, i64 0}
!186 = !{!183, !122, i64 56}
!187 = !DILocation(line: 60, scope: !180)
!188 = !{!183, !130, i64 8}
!189 = !DILocation(line: 61, scope: !180)
!190 = !{!183, !130, i64 16}
!191 = !DILocation(line: 62, scope: !180)
!192 = !{!183, !130, i64 24}
!193 = !DILocation(line: 63, scope: !180)
!194 = !{!183, !131, i64 64}
!195 = !DILocation(line: 64, scope: !180)
!196 = !{!183, !130, i64 32}
!197 = !DILocation(line: 65, scope: !180)
!198 = !{!183, !130, i64 40}
!199 = !DILocation(line: 66, scope: !180)
!200 = !{!183, !130, i64 48}
!201 = !DILocation(line: 57, scope: !181)
!202 = distinct !{!202, !171, !203, !136}
!203 = !DILocation(line: 67, scope: !116)
!204 = !DILocation(line: 71, scope: !102)
!205 = distinct !DISubprogram(name: "bill_func", linkageName: "?bill_func@Internal@Runtime@Halide@@YAXPEAUhalide_profiler_state@@H_KH@Z", scope: !93, file: !3, line: 73, type: !206, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !6, !22, !17, !22}
!208 = !{!209, !210, !211, !212, !213, !214, !216}
!209 = !DILocalVariable(name: "active_threads", arg: 4, scope: !205, file: !3, line: 73, type: !22)
!210 = !DILocalVariable(name: "time", arg: 3, scope: !205, file: !3, line: 73, type: !17)
!211 = !DILocalVariable(name: "func_id", arg: 2, scope: !205, file: !3, line: 73, type: !22)
!212 = !DILocalVariable(name: "s", arg: 1, scope: !205, file: !3, line: 73, type: !6)
!213 = !DILocalVariable(name: "p_prev", scope: !205, file: !3, line: 74, type: !27)
!214 = !DILocalVariable(name: "p", scope: !215, file: !3, line: 75, type: !27)
!215 = distinct !DILexicalBlock(scope: !205, file: !3, line: 75)
!216 = !DILocalVariable(name: "f", scope: !217, file: !3, line: 84, type: !41)
!217 = distinct !DILexicalBlock(scope: !218, file: !3, line: 77)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 77)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 76)
!220 = distinct !DILexicalBlock(scope: !215, file: !3, line: 75)
!221 = !DILocation(line: 0, scope: !205)
!222 = !DILocation(line: 75, scope: !215)
!223 = !DILocation(line: 0, scope: !215)
!224 = !DILocation(line: 77, scope: !219)
!225 = !DILocation(line: 78, scope: !217)
!226 = !DILocation(line: 80, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 78)
!228 = distinct !DILexicalBlock(scope: !217, file: !3, line: 78)
!229 = !DILocation(line: 81, scope: !227)
!230 = !DILocation(line: 82, scope: !227)
!231 = !DILocation(line: 83, scope: !227)
!232 = !DILocation(line: 84, scope: !217)
!233 = !DILocation(line: 0, scope: !217)
!234 = !DILocation(line: 85, scope: !217)
!235 = !DILocation(line: 86, scope: !217)
!236 = !DILocation(line: 87, scope: !217)
!237 = !DILocation(line: 88, scope: !217)
!238 = !DILocation(line: 89, scope: !217)
!239 = !DILocation(line: 90, scope: !217)
!240 = !DILocation(line: 91, scope: !217)
!241 = !DILocation(line: 76, scope: !220)
!242 = distinct !{!242, !222, !243, !136}
!243 = !DILocation(line: 95, scope: !215)
!244 = !DILocation(line: 97, scope: !205)
!245 = distinct !DISubprogram(name: "sampling_profiler_thread", linkageName: "?sampling_profiler_thread@Internal@Runtime@Halide@@YAXPEAX@Z", scope: !93, file: !3, line: 99, type: !246, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !248)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !54}
!248 = !{!249, !250, !251, !253, !254, !256, !257, !258}
!249 = !DILocalVariable(arg: 1, scope: !245, file: !3, line: 99, type: !54)
!250 = !DILocalVariable(name: "s", scope: !245, file: !3, line: 100, type: !6)
!251 = !DILocalVariable(name: "t1", scope: !252, file: !3, line: 107, type: !17)
!252 = distinct !DILexicalBlock(scope: !245, file: !3, line: 105)
!253 = !DILocalVariable(name: "t", scope: !252, file: !3, line: 108, type: !17)
!254 = !DILocalVariable(name: "func", scope: !255, file: !3, line: 110, type: !22)
!255 = distinct !DILexicalBlock(scope: !252, file: !3, line: 109)
!256 = !DILocalVariable(name: "active_threads", scope: !255, file: !3, line: 110, type: !22)
!257 = !DILocalVariable(name: "t_now", scope: !255, file: !3, line: 119, type: !17)
!258 = !DILocalVariable(name: "sleep_ms", scope: !255, file: !3, line: 130, type: !22)
!259 = !DILocation(line: 0, scope: !245)
!260 = !DILocation(line: 100, scope: !245)
!261 = !DILocation(line: 103, scope: !245)
!262 = !DILocation(line: 105, scope: !245)
!263 = !{!141, !131, i64 16}
!264 = !DILocation(line: 0, scope: !252)
!265 = !DILocation(line: 134, scope: !255)
!266 = distinct !{!266, !262, !267, !136}
!267 = !DILocation(line: 135, scope: !245)
!268 = !DILocation(line: 107, scope: !252)
!269 = !DILocation(line: 109, scope: !252)
!270 = !DILocation(line: 108, scope: !252)
!271 = !DILocation(line: 110, scope: !255)
!272 = !DILocation(line: 111, scope: !255)
!273 = !{!141, !122, i64 32}
!274 = !DILocation(line: 0, scope: !255)
!275 = !DILocation(line: 114, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 111)
!277 = distinct !DILexicalBlock(scope: !255, file: !3, line: 111)
!278 = !DILocation(line: 115, scope: !276)
!279 = !DILocation(line: 116, scope: !280)
!280 = distinct !DILexicalBlock(scope: !277, file: !3, line: 115)
!281 = !{!131, !131, i64 0}
!282 = !DILocation(line: 117, scope: !280)
!283 = !{!141, !131, i64 20}
!284 = !DILocation(line: 118, scope: !280)
!285 = !DILocation(line: 119, scope: !255)
!286 = !DILocation(line: 120, scope: !255)
!287 = !DILocation(line: 122, scope: !288)
!288 = distinct !DILexicalBlock(scope: !255, file: !3, line: 120)
!289 = !DILocation(line: 125, scope: !290)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 122)
!291 = distinct !DILexicalBlock(scope: !288, file: !3, line: 122)
!292 = !DILocation(line: 126, scope: !290)
!293 = !DILocation(line: 130, scope: !255)
!294 = !{!141, !131, i64 8}
!295 = !DILocation(line: 131, scope: !255)
!296 = !DILocation(line: 132, scope: !255)
!297 = !DILocation(line: 133, scope: !255)
!298 = !DILocation(line: 137, scope: !245)
!299 = !DILocation(line: 138, scope: !245)
!300 = distinct !DISubprogram(name: "halide_profiler_get_pipeline_state", scope: !3, file: !3, line: 162, type: !301, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{!27, !37}
!303 = !{!304, !305, !306, !319}
!304 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !300, file: !3, line: 162, type: !37)
!305 = !DILocalVariable(name: "s", scope: !300, file: !3, line: 163, type: !6)
!306 = !DILocalVariable(name: "lock", scope: !300, file: !3, line: 165, type: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedMutexLock", scope: !93, file: !308, line: 11, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !309, identifier: ".?AUScopedMutexLock@Internal@Runtime@Halide@@")
!308 = !DIFile(filename: "src/runtime/scoped_mutex_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "642ccaf34ebe2e8cca3ae0e35e43768c")
!309 = !{!310, !312, !316}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !307, file: !308, line: 12, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!312 = !DISubprogram(name: "ScopedMutexLock", scope: !307, file: !308, line: 14, type: !313, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !311}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!316 = !DISubprogram(name: "~ScopedMutexLock", scope: !307, file: !308, line: 19, type: !317, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !315}
!319 = !DILocalVariable(name: "p", scope: !320, file: !3, line: 167, type: !27)
!320 = distinct !DILexicalBlock(scope: !300, file: !3, line: 167)
!321 = !DILocation(line: 0, scope: !300)
!322 = !DILocation(line: 163, scope: !300)
!323 = !DILocation(line: 165, scope: !300)
!324 = !DILocalVariable(name: "mutex", arg: 2, scope: !325, file: !308, line: 14, type: !311)
!325 = distinct !DISubprogram(name: "ScopedMutexLock", linkageName: "??0ScopedMutexLock@Internal@Runtime@Halide@@QEAA@PEAUhalide_mutex@@@Z", scope: !307, file: !308, line: 14, type: !313, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, declaration: !312, retainedNodes: !326)
!326 = !{!324, !327}
!327 = !DILocalVariable(name: "this", arg: 1, scope: !325, type: !328, flags: DIFlagArtificial | DIFlagObjectPointer)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!329 = !DILocation(line: 0, scope: !325, inlinedAt: !330)
!330 = distinct !DILocation(line: 165, scope: !300)
!331 = !DILocation(line: 16, scope: !332, inlinedAt: !330)
!332 = distinct !DILexicalBlock(scope: !325, file: !308, line: 15)
!333 = !DILocation(line: 167, scope: !320)
!334 = !DILocation(line: 0, scope: !320)
!335 = !DILocation(line: 171, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !3, line: 168)
!337 = distinct !DILexicalBlock(scope: !320, file: !3, line: 167)
!338 = !DILocation(line: 168, scope: !337)
!339 = distinct !{!339, !333, !340, !136}
!340 = !DILocation(line: 174, scope: !320)
!341 = !DILocalVariable(name: "this", arg: 1, scope: !342, type: !328, flags: DIFlagArtificial | DIFlagObjectPointer)
!342 = distinct !DISubprogram(name: "~ScopedMutexLock", linkageName: "??1ScopedMutexLock@Internal@Runtime@Halide@@QEAA@XZ", scope: !307, file: !308, line: 19, type: !317, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, declaration: !316, retainedNodes: !343)
!343 = !{!341}
!344 = !DILocation(line: 0, scope: !342, inlinedAt: !345)
!345 = distinct !DILocation(line: 176, scope: !300)
!346 = !DILocation(line: 20, scope: !347, inlinedAt: !345)
!347 = distinct !DILexicalBlock(scope: !342, file: !308, line: 19)
!348 = !DILocation(line: 176, scope: !300)
!349 = distinct !DISubprogram(name: "halide_profiler_pipeline_start", scope: !3, file: !3, line: 179, type: !350, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{!22, !54, !37, !22, !105}
!352 = !{!353, !354, !355, !356, !357, !358, !359}
!353 = !DILocalVariable(name: "func_names", arg: 4, scope: !349, file: !3, line: 182, type: !105)
!354 = !DILocalVariable(name: "num_funcs", arg: 3, scope: !349, file: !3, line: 181, type: !22)
!355 = !DILocalVariable(name: "pipeline_name", arg: 2, scope: !349, file: !3, line: 180, type: !37)
!356 = !DILocalVariable(name: "user_context", arg: 1, scope: !349, file: !3, line: 179, type: !54)
!357 = !DILocalVariable(name: "s", scope: !349, file: !3, line: 183, type: !6)
!358 = !DILocalVariable(name: "lock", scope: !349, file: !3, line: 185, type: !307)
!359 = !DILocalVariable(name: "p", scope: !349, file: !3, line: 192, type: !27)
!360 = !DILocation(line: 0, scope: !349)
!361 = !DILocation(line: 183, scope: !349)
!362 = !DILocation(line: 185, scope: !349)
!363 = !DILocation(line: 0, scope: !325, inlinedAt: !364)
!364 = distinct !DILocation(line: 185, scope: !349)
!365 = !DILocation(line: 16, scope: !332, inlinedAt: !364)
!366 = !DILocation(line: 187, scope: !349)
!367 = !{!141, !122, i64 40}
!368 = !DILocation(line: 188, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !3, line: 187)
!370 = distinct !DILexicalBlock(scope: !349, file: !3, line: 187)
!371 = !DILocation(line: 189, scope: !369)
!372 = !DILocation(line: 190, scope: !369)
!373 = !DILocation(line: 192, scope: !349)
!374 = !DILocation(line: 194, scope: !349)
!375 = !DILocation(line: 196, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 194)
!377 = distinct !DILexicalBlock(scope: !349, file: !3, line: 194)
!378 = !DILocation(line: 198, scope: !349)
!379 = !DILocation(line: 200, scope: !349)
!380 = !DILocation(line: 0, scope: !342, inlinedAt: !381)
!381 = distinct !DILocation(line: 201, scope: !349)
!382 = !DILocation(line: 20, scope: !347, inlinedAt: !381)
!383 = !DILocation(line: 201, scope: !349)
!384 = distinct !DISubprogram(name: "halide_profiler_stack_peak_update", scope: !3, file: !3, line: 203, type: !385, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !388)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !54, !54, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DILocalVariable(name: "f_values", arg: 3, scope: !384, file: !3, line: 205, type: !387)
!390 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !384, file: !3, line: 204, type: !54)
!391 = !DILocalVariable(name: "user_context", arg: 1, scope: !384, file: !3, line: 203, type: !54)
!392 = !DILocalVariable(name: "p_stats", scope: !384, file: !3, line: 206, type: !27)
!393 = !DILocalVariable(name: "i", scope: !394, file: !3, line: 216, type: !22)
!394 = distinct !DILexicalBlock(scope: !384, file: !3, line: 216)
!395 = !DILocation(line: 0, scope: !384)
!396 = !DILocation(line: 207, scope: !397)
!397 = distinct !DILexicalBlock(scope: !384, file: !3, line: 207)
!398 = !DILocation(line: 207, scope: !399)
!399 = distinct !DILexicalBlock(scope: !400, file: !3, line: 207)
!400 = distinct !DILexicalBlock(scope: !397, file: !3, line: 207)
!401 = !DILocation(line: 0, scope: !394)
!402 = !DILocation(line: 216, scope: !394)
!403 = !DILocation(line: 221, scope: !384)
!404 = !DILocation(line: 217, scope: !405)
!405 = distinct !DILexicalBlock(scope: !406, file: !3, line: 216)
!406 = distinct !DILexicalBlock(scope: !394, file: !3, line: 216)
!407 = !DILocation(line: 218, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !3, line: 217)
!409 = distinct !DILexicalBlock(scope: !405, file: !3, line: 217)
!410 = !DILocalVariable(name: "val", arg: 2, scope: !411, file: !3, line: 147, type: !18)
!411 = distinct !DISubprogram(name: "sync_compare_max_and_swap<unsigned long long>", linkageName: "??$sync_compare_max_and_swap@_K@?A0x3E95B2E2@@YAXPEA_K_K@Z", scope: !412, file: !3, line: 147, type: !413, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !68, templateParams: !421, retainedNodes: !416)
!412 = !DINamespace(scope: null)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !415, !18}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!416 = !{!410, !417, !418, !419}
!417 = !DILocalVariable(name: "ptr", arg: 1, scope: !411, file: !3, line: 147, type: !415)
!418 = !DILocalVariable(name: "old_val", scope: !411, file: !3, line: 148, type: !18)
!419 = !DILocalVariable(name: "temp", scope: !420, file: !3, line: 150, type: !18)
!420 = distinct !DILexicalBlock(scope: !411, file: !3, line: 149)
!421 = !{!422}
!422 = !DITemplateTypeParameter(name: "T", type: !18)
!423 = !DILocation(line: 0, scope: !411, inlinedAt: !424)
!424 = distinct !DILocation(line: 218, scope: !408)
!425 = !DILocation(line: 148, scope: !411, inlinedAt: !424)
!426 = !DILocation(line: 149, scope: !411, inlinedAt: !424)
!427 = !DILocation(line: 0, scope: !420, inlinedAt: !424)
!428 = !DILocation(line: 151, scope: !420, inlinedAt: !424)
!429 = !DILocation(line: 152, scope: !420, inlinedAt: !424)
!430 = distinct !{!430, !426, !431, !136}
!431 = !DILocation(line: 155, scope: !411, inlinedAt: !424)
!432 = !DILocation(line: 216, scope: !406)
!433 = distinct !{!433, !402, !434, !136}
!434 = !DILocation(line: 220, scope: !394)
!435 = distinct !DISubprogram(name: "halide_profiler_memory_allocate", scope: !3, file: !3, line: 223, type: !436, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !54, !54, !22, !17}
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446}
!439 = !DILocalVariable(name: "incr", arg: 4, scope: !435, file: !3, line: 226, type: !17)
!440 = !DILocalVariable(name: "func_id", arg: 3, scope: !435, file: !3, line: 225, type: !22)
!441 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !435, file: !3, line: 224, type: !54)
!442 = !DILocalVariable(name: "user_context", arg: 1, scope: !435, file: !3, line: 223, type: !54)
!443 = !DILocalVariable(name: "p_stats", scope: !435, file: !3, line: 233, type: !27)
!444 = !DILocalVariable(name: "f_stats", scope: !435, file: !3, line: 238, type: !41)
!445 = !DILocalVariable(name: "p_mem_current", scope: !435, file: !3, line: 249, type: !17)
!446 = !DILocalVariable(name: "f_mem_current", scope: !435, file: !3, line: 255, type: !17)
!447 = !DILocation(line: 0, scope: !435)
!448 = !DILocation(line: 229, scope: !435)
!449 = !DILocation(line: 234, scope: !450)
!450 = distinct !DILexicalBlock(scope: !435, file: !3, line: 234)
!451 = !DILocation(line: 234, scope: !452)
!452 = distinct !DILexicalBlock(scope: !453, file: !3, line: 234)
!453 = distinct !DILexicalBlock(scope: !450, file: !3, line: 234)
!454 = !DILocation(line: 235, scope: !455)
!455 = distinct !DILexicalBlock(scope: !435, file: !3, line: 235)
!456 = !DILocation(line: 235, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !3, line: 235)
!458 = distinct !DILexicalBlock(scope: !455, file: !3, line: 235)
!459 = !DILocation(line: 236, scope: !460)
!460 = distinct !DILexicalBlock(scope: !435, file: !3, line: 236)
!461 = !DILocation(line: 236, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !3, line: 236)
!463 = distinct !DILexicalBlock(scope: !460, file: !3, line: 236)
!464 = !DILocation(line: 238, scope: !435)
!465 = !DILocation(line: 247, scope: !435)
!466 = !DILocation(line: 248, scope: !435)
!467 = !DILocation(line: 249, scope: !435)
!468 = !DILocation(line: 250, scope: !435)
!469 = !DILocation(line: 0, scope: !411, inlinedAt: !470)
!470 = distinct !DILocation(line: 250, scope: !435)
!471 = !DILocation(line: 148, scope: !411, inlinedAt: !470)
!472 = !DILocation(line: 149, scope: !411, inlinedAt: !470)
!473 = !DILocation(line: 0, scope: !420, inlinedAt: !470)
!474 = !DILocation(line: 151, scope: !420, inlinedAt: !470)
!475 = !DILocation(line: 152, scope: !420, inlinedAt: !470)
!476 = distinct !{!476, !472, !477, !136}
!477 = !DILocation(line: 155, scope: !411, inlinedAt: !470)
!478 = !DILocation(line: 253, scope: !435)
!479 = !DILocation(line: 254, scope: !435)
!480 = !DILocation(line: 255, scope: !435)
!481 = !DILocation(line: 256, scope: !435)
!482 = !DILocation(line: 0, scope: !411, inlinedAt: !483)
!483 = distinct !DILocation(line: 256, scope: !435)
!484 = !DILocation(line: 148, scope: !411, inlinedAt: !483)
!485 = !DILocation(line: 149, scope: !411, inlinedAt: !483)
!486 = !DILocation(line: 0, scope: !420, inlinedAt: !483)
!487 = !DILocation(line: 151, scope: !420, inlinedAt: !483)
!488 = !DILocation(line: 152, scope: !420, inlinedAt: !483)
!489 = distinct !{!489, !485, !490, !136}
!490 = !DILocation(line: 155, scope: !411, inlinedAt: !483)
!491 = !DILocation(line: 257, scope: !435)
!492 = distinct !DISubprogram(name: "halide_profiler_memory_free", scope: !3, file: !3, line: 259, type: !436, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !493)
!493 = !{!494, !495, !496, !497, !498, !499}
!494 = !DILocalVariable(name: "decr", arg: 4, scope: !492, file: !3, line: 262, type: !17)
!495 = !DILocalVariable(name: "func_id", arg: 3, scope: !492, file: !3, line: 261, type: !22)
!496 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !492, file: !3, line: 260, type: !54)
!497 = !DILocalVariable(name: "user_context", arg: 1, scope: !492, file: !3, line: 259, type: !54)
!498 = !DILocalVariable(name: "p_stats", scope: !492, file: !3, line: 269, type: !27)
!499 = !DILocalVariable(name: "f_stats", scope: !492, file: !3, line: 274, type: !41)
!500 = !DILocation(line: 0, scope: !492)
!501 = !DILocation(line: 265, scope: !492)
!502 = !DILocation(line: 270, scope: !503)
!503 = distinct !DILexicalBlock(scope: !492, file: !3, line: 270)
!504 = !DILocation(line: 270, scope: !505)
!505 = distinct !DILexicalBlock(scope: !506, file: !3, line: 270)
!506 = distinct !DILexicalBlock(scope: !503, file: !3, line: 270)
!507 = !DILocation(line: 271, scope: !508)
!508 = distinct !DILexicalBlock(scope: !492, file: !3, line: 271)
!509 = !DILocation(line: 271, scope: !510)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 271)
!511 = distinct !DILexicalBlock(scope: !508, file: !3, line: 271)
!512 = !DILocation(line: 272, scope: !513)
!513 = distinct !DILexicalBlock(scope: !492, file: !3, line: 272)
!514 = !DILocation(line: 272, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !3, line: 272)
!516 = distinct !DILexicalBlock(scope: !513, file: !3, line: 272)
!517 = !DILocation(line: 274, scope: !492)
!518 = !DILocation(line: 283, scope: !492)
!519 = !DILocation(line: 286, scope: !492)
!520 = !DILocation(line: 287, scope: !492)
!521 = distinct !DISubprogram(name: "halide_profiler_report_unlocked", scope: !3, file: !3, line: 289, type: !522, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !54, !6}
!524 = !{!525, !526, !527, !531, !649, !651, !654, !655, !656, !657, !658, !662, !665, !669, !674, !675, !676, !677, !680}
!525 = !DILocalVariable(name: "s", arg: 2, scope: !521, file: !3, line: 289, type: !6)
!526 = !DILocalVariable(name: "user_context", arg: 1, scope: !521, file: !3, line: 289, type: !54)
!527 = !DILocalVariable(name: "line_buf", scope: !521, file: !3, line: 291, type: !528)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8192, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 1024)
!531 = !DILocalVariable(name: "sstr", scope: !521, file: !3, line: 292, type: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2,1024>", scope: !534, file: !533, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !535, templateParams: !646, identifier: ".?AV?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@")
!533 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a97d2909b01229a33f8a6f2cb0fa6ab8")
!534 = !DINamespace(scope: !93)
!535 = !{!536, !537, !538, !539, !540, !542, !544, !548, !552, !557, !561, !564, !569, !573, !577, !582, !588, !621, !628, !631, !634, !639, !640, !643, !644, !645}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !532, file: !533, line: 32, baseType: !85, size: 64, flags: DIFlagPublic)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !532, file: !533, line: 32, baseType: !85, size: 64, offset: 64, flags: DIFlagPublic)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !532, file: !533, line: 32, baseType: !85, size: 64, offset: 128, flags: DIFlagPublic)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !532, file: !533, line: 33, baseType: !54, size: 64, offset: 192, flags: DIFlagPublic)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !532, file: !533, line: 34, baseType: !541, size: 8, offset: 256, flags: DIFlagPublic)
!541 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !532, file: !533, line: 35, baseType: !543, size: 8, offset: 264, flags: DIFlagPublic)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !19)
!544 = !DISubprogram(name: "Printer", scope: !532, file: !533, line: 37, type: !545, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !547, !54, !85}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!548 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@PEBD@Z", scope: !532, file: !533, line: 57, type: !549, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !547, !37}
!551 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !532, size: 64)
!552 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@_J@Z", scope: !532, file: !533, line: 67, type: !553, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubroutineType(types: !554)
!554 = !{!551, !547, !555}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 9, baseType: !556)
!556 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!557 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@H@Z", scope: !532, file: !533, line: 72, type: !558, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!558 = !DISubroutineType(types: !559)
!559 = !{!551, !547, !560}
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !16, line: 11, baseType: !22)
!561 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@_K@Z", scope: !532, file: !533, line: 77, type: !562, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!562 = !DISubroutineType(types: !563)
!563 = !{!551, !547, !17}
!564 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@I@Z", scope: !532, file: !533, line: 82, type: !565, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DISubroutineType(types: !566)
!566 = !{!551, !547, !567}
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 12, baseType: !568)
!568 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!569 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@N@Z", scope: !532, file: !533, line: 87, type: !570, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{!551, !547, !572}
!572 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!573 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@M@Z", scope: !532, file: !533, line: 92, type: !574, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{!551, !547, !576}
!576 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!577 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@PEBX@Z", scope: !532, file: !533, line: 97, type: !578, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{!551, !547, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!582 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV1?A0x3E95B2E2@234@G@Z", scope: !532, file: !533, line: 102, type: !583, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubroutineType(types: !584)
!584 = !{!551, !547, !585}
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 14, baseType: !587)
!587 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!588 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@AEBUhalide_type_t@@@Z", scope: !532, file: !533, line: 108, type: !589, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!589 = !DISubroutineType(types: !590)
!590 = !{!551, !547, !591}
!591 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !8, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !594, identifier: ".?AUhalide_type_t@@")
!594 = !{!595, !597, !598, !599, !603, !606, !610, !613, !614, !615, !618}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !593, file: !8, line: 434, baseType: !596, size: 8, align: 8)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !8, line: 413, baseType: !75)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !593, file: !8, line: 442, baseType: !76, size: 8, align: 8, offset: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !593, file: !8, line: 446, baseType: !586, size: 16, align: 16, offset: 16)
!599 = !DISubprogram(name: "halide_type_t", scope: !593, file: !8, line: 453, type: !600, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !602, !596, !76, !586}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!603 = !DISubprogram(name: "halide_type_t", scope: !593, file: !8, line: 459, type: !604, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !602}
!606 = !DISubprogram(name: "with_lanes", linkageName: "?with_lanes@halide_type_t@@QEBA?AU1@G@Z", scope: !593, file: !8, line: 463, type: !607, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!607 = !DISubroutineType(types: !608)
!608 = !{!593, !609, !586}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!610 = !DISubprogram(name: "operator==", linkageName: "??8halide_type_t@@QEBA_NAEBU0@@Z", scope: !593, file: !8, line: 468, type: !611, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DISubroutineType(types: !612)
!612 = !{!541, !609, !591}
!613 = !DISubprogram(name: "operator!=", linkageName: "??9halide_type_t@@QEBA_NAEBU0@@Z", scope: !593, file: !8, line: 472, type: !611, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DISubprogram(name: "operator<", linkageName: "??Mhalide_type_t@@QEBA_NAEBU0@@Z", scope: !593, file: !8, line: 476, type: !611, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QEBAHXZ", scope: !593, file: !8, line: 481, type: !616, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!616 = !DISubroutineType(types: !617)
!617 = !{!22, !609}
!618 = !DISubprogram(name: "as_u32", linkageName: "?as_u32@halide_type_t@@QEBAIXZ", scope: !593, file: !8, line: 485, type: !619, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !DISubroutineType(types: !620)
!620 = !{!567, !609}
!621 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAAEAV0?A0x3E95B2E2@123@AEBUhalide_buffer_t@@@Z", scope: !532, file: !533, line: 113, type: !622, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DISubroutineType(types: !623)
!623 = !{!551, !547, !624}
!624 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !8, line: 1550, baseType: !627)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !8, line: 1423, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AUhalide_buffer_t@@")
!628 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !532, file: !533, line: 119, type: !629, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!629 = !DISubroutineType(types: !630)
!630 = !{!37, !547}
!631 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEAAXXZ", scope: !532, file: !533, line: 131, type: !632, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !547}
!634 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QEBA_KXZ", scope: !532, file: !533, line: 139, type: !635, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!635 = !DISubroutineType(types: !636)
