; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/posix_threads_tsan.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/posix_threads_tsan.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, [4 x i8], %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8, [7 x i8] }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32, [4 x i8] }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i64] }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::spawned_thread" = type { void (i8*)*, i8*, i64 }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13table_storageE", scope: !2, file: !6, line: 478, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Synchronization", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 196608, elements: !9)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!10}
!10 = !DISubrange(count: 24576)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "_ZN6Halide7Runtime8Internal10work_queueE", scope: !3, file: !13, line: 166, type: !14, isLocal: false, isDefinition: true)
!13 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !3, file: !13, line: 94, size: 17024, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTSN6Halide7Runtime8Internal12work_queue_tE")
!15 = !{!16, !28, !30, !31, !89, !90, !91, !92, !96, !97, !98, !99, !100, !106, !107, !108, !109, !114, !117}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !14, file: !13, line: 96, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !18, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !19, identifier: "_ZTS12halide_mutex")
!18 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !17, file: !18, line: 121, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !26)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 61, baseType: !24)
!23 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 10, baseType: !25)
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 1)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !14, file: !13, line: 99, baseType: !29, size: 32, offset: 64)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !14, file: !13, line: 103, baseType: !29, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !14, file: !13, line: 106, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !3, file: !13, line: 26, size: 1024, flags: DIFlagTypePassByValue, elements: !34, identifier: "_ZTSN6Halide7Runtime8Internal4workE")
!34 = !{!35, !65, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !84}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !33, file: !13, line: 27, baseType: !36, size: 448)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !18, line: 201, size: 448, flags: DIFlagTypePassByValue, elements: !37, identifier: "_ZTS22halide_parallel_task_t")
!37 = !{!38, !47, !48, !51, !59, !60, !61, !62, !63}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !36, file: !18, line: 204, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !18, line: 192, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!29, !43, !29, !29, !44, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 16, baseType: !46)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !36, file: !18, line: 207, baseType: !44, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !18, line: 210, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !36, file: !18, line: 214, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !18, line: 177, size: 128, flags: DIFlagTypePassByValue, elements: !54, identifier: "_ZTS26halide_semaphore_acquire_t")
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !53, file: !18, line: 178, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !18, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS18halide_semaphore_t")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !18, line: 179, baseType: !29, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !36, file: !18, line: 215, baseType: !29, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 288)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !36, file: !18, line: 238, baseType: !29, size: 32, offset: 352)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !36, file: !18, line: 243, baseType: !64, size: 8, offset: 384)
!64 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !33, file: !13, line: 31, baseType: !66, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !18, line: 158, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!29, !43, !29, !44}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !33, file: !13, line: 33, baseType: !32, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !33, file: !13, line: 34, baseType: !32, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !33, file: !13, line: 35, baseType: !29, size: 32, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !33, file: !13, line: 36, baseType: !32, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !33, file: !13, line: 37, baseType: !29, size: 32, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !33, file: !13, line: 39, baseType: !43, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !33, file: !13, line: 40, baseType: !29, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !33, file: !13, line: 41, baseType: !29, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !33, file: !13, line: 42, baseType: !29, size: 32, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !33, file: !13, line: 44, baseType: !64, size: 8, offset: 992)
!80 = !DISubprogram(name: "make_runnable", linkageName: "_ZN6Halide7Runtime8Internal4work13make_runnableEv", scope: !33, file: !13, line: 46, type: !81, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{!64, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!84 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal4work7runningEv", scope: !33, file: !13, line: 62, type: !85, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{!64, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !14, file: !13, line: 109, baseType: !29, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !14, file: !13, line: 122, baseType: !93, size: 64, offset: 320)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !18, line: 125, size: 64, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTS11halide_cond")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !93, file: !18, line: 126, baseType: !21, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !14, file: !13, line: 122, baseType: !93, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !14, file: !13, line: 122, baseType: !93, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 544)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !14, file: !13, line: 129, baseType: !101, size: 16384, offset: 576)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 16384, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !18, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13halide_thread")
!104 = !{!105}
!105 = !DISubrange(count: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 16960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 16968)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !14, file: !13, line: 139, baseType: !29, size: 32, offset: 16992)
!109 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t7runningEv", scope: !14, file: !13, line: 141, type: !110, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!64, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!114 = !DISubprogram(name: "assert_zeroed", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t13assert_zeroedEv", scope: !14, file: !13, line: 146, type: !115, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !112}
!117 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal12work_queue_t5resetEv", scope: !14, file: !13, line: 158, type: !118, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "_ZN6Halide7Runtime8Internal14custom_do_taskE", scope: !3, file: !13, line: 567, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !18, line: 259, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!29, !43, !66, !29, !44}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "_ZN6Halide7Runtime8Internal19custom_do_loop_taskE", scope: !3, file: !13, line: 568, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !18, line: 268, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!29, !43, !39, !29, !29, !44, !43}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "_ZN6Halide7Runtime8Internal17custom_do_par_forE", scope: !3, file: !13, line: 569, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !18, line: 167, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!29, !43, !66, !29, !29, !44}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "_ZN6Halide7Runtime8Internal24custom_do_parallel_tasksE", scope: !3, file: !13, line: 570, type: !141, isLocal: false, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !18, line: 281, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!29, !43, !29, !145, !43}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "_ZN6Halide7Runtime8Internal21custom_semaphore_initE", scope: !3, file: !13, line: 571, type: !148, isLocal: false, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !18, line: 184, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!29, !56, !29}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "_ZN6Halide7Runtime8Internal28custom_semaphore_try_acquireE", scope: !3, file: !13, line: 572, type: !154, isLocal: false, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !18, line: 186, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!64, !56, !29}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "_ZN6Halide7Runtime8Internal24custom_semaphore_releaseE", scope: !3, file: !13, line: 573, type: !160, isLocal: false, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !18, line: 185, baseType: !149)
!161 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !162, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !163, retainedTypes: !164, globals: !373, imports: !385, splitDebugInlining: false, nameTableKind: None)
!162 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/posix_threads_tsan.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!163 = !{}
!164 = !{!165, !102, !22, !177, !229, !264, !265, !305, !330, !340, !311, !350, !363, !367, !32, !368, !300, !49, !372}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !3, file: !167, line: 45, size: 192, flags: DIFlagTypePassByValue, elements: !168, identifier: "_ZTSN6Halide7Runtime8Internal14spawned_threadE")
!167 = !DIFile(filename: "src/runtime/posix_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!168 = !{!169, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !166, file: !167, line: 46, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !43}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !166, file: !167, line: 47, baseType: !43, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !166, file: !167, line: 48, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !167, line: 20, baseType: !176)
!176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !2, file: !6, line: 254, size: 1280, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !179, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE")
!179 = !{!180, !221, !222, !223, !224, !228}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !178, file: !6, line: 255, baseType: !181, size: 1088)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !2, file: !167, line: 93, size: 1088, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !182, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE")
!182 = !{!183, !190, !194, !195, !201, !205, !209, !212, !215, !216, !217, !218, !219, !220}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !181, file: !167, line: 94, baseType: !184, size: 512)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", file: !167, line: 12, size: 512, flags: DIFlagTypePassByValue, elements: !185, identifier: "_ZTS15pthread_mutex_t")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !184, file: !167, line: 13, baseType: !187, size: 512)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !181, file: !167, line: 95, baseType: !191, size: 512, offset: 512)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_cond_t", file: !167, line: 16, size: 512, flags: DIFlagTypePassByValue, elements: !192, identifier: "_ZTS14pthread_cond_t")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !191, file: !167, line: 17, baseType: !187, size: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !181, file: !167, line: 96, baseType: !64, size: 8, offset: 1024)
!195 = !DISubprogram(name: "thread_parker", scope: !181, file: !167, line: 98, type: !196, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !199}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!199 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!201 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSERKS3_", scope: !181, file: !167, line: 99, type: !202, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !198, !199}
!204 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !181, size: 64)
!205 = !DISubprogram(name: "thread_parker", scope: !181, file: !167, line: 100, type: !206, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !198, !208}
!208 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !181, size: 64)
!209 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSEOS3_", scope: !181, file: !167, line: 101, type: !210, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!210 = !DISubroutineType(types: !211)
!211 = !{!204, !198, !208}
!212 = !DISubprogram(name: "thread_parker", scope: !181, file: !167, line: 103, type: !213, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !198}
!215 = !DISubprogram(name: "~thread_parker", scope: !181, file: !167, line: 108, type: !213, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !181, file: !167, line: 113, type: !213, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !181, file: !167, line: 117, type: !213, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !181, file: !167, line: 125, type: !213, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !181, file: !167, line: 129, type: !213, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !181, file: !167, line: 134, type: !213, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !6, line: 273, baseType: !177, size: 64, offset: 1088)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !6, line: 274, baseType: !177, size: 64, offset: 1152)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !178, file: !6, line: 275, baseType: !177, size: 64, offset: 1216)
!224 = !DISubprogram(name: "word_lock_queue_data", scope: !178, file: !6, line: 277, type: !225, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!228 = !DISubprogram(name: "~word_lock_queue_data", scope: !178, file: !6, line: 280, type: !225, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !2, file: !6, line: 475, size: 196608, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !231, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10hash_tableE")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !230, file: !6, line: 476, baseType: !233, size: 196608)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 196608, elements: !262)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !2, file: !6, line: 463, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !235, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11hash_bucketE")
!235 = !{!236, !248, !261}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !234, file: !6, line: 464, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !2, file: !6, line: 283, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !238, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9word_lockE")
!238 = !{!239, !240, !244, !245, !246, !247}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !6, line: 284, baseType: !22, size: 64)
!240 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !237, file: !6, line: 286, type: !241, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!244 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !237, file: !6, line: 287, type: !241, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!245 = !DISubprogram(name: "word_lock", scope: !237, file: !6, line: 290, type: !241, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !237, file: !6, line: 291, type: !241, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!247 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock6unlockEv", scope: !237, file: !6, line: 304, type: !241, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !234, file: !6, line: 466, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !2, file: !6, line: 448, size: 1280, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !251, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10queue_dataE")
!251 = !{!252, !253, !254, !255, !256, !260}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !250, file: !6, line: 449, baseType: !181, size: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !250, file: !6, line: 451, baseType: !22, size: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !6, line: 452, baseType: !249, size: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !250, file: !6, line: 453, baseType: !22, size: 64, offset: 1216)
!256 = !DISubprogram(name: "queue_data", scope: !250, file: !6, line: 455, type: !257, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!260 = !DISubprogram(name: "~queue_data", scope: !250, file: !6, line: 457, type: !257, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !234, file: !6, line: 467, baseType: !249, size: 64, offset: 128)
!262 = !{!263}
!263 = !DISubrange(count: 1024)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !2, file: !6, line: 829, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !267, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization21mutex_parking_controlE")
!267 = !{!268, !299, !301}
!268 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !266, baseType: !269, extraData: i32 0)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !2, file: !6, line: 592, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !270, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15parking_controlE")
!270 = !{!271, !284, !285, !289, !295}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !269, file: !6, line: 593, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!64, !43, !275}
!275 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !2, file: !6, line: 576, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !277, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15validate_actionE")
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !276, file: !6, line: 577, baseType: !64, size: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !276, file: !6, line: 578, baseType: !22, size: 64, offset: 64)
!280 = !DISubprogram(name: "validate_action", scope: !276, file: !6, line: 580, type: !281, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !269, file: !6, line: 594, baseType: !170, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !269, file: !6, line: 595, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!22, !43, !29, !64}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !269, file: !6, line: 596, baseType: !290, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !43, !293, !64, !64}
!293 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!295 = !DISubprogram(name: "parking_control", scope: !269, file: !6, line: 598, type: !296, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !266, file: !6, line: 830, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!301 = !DISubprogram(name: "mutex_parking_control", scope: !266, file: !6, line: 832, type: !302, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304, !300}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !2, file: !6, line: 958, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !307, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization22signal_parking_controlE")
!307 = !{!308, !309, !310, !326}
!308 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !306, baseType: !269, extraData: i32 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !306, file: !6, line: 959, baseType: !300, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !306, file: !6, line: 960, baseType: !311, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !2, file: !6, line: 859, size: 64, flags: DIFlagTypePassByValue, elements: !313, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10fast_mutexE")
!313 = !{!314, !315, !319, !320, !321, !322, !325}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !312, file: !6, line: 860, baseType: !22, size: 64)
!315 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex9lock_fullEv", scope: !312, file: !6, line: 862, type: !316, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!319 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11unlock_fullEv", scope: !312, file: !6, line: 906, type: !316, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex4lockEv", scope: !312, file: !6, line: 920, type: !316, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!321 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex6unlockEv", scope: !312, file: !6, line: 929, type: !316, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubprogram(name: "make_parked_if_locked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex21make_parked_if_lockedEv", scope: !312, file: !6, line: 938, type: !323, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DISubroutineType(types: !324)
!324 = !{!64, !318}
!325 = !DISubprogram(name: "make_parked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11make_parkedEv", scope: !312, file: !6, line: 953, type: !316, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubprogram(name: "signal_parking_control", scope: !306, file: !6, line: 962, type: !327, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329, !300, !311}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !2, file: !6, line: 985, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !332, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization25broadcast_parking_controlE")
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !331, baseType: !269, extraData: i32 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !331, file: !6, line: 986, baseType: !300, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !331, file: !6, line: 987, baseType: !311, size: 64, offset: 320)
!336 = !DISubprogram(name: "broadcast_parking_control", scope: !331, file: !6, line: 989, type: !337, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !300, !311}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !2, file: !6, line: 1026, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !342, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20wait_parking_controlE")
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !341, baseType: !269, extraData: i32 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !341, file: !6, line: 1027, baseType: !300, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !341, file: !6, line: 1028, baseType: !311, size: 64, offset: 320)
!346 = !DISubprogram(name: "wait_parking_control", scope: !341, file: !6, line: 1030, type: !347, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !349, !300, !311}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !2, file: !6, line: 1072, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !352, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9fast_condE")
!352 = !{!353, !354, !358, !359, !360}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !6, line: 1073, baseType: !22, size: 64)
!354 = !DISubprogram(name: "fast_cond", scope: !351, file: !6, line: 1076, type: !355, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!358 = !DISubprogram(name: "signal", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond6signalEv", scope: !351, file: !6, line: 1078, type: !355, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubprogram(name: "broadcast", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond9broadcastEv", scope: !351, file: !6, line: 1092, type: !355, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubprogram(name: "wait", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond4waitEPNS2_10fast_mutexE", scope: !351, file: !6, line: 1105, type: !361, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !357, !311}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !6, line: 1164, size: 64, flags: DIFlagTypePassByValue, elements: !365, identifier: "_ZTS18halide_mutex_array")
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !364, file: !6, line: 1165, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !13, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !370, identifier: "_ZTS23halide_semaphore_impl_t")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !13, line: 712, baseType: !29, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!373 = !{!374, !377, !0, !379, !11, !121, !127, !133, !139, !146, !152, !158, !381}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!375 = distinct !DIGlobalVariable(name: "lock_bit", scope: !2, file: !6, line: 250, type: !376, isLocal: true, isDefinition: true)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!378 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !2, file: !6, line: 251, type: !376, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!380 = distinct !DIGlobalVariable(name: "parked_bit", scope: !2, file: !6, line: 252, type: !376, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!382 = distinct !DIGlobalVariable(name: "__tsan_mutex_linker_init", scope: !161, file: !6, line: 37, type: !383, isLocal: true, isDefinition: true)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!385 = !{!386, !387, !388}
!386 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !23, line: 225)
!387 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !167, line: 62)
!388 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !13, line: 579)
!389 = !{i32 7, !"Dwarf Version", i32 4}
!390 = !{i32 2, !"Debug Info Version", i32 3}
!391 = !{i32 1, !"wchar_size", i32 4}
!392 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!393 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "_ZN6Halide7Runtime8Internal19spawn_thread_helperEPv", scope: !3, file: !167, line: 50, type: !394, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{!43, !43}
!396 = !{!397, !398}
!397 = !DILocalVariable(name: "arg", arg: 1, scope: !393, file: !167, line: 50, type: !43)
!398 = !DILocalVariable(name: "t", scope: !393, file: !167, line: 51, type: !165)
!399 = !DILocation(line: 0, scope: !393)
!400 = !DILocation(line: 52, column: 8, scope: !393)
!401 = !{!402, !403, i64 0}
!402 = !{!"_ZTSN6Halide7Runtime8Internal14spawned_threadE", !403, i64 0, !403, i64 8, !406, i64 16}
!403 = !{!"any pointer", !404, i64 0}
!404 = !{!"omnipotent char", !405, i64 0}
!405 = !{!"Simple C++ TBAA"}
!406 = !{!"long", !404, i64 0}
!407 = !DILocation(line: 52, column: 13, scope: !393)
!408 = !{!402, !403, i64 8}
!409 = !DILocation(line: 52, column: 5, scope: !393)
!410 = !DILocation(line: 53, column: 5, scope: !393)
!411 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !167, file: !167, line: 64, type: !412, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!102, !170, !43}
!414 = !{!415, !416, !417}
!415 = !DILocalVariable(name: "f", arg: 1, scope: !411, file: !167, line: 64, type: !170)
!416 = !DILocalVariable(name: "closure", arg: 2, scope: !411, file: !167, line: 64, type: !43)
!417 = !DILocalVariable(name: "t", scope: !411, file: !167, line: 65, type: !165)
!418 = !DILocation(line: 0, scope: !411)
!419 = !DILocation(line: 65, column: 43, scope: !411)
!420 = !DILocation(line: 66, column: 8, scope: !411)
!421 = !DILocation(line: 66, column: 10, scope: !411)
!422 = !DILocation(line: 67, column: 8, scope: !411)
!423 = !DILocation(line: 67, column: 16, scope: !411)
!424 = !DILocation(line: 68, column: 8, scope: !411)
!425 = !DILocation(line: 68, column: 15, scope: !411)
!426 = !{!402, !406, i64 16}
!427 = !DILocation(line: 69, column: 5, scope: !411)
!428 = !DILocation(line: 70, column: 12, scope: !411)
!429 = !DILocation(line: 70, column: 5, scope: !411)
!430 = !DISubprogram(name: "malloc", scope: !23, file: !23, line: 87, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!431 = !DISubroutineType(types: !432)
!432 = !{!43, !433}
!433 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!434 = !DISubprogram(name: "pthread_create", scope: !167, file: !167, line: 21, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!435 = !DISubroutineType(types: !436)
!436 = !{!29, !437, !438, !440, !43}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!441 = distinct !DISubprogram(name: "halide_join_thread", scope: !167, file: !167, line: 73, type: !442, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !102}
!444 = !{!445, !446, !447}
!445 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !441, file: !167, line: 73, type: !102)
!446 = !DILocalVariable(name: "t", scope: !441, file: !167, line: 74, type: !165)
!447 = !DILocalVariable(name: "ret", scope: !441, file: !167, line: 75, type: !43)
!448 = !DILocation(line: 0, scope: !441)
!449 = !DILocation(line: 74, column: 25, scope: !441)
!450 = !DILocation(line: 75, column: 5, scope: !441)
!451 = !DILocation(line: 75, column: 11, scope: !441)
!452 = !{!403, !403, i64 0}
!453 = !DILocation(line: 76, column: 21, scope: !441)
!454 = !DILocation(line: 76, column: 5, scope: !441)
!455 = !DILocation(line: 77, column: 10, scope: !441)
!456 = !DILocation(line: 77, column: 5, scope: !441)
!457 = !DILocation(line: 78, column: 1, scope: !441)
!458 = !DISubprogram(name: "pthread_join", scope: !167, file: !167, line: 23, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!459 = !DISubroutineType(types: !460)
!460 = !{!29, !176, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!462 = !DISubprogram(name: "free", scope: !23, file: !23, line: 86, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!463 = distinct !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !237, file: !6, line: 321, type: !241, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !240, retainedNodes: !464)
!464 = !{!465, !467, !479, !480, !484, !485, !486}
!465 = !DILocalVariable(name: "this", arg: 1, scope: !463, type: !466, flags: DIFlagArtificial | DIFlagObjectPointer)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!467 = !DILocalVariable(name: "spinner", scope: !463, file: !6, line: 322, type: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !2, file: !6, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !469, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization12spin_controlE")
!469 = !{!470, !471, !475, !478}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !468, file: !6, line: 231, baseType: !29, size: 32)
!471 = !DISubprogram(name: "spin_control", scope: !468, file: !6, line: 235, type: !472, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!475 = !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !468, file: !6, line: 237, type: !476, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!476 = !DISubroutineType(types: !477)
!477 = !{!64, !474}
!478 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control5resetEv", scope: !468, file: !6, line: 244, type: !472, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !DILocalVariable(name: "expected", scope: !463, file: !6, line: 323, type: !22)
!480 = !DILocalVariable(name: "desired", scope: !481, file: !6, line: 328, type: !22)
!481 = distinct !DILexicalBlock(scope: !482, file: !6, line: 327, column: 37)
!482 = distinct !DILexicalBlock(scope: !483, file: !6, line: 327, column: 13)
!483 = distinct !DILexicalBlock(scope: !463, file: !6, line: 326, column: 18)
!484 = !DILocalVariable(name: "node", scope: !483, file: !6, line: 342, type: !178)
!485 = !DILocalVariable(name: "head", scope: !483, file: !6, line: 347, type: !177)
!486 = !DILocalVariable(name: "desired", scope: !483, file: !6, line: 359, type: !22)
!487 = !DILocation(line: 0, scope: !463)
!488 = !DILocation(line: 324, column: 26, scope: !463)
!489 = !DILocalVariable(name: "addr", arg: 1, scope: !490, file: !6, line: 200, type: !494)
!490 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned long long>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_119atomic_load_relaxedIyEEvPT_S6_", scope: !491, file: !6, line: 200, type: !492, scopeLine: 200, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !497, retainedNodes: !495)
!491 = !DINamespace(scope: !2)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!495 = !{!489, !496}
!496 = !DILocalVariable(name: "val", arg: 2, scope: !490, file: !6, line: 200, type: !494)
!497 = !{!498}
!498 = !DITemplateTypeParameter(name: "T", type: !25)
!499 = !DILocation(line: 0, scope: !490, inlinedAt: !500)
!500 = distinct !DILocation(line: 324, column: 5, scope: !463)
!501 = !DILocation(line: 201, column: 5, scope: !490, inlinedAt: !500)
!502 = !DILocation(line: 326, column: 5, scope: !463)
!503 = !DILocation(line: 327, column: 24, scope: !482)
!504 = !DILocation(line: 327, column: 14, scope: !482)
!505 = !DILocation(line: 327, column: 13, scope: !483)
!506 = !DILocation(line: 328, column: 42, scope: !481)
!507 = !DILocation(line: 0, scope: !481)
!508 = !DILocalVariable(name: "addr", arg: 1, scope: !509, file: !6, line: 191, type: !300)
!509 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_acquire_relaxedEPyS4_S4_", scope: !491, file: !6, line: 191, type: !510, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!64, !300, !300, !300}
!512 = !{!508, !513, !514}
!513 = !DILocalVariable(name: "expected", arg: 2, scope: !509, file: !6, line: 191, type: !300)
!514 = !DILocalVariable(name: "desired", arg: 3, scope: !509, file: !6, line: 191, type: !300)
!515 = !DILocation(line: 0, scope: !509, inlinedAt: !516)
!516 = distinct !DILocation(line: 330, column: 17, scope: !517)
!517 = distinct !DILexicalBlock(scope: !481, file: !6, line: 330, column: 17)
!518 = !DILocation(line: 192, column: 12, scope: !509, inlinedAt: !516)
!519 = !DILocation(line: 336, column: 67, scope: !520)
!520 = distinct !DILexicalBlock(scope: !483, file: !6, line: 336, column: 13)
!521 = !DILocation(line: 336, column: 73, scope: !520)
!522 = !DILocalVariable(name: "this", arg: 1, scope: !523, type: !525, flags: DIFlagArtificial | DIFlagObjectPointer)
!523 = distinct !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !468, file: !6, line: 237, type: !476, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !475, retainedNodes: !524)
!524 = !{!522}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!526 = !DILocation(line: 0, scope: !523, inlinedAt: !527)
!527 = distinct !DILocation(line: 336, column: 84, scope: !520)
!528 = !DILocation(line: 241, column: 27, scope: !523, inlinedAt: !527)
!529 = !DILocation(line: 336, column: 13, scope: !483)
!530 = !DILocation(line: 239, column: 23, scope: !531, inlinedAt: !527)
!531 = distinct !DILexicalBlock(scope: !532, file: !6, line: 238, column: 29)
!532 = distinct !DILexicalBlock(scope: !523, file: !6, line: 238, column: 13)
!533 = !DILocation(line: 337, column: 13, scope: !534)
!534 = distinct !DILexicalBlock(scope: !520, file: !6, line: 336, column: 99)
!535 = !DILocation(line: 0, scope: !490, inlinedAt: !536)
!536 = distinct !DILocation(line: 338, column: 13, scope: !534)
!537 = !DILocation(line: 201, column: 5, scope: !490, inlinedAt: !536)
!538 = !DILocation(line: 339, column: 13, scope: !534)
!539 = !DILocation(line: 342, column: 9, scope: !483)
!540 = !DILocation(line: 342, column: 30, scope: !483)
!541 = !DILocalVariable(name: "this", arg: 1, scope: !542, type: !177, flags: DIFlagArtificial | DIFlagObjectPointer)
!542 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataC2Ev", scope: !178, file: !6, line: 277, type: !225, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !224, retainedNodes: !543)
!543 = !{!541}
!544 = !DILocation(line: 0, scope: !542, inlinedAt: !545)
!545 = distinct !DILocation(line: 342, column: 30, scope: !483)
!546 = !DILocalVariable(name: "this", arg: 1, scope: !547, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!547 = distinct !DISubprogram(name: "thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerC2Ev", scope: !181, file: !167, line: 103, type: !213, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !212, retainedNodes: !548)
!548 = !{!546}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!550 = !DILocation(line: 0, scope: !547, inlinedAt: !551)
!551 = distinct !DILocation(line: 277, column: 19, scope: !542, inlinedAt: !545)
!552 = !DILocation(line: 96, column: 10, scope: !547, inlinedAt: !551)
!553 = !{!554, !557, i64 128}
!554 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE", !555, i64 0, !556, i64 64, !557, i64 128}
!555 = !{!"_ZTS15pthread_mutex_t", !404, i64 0}
!556 = !{!"_ZTS14pthread_cond_t", !404, i64 0}
!557 = !{!"bool", !404, i64 0}
!558 = !DILocation(line: 104, column: 9, scope: !559, inlinedAt: !551)
!559 = distinct !DILexicalBlock(scope: !547, file: !167, line: 103, column: 35)
!560 = !DILocation(line: 105, column: 9, scope: !559, inlinedAt: !551)
!561 = !DILocation(line: 273, column: 27, scope: !542, inlinedAt: !545)
!562 = !{!563, !403, i64 136}
!563 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE", !554, i64 0, !403, i64 136, !403, i64 144, !403, i64 152}
!564 = !DILocation(line: 274, column: 27, scope: !542, inlinedAt: !545)
!565 = !{!563, !403, i64 144}
!566 = !DILocation(line: 275, column: 27, scope: !542, inlinedAt: !545)
!567 = !{!563, !403, i64 152}
!568 = !DILocalVariable(name: "this", arg: 1, scope: !569, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!569 = distinct !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !181, file: !167, line: 113, type: !213, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !216, retainedNodes: !570)
!570 = !{!568}
!571 = !DILocation(line: 0, scope: !569, inlinedAt: !572)
!572 = distinct !DILocation(line: 344, column: 21, scope: !483)
!573 = !DILocation(line: 114, column: 21, scope: !569, inlinedAt: !572)
!574 = !DILocation(line: 347, column: 72, scope: !483)
!575 = !DILocation(line: 0, scope: !483)
!576 = !DILocation(line: 348, column: 18, scope: !577)
!577 = distinct !DILexicalBlock(scope: !483, file: !6, line: 348, column: 13)
!578 = !DILocation(line: 348, column: 13, scope: !483)
!579 = !DILocation(line: 349, column: 23, scope: !580)
!580 = distinct !DILexicalBlock(scope: !577, file: !6, line: 348, column: 30)
!581 = !DILocation(line: 351, column: 9, scope: !580)
!582 = !DILocation(line: 347, column: 38, scope: !483)
!583 = !DILocation(line: 356, column: 23, scope: !584)
!584 = distinct !DILexicalBlock(scope: !577, file: !6, line: 351, column: 16)
!585 = !DILocation(line: 359, column: 60, scope: !483)
!586 = !DILocation(line: 359, column: 48, scope: !483)
!587 = !DILocalVariable(name: "addr", arg: 1, scope: !588, file: !6, line: 183, type: !300)
!588 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_release_relaxedEPyS4_S4_", scope: !491, file: !6, line: 183, type: !510, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !589)
!589 = !{!587, !590, !591}
!590 = !DILocalVariable(name: "expected", arg: 2, scope: !588, file: !6, line: 183, type: !300)
!591 = !DILocalVariable(name: "desired", arg: 3, scope: !588, file: !6, line: 183, type: !300)
!592 = !DILocation(line: 0, scope: !588, inlinedAt: !593)
!593 = distinct !DILocation(line: 360, column: 13, scope: !594)
!594 = distinct !DILexicalBlock(scope: !483, file: !6, line: 360, column: 13)
!595 = !DILocation(line: 184, column: 12, scope: !588, inlinedAt: !593)
!596 = !DILocalVariable(name: "this", arg: 1, scope: !597, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!597 = distinct !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !181, file: !167, line: 117, type: !213, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !217, retainedNodes: !598)
!598 = !{!596}
!599 = !DILocation(line: 0, scope: !597, inlinedAt: !600)
!600 = distinct !DILocation(line: 361, column: 25, scope: !601)
!601 = distinct !DILexicalBlock(scope: !594, file: !6, line: 360, column: 75)
!602 = !DILocation(line: 118, column: 9, scope: !597, inlinedAt: !600)
!603 = !DILocation(line: 119, column: 16, scope: !597, inlinedAt: !600)
!604 = !{i8 0, i8 2}
!605 = !DILocation(line: 119, column: 9, scope: !597, inlinedAt: !600)
!606 = !DILocation(line: 120, column: 13, scope: !607, inlinedAt: !600)
!607 = distinct !DILexicalBlock(scope: !597, file: !167, line: 119, column: 29)
!608 = distinct !{!608, !605, !609, !610}
!609 = !DILocation(line: 121, column: 9, scope: !597, inlinedAt: !600)
!610 = !{!"llvm.loop.mustprogress"}
!611 = !DILocation(line: 122, column: 9, scope: !597, inlinedAt: !600)
!612 = !DILocation(line: 0, scope: !490, inlinedAt: !613)
!613 = distinct !DILocation(line: 363, column: 13, scope: !601)
!614 = !DILocation(line: 201, column: 5, scope: !490, inlinedAt: !613)
!615 = !DILocation(line: 364, column: 9, scope: !601)
!616 = !DILocalVariable(name: "this", arg: 1, scope: !617, type: !177, flags: DIFlagArtificial | DIFlagObjectPointer)
!617 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataD2Ev", scope: !178, file: !6, line: 280, type: !225, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !228, retainedNodes: !618)
!618 = !{!616}
!619 = !DILocation(line: 0, scope: !617, inlinedAt: !620)
!620 = distinct !DILocation(line: 365, column: 5, scope: !463)
!621 = !DILocalVariable(name: "this", arg: 1, scope: !622, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!622 = distinct !DISubprogram(name: "~thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerD2Ev", scope: !181, file: !167, line: 108, type: !213, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !215, retainedNodes: !623)
!623 = !{!621}
!624 = !DILocation(line: 0, scope: !622, inlinedAt: !625)
!625 = distinct !DILocation(line: 280, column: 51, scope: !626, inlinedAt: !620)
!626 = distinct !DILexicalBlock(scope: !617, file: !6, line: 280, column: 51)
!627 = !DILocation(line: 109, column: 9, scope: !628, inlinedAt: !625)
!628 = distinct !DILexicalBlock(scope: !622, file: !167, line: 108, column: 36)
!629 = !DILocation(line: 110, column: 9, scope: !628, inlinedAt: !625)
!630 = !DILocation(line: 365, column: 5, scope: !463)
!631 = distinct !{!631, !502, !630}
!632 = !DILocation(line: 366, column: 1, scope: !463)
!633 = !DISubprogram(name: "halide_thread_yield", scope: !23, file: !23, line: 190, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!634 = !DISubroutineType(types: !635)
!635 = !{null}
!636 = distinct !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !237, file: !6, line: 368, type: !241, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !244, retainedNodes: !637)
!637 = !{!638, !639, !640, !642, !643, !644, !646, !647, !648, !649, !651, !654, !655, !658}
!638 = !DILocalVariable(name: "this", arg: 1, scope: !636, type: !466, flags: DIFlagArtificial | DIFlagObjectPointer)
!639 = !DILocalVariable(name: "expected", scope: !636, file: !6, line: 369, type: !22)
!640 = !DILocalVariable(name: "thread_queuing", scope: !641, file: !6, line: 375, type: !64)
!641 = distinct !DILexicalBlock(scope: !636, file: !6, line: 372, column: 18)
!642 = !DILocalVariable(name: "none_queued", scope: !641, file: !6, line: 377, type: !64)
!643 = !DILocalVariable(name: "desired", scope: !641, file: !6, line: 382, type: !22)
!644 = !DILocalVariable(name: "head", scope: !645, file: !6, line: 389, type: !177)
!645 = distinct !DILexicalBlock(scope: !636, file: !6, line: 388, column: 18)
!646 = !DILocalVariable(name: "current", scope: !645, file: !6, line: 390, type: !177)
!647 = !DILocalVariable(name: "tail", scope: !645, file: !6, line: 391, type: !177)
!648 = !DILocalVariable(name: "times_through", scope: !645, file: !6, line: 392, type: !29)
!649 = !DILocalVariable(name: "next", scope: !650, file: !6, line: 394, type: !177)
!650 = distinct !DILexicalBlock(scope: !645, file: !6, line: 393, column: 33)
!651 = !DILocalVariable(name: "desired", scope: !652, file: !6, line: 406, type: !22)
!652 = distinct !DILexicalBlock(scope: !653, file: !6, line: 405, column: 34)
!653 = distinct !DILexicalBlock(scope: !645, file: !6, line: 405, column: 13)
!654 = !DILocalVariable(name: "new_tail", scope: !645, file: !6, line: 414, type: !177)
!655 = !DILocalVariable(name: "continue_outer", scope: !656, file: !6, line: 416, type: !64)
!656 = distinct !DILexicalBlock(scope: !657, file: !6, line: 415, column: 34)
!657 = distinct !DILexicalBlock(scope: !645, file: !6, line: 415, column: 13)
!658 = !DILocalVariable(name: "desired", scope: !659, file: !6, line: 418, type: !22)
!659 = distinct !DILexicalBlock(scope: !656, file: !6, line: 417, column: 37)
!660 = !DILocation(line: 0, scope: !636)
!661 = !DILocation(line: 370, column: 26, scope: !636)
!662 = !DILocation(line: 0, scope: !490, inlinedAt: !663)
!663 = distinct !DILocation(line: 370, column: 5, scope: !636)
!664 = !DILocation(line: 201, column: 5, scope: !490, inlinedAt: !663)
!665 = !DILocation(line: 372, column: 5, scope: !636)
!666 = !DILocation(line: 375, column: 41, scope: !641)
!667 = !DILocation(line: 375, column: 31, scope: !641)
!668 = !DILocation(line: 0, scope: !641)
!669 = !DILocation(line: 378, column: 28, scope: !670)
!670 = distinct !DILexicalBlock(scope: !641, file: !6, line: 378, column: 13)
!671 = !DILocation(line: 382, column: 38, scope: !641)
!672 = !DILocation(line: 0, scope: !509, inlinedAt: !673)
!673 = distinct !DILocation(line: 383, column: 13, scope: !674)
!674 = distinct !DILexicalBlock(scope: !641, file: !6, line: 383, column: 13)
!675 = !DILocation(line: 192, column: 12, scope: !509, inlinedAt: !673)
!676 = !DILocation(line: 389, column: 72, scope: !645)
!677 = !DILocation(line: 389, column: 38, scope: !645)
!678 = !DILocation(line: 0, scope: !645)
!679 = !DILocation(line: 391, column: 47, scope: !645)
!680 = !DILocation(line: 393, column: 21, scope: !645)
!681 = !DILocation(line: 393, column: 9, scope: !645)
!682 = !DILocation(line: 394, column: 51, scope: !650)
!683 = !DILocation(line: 0, scope: !650)
!684 = !DILocation(line: 395, column: 13, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !6, line: 395, column: 13)
!686 = distinct !DILexicalBlock(scope: !650, file: !6, line: 395, column: 13)
!687 = !DILocation(line: 395, column: 13, scope: !686)
!688 = !DILocation(line: 395, column: 13, scope: !689)
!689 = distinct !DILexicalBlock(scope: !685, file: !6, line: 395, column: 13)
!690 = !DILocation(line: 396, column: 19, scope: !650)
!691 = !DILocation(line: 396, column: 24, scope: !650)
!692 = !DILocation(line: 398, column: 29, scope: !650)
!693 = distinct !{!693, !681, !694, !610}
!694 = !DILocation(line: 400, column: 9, scope: !645)
!695 = !DILocation(line: 401, column: 20, scope: !645)
!696 = !DILocation(line: 405, column: 22, scope: !653)
!697 = !DILocation(line: 405, column: 13, scope: !653)
!698 = !DILocation(line: 405, column: 13, scope: !645)
!699 = !DILocation(line: 406, column: 42, scope: !652)
!700 = !DILocation(line: 0, scope: !652)
!701 = !DILocalVariable(name: "addr", arg: 1, scope: !702, file: !6, line: 179, type: !494)
!702 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned long long>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_130atomic_cas_weak_relacq_relaxedIyEEbPT_S6_S6_", scope: !491, file: !6, line: 179, type: !703, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !497, retainedNodes: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{!64, !494, !494, !494}
!705 = !{!701, !706, !707}
!706 = !DILocalVariable(name: "expected", arg: 2, scope: !702, file: !6, line: 179, type: !494)
!707 = !DILocalVariable(name: "desired", arg: 3, scope: !702, file: !6, line: 179, type: !494)
!708 = !DILocation(line: 0, scope: !702, inlinedAt: !709)
!709 = distinct !DILocation(line: 407, column: 17, scope: !710)
!710 = distinct !DILexicalBlock(scope: !652, file: !6, line: 407, column: 17)
!711 = !DILocation(line: 180, column: 12, scope: !702, inlinedAt: !709)
!712 = distinct !{!712, !713, !714}
!713 = !DILocation(line: 388, column: 5, scope: !636)
!714 = !DILocation(line: 445, column: 5, scope: !636)
!715 = !DILocation(line: 414, column: 48, scope: !645)
!716 = !DILocation(line: 415, column: 22, scope: !657)
!717 = !DILocation(line: 415, column: 13, scope: !645)
!718 = !DILocation(line: 0, scope: !656)
!719 = !DILocation(line: 418, column: 46, scope: !659)
!720 = !DILocation(line: 0, scope: !659)
!721 = !DILocation(line: 0, scope: !702, inlinedAt: !722)
!722 = distinct !DILocation(line: 419, column: 21, scope: !723)
!723 = distinct !DILexicalBlock(scope: !659, file: !6, line: 419, column: 21)
!724 = !DILocation(line: 180, column: 12, scope: !702, inlinedAt: !722)
!725 = !DILocation(line: 422, column: 74, scope: !726)
!726 = distinct !DILexicalBlock(scope: !659, file: !6, line: 422, column: 21)
!727 = !DILocation(line: 422, column: 21, scope: !659)
!728 = distinct !{!728, !729, !730, !610}
!729 = !DILocation(line: 417, column: 13, scope: !656)
!730 = !DILocation(line: 428, column: 13, scope: !656)
!731 = !DILocation(line: 434, column: 24, scope: !732)
!732 = distinct !DILexicalBlock(scope: !657, file: !6, line: 433, column: 16)
!733 = !DILocalVariable(name: "addr", arg: 1, scope: !734, file: !6, line: 165, type: !300)
!734 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_124atomic_and_fetch_releaseEPyy", scope: !491, file: !6, line: 165, type: !735, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!22, !300, !22}
!737 = !{!733, !738}
!738 = !DILocalVariable(name: "val", arg: 2, scope: !734, file: !6, line: 165, type: !22)
!739 = !DILocation(line: 0, scope: !734, inlinedAt: !740)
!740 = distinct !DILocation(line: 435, column: 13, scope: !732)
!741 = !DILocation(line: 166, column: 12, scope: !734, inlinedAt: !740)
!742 = !DILocalVariable(name: "this", arg: 1, scope: !743, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!743 = distinct !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !181, file: !167, line: 125, type: !213, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !218, retainedNodes: !744)
!744 = !{!742}
!745 = !DILocation(line: 0, scope: !743, inlinedAt: !746)
!746 = distinct !DILocation(line: 441, column: 22, scope: !645)
!747 = !DILocation(line: 126, column: 29, scope: !743, inlinedAt: !746)
!748 = !DILocation(line: 126, column: 9, scope: !743, inlinedAt: !746)
!749 = !DILocalVariable(name: "this", arg: 1, scope: !750, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!750 = distinct !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !181, file: !167, line: 129, type: !213, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !219, retainedNodes: !751)
!751 = !{!749}
!752 = !DILocation(line: 0, scope: !750, inlinedAt: !753)
!753 = distinct !DILocation(line: 442, column: 22, scope: !645)
!754 = !DILocation(line: 130, column: 9, scope: !750, inlinedAt: !753)
!755 = !DILocation(line: 130, column: 21, scope: !750, inlinedAt: !753)
!756 = !DILocation(line: 131, column: 30, scope: !750, inlinedAt: !753)
!757 = !DILocation(line: 131, column: 9, scope: !750, inlinedAt: !753)
!758 = !DILocalVariable(name: "this", arg: 1, scope: !759, type: !549, flags: DIFlagArtificial | DIFlagObjectPointer)
!759 = distinct !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !181, file: !167, line: 134, type: !213, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !220, retainedNodes: !760)
!760 = !{!758}
!761 = !DILocation(line: 0, scope: !759, inlinedAt: !762)
!762 = distinct !DILocation(line: 443, column: 22, scope: !645)
!763 = !DILocation(line: 135, column: 9, scope: !759, inlinedAt: !762)
!764 = !DILocation(line: 444, column: 9, scope: !645)
!765 = !DILocation(line: 446, column: 1, scope: !636)
!766 = !DISubprogram(name: "halide_print", scope: !18, file: !18, line: 97, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !43, !49}
!769 = !DISubprogram(name: "abort", scope: !23, file: !23, line: 108, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!770 = distinct !DISubprogram(name: "lock_bucket", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization11lock_bucketEy", scope: !2, file: !6, line: 509, type: !771, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !774)
!771 = !DISubroutineType(types: !772)
!772 = !{!773, !22}
!773 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !234, size: 64)
!774 = !{!775, !776, !777}
!775 = !DILocalVariable(name: "addr", arg: 1, scope: !770, file: !6, line: 509, type: !22)
!776 = !DILocalVariable(name: "hash", scope: !770, file: !6, line: 510, type: !22)
!777 = !DILocalVariable(name: "bucket", scope: !770, file: !6, line: 515, type: !773)
!778 = !DILocation(line: 0, scope: !770)
!779 = !DILocalVariable(name: "addr", arg: 1, scope: !780, file: !6, line: 499, type: !22)
!780 = distinct !DISubprogram(name: "addr_hash", linkageName: "_ZN6Halide7Runtime8Internal15SynchronizationL9addr_hashEyj", scope: !2, file: !6, line: 499, type: !781, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !784)
!781 = !DISubroutineType(types: !782)
!782 = !{!22, !22, !783}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 12, baseType: !384)
!784 = !{!779, !785}
!785 = !DILocalVariable(name: "bits", arg: 2, scope: !780, file: !6, line: 499, type: !783)
!786 = !DILocation(line: 0, scope: !780, inlinedAt: !787)
!787 = distinct !DILocation(line: 510, column: 22, scope: !770)
!788 = !DILocation(line: 503, column: 22, scope: !789, inlinedAt: !787)
!789 = distinct !DILexicalBlock(scope: !790, file: !6, line: 502, column: 33)
!790 = distinct !DILexicalBlock(scope: !780, file: !6, line: 502, column: 9)
!791 = !DILocation(line: 503, column: 55, scope: !789, inlinedAt: !787)
!792 = !DILocation(line: 515, column: 27, scope: !770)
!793 = !DILocalVariable(name: "this", arg: 1, scope: !794, type: !466, flags: DIFlagArtificial | DIFlagObjectPointer)
!794 = distinct !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !237, file: !6, line: 291, type: !241, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !246, retainedNodes: !795)
!795 = !{!793, !796, !797}
!796 = !DILocalVariable(name: "expected", scope: !794, file: !6, line: 294, type: !22)
!797 = !DILocalVariable(name: "desired", scope: !794, file: !6, line: 295, type: !22)
!798 = !DILocation(line: 0, scope: !794, inlinedAt: !799)
!799 = distinct !DILocation(line: 517, column: 18, scope: !770)
!800 = !DILocation(line: 292, column: 26, scope: !794, inlinedAt: !799)
!801 = !DILocalVariable(name: "mutex", arg: 1, scope: !802, file: !6, line: 56, type: !43)
!802 = distinct !DISubprogram(name: "if_tsan_pre_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_116if_tsan_pre_lockEPv", scope: !491, file: !6, line: 56, type: !171, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !803)
!803 = !{!801}
!804 = !DILocation(line: 0, scope: !802, inlinedAt: !805)
!805 = distinct !DILocation(line: 292, column: 9, scope: !794, inlinedAt: !799)
!806 = !DILocation(line: 57, column: 5, scope: !802, inlinedAt: !805)
!807 = !DILocation(line: 297, column: 47, scope: !808, inlinedAt: !799)
!808 = distinct !DILexicalBlock(scope: !794, file: !6, line: 297, column: 13)
!809 = !DILocation(line: 0, scope: !509, inlinedAt: !810)
!810 = distinct !DILocation(line: 297, column: 14, scope: !808, inlinedAt: !799)
!811 = !DILocation(line: 192, column: 12, scope: !509, inlinedAt: !810)
!812 = !DILocation(line: 297, column: 13, scope: !794, inlinedAt: !799)
!813 = !DILocation(line: 517, column: 12, scope: !770)
!814 = !DILocation(line: 298, column: 13, scope: !815, inlinedAt: !799)
!815 = distinct !DILexicalBlock(scope: !808, file: !6, line: 297, column: 76)
!816 = !DILocation(line: 299, column: 9, scope: !815, inlinedAt: !799)
!817 = !DILocalVariable(name: "mutex", arg: 1, scope: !818, file: !6, line: 60, type: !43)
!818 = distinct !DISubprogram(name: "if_tsan_post_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_117if_tsan_post_lockEPv", scope: !491, file: !6, line: 60, type: !171, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !819)
!819 = !{!817}
!820 = !DILocation(line: 0, scope: !818, inlinedAt: !821)
!821 = distinct !DILocation(line: 301, column: 9, scope: !794, inlinedAt: !799)
!822 = !DILocation(line: 61, column: 5, scope: !818, inlinedAt: !821)
!823 = !DILocation(line: 519, column: 5, scope: !770)
!824 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization16lock_bucket_pairEyy", scope: !2, file: !6, line: 531, type: !825, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !835)
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !22, !22}
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !2, file: !6, line: 522, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !828, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11bucket_pairE")
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !827, file: !6, line: 523, baseType: !773, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !827, file: !6, line: 524, baseType: !773, size: 64, offset: 64)
!831 = !DISubprogram(name: "bucket_pair", scope: !827, file: !6, line: 526, type: !832, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !834, !773, !773}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!835 = !{!836, !837, !838, !839, !840, !843, !846, !847, !849}
!836 = !DILocalVariable(name: "addr_from", arg: 1, scope: !824, file: !6, line: 531, type: !22)
!837 = !DILocalVariable(name: "addr_to", arg: 2, scope: !824, file: !6, line: 531, type: !22)
!838 = !DILocalVariable(name: "hash_from", scope: !824, file: !6, line: 533, type: !22)
!839 = !DILocalVariable(name: "hash_to", scope: !824, file: !6, line: 534, type: !22)
!840 = !DILocalVariable(name: "first", scope: !841, file: !6, line: 542, type: !773)
!841 = distinct !DILexicalBlock(scope: !842, file: !6, line: 541, column: 31)
!842 = distinct !DILexicalBlock(scope: !824, file: !6, line: 541, column: 9)
!843 = !DILocalVariable(name: "first", scope: !844, file: !6, line: 546, type: !773)
!844 = distinct !DILexicalBlock(scope: !845, file: !6, line: 545, column: 37)
!845 = distinct !DILexicalBlock(scope: !842, file: !6, line: 545, column: 16)
!846 = !DILocalVariable(name: "second", scope: !844, file: !6, line: 547, type: !773)
!847 = !DILocalVariable(name: "first", scope: !848, file: !6, line: 552, type: !773)
!848 = distinct !DILexicalBlock(scope: !845, file: !6, line: 551, column: 12)
!849 = !DILocalVariable(name: "second", scope: !848, file: !6, line: 553, type: !773)
!850 = !DILocation(line: 0, scope: !824)
!851 = !DILocation(line: 0, scope: !780, inlinedAt: !852)
!852 = distinct !DILocation(line: 533, column: 27, scope: !824)
!853 = !DILocation(line: 503, column: 22, scope: !789, inlinedAt: !852)
!854 = !DILocation(line: 503, column: 55, scope: !789, inlinedAt: !852)
!855 = !DILocation(line: 0, scope: !780, inlinedAt: !856)
!856 = distinct !DILocation(line: 534, column: 25, scope: !824)
!857 = !DILocation(line: 503, column: 22, scope: !789, inlinedAt: !856)
!858 = !DILocation(line: 503, column: 55, scope: !789, inlinedAt: !856)
!859 = !DILocation(line: 541, column: 19, scope: !842)
!860 = !DILocation(line: 541, column: 9, scope: !824)
!861 = !DILocation(line: 542, column: 30, scope: !841)
!862 = !DILocation(line: 0, scope: !841)
!863 = !DILocation(line: 0, scope: !794, inlinedAt: !864)
!864 = distinct !DILocation(line: 543, column: 21, scope: !841)
!865 = !DILocation(line: 292, column: 26, scope: !794, inlinedAt: !864)
!866 = !DILocation(line: 0, scope: !802, inlinedAt: !867)
!867 = distinct !DILocation(line: 292, column: 9, scope: !794, inlinedAt: !864)
!868 = !DILocation(line: 57, column: 5, scope: !802, inlinedAt: !867)
!869 = !DILocation(line: 297, column: 47, scope: !808, inlinedAt: !864)
!870 = !DILocation(line: 0, scope: !509, inlinedAt: !871)
!871 = distinct !DILocation(line: 297, column: 14, scope: !808, inlinedAt: !864)
!872 = !DILocation(line: 192, column: 12, scope: !509, inlinedAt: !871)
!873 = !DILocation(line: 297, column: 13, scope: !794, inlinedAt: !864)
!874 = !DILocation(line: 543, column: 15, scope: !841)
!875 = !DILocation(line: 298, column: 13, scope: !815, inlinedAt: !864)
!876 = !DILocation(line: 299, column: 9, scope: !815, inlinedAt: !864)
!877 = !DILocation(line: 545, column: 26, scope: !845)
!878 = !DILocation(line: 545, column: 16, scope: !842)
!879 = !DILocation(line: 546, column: 30, scope: !844)
!880 = !DILocation(line: 0, scope: !844)
!881 = !DILocation(line: 547, column: 31, scope: !844)
!882 = !DILocation(line: 0, scope: !794, inlinedAt: !883)
!883 = distinct !DILocation(line: 548, column: 21, scope: !844)
!884 = !DILocation(line: 292, column: 26, scope: !794, inlinedAt: !883)
!885 = !DILocation(line: 0, scope: !802, inlinedAt: !886)
