; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_cuda.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_cuda.cpp"
target datalayout = "e-m:x-p:32:32-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:32-n8:16:32-a:0:32-S32"
target triple = "i386-unknown-windows-msvc19.11.0"

%"struct.Halide::Runtime::Internal::Cuda::CUctx_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUmod_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUfunc_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUDA_MEMCPY3D_st" = type { i32, i32, i32, i32, i32, i8*, i32, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i32, i32, i32, i32, i32, i32, i32, i8*, i32, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i32, i32, i32, i32, i32 }
%"struct.Halide::Runtime::Internal::Cuda::CUarray_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUstream_st" = type opaque
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::Cuda::FreeListItem" = type { i32, %"struct.Halide::Runtime::Internal::Cuda::CUctx_st"*, %"struct.Halide::Runtime::Internal::Cuda::CUstream_st"*, i32, %"struct.Halide::Runtime::Internal::Cuda::FreeListItem"* }

!324 = distinct !DIGlobalVariable(name: "cuCtxPushCurrent", linkageName: "?cuCtxPushCurrent@Cuda@Internal@Runtime@Halide@@3P6G?AW4CUresult@1234@PAUCUctx_st@1234@@ZA", scope: !2, file: !6, line: 43, type: !209, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "cuCtxPopCurrent", linkageName: "?cuCtxPopCurrent@Cuda@Internal@Runtime@Halide@@3P6G?AW4CUresult@1234@PAPAUCUctx_st@1234@@ZA", scope: !2, file: !6, line: 44, type: !327, isLocal: false, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !329)
!329 = !{!10, !203}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "cuPointerGetAttribute", linkageName: "?cuPointerGetAttribute@Cuda@Internal@Runtime@Halide@@3P6G?AW4CUresult@1234@PAXHI@ZA", scope: !2, file: !6, line: 46, type: !332, isLocal: false, isDefinition: true)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !334)
!334 = !{!10, !260, !13, !283}
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "cuStreamSynchronize", linkageName: "?cuStreamSynchronize@Cuda@Internal@Runtime@Halide@@3P6G?AW4CUresult@1234@PAUCUstream_st@1234@@ZA", scope: !2, file: !6, line: 48, type: !337, isLocal: false, isDefinition: true)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !339)
!339 = !{!10, !318}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "lib_cuda", linkageName: "?lib_cuda@Cuda@Internal@Runtime@Halide@@3PAXA", scope: !2, file: !342, line: 31, type: !260, isLocal: false, isDefinition: true)
!342 = !DIFile(filename: "src/runtime/cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "7f7473b8bd931831df4144c8e0824960")
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "lib_cuda_lock", linkageName: "?lib_cuda_lock@Cuda@Internal@Runtime@Halide@@3DC", scope: !2, file: !342, line: 32, type: !345, isLocal: false, isDefinition: true)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !348, file: !347, line: 11, baseType: !189)
!347 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "5cf5ff4091fc972c00e0f2f3144d40ad")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !347, line: 9, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !349, identifier: ".?AUScopedSpinLock@Internal@Runtime@Halide@@")
!349 = !{!346, !350, !353, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !347, line: 13, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!353 = !DISubprogram(name: "ScopedSpinLock", scope: !348, file: !347, line: 15, type: !354, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !355)
!355 = !{null, !356, !352}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!357 = !DISubprogram(name: "~ScopedSpinLock", scope: !348, file: !347, line: 22, type: !358, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !359)
!359 = !{null, !356}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "context", linkageName: "?context@Cuda@Internal@Runtime@Halide@@3PAUCUctx_st@1234@A", scope: !2, file: !342, line: 106, type: !204, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "context_lock", linkageName: "?context_lock@Cuda@Internal@Runtime@Halide@@3Uhalide_mutex@@A", scope: !2, file: !342, line: 108, type: !364, isLocal: false, isDefinition: true)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !365, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !366, identifier: ".?AUhalide_mutex@@")
!365 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !364, file: !365, line: 121, baseType: !368, size: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 32, elements: !371)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !197, line: 68, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !197, line: 12, baseType: !70)
!371 = !{!372}
!372 = !DISubrange(count: 1)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "free_list", linkageName: "?free_list@Cuda@Internal@Runtime@Halide@@3PAUFreeListItem@1234@A", scope: !2, file: !342, line: 117, type: !375, isLocal: false, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreeListItem", scope: !2, file: !342, line: 111, size: 160, flags: DIFlagTypePassByValue, elements: !377, identifier: ".?AUFreeListItem@Cuda@Internal@Runtime@Halide@@")
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !376, file: !342, line: 112, baseType: !283, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !376, file: !342, line: 113, baseType: !204, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !376, file: !342, line: 114, baseType: !318, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !342, line: 115, baseType: !196, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !342, line: 116, baseType: !375, size: 32, offset: 128)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "free_list_lock", linkageName: "?free_list_lock@Cuda@Internal@Runtime@Halide@@3Uhalide_mutex@@A", scope: !2, file: !342, line: 118, type: !364, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "?compilation_cache@Cuda@Internal@Runtime@Halide@@3V?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@24@A", scope: !2, file: !342, line: 248, type: !387, isLocal: false, isDefinition: true)
!387 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *,Halide::Runtime::Internal::Cuda::CUmod_st *>", scope: !389, file: !388, line: 8, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !390, templateParams: !440, identifier: ".?AV?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@")
!388 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "24284584ab13511a21d3d0444c1ab74f")
!389 = !DINamespace(name: "Internal", scope: !5)
!390 = !{!391, !401, !402, !405, !407, !408, !410, !411, !413, !414, !415, !418, !425, !430, !434, !437}
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !387, file: !388, line: 9, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !392, identifier: ".?AUCachedCompilation@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@")
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !391, file: !388, line: 10, baseType: !205, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !391, file: !388, line: 11, baseType: !235, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !391, file: !388, line: 12, baseType: !370, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !391, file: !388, line: 13, baseType: !370, size: 32, offset: 96)
!397 = !DISubprogram(name: "CachedCompilation", scope: !391, file: !388, line: 15, type: !398, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!398 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !399)
!399 = !{null, !400, !205, !235, !370, !370}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !387, file: !388, line: 22, baseType: !364, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !387, file: !388, line: 24, baseType: !403, flags: DIFlagStaticMember)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !387, file: !388, line: 25, baseType: !406, flags: DIFlagStaticMember)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !387, file: !388, line: 26, baseType: !13, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !387, file: !388, line: 27, baseType: !409, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !387, file: !388, line: 28, baseType: !13, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !387, file: !388, line: 30, baseType: !412, flags: DIFlagStaticMember)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !387, file: !388, line: 31, baseType: !412, flags: DIFlagStaticMember)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !387, file: !388, line: 33, baseType: !370, size: 32, offset: 128)
!415 = !DISubprogram(name: "kernel_hash", linkageName: "?kernel_hash@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@SAIPAUCUctx_st@Cuda@2Runtime@3@II@Z", scope: !387, file: !388, line: 36, type: !416, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!416 = !DISubroutineType(types: !417)
!417 = !{!369, !205, !370, !370}
!418 = !DISubprogram(name: "insert", linkageName: "?insert@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@QAE_NABUCachedCompilation@123@@Z", scope: !387, file: !388, line: 47, type: !419, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !420)
!420 = !{!421, !422, !423}
!421 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!423 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!425 = !DISubprogram(name: "find_internal", linkageName: "?find_internal@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@QAE_NPAUCUctx_st@Cuda@2Runtime@3@IAAPAPAUCUmod_st@5263@H@Z", scope: !387, file: !388, line: 73, type: !426, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !427)
!427 = !{!421, !422, !205, !370, !428, !13}
!428 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!430 = !DISubprogram(name: "lookup", linkageName: "?lookup@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@QAE_NPAUCUctx_st@Cuda@2Runtime@3@PAXAAPAUCUmod_st@5263@@Z", scope: !387, file: !388, line: 97, type: !431, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !432)
!432 = !{!421, !422, !205, !260, !433}
!433 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !235, size: 32)
!434 = !DISubprogram(name: "resize_table", linkageName: "?resize_table@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@QAE_NH@Z", scope: !387, file: !388, line: 108, type: !435, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !436)
!436 = !{!421, !422, !13}
!437 = !DISubprogram(name: "release_hold", linkageName: "?release_hold@?$GPUCompilationCache@PAUCUctx_st@Cuda@Internal@Runtime@Halide@@PAUCUmod_st@2345@@Internal@Halide@@QAEXPAXPAUCUctx_st@Cuda@2Runtime@3@0@Z", scope: !387, file: !388, line: 211, type: !438, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !439)
!439 = !{null, !422, !260, !205, !260}
!440 = !{!441, !442}
!441 = !DITemplateTypeParameter(name: "ContextT", type: !205)
!442 = !DITemplateTypeParameter(name: "ModuleStateT", type: !235)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "cuda_allocation_pool", scope: !3, file: !342, line: 569, type: !445, isLocal: false, isDefinition: true)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_allocation_pool", file: !365, line: 1887, size: 64, flags: DIFlagTypePassByValue, elements: !446, identifier: ".?AUhalide_device_allocation_pool@@")
!446 = !{!447, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "release_unused", scope: !445, file: !365, line: 1888, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DISubroutineType(types: !450)
!450 = !{!13, !260}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !365, line: 1889, baseType: !452, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "cuda_device_interface", linkageName: "?cuda_device_interface@Cuda@Internal@Runtime@Halide@@3Uhalide_device_interface_t@@A", scope: !2, file: !342, line: 1405, type: !455, isLocal: false, isDefinition: true)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !365, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !456, identifier: ".?AUhalide_device_interface_t@@")
!456 = !{!457, !579, !583, !584, !588, !589, !590, !591, !592, !596, !601, !605, !606, !610, !611, !615}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !455, file: !365, line: 724, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DISubroutineType(types: !460)
!460 = !{!13, !260, !461, !468}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !365, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !463, identifier: ".?AUhalide_buffer_t@@")
!463 = !{!464, !467, !470, !474, !475, !515, !517, !540, !541, !551, !555, !558, !559, !562, !563, !566, !569, !570, !571, !575, !578}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !462, file: !365, line: 1425, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !197, line: 10, baseType: !466)
!466 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !462, file: !365, line: 1428, baseType: !468, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !462, file: !365, line: 1433, baseType: !471, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !197, line: 16, baseType: !473)
!473 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !462, file: !365, line: 1436, baseType: !465, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !365, line: 1439, baseType: !476, size: 32, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !365, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !477, identifier: ".?AUhalide_type_t@@")
!477 = !{!478, !487, !488, !491, !495, !498, !503, !507, !508, !509, !512}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !476, file: !365, line: 434, baseType: !479, size: 8, align: 8)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !365, line: 413, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !365, line: 403, baseType: !472, size: 8, elements: !481, identifier: ".?AW4halide_type_code_t@@")
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!483 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!484 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!485 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!486 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !476, file: !365, line: 442, baseType: !472, size: 8, align: 8, offset: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !476, file: !365, line: 446, baseType: !489, size: 16, align: 16, offset: 16)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !197, line: 14, baseType: !490)
!490 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!491 = !DISubprogram(name: "halide_type_t", scope: !476, file: !365, line: 453, type: !492, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !493)
!493 = !{null, !494, !479, !472, !489}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!495 = !DISubprogram(name: "halide_type_t", scope: !476, file: !365, line: 459, type: !496, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !497)
!497 = !{null, !494}
!498 = !DISubprogram(name: "with_lanes", linkageName: "?with_lanes@halide_type_t@@QBE?AU1@G@Z", scope: !476, file: !365, line: 463, type: !499, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !500)
!500 = !{!476, !501, !489}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!503 = !DISubprogram(name: "operator==", linkageName: "??8halide_type_t@@QBE_NABU0@@Z", scope: !476, file: !365, line: 468, type: !504, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !505)
!505 = !{!421, !501, !506}
!506 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !502, size: 32)
!507 = !DISubprogram(name: "operator!=", linkageName: "??9halide_type_t@@QBE_NABU0@@Z", scope: !476, file: !365, line: 472, type: !504, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubprogram(name: "operator<", linkageName: "??Mhalide_type_t@@QBE_NABU0@@Z", scope: !476, file: !365, line: 476, type: !504, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QBEHXZ", scope: !476, file: !365, line: 481, type: !510, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !511)
!511 = !{!13, !501}
!512 = !DISubprogram(name: "as_u32", linkageName: "?as_u32@halide_type_t@@QBEIXZ", scope: !476, file: !365, line: 485, type: !513, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!513 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !514)
!514 = !{!370, !501}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !462, file: !365, line: 1442, baseType: !516, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !197, line: 11, baseType: !13)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !462, file: !365, line: 1446, baseType: !518, size: 32, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !365, line: 1409, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !365, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !521, identifier: ".?AUhalide_dimension_t@@")
!521 = !{!522, !523, !524, !525, !526, !530, !533, !539}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !520, file: !365, line: 1383, baseType: !516, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !520, file: !365, line: 1383, baseType: !516, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !520, file: !365, line: 1383, baseType: !516, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !520, file: !365, line: 1386, baseType: !370, size: 32, offset: 96)
!526 = !DISubprogram(name: "halide_dimension_t", scope: !520, file: !365, line: 1388, type: !527, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !528)
!528 = !{null, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!530 = !DISubprogram(name: "halide_dimension_t", scope: !520, file: !365, line: 1389, type: !531, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !532)
!532 = !{null, !529, !516, !516, !516, !370}
!533 = !DISubprogram(name: "operator==", linkageName: "??8halide_dimension_t@@QBE_NABU0@@Z", scope: !520, file: !365, line: 1393, type: !534, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !535)
!535 = !{!421, !536, !538}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!538 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !537, size: 32)
!539 = !DISubprogram(name: "operator!=", linkageName: "??9halide_dimension_t@@QBE_NABU0@@Z", scope: !520, file: !365, line: 1400, type: !534, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !462, file: !365, line: 1449, baseType: !260, size: 32, offset: 288)
!541 = !DISubprogram(name: "get_flag", linkageName: "?get_flag@halide_buffer_t@@QBE_NW4halide_buffer_flags@@@Z", scope: !462, file: !365, line: 1454, type: !542, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !543)
!543 = !{!421, !544, !546}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !365, line: 1416, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 1415, baseType: !13, size: 32, elements: !548, identifier: ".?AW4halide_buffer_flags@@")
!548 = !{!549, !550}
!549 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1)
!550 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2)
!551 = !DISubprogram(name: "set_flag", linkageName: "?set_flag@halide_buffer_t@@QAEXW4halide_buffer_flags@@_N@Z", scope: !462, file: !365, line: 1458, type: !552, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !553)
!553 = !{null, !554, !546, !421}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!555 = !DISubprogram(name: "host_dirty", linkageName: "?host_dirty@halide_buffer_t@@QBE_NXZ", scope: !462, file: !365, line: 1466, type: !556, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !557)
!557 = !{!421, !544}
!558 = !DISubprogram(name: "device_dirty", linkageName: "?device_dirty@halide_buffer_t@@QBE_NXZ", scope: !462, file: !365, line: 1470, type: !556, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DISubprogram(name: "set_host_dirty", linkageName: "?set_host_dirty@halide_buffer_t@@QAEX_N@Z", scope: !462, file: !365, line: 1474, type: !560, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !561)
!561 = !{null, !554, !421}
!562 = !DISubprogram(name: "set_device_dirty", linkageName: "?set_device_dirty@halide_buffer_t@@QAEX_N@Z", scope: !462, file: !365, line: 1478, type: !560, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = !DISubprogram(name: "number_of_elements", linkageName: "?number_of_elements@halide_buffer_t@@QBEIXZ", scope: !462, file: !365, line: 1485, type: !564, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !565)
!565 = !{!196, !544}
!566 = !DISubprogram(name: "begin", linkageName: "?begin@halide_buffer_t@@QBEPAEXZ", scope: !462, file: !365, line: 1495, type: !567, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !568)
!568 = !{!471, !544}
!569 = !DISubprogram(name: "end", linkageName: "?end@halide_buffer_t@@QBEPAEXZ", scope: !462, file: !365, line: 1506, type: !567, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubprogram(name: "size_in_bytes", linkageName: "?size_in_bytes@halide_buffer_t@@QBEIXZ", scope: !462, file: !365, line: 1518, type: !564, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubprogram(name: "address_of", linkageName: "?address_of@halide_buffer_t@@QBEPAEPBH@Z", scope: !462, file: !365, line: 1523, type: !572, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !573)
!573 = !{!471, !544, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!575 = !DISubprogram(name: "device_sync", linkageName: "?device_sync@halide_buffer_t@@QAEHPAX@Z", scope: !462, file: !365, line: 1534, type: !576, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!576 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !577)
!577 = !{!13, !554, !260}
!578 = !DISubprogram(name: "is_bounds_query", linkageName: "?is_bounds_query@halide_buffer_t@@QBE_NXZ", scope: !462, file: !365, line: 1545, type: !556, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !455, file: !365, line: 726, baseType: !580, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!13, !260, !461}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !455, file: !365, line: 727, baseType: !580, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !455, file: !365, line: 728, baseType: !585, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !260, !468}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !455, file: !365, line: 730, baseType: !580, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !455, file: !365, line: 731, baseType: !458, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !455, file: !365, line: 733, baseType: !458, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !455, file: !365, line: 735, baseType: !580, size: 32, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !455, file: !365, line: 736, baseType: !593, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{!13, !260, !461, !468, !461}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !455, file: !365, line: 738, baseType: !597, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!13, !260, !600, !461}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !455, file: !365, line: 740, baseType: !602, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{!13, !260, !600, !13, !13, !461}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !455, file: !365, line: 742, baseType: !580, size: 32, offset: 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !455, file: !365, line: 743, baseType: !607, size: 32, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!13, !260, !461, !465, !468}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !455, file: !365, line: 745, baseType: !580, size: 32, offset: 416)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !455, file: !365, line: 746, baseType: !612, size: 32, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{!13, !260, !76, !76}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !455, file: !365, line: 747, baseType: !616, size: 32, offset: 480)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !619, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !620, identifier: ".?AUhalide_device_interface_impl_t@@")
!619 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "973e1c360c8f9d0d9344920815b6525d")
!620 = !{!621, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !642}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !618, file: !619, line: 16, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{null}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !618, file: !619, line: 17, baseType: !622, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !618, file: !619, line: 18, baseType: !580, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !618, file: !619, line: 19, baseType: !580, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !618, file: !619, line: 20, baseType: !580, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !618, file: !619, line: 21, baseType: !448, size: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !618, file: !619, line: 22, baseType: !580, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !618, file: !619, line: 23, baseType: !580, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !618, file: !619, line: 24, baseType: !580, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !618, file: !619, line: 25, baseType: !580, size: 32, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !618, file: !619, line: 26, baseType: !593, size: 32, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !618, file: !619, line: 28, baseType: !597, size: 32, offset: 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !618, file: !619, line: 31, baseType: !602, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !618, file: !619, line: 35, baseType: !580, size: 32, offset: 416)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !618, file: !619, line: 37, baseType: !639, size: 32, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{!13, !260, !461, !465}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !618, file: !619, line: 38, baseType: !580, size: 32, offset: 480)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "cuda_device_interface_impl", linkageName: "?cuda_device_interface_impl@Cuda@Internal@Runtime@Halide@@3Uhalide_device_interface_impl_t@@A", scope: !2, file: !342, line: 1386, type: !618, isLocal: false, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !646, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !647, retainedTypes: !695, globals: !919, imports: !966, nameTableKind: None)
!646 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "c931c080956aea8bd054fc653f238906")
!647 = !{!480, !547, !12, !90, !246, !648}
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !365, line: 990, baseType: !13, size: 32, elements: !649, identifier: ".?AW4halide_error_code_t@@")
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!650 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!651 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!652 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!653 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!654 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!655 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!656 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!657 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!658 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!659 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!660 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!661 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!662 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!663 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!664 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!665 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!666 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!667 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!668 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!669 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!670 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!671 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!672 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!673 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!674 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!675 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!676 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!677 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!678 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!679 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!680 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!681 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!682 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!683 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!684 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!685 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!686 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!687 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!688 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!689 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!690 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!691 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!692 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!693 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!694 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!695 = !{!260, !696, !465, !774, !13, !369, !283, !375, !259, !841, !842, !196, !843, !719, !188, !844, !847, !850, !853, !856, !859, !862, !866, !869, !872, !875, !878, !882, !885, !889, !892, !895, !898, !901, !906, !909, !912, !915, !918, !409, !370, !387}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !698, file: !697, line: 203, baseType: !699)
!697 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a97d2909b01229a33f8a6f2cb0fa6ab8")
!698 = !DINamespace(scope: !3)
!699 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0,1024>", scope: !698, file: !697, line: 30, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !700, templateParams: !771, identifier: ".?AV?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@")
!700 = !{!701, !702, !703, !704, !705, !706, !708, !712, !716, !721, !724, !727, !730, !734, !737, !740, !744, !747, !753, !756, !759, !764, !765, !768, !769, !770}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !699, file: !697, line: 32, baseType: !188, size: 32, flags: DIFlagPublic)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !699, file: !697, line: 32, baseType: !188, size: 32, offset: 32, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !699, file: !697, line: 32, baseType: !188, size: 32, offset: 64, flags: DIFlagPublic)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !699, file: !697, line: 33, baseType: !260, size: 32, offset: 96, flags: DIFlagPublic)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !699, file: !697, line: 34, baseType: !421, size: 8, offset: 128, flags: DIFlagPublic)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !699, file: !697, line: 35, baseType: !707, size: 8, offset: 136, flags: DIFlagPublic)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !371)
!708 = !DISubprogram(name: "Printer", scope: !699, file: !697, line: 37, type: !709, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!709 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !710)
!710 = !{null, !711, !260, !188}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!712 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@PBD@Z", scope: !699, file: !697, line: 57, type: !713, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!713 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !714)
!714 = !{!715, !711, !275}
!715 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !699, size: 32)
!716 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@_J@Z", scope: !699, file: !697, line: 67, type: !717, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!717 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !718)
!718 = !{!715, !711, !719}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !197, line: 9, baseType: !720)
!720 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!721 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@H@Z", scope: !699, file: !697, line: 72, type: !722, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !723)
!723 = !{!715, !711, !516}
!724 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@_K@Z", scope: !699, file: !697, line: 77, type: !725, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !726)
!726 = !{!715, !711, !465}
!727 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@I@Z", scope: !699, file: !697, line: 82, type: !728, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !729)
!729 = !{!715, !711, !370}
!730 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@N@Z", scope: !699, file: !697, line: 87, type: !731, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!731 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !732)
!732 = !{!715, !711, !733}
!733 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!734 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@M@Z", scope: !699, file: !697, line: 92, type: !735, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !736)
!736 = !{!715, !711, !404}
!737 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@PBX@Z", scope: !699, file: !697, line: 97, type: !738, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !739)
!739 = !{!715, !711, !237}
!740 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV1?A0x6F7B8F51@234@G@Z", scope: !699, file: !697, line: 102, type: !741, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!741 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !742)
!742 = !{!715, !711, !743}
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!744 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@ABUhalide_type_t@@@Z", scope: !699, file: !697, line: 108, type: !745, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!745 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !746)
!746 = !{!715, !711, !506}
!747 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@ABUhalide_buffer_t@@@Z", scope: !699, file: !697, line: 113, type: !748, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !749)
!749 = !{!715, !711, !750}
!750 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !365, line: 1550, baseType: !462)
!753 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEPBDXZ", scope: !699, file: !697, line: 119, type: !754, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !755)
!755 = !{!275, !711}
!756 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXXZ", scope: !699, file: !697, line: 131, type: !757, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!757 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !758)
!758 = !{null, !711}
!759 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QBE_KXZ", scope: !699, file: !697, line: 139, type: !760, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !761)
!761 = !{!465, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!764 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QBE_KXZ", scope: !699, file: !697, line: 143, type: !760, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXH@Z", scope: !699, file: !697, line: 148, type: !766, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !767)
!767 = !{null, !711, !13}
!768 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEPBDXZ", scope: !699, file: !697, line: 158, type: !754, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!769 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXXZ", scope: !699, file: !697, line: 162, type: !757, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubprogram(name: "~Printer", scope: !699, file: !697, line: 166, type: !757, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !{!772, !773}
!772 = !DITemplateValueParameter(name: "type", type: !13, value: i32 0)
!773 = !DITemplateValueParameter(name: "length", type: !466, value: i64 1024)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !698, file: !697, line: 199, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1,1024>", scope: !698, file: !697, line: 30, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !776, templateParams: !839, identifier: ".?AV?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@")
!776 = !{!777, !778, !779, !780, !781, !782, !783, !787, !791, !794, !797, !800, !803, !806, !809, !812, !815, !818, !821, !824, !827, !832, !833, !836, !837, !838}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !775, file: !697, line: 32, baseType: !188, size: 32, flags: DIFlagPublic)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !775, file: !697, line: 32, baseType: !188, size: 32, offset: 32, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !775, file: !697, line: 32, baseType: !188, size: 32, offset: 64, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !775, file: !697, line: 33, baseType: !260, size: 32, offset: 96, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !775, file: !697, line: 34, baseType: !421, size: 8, offset: 128, flags: DIFlagPublic)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !775, file: !697, line: 35, baseType: !707, size: 8, offset: 136, flags: DIFlagPublic)
!783 = !DISubprogram(name: "Printer", scope: !775, file: !697, line: 37, type: !784, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!784 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !785)
!785 = !{null, !786, !260, !188}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!787 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@PBD@Z", scope: !775, file: !697, line: 57, type: !788, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!788 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !789)
!789 = !{!790, !786, !275}
!790 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !775, size: 32)
!791 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@_J@Z", scope: !775, file: !697, line: 67, type: !792, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !793)
!793 = !{!790, !786, !719}
!794 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@H@Z", scope: !775, file: !697, line: 72, type: !795, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!795 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !796)
!796 = !{!790, !786, !516}
!797 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@_K@Z", scope: !775, file: !697, line: 77, type: !798, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!798 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !799)
!799 = !{!790, !786, !465}
!800 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@I@Z", scope: !775, file: !697, line: 82, type: !801, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !802)
!802 = !{!790, !786, !370}
!803 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@N@Z", scope: !775, file: !697, line: 87, type: !804, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!804 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !805)
!805 = !{!790, !786, !733}
!806 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@M@Z", scope: !775, file: !697, line: 92, type: !807, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !808)
!808 = !{!790, !786, !404}
!809 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@PBX@Z", scope: !775, file: !697, line: 97, type: !810, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !811)
!811 = !{!790, !786, !237}
!812 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV1?A0x6F7B8F51@234@G@Z", scope: !775, file: !697, line: 102, type: !813, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!813 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !814)
!814 = !{!790, !786, !743}
!815 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@ABUhalide_type_t@@@Z", scope: !775, file: !697, line: 108, type: !816, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !817)
!817 = !{!790, !786, !506}
!818 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@ABUhalide_buffer_t@@@Z", scope: !775, file: !697, line: 113, type: !819, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !820)
!820 = !{!790, !786, !750}
!821 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEPBDXZ", scope: !775, file: !697, line: 119, type: !822, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!822 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !823)
!823 = !{!275, !786}
!824 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXXZ", scope: !775, file: !697, line: 131, type: !825, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !826)
!826 = !{null, !786}
!827 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QBE_KXZ", scope: !775, file: !697, line: 139, type: !828, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !829)
!829 = !{!465, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!832 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QBE_KXZ", scope: !775, file: !697, line: 143, type: !828, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXH@Z", scope: !775, file: !697, line: 148, type: !834, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!834 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !835)
!835 = !{null, !786, !13}
!836 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEPBDXZ", scope: !775, file: !697, line: 158, type: !822, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$00$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXXZ", scope: !775, file: !697, line: 162, type: !825, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubprogram(name: "~Printer", scope: !775, file: !697, line: 166, type: !825, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !{!840, !773}
!840 = !DITemplateValueParameter(name: "type", type: !13, value: i32 1)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !197, line: 28, baseType: !13)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !846)
!846 = !{!12, !70}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !849)
!849 = !{!12, !76}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !852)
!852 = !{!12, !76, !13}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !855)
!855 = !{!12, !76, !90, !13}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !858)
!858 = !{!12, !188, !13, !13}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !861)
!861 = !{!12, !222, !13}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !864)
!864 = !{!12, !865, !70, !13}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !868)
!868 = !{!12, !205}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !871)
!871 = !{!12}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !874)
!874 = !{!12, !205, !222}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !877)
!877 = !{!12, !429, !237}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !880)
!880 = !{!12, !429, !237, !70, !881, !259}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !884)
!884 = !{!12, !235}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !887)
!887 = !{!12, !888, !235, !275}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !891)
!891 = !{!12, !222, !70}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !894)
!894 = !{!12, !70, !237, !70}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !897)
!897 = !{!12, !260, !70, !70}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !900)
!900 = !{!12, !70, !70, !70}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !903)
!903 = !{!12, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !908)
!908 = !{!12, !273, !70, !70, !70, !70, !70, !70, !70, !319, !259, !259}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !911)
!911 = !{!12, !865}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !914)
!914 = !{!12, !260, !13, !70}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DISubroutineType(cc: DW_CC_BORLAND_stdcall, types: !917)
!917 = !{!12, !319}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!919 = !{!0, !71, !77, !84, !183, !190, !198, !207, !212, !217, !223, !228, !239, !261, !266, !277, !284, !289, !294, !299, !304, !313, !321, !323, !325, !330, !335, !340, !343, !360, !362, !373, !383, !920, !385, !922, !924, !926, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !443, !956, !958, !960, !643, !453, !962, !964}
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!921 = distinct !DIGlobalVariable(name: "CUDA_SUCCESS", scope: !645, file: !11, line: 44, type: !12, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression(DW_OP_constu, 301, DW_OP_stack_value))
!923 = distinct !DIGlobalVariable(name: "CUDA_ERROR_FILE_NOT_FOUND", scope: !645, file: !11, line: 76, type: !12, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression(DW_OP_constu, 100, DW_OP_stack_value))
!925 = distinct !DIGlobalVariable(name: "CUDA_ERROR_NO_DEVICE", scope: !645, file: !11, line: 53, type: !12, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!927 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT", scope: !645, file: !11, line: 119, type: !90, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!929 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_BLOCK", scope: !645, file: !11, line: 102, type: !90, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression(DW_OP_constu, 10, DW_OP_stack_value))
!931 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_WARP_SIZE", scope: !645, file: !11, line: 112, type: !90, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!933 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_X", scope: !645, file: !11, line: 103, type: !90, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!935 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Y", scope: !645, file: !11, line: 104, type: !90, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!937 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Z", scope: !645, file: !11, line: 105, type: !90, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!939 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_X", scope: !645, file: !11, line: 106, type: !90, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!941 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Y", scope: !645, file: !11, line: 107, type: !90, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression(DW_OP_constu, 7, DW_OP_stack_value))
!943 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Z", scope: !645, file: !11, line: 108, type: !90, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!945 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_SHARED_MEMORY_PER_BLOCK", scope: !645, file: !11, line: 110, type: !90, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression(DW_OP_constu, 9, DW_OP_stack_value))
!947 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_TOTAL_CONSTANT_MEMORY", scope: !645, file: !11, line: 111, type: !90, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression(DW_OP_constu, 75, DW_OP_stack_value))
!949 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MAJOR", scope: !645, file: !11, line: 181, type: !90, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression(DW_OP_constu, 76, DW_OP_stack_value))
!951 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MINOR", scope: !645, file: !11, line: 182, type: !90, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression(DW_OP_constu, 86, DW_OP_stack_value))
!953 = distinct !DIGlobalVariable(name: "CU_DEVICE_ATTRIBUTE_MAX", scope: !645, file: !11, line: 192, type: !90, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!955 = distinct !DIGlobalVariable(name: "halide_error_code_generic_error", scope: !645, file: !365, line: 995, type: !648, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!957 = distinct !DIGlobalVariable(name: "CUDA_ERROR_DEINITIALIZED", scope: !645, file: !11, line: 48, type: !12, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!959 = distinct !DIGlobalVariable(name: "CUDA_ERROR_OUT_OF_MEMORY", scope: !645, file: !11, line: 46, type: !12, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression(DW_OP_constu, 18446744073709551574, DW_OP_stack_value))
!961 = distinct !DIGlobalVariable(name: "halide_error_code_incompatible_device_interface", scope: !645, file: !365, line: 1164, type: !648, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!963 = distinct !DIGlobalVariable(name: "halide_buffer_flag_device_dirty", scope: !645, file: !365, line: 1416, type: !547, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!965 = distinct !DIGlobalVariable(name: "halide_buffer_flag_host_dirty", scope: !645, file: !365, line: 1415, type: !547, isLocal: true, isDefinition: true)
!966 = !{!967, !968, !969}
!967 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !645, entity: !3, file: !197, line: 225)
!968 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !645, entity: !3, file: !342, line: 125)
!969 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !645, entity: !2, file: !342, line: 126)
!970 = !{i32 1, !"NumRegisterParameters", i32 0}
!971 = !{i32 2, !"CodeView", i32 1}
!972 = !{i32 2, !"Debug Info Version", i32 3}
!973 = !{i32 1, !"wchar_size", i32 2}
!974 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!975 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "?copy_memory_helper@Internal@Runtime@Halide@@YAXABUdevice_copy@123@H_J1@Z", scope: !3, file: !976, line: 47, type: !977, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !993)
!976 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "01ded04610775bfbd39cee48a3f67c54")
!977 = !DISubroutineType(types: !978)
!978 = !{null, !979, !13, !719, !719}
!979 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !976, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !982, identifier: ".?AUdevice_copy@Internal@Runtime@Halide@@")
!982 = !{!983, !984, !985, !986, !990, !991, !992}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !981, file: !976, line: 35, baseType: !465, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !981, file: !976, line: 35, baseType: !465, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !981, file: !976, line: 37, baseType: !465, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !981, file: !976, line: 39, baseType: !987, size: 1024, offset: 192)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 1024, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 16)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !981, file: !976, line: 41, baseType: !987, size: 1024, offset: 1216)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !981, file: !976, line: 42, baseType: !987, size: 1024, offset: 2240)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !981, file: !976, line: 44, baseType: !465, size: 64, offset: 3264)
!993 = !{!994, !995, !996, !997, !998, !1001, !1002}
!994 = !DILocalVariable(name: "dst_off", arg: 4, scope: !975, file: !976, line: 47, type: !719)
!995 = !DILocalVariable(name: "src_off", arg: 3, scope: !975, file: !976, line: 47, type: !719)
!996 = !DILocalVariable(name: "d", arg: 2, scope: !975, file: !976, line: 47, type: !13)
!997 = !DILocalVariable(name: "copy", arg: 1, scope: !975, file: !976, line: 47, type: !979)
!998 = !DILocalVariable(name: "from", scope: !999, file: !976, line: 54, type: !237)
!999 = distinct !DILexicalBlock(scope: !1000, file: !976, line: 53)
!1000 = distinct !DILexicalBlock(scope: !975, file: !976, line: 53)
!1001 = !DILocalVariable(name: "to", scope: !999, file: !976, line: 55, type: !260)
!1002 = !DILocalVariable(name: "i", scope: !1003, file: !976, line: 58, type: !465)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !976, line: 58)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !976, line: 57)
!1005 = !DILocation(line: 0, scope: !975)
!1006 = !DILocation(line: 49, scope: !975)
!1007 = !{!1008, !1008, i64 0}
!1008 = !{!"long long", !1009, i64 0}
!1009 = !{!"omnipotent char", !1010, i64 0}
!1010 = !{!"Simple C++ TBAA"}
!1011 = !DILocation(line: 50, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !975, file: !976, line: 49)
!1013 = distinct !{!1013, !1006, !1014, !1015}
!1014 = !DILocation(line: 51, scope: !975)
!1015 = !{!"llvm.loop.mustprogress"}
!1016 = !DILocation(line: 53, scope: !975)
!1017 = !DILocation(line: 0, scope: !1003)
!1018 = !DILocation(line: 58, scope: !1003)
!1019 = !DILocation(line: 54, scope: !999)
!1020 = !{!1021, !1008, i64 0}
!1021 = !{!"?AUdevice_copy@Internal@Runtime@Halide@@", !1008, i64 0, !1008, i64 8, !1008, i64 16, !1009, i64 24, !1009, i64 152, !1009, i64 280, !1008, i64 408}
!1022 = !DILocation(line: 0, scope: !999)
!1023 = !DILocation(line: 55, scope: !999)
!1024 = !{!1021, !1008, i64 8}
!1025 = !DILocation(line: 56, scope: !999)
!1026 = !{!1021, !1008, i64 408}
!1027 = !DILocation(line: 57, scope: !999)
!1028 = !DILocation(line: 59, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !976, line: 58)
!1030 = distinct !DILexicalBlock(scope: !1003, file: !976, line: 58)
!1031 = !DILocation(line: 60, scope: !1029)
!1032 = !DILocation(line: 61, scope: !1029)
!1033 = !DILocation(line: 58, scope: !1030)
!1034 = distinct !{!1034, !1018, !1035, !1015}
!1035 = !DILocation(line: 62, scope: !1003)
!1036 = !DILocation(line: 64, scope: !975)
!1037 = distinct !DISubprogram(name: "copy_memory", linkageName: "?copy_memory@Internal@Runtime@Halide@@YAXABUdevice_copy@123@PAX@Z", scope: !3, file: !976, line: 66, type: !1038, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1040)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !979, !260}
!1040 = !{!1041, !1042}
!1041 = !DILocalVariable(name: "user_context", arg: 2, scope: !1037, file: !976, line: 66, type: !260)
!1042 = !DILocalVariable(name: "copy", arg: 1, scope: !1037, file: !976, line: 66, type: !979)
!1043 = !DILocation(line: 0, scope: !1037)
!1044 = !DILocation(line: 68, scope: !1037)
!1045 = !DILocation(line: 69, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !976, line: 68)
!1047 = distinct !DILexicalBlock(scope: !1037, file: !976, line: 68)
!1048 = !{!1021, !1008, i64 16}
!1049 = !DILocation(line: 70, scope: !1046)
!1050 = !DILocalVariable(name: "mem", arg: 3, scope: !1051, file: !697, line: 37, type: !188)
!1051 = distinct !DISubprogram(name: "Printer", linkageName: "??0?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAE@PAXPAD@Z", scope: !699, file: !697, line: 37, type: !709, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !708, retainedNodes: !1052)
!1052 = !{!1050, !1053, !1054}
!1053 = !DILocalVariable(name: "ctx", arg: 2, scope: !1051, file: !697, line: 37, type: !260)
!1054 = !DILocalVariable(name: "this", arg: 1, scope: !1051, type: !1055, flags: DIFlagArtificial | DIFlagObjectPointer)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!1056 = !DILocation(line: 0, scope: !1051, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 71, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1047, file: !976, line: 70)
!1059 = !DILocation(line: 44, scope: !1060, inlinedAt: !1057)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !697, line: 43)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !697, line: 41)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !697, line: 39)
!1063 = distinct !DILexicalBlock(scope: !1051, file: !697, line: 38)
!1064 = !DILocation(line: 48, scope: !1063, inlinedAt: !1057)
!1065 = !DILocalVariable(name: "arg", arg: 2, scope: !1066, file: !697, line: 57, type: !275)
!1066 = distinct !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@PBD@Z", scope: !699, file: !697, line: 57, type: !713, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !712, retainedNodes: !1067)
!1067 = !{!1065, !1068}
!1068 = !DILocalVariable(name: "this", arg: 1, scope: !1066, type: !1055, flags: DIFlagArtificial | DIFlagObjectPointer)
!1069 = !DILocation(line: 0, scope: !1066, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 71, scope: !1058)
!1071 = !DILocation(line: 62, scope: !1072, inlinedAt: !1070)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !697, line: 61)
!1073 = distinct !DILexicalBlock(scope: !1066, file: !697, line: 59)
!1074 = !DILocalVariable(name: "this", arg: 1, scope: !1075, type: !1055, flags: DIFlagArtificial | DIFlagObjectPointer)
!1075 = distinct !DISubprogram(name: "~Printer", linkageName: "??1?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAE@XZ", scope: !699, file: !697, line: 166, type: !757, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !770, retainedNodes: !1076)
!1076 = !{!1074}
!1077 = !DILocation(line: 0, scope: !1075, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 71, scope: !1058)
!1079 = !DILocation(line: 168, scope: !1080, inlinedAt: !1078)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !697, line: 167)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !697, line: 167)
!1082 = distinct !DILexicalBlock(scope: !1075, file: !697, line: 166)
!1083 = !DILocation(line: 169, scope: !1080, inlinedAt: !1078)
!1084 = !DILocation(line: 49, scope: !1085, inlinedAt: !1057)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !697, line: 48)
!1086 = distinct !DILexicalBlock(scope: !1063, file: !697, line: 48)
!1087 = !DILocation(line: 50, scope: !1085, inlinedAt: !1057)
!1088 = !{!1009, !1009, i64 0}
!1089 = !DILocalVariable(name: "this", arg: 1, scope: !1090, type: !1055, flags: DIFlagArtificial | DIFlagObjectPointer)
!1090 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEXXZ", scope: !699, file: !697, line: 162, type: !757, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !769, retainedNodes: !1091)
!1091 = !{!1089}
!1092 = !DILocation(line: 0, scope: !1090, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 170, scope: !1094, inlinedAt: !1078)
!1094 = distinct !DILexicalBlock(scope: !1081, file: !697, line: 169)
!1095 = !DILocation(line: 163, scope: !1090, inlinedAt: !1093)
!1096 = !DILocation(line: 174, scope: !1097, inlinedAt: !1078)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !697, line: 173)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !697, line: 173)
!1099 = distinct !DILexicalBlock(scope: !1094, file: !697, line: 171)
!1100 = !DILocation(line: 178, scope: !1094, inlinedAt: !1078)
!1101 = !DILocation(line: 181, scope: !1102, inlinedAt: !1078)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !697, line: 180)
!1103 = distinct !DILexicalBlock(scope: !1082, file: !697, line: 180)
!1104 = !DILocation(line: 72, scope: !1058)
!1105 = !DILocation(line: 73, scope: !1037)
!1106 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "?make_buffer_copy@Internal@Runtime@Halide@@YA?AUdevice_copy@123@PBUhalide_buffer_t@@_N01@Z", scope: !3, file: !976, line: 76, type: !1107, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1110)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!981, !1109, !421, !1109, !421}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1118, !1120, !1123, !1126, !1128, !1131, !1132, !1133, !1135}
!1111 = !DILocalVariable(name: "dst_host", arg: 4, scope: !1106, file: !976, line: 77, type: !421)
!1112 = !DILocalVariable(name: "dst", arg: 3, scope: !1106, file: !976, line: 77, type: !1109)
!1113 = !DILocalVariable(name: "src_host", arg: 2, scope: !1106, file: !976, line: 76, type: !421)
!1114 = !DILocalVariable(name: "src", arg: 1, scope: !1106, file: !976, line: 76, type: !1109)
!1115 = !DILocalVariable(name: "c", scope: !1106, file: !976, line: 79, type: !981)
!1116 = !DILocalVariable(name: "i", scope: !1117, file: !976, line: 83, type: !13)
!1117 = distinct !DILexicalBlock(scope: !1106, file: !976, line: 83)
!1118 = !DILocalVariable(name: "i", scope: !1119, file: !976, line: 91, type: !13)
!1119 = distinct !DILexicalBlock(scope: !1106, file: !976, line: 91)
!1120 = !DILocalVariable(name: "zero", scope: !1121, file: !976, line: 100, type: !981)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !976, line: 98)
!1122 = distinct !DILexicalBlock(scope: !1106, file: !976, line: 96)
!1123 = !DILocalVariable(name: "zero", scope: !1124, file: !976, line: 107, type: !981)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !976, line: 104)
!1125 = distinct !DILexicalBlock(scope: !1106, file: !976, line: 104)
!1126 = !DILocalVariable(name: "i", scope: !1127, file: !976, line: 115, type: !13)
!1127 = distinct !DILexicalBlock(scope: !1106, file: !976, line: 115)
!1128 = !DILocalVariable(name: "dst_stride_bytes", scope: !1129, file: !976, line: 117, type: !465)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !976, line: 115)
!1130 = distinct !DILexicalBlock(scope: !1127, file: !976, line: 115)
!1131 = !DILocalVariable(name: "src_stride_bytes", scope: !1129, file: !976, line: 118, type: !465)
!1132 = !DILocalVariable(name: "insert", scope: !1129, file: !976, line: 120, type: !13)
!1133 = !DILocalVariable(name: "j", scope: !1134, file: !976, line: 128, type: !13)
!1134 = distinct !DILexicalBlock(scope: !1129, file: !976, line: 128)
!1135 = !DILocalVariable(name: "j", scope: !1136, file: !976, line: 151, type: !13)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !976, line: 151)
!1137 = distinct !DILexicalBlock(scope: !1106, file: !976, line: 145)
!1138 = !DILocation(line: 0, scope: !1124)
!1139 = !DILocation(line: 0, scope: !1121)
!1140 = !DILocation(line: 0, scope: !1106)
!1141 = !DILocation(line: 79, scope: !1106)
!1142 = !DILocation(line: 80, scope: !1106)
!1143 = !{!1144, !1145, i64 12}
!1144 = !{!"?AUhalide_buffer_t@@", !1008, i64 0, !1145, i64 8, !1145, i64 12, !1008, i64 16, !1146, i64 24, !1149, i64 28, !1145, i64 32, !1145, i64 36}
!1145 = !{!"any pointer", !1009, i64 0}
!1146 = !{!"?AUhalide_type_t@@", !1147, i64 0, !1009, i64 1, !1148, i64 2}
!1147 = !{!"?AW4halide_type_code_t@@", !1009, i64 0}
!1148 = !{!"short", !1009, i64 0}
!1149 = !{!"int", !1009, i64 0}
!1150 = !{!1144, !1008, i64 0}
!1151 = !DILocation(line: 81, scope: !1106)
!1152 = !DILocalVariable(name: "this", arg: 1, scope: !1153, type: !1155, flags: DIFlagArtificial | DIFlagObjectPointer)
!1153 = distinct !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QBEHXZ", scope: !476, file: !365, line: 481, type: !510, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !509, retainedNodes: !1154)
!1154 = !{!1152}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!1156 = !DILocation(line: 0, scope: !1153, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 82, scope: !1106)
!1158 = !DILocation(line: 482, scope: !1153, inlinedAt: !1157)
!1159 = !{!1146, !1009, i64 1}
!1160 = !DILocation(line: 82, scope: !1106)
!1161 = !DILocation(line: 0, scope: !1117)
!1162 = !DILocation(line: 84, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !976, line: 83)
!1164 = distinct !DILexicalBlock(scope: !1117, file: !976, line: 83)
!1165 = !DILocation(line: 85, scope: !1163)
!1166 = !DILocation(line: 86, scope: !1163)
!1167 = !DILocation(line: 90, scope: !1106)
!1168 = !DILocation(line: 0, scope: !1119)
!1169 = !DILocation(line: 91, scope: !1119)
!1170 = !{!1144, !1149, i64 28}
!1171 = !{!1144, !1145, i64 32}
!1172 = !DILocation(line: 92, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !976, line: 91)
!1174 = distinct !DILexicalBlock(scope: !1119, file: !976, line: 91)
!1175 = !{!1176, !1149, i64 0}
!1176 = !{!"?AUhalide_dimension_t@@", !1149, i64 0, !1149, i64 4, !1149, i64 8, !1149, i64 12}
!1177 = !{!1176, !1149, i64 8}
!1178 = !DILocation(line: 94, scope: !1106)
!1179 = !DILocation(line: 96, scope: !1106)
!1180 = !DILocation(line: 91, scope: !1174)
!1181 = distinct !{!1181, !1169, !1182, !1015}
!1182 = !DILocation(line: 93, scope: !1119)
!1183 = !DILocation(line: 0, scope: !1153, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 96, scope: !1106)
!1185 = !DILocation(line: 0, scope: !1153, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 96, scope: !1106)
!1187 = !DILocation(line: 482, scope: !1153, inlinedAt: !1186)
!1188 = !DILocation(line: 100, scope: !1121)
!1189 = !DILocation(line: 101, scope: !1121)
!1190 = !DILocation(line: 104, scope: !1106)
!1191 = !DILocation(line: 0, scope: !1127)
!1192 = !DILocation(line: 115, scope: !1127)
!1193 = !DILocation(line: 107, scope: !1124)
!1194 = !DILocation(line: 108, scope: !1124)
!1195 = !DILocation(line: 144, scope: !1106)
!1196 = !DILocation(line: 153, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !976, line: 151)
!1198 = distinct !DILexicalBlock(scope: !1136, file: !976, line: 151)
!1199 = !DILocation(line: 154, scope: !1197)
!1200 = !DILocation(line: 152, scope: !1197)
!1201 = !DILocation(line: 147, scope: !1137)
!1202 = !DILocation(line: 0, scope: !1136)
!1203 = !DILocation(line: 117, scope: !1129)
!1204 = !DILocation(line: 0, scope: !1153, inlinedAt: !1205)
!1205 = distinct !DILocation(line: 117, scope: !1129)
!1206 = !DILocation(line: 0, scope: !1129)
!1207 = !DILocation(line: 118, scope: !1129)
!1208 = !DILocation(line: 0, scope: !1153, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 118, scope: !1129)
!1210 = !DILocation(line: 121, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1129, file: !976, line: 121)
!1212 = !DILocation(line: 124, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !976, line: 121)
!1214 = distinct !DILexicalBlock(scope: !1211, file: !976, line: 121)
!1215 = !DILocation(line: 121, scope: !1214)
!1216 = distinct !{!1216, !1210, !1217, !1015}
!1217 = !DILocation(line: 127, scope: !1211)
!1218 = !DILocation(line: 0, scope: !1211)
!1219 = !DILocation(line: 0, scope: !1134)
!1220 = !DILocation(line: 128, scope: !1134)
!1221 = !DILocation(line: 129, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !976, line: 128)
!1223 = distinct !DILexicalBlock(scope: !1134, file: !976, line: 128)
!1224 = !DILocation(line: 130, scope: !1222)
!1225 = !DILocation(line: 131, scope: !1222)
!1226 = !DILocation(line: 133, scope: !1129)
!1227 = !{!1176, !1149, i64 4}
!1228 = !DILocation(line: 135, scope: !1129)
!1229 = !DILocation(line: 136, scope: !1129)
!1230 = !DILocation(line: 115, scope: !1130)
!1231 = distinct !{!1231, !1192, !1232, !1015}
!1232 = !DILocation(line: 137, scope: !1127)
!1233 = distinct !{!1233, !1220, !1234, !1015}
!1234 = !DILocation(line: 132, scope: !1134)
!1235 = distinct !{!1235, !1195, !1236, !1015, !1237}
!1236 = !DILocation(line: 159, scope: !1106)
!1237 = !{!"llvm.loop.peeled.count", i32 7}
!1238 = !DILocation(line: 160, scope: !1106)
!1239 = !{i64 0, i64 8, !1007, i64 8, i64 8, !1007, i64 16, i64 8, !1007, i64 24, i64 128, !1088, i64 152, i64 128, !1088, i64 280, i64 128, !1088, i64 408, i64 8, !1007}
!1240 = !DILocation(line: 161, scope: !1106)
!1241 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "?make_host_to_device_copy@Internal@Runtime@Halide@@YA?AUdevice_copy@123@PBUhalide_buffer_t@@@Z", scope: !3, file: !976, line: 163, type: !1242, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1244)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!981, !1109}
!1244 = !{!1245}
!1245 = !DILocalVariable(name: "buf", arg: 1, scope: !1241, file: !976, line: 163, type: !1109)
!1246 = !DILocation(line: 0, scope: !1241)
!1247 = !DILocation(line: 164, scope: !1241)
!1248 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "?make_device_to_host_copy@Internal@Runtime@Halide@@YA?AUdevice_copy@123@PBUhalide_buffer_t@@@Z", scope: !3, file: !976, line: 167, type: !1242, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1249)
!1249 = !{!1250}
!1250 = !DILocalVariable(name: "buf", arg: 1, scope: !1248, file: !976, line: 167, type: !1109)
!1251 = !DILocation(line: 0, scope: !1248)
!1252 = !DILocation(line: 168, scope: !1248)
!1253 = distinct !DISubprogram(name: "halide_cuda_get_symbol", scope: !342, file: !342, line: 34, type: !1254, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1256)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!260, !260, !275}
!1256 = !{!1257, !1258, !1259, !1260, !1262}
!1257 = !DILocalVariable(name: "name", arg: 2, scope: !1253, file: !342, line: 34, type: !275)
!1258 = !DILocalVariable(name: "user_context", arg: 1, scope: !1253, file: !342, line: 34, type: !260)
!1259 = !DILocalVariable(name: "symbol", scope: !1253, file: !342, line: 38, type: !260)
!1260 = !DILocalVariable(name: "lib_names", scope: !1253, file: !342, line: 43, type: !1261)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 32, elements: !371)
!1262 = !DILocalVariable(name: "i", scope: !1263, file: !342, line: 52, type: !196)
!1263 = distinct !DILexicalBlock(scope: !1253, file: !342, line: 52)
!1264 = !DILocation(line: 0, scope: !1253)
!1265 = !DILocation(line: 38, scope: !1253)
!1266 = !{!1145, !1145, i64 0}
!1267 = !DILocation(line: 39, scope: !1253)
!1268 = !DILocation(line: 0, scope: !1263)
!1269 = !DILocation(line: 53, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !342, line: 52)
!1271 = distinct !DILexicalBlock(scope: !1263, file: !342, line: 52)
!1272 = !DILocation(line: 54, scope: !1270)
!1273 = !DILocation(line: 0, scope: !1051, inlinedAt: !1274)
!1274 = distinct !DILocation(line: 55, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !342, line: 54)
!1276 = distinct !DILexicalBlock(scope: !1270, file: !342, line: 54)
!1277 = !DILocation(line: 44, scope: !1060, inlinedAt: !1274)
!1278 = !DILocation(line: 48, scope: !1063, inlinedAt: !1274)
!1279 = !DILocation(line: 49, scope: !1085, inlinedAt: !1274)
!1280 = !DILocation(line: 50, scope: !1085, inlinedAt: !1274)
!1281 = !DILocation(line: 51, scope: !1085, inlinedAt: !1274)
!1282 = !DILocation(line: 0, scope: !1086, inlinedAt: !1274)
!1283 = !DILocation(line: 0, scope: !1066, inlinedAt: !1284)
!1284 = distinct !DILocation(line: 55, scope: !1275)
!1285 = !DILocation(line: 62, scope: !1072, inlinedAt: !1284)
!1286 = !DILocation(line: 0, scope: !1066, inlinedAt: !1287)
!1287 = distinct !DILocation(line: 55, scope: !1275)
!1288 = !DILocation(line: 62, scope: !1072, inlinedAt: !1287)
!1289 = !DILocation(line: 0, scope: !1066, inlinedAt: !1290)
!1290 = distinct !DILocation(line: 55, scope: !1275)
!1291 = !DILocation(line: 62, scope: !1072, inlinedAt: !1290)
!1292 = !DILocation(line: 0, scope: !1075, inlinedAt: !1293)
!1293 = distinct !DILocation(line: 55, scope: !1275)
!1294 = !DILocation(line: 167, scope: !1082, inlinedAt: !1293)
!1295 = !DILocation(line: 168, scope: !1080, inlinedAt: !1293)
!1296 = !DILocation(line: 169, scope: !1080, inlinedAt: !1293)
!1297 = !DILocation(line: 0, scope: !1090, inlinedAt: !1298)
!1298 = distinct !DILocation(line: 170, scope: !1094, inlinedAt: !1293)
!1299 = !DILocation(line: 163, scope: !1090, inlinedAt: !1298)
!1300 = !DILocation(line: 174, scope: !1097, inlinedAt: !1293)
!1301 = !DILocation(line: 178, scope: !1094, inlinedAt: !1293)
!1302 = !DILocation(line: 181, scope: !1102, inlinedAt: !1293)
!1303 = !DILocation(line: 60, scope: !1253)
!1304 = !DILocation(line: 56, scope: !1275)
!1305 = !DILocation(line: 61, scope: !1253)
!1306 = distinct !DISubprogram(name: "load_libcuda", linkageName: "?load_libcuda@Cuda@Internal@Runtime@Halide@@YAXPAX@Z", scope: !2, file: !342, line: 73, type: !1307, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !1309)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !260}
!1309 = !{!1310}
!1310 = !DILocalVariable(name: "user_context", arg: 1, scope: !1306, file: !342, line: 73, type: !260)
!1311 = !DILocation(line: 0, scope: !1306)
!1312 = !DILocation(line: 0, scope: !1051, inlinedAt: !1313)
!1313 = distinct !DILocation(line: 74, scope: !1306)
!1314 = !DILocation(line: 44, scope: !1060, inlinedAt: !1313)
!1315 = !DILocation(line: 48, scope: !1063, inlinedAt: !1313)
!1316 = !DILocation(line: 49, scope: !1085, inlinedAt: !1313)
!1317 = !DILocation(line: 50, scope: !1085, inlinedAt: !1313)
!1318 = !DILocation(line: 51, scope: !1085, inlinedAt: !1313)
!1319 = !DILocation(line: 0, scope: !1086, inlinedAt: !1313)
!1320 = !DILocation(line: 0, scope: !1066, inlinedAt: !1321)
!1321 = distinct !DILocation(line: 74, scope: !1306)
!1322 = !DILocation(line: 62, scope: !1072, inlinedAt: !1321)
!1323 = !DILocalVariable(name: "arg", arg: 2, scope: !1324, file: !697, line: 97, type: !237)
!1324 = distinct !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0x6F7B8F51@Internal@Runtime@Halide@@QAEAAV0?A0x6F7B8F51@123@PBX@Z", scope: !699, file: !697, line: 97, type: !738, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !645, declaration: !737, retainedNodes: !1325)
!1325 = !{!1323, !1326}
!1326 = !DILocalVariable(name: "this", arg: 1, scope: !1324, type: !1055, flags: DIFlagArtificial | DIFlagObjectPointer)
!1327 = !DILocation(line: 0, scope: !1324, inlinedAt: !1328)
!1328 = distinct !DILocation(line: 74, scope: !1306)
!1329 = !DILocation(line: 98, scope: !1324, inlinedAt: !1328)
!1330 = !DILocation(line: 0, scope: !1066, inlinedAt: !1331)
!1331 = distinct !DILocation(line: 74, scope: !1306)
!1332 = !DILocation(line: 62, scope: !1072, inlinedAt: !1331)
!1333 = !DILocation(line: 0, scope: !1075, inlinedAt: !1334)
!1334 = distinct !DILocation(line: 74, scope: !1306)
!1335 = !DILocation(line: 167, scope: !1082, inlinedAt: !1334)
!1336 = !DILocation(line: 168, scope: !1080, inlinedAt: !1334)
!1337 = !DILocation(line: 169, scope: !1080, inlinedAt: !1334)
!1338 = !DILocation(line: 0, scope: !1090, inlinedAt: !1339)
!1339 = distinct !DILocation(line: 170, scope: !1094, inlinedAt: !1334)
!1340 = !DILocation(line: 163, scope: !1090, inlinedAt: !1339)
!1341 = !DILocation(line: 174, scope: !1097, inlinedAt: !1334)
!1342 = !DILocation(line: 178, scope: !1094, inlinedAt: !1334)
!1343 = !DILocation(line: 181, scope: !1102, inlinedAt: !1334)
!1344 = !DILocation(line: 75, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1306, file: !342, line: 75)
!1346 = !DILocation(line: 75, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1348, file: !342, line: 75)
!1348 = distinct !DILexicalBlock(scope: !1345, file: !342, line: 75)
!1349 = !DILocalVariable(name: "optional", arg: 3, scope: !1350, file: !342, line: 64, type: !421)
!1350 = distinct !DISubprogram(name: "get_cuda_symbol<Halide::Runtime::Internal::Cuda::CUresult (*)(unsigned int) __attribute__((stdcall))>", linkageName: "??$get_cuda_symbol@P6G?AW4CUresult@Cuda@Internal@Runtime@Halide@@I@Z@Cuda@Internal@Runtime@Halide@@YAP6G?AW4CUresult@0123@I@ZPAXPBD_N@Z", scope: !2, file: !342, line: 64, type: !1351, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, templateParams: !1357, retainedNodes: !1353)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!844, !260, !275, !421}
!1353 = !{!1349, !1354, !1355, !1356}
!1354 = !DILocalVariable(name: "name", arg: 2, scope: !1350, file: !342, line: 64, type: !275)
!1355 = !DILocalVariable(name: "user_context", arg: 1, scope: !1350, file: !342, line: 64, type: !260)
!1356 = !DILocalVariable(name: "s", scope: !1350, file: !342, line: 65, type: !844)
!1357 = !{!1358}
!1358 = !DITemplateTypeParameter(name: "T", type: !844)
!1359 = !DILocation(line: 0, scope: !1350, inlinedAt: !1360)
!1360 = distinct !DILocation(line: 19, scope: !1361)
!1361 = !DILexicalBlockFile(scope: !1306, file: !6, discriminator: 0)
!1362 = !DILocation(line: 65, scope: !1350, inlinedAt: !1360)
!1363 = !DILocation(line: 66, scope: !1350, inlinedAt: !1360)
!1364 = !DILocalVariable(name: "mem", arg: 3, scope: !1365, file: !697, line: 37, type: !188)
