; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, [4 x i8], %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8, [7 x i8] }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32, [4 x i8] }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i64] }
%struct.halide_thread = type { i32 }
%struct._qurt_thread_attr = type { [16 x i8], i8, i8, i16, i8, i8, i16, i32, i8* }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "halide_qurt_default_thread_priority", scope: !2, file: !8, line: 37, type: !406, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !3, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !310, imports: !401, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!4 = !{}
!5 = !{!6, !25, !26, !30, !101, !136, !137, !178, !203, !213, !184, !223, !236, !240, !248, !305, !173, !265, !309}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !9, file: !8, line: 14, size: 256, flags: DIFlagTypePassByValue, elements: !10)
!8 = !DIFile(filename: "src/runtime/qurt_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !DINamespace(scope: null)
!10 = !{!11, !16, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !7, file: !8, line: 15, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !7, file: !8, line: 16, baseType: !15, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !7, file: !8, line: 17, baseType: !15, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !7, file: !8, line: 18, baseType: !19, size: 32, offset: 192)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 9, size: 32, flags: DIFlagTypePassByValue, elements: !20, identifier: "_ZTS13halide_thread")
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !8, line: 10, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_t", file: !23, line: 18, baseType: !24)
!23 = !DIFile(filename: "src/runtime/mini_qurt.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !27, line: 61, baseType: !28)
!27 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !27, line: 10, baseType: !29)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !33, file: !32, line: 254, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !37, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE")
!32 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!33 = !DINamespace(name: "Synchronization", scope: !34)
!34 = !DINamespace(name: "Internal", scope: !35)
!35 = !DINamespace(name: "Runtime", scope: !36)
!36 = !DINamespace(name: "Halide", scope: null)
!37 = !{!38, !93, !94, !95, !96, !100}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !31, file: !32, line: 255, baseType: !39, size: 320)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !33, file: !8, line: 84, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !40, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE")
!40 = !{!41, !53, !65, !67, !73, !77, !81, !84, !87, !88, !89, !90, !91, !92}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !39, file: !8, line: 85, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_mutex_t", file: !23, line: 211, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "qurt_mutex_aligned8", file: !23, line: 201, size: 128, flags: DIFlagTypePassByValue, elements: !44, identifier: "_ZTS19qurt_mutex_aligned8")
!44 = !{!45, !52}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !23, line: 203, baseType: !46, size: 128)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !23, line: 203, size: 128, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !47, identifier: "_ZTSN19qurt_mutex_aligned8Ut_E")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "holder", scope: !46, file: !23, line: 204, baseType: !24, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !23, line: 205, baseType: !24, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !46, file: !23, line: 206, baseType: !24, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !46, file: !23, line: 207, baseType: !24, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !43, file: !23, line: 209, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !39, file: !8, line: 86, baseType: !54, size: 128, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_cond_t", file: !23, line: 224, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !23, line: 214, size: 128, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTS11qurt_cond_t")
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !55, file: !23, line: 216, baseType: !29, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !55, file: !23, line: 222, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !23, line: 217, size: 128, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN11qurt_cond_tUt_E")
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !59, file: !23, line: 218, baseType: !24, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting", scope: !59, file: !23, line: 219, baseType: !24, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !59, file: !23, line: 220, baseType: !24, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !59, file: !23, line: 221, baseType: !24, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !39, file: !8, line: 87, baseType: !66, size: 8, offset: 256)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DISubprogram(name: "thread_parker", scope: !39, file: !8, line: 89, type: !68, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!73 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSERKS3_", scope: !39, file: !8, line: 90, type: !74, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !70, !71}
!76 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39, size: 64)
!77 = !DISubprogram(name: "thread_parker", scope: !39, file: !8, line: 91, type: !78, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !70, !80}
!80 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !39, size: 64)
!81 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSEOS3_", scope: !39, file: !8, line: 92, type: !82, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!82 = !DISubroutineType(types: !83)
!83 = !{!76, !70, !80}
!84 = !DISubprogram(name: "thread_parker", scope: !39, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !70}
!87 = !DISubprogram(name: "~thread_parker", scope: !39, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !39, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!89 = !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !39, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !39, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!91 = !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !39, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !39, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !32, line: 273, baseType: !30, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !32, line: 274, baseType: !30, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !31, file: !32, line: 275, baseType: !30, size: 64, offset: 448)
!96 = !DISubprogram(name: "word_lock_queue_data", scope: !31, file: !32, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!100 = !DISubprogram(name: "~word_lock_queue_data", scope: !31, file: !32, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !33, file: !32, line: 475, size: 196608, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !103, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10hash_tableE")
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !102, file: !32, line: 476, baseType: !105, size: 196608)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 196608, elements: !134)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !33, file: !32, line: 463, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !107, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11hash_bucketE")
!107 = !{!108, !120, !133}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !106, file: !32, line: 464, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !33, file: !32, line: 283, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !110, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9word_lockE")
!110 = !{!111, !112, !116, !117, !118, !119}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !32, line: 284, baseType: !26, size: 64)
!112 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !32, line: 286, type: !113, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !32, line: 287, type: !113, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubprogram(name: "word_lock", scope: !109, file: !32, line: 290, type: !113, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !32, line: 291, type: !113, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock6unlockEv", scope: !109, file: !32, line: 304, type: !113, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !106, file: !32, line: 466, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !33, file: !32, line: 448, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !123, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10queue_dataE")
!123 = !{!124, !125, !126, !127, !128, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !122, file: !32, line: 449, baseType: !39, size: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !122, file: !32, line: 451, baseType: !26, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !32, line: 452, baseType: !121, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !122, file: !32, line: 453, baseType: !26, size: 64, offset: 448)
!128 = !DISubprogram(name: "queue_data", scope: !122, file: !32, line: 455, type: !129, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!132 = !DISubprogram(name: "~queue_data", scope: !122, file: !32, line: 457, type: !129, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !106, file: !32, line: 467, baseType: !121, size: 64, offset: 128)
!134 = !{!135}
!135 = !DISubrange(count: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !33, file: !32, line: 829, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !139, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization21mutex_parking_controlE")
!139 = !{!140, !172, !174}
!140 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !138, baseType: !141, extraData: i32 0)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !33, file: !32, line: 592, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !142, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15parking_controlE")
!142 = !{!143, !156, !157, !162, !168}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !141, file: !32, line: 593, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!66, !15, !147}
!147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !33, file: !32, line: 576, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !149, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15validate_actionE")
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !148, file: !32, line: 577, baseType: !66, size: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !148, file: !32, line: 578, baseType: !26, size: 64, offset: 64)
!152 = !DISubprogram(name: "validate_action", scope: !148, file: !32, line: 580, type: !153, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !141, file: !32, line: 594, baseType: !12, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !141, file: !32, line: 595, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!26, !15, !161, !66}
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !141, file: !32, line: 596, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !15, !166, !66, !66}
!166 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!168 = !DISubprogram(name: "parking_control", scope: !141, file: !32, line: 598, type: !169, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !138, file: !32, line: 830, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!174 = !DISubprogram(name: "mutex_parking_control", scope: !138, file: !32, line: 832, type: !175, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !173}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !33, file: !32, line: 958, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !180, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization22signal_parking_controlE")
!180 = !{!181, !182, !183, !199}
!181 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !179, baseType: !141, extraData: i32 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !179, file: !32, line: 959, baseType: !173, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !179, file: !32, line: 960, baseType: !184, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !33, file: !32, line: 859, size: 64, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10fast_mutexE")
!186 = !{!187, !188, !192, !193, !194, !195, !198}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !185, file: !32, line: 860, baseType: !26, size: 64)
!188 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex9lock_fullEv", scope: !185, file: !32, line: 862, type: !189, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!192 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11unlock_fullEv", scope: !185, file: !32, line: 906, type: !189, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex4lockEv", scope: !185, file: !32, line: 920, type: !189, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex6unlockEv", scope: !185, file: !32, line: 929, type: !189, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubprogram(name: "make_parked_if_locked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex21make_parked_if_lockedEv", scope: !185, file: !32, line: 938, type: !196, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !191}
!198 = !DISubprogram(name: "make_parked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11make_parkedEv", scope: !185, file: !32, line: 953, type: !189, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubprogram(name: "signal_parking_control", scope: !179, file: !32, line: 962, type: !200, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202, !173, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !33, file: !32, line: 985, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !205, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization25broadcast_parking_controlE")
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !204, baseType: !141, extraData: i32 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !204, file: !32, line: 986, baseType: !173, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !204, file: !32, line: 987, baseType: !184, size: 64, offset: 320)
!209 = !DISubprogram(name: "broadcast_parking_control", scope: !204, file: !32, line: 989, type: !210, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212, !173, !184}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !33, file: !32, line: 1026, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !215, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20wait_parking_controlE")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !214, baseType: !141, extraData: i32 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !214, file: !32, line: 1027, baseType: !173, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !214, file: !32, line: 1028, baseType: !184, size: 64, offset: 320)
!219 = !DISubprogram(name: "wait_parking_control", scope: !214, file: !32, line: 1030, type: !220, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !173, !184}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !33, file: !32, line: 1072, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !225, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9fast_condE")
!225 = !{!226, !227, !231, !232, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !32, line: 1073, baseType: !26, size: 64)
!227 = !DISubprogram(name: "fast_cond", scope: !224, file: !32, line: 1076, type: !228, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!231 = !DISubprogram(name: "signal", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond6signalEv", scope: !224, file: !32, line: 1078, type: !228, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubprogram(name: "broadcast", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond9broadcastEv", scope: !224, file: !32, line: 1092, type: !228, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubprogram(name: "wait", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond4waitEPNS2_10fast_mutexE", scope: !224, file: !32, line: 1105, type: !234, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !230, !184}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !32, line: 1164, size: 64, flags: DIFlagTypePassByValue, elements: !238, identifier: "_ZTS18halide_mutex_array")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !237, file: !32, line: 1165, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !242, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !243, identifier: "_ZTS12halide_mutex")
!242 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !241, file: !242, line: 121, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !34, file: !250, line: 26, size: 1024, flags: DIFlagTypePassByValue, elements: !251, identifier: "_ZTSN6Halide7Runtime8Internal4workE")
!250 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!251 = !{!252, !281, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !249, file: !250, line: 27, baseType: !253, size: 448)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !242, line: 201, size: 448, flags: DIFlagTypePassByValue, elements: !254, identifier: "_ZTS22halide_parallel_task_t")
!254 = !{!255, !263, !264, !268, !276, !277, !278, !279, !280}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !253, file: !242, line: 204, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !242, line: 192, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!161, !15, !161, !161, !260, !15}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 16, baseType: !262)
!262 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !253, file: !242, line: 207, baseType: !260, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !242, line: 210, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !253, file: !242, line: 214, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !242, line: 177, size: 128, flags: DIFlagTypePassByValue, elements: !271, identifier: "_ZTS26halide_semaphore_acquire_t")
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !270, file: !242, line: 178, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !242, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS18halide_semaphore_t")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !242, line: 179, baseType: !161, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !253, file: !242, line: 215, baseType: !161, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !253, file: !242, line: 238, baseType: !161, size: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !253, file: !242, line: 243, baseType: !66, size: 8, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !249, file: !250, line: 31, baseType: !282, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !242, line: 158, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!161, !15, !161, !260}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !249, file: !250, line: 33, baseType: !248, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !249, file: !250, line: 34, baseType: !248, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !249, file: !250, line: 35, baseType: !161, size: 32, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !249, file: !250, line: 36, baseType: !248, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !249, file: !250, line: 37, baseType: !161, size: 32, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !249, file: !250, line: 39, baseType: !15, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !249, file: !250, line: 40, baseType: !161, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !249, file: !250, line: 41, baseType: !161, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !249, file: !250, line: 42, baseType: !161, size: 32, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !249, file: !250, line: 44, baseType: !66, size: 8, offset: 992)
!296 = !DISubprogram(name: "make_runnable", linkageName: "_ZN6Halide7Runtime8Internal4work13make_runnableEv", scope: !249, file: !250, line: 46, type: !297, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!66, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!300 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal4work7runningEv", scope: !249, file: !250, line: 62, type: !301, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!301 = !DISubroutineType(types: !302)
!302 = !{!66, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !250, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !307, identifier: "_ZTS23halide_semaphore_impl_t")
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !306, file: !250, line: 712, baseType: !161, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!310 = !{!0, !311, !314, !316, !321, !323, !361, !367, !373, !379, !386, !392, !398}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!312 = distinct !DIGlobalVariable(name: "lock_bit", scope: !33, file: !32, line: 250, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!315 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !33, file: !32, line: 251, type: !313, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13table_storageE", scope: !33, file: !32, line: 478, type: !318, isLocal: false, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 196608, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 24576)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!322 = distinct !DIGlobalVariable(name: "parked_bit", scope: !33, file: !32, line: 252, type: !313, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "_ZN6Halide7Runtime8Internal10work_queueE", scope: !34, file: !250, line: 166, type: !325, isLocal: false, isDefinition: true)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !34, file: !250, line: 94, size: 17024, flags: DIFlagTypePassByValue, elements: !326, identifier: "_ZTSN6Halide7Runtime8Internal12work_queue_tE")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !346, !347, !348, !349, !354, !357}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !325, file: !250, line: 96, baseType: !241, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !325, file: !250, line: 99, baseType: !161, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !325, file: !250, line: 103, baseType: !161, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !325, file: !250, line: 106, baseType: !248, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !325, file: !250, line: 109, baseType: !161, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !325, file: !250, line: 122, baseType: !335, size: 64, offset: 320)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !242, line: 125, size: 64, flags: DIFlagTypePassByValue, elements: !336, identifier: "_ZTS11halide_cond")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !335, file: !242, line: 126, baseType: !245, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !325, file: !250, line: 122, baseType: !335, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !325, file: !250, line: 122, baseType: !335, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !325, file: !250, line: 129, baseType: !343, size: 16384, offset: 576)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 16384, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 16960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 16968)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !325, file: !250, line: 139, baseType: !161, size: 32, offset: 16992)
!349 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t7runningEv", scope: !325, file: !250, line: 141, type: !350, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!66, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!354 = !DISubprogram(name: "assert_zeroed", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t13assert_zeroedEv", scope: !325, file: !250, line: 146, type: !355, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !352}
!357 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal12work_queue_t5resetEv", scope: !325, file: !250, line: 158, type: !358, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "_ZN6Halide7Runtime8Internal14custom_do_taskE", scope: !34, file: !250, line: 567, type: !363, isLocal: false, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !242, line: 259, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!161, !15, !282, !161, !260}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "_ZN6Halide7Runtime8Internal19custom_do_loop_taskE", scope: !34, file: !250, line: 568, type: !369, isLocal: false, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !242, line: 268, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!161, !15, !256, !161, !161, !260, !15}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "_ZN6Halide7Runtime8Internal17custom_do_par_forE", scope: !34, file: !250, line: 569, type: !375, isLocal: false, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !242, line: 167, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!161, !15, !282, !161, !161, !260}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "_ZN6Halide7Runtime8Internal24custom_do_parallel_tasksE", scope: !34, file: !250, line: 570, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !242, line: 281, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!161, !15, !161, !385, !15}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "_ZN6Halide7Runtime8Internal21custom_semaphore_initE", scope: !34, file: !250, line: 571, type: !388, isLocal: false, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !242, line: 184, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!161, !273, !161}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "_ZN6Halide7Runtime8Internal28custom_semaphore_try_acquireE", scope: !34, file: !250, line: 572, type: !394, isLocal: false, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !242, line: 186, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!66, !273, !161}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "_ZN6Halide7Runtime8Internal24custom_semaphore_releaseE", scope: !34, file: !250, line: 573, type: !400, isLocal: false, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !242, line: 185, baseType: !389)
!401 = !{!402, !403, !405}
!402 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !34, file: !27, line: 225)
!403 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !404, file: !8, line: 7)
!404 = !DINamespace(name: "Qurt", scope: !34)
!405 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !34, file: !250, line: 579)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 14, baseType: !407)
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !{i32 7, !"Dwarf Version", i32 4}
!409 = !{i32 2, !"Debug Info Version", i32 3}
!410 = !{i32 1, !"wchar_size", i32 4}
!411 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!412 = distinct !DISubprogram(name: "halide_host_cpu_count", scope: !8, file: !8, line: 30, type: !413, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!413 = !DISubroutineType(types: !414)
!414 = !{!161}
!415 = !DILocation(line: 32, column: 5, scope: !412)
!416 = distinct !DISubprogram(name: "halide_set_default_thread_priority", scope: !8, file: !8, line: 39, type: !417, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !161}
!419 = !{!420}
!420 = !DILocalVariable(name: "priority", arg: 1, scope: !416, file: !8, line: 39, type: !161)
!421 = !DILocation(line: 0, scope: !416)
!422 = !DILocation(line: 40, column: 18, scope: !423)
!423 = distinct !DILexicalBlock(scope: !416, file: !8, line: 40, column: 9)
!424 = !DILocation(line: 40, column: 9, scope: !416)
!425 = !DILocation(line: 42, column: 25, scope: !426)
!426 = distinct !DILexicalBlock(scope: !423, file: !8, line: 42, column: 16)
!427 = !DILocation(line: 42, column: 16, scope: !423)
!428 = !DILocation(line: 45, column: 43, scope: !416)
!429 = !DILocation(line: 45, column: 41, scope: !416)
!430 = !{!431, !431, i64 0}
!431 = !{!"short", !432, i64 0}
!432 = !{!"omnipotent char", !433, i64 0}
!433 = !{!"Simple C++ TBAA"}
!434 = !DILocation(line: 46, column: 1, scope: !416)
!435 = distinct !DISubprogram(name: "halide_get_default_thread_priority", scope: !8, file: !8, line: 48, type: !436, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!436 = !DISubroutineType(types: !437)
!437 = !{!406}
!438 = !DILocation(line: 49, column: 12, scope: !435)
!439 = !DILocation(line: 49, column: 5, scope: !435)
!440 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !8, file: !8, line: 52, type: !441, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!25, !12, !15}
!443 = !{!444, !445, !446, !447, !448}
!444 = !DILocalVariable(name: "f", arg: 1, scope: !440, file: !8, line: 52, type: !12)
!445 = !DILocalVariable(name: "closure", arg: 2, scope: !440, file: !8, line: 52, type: !15)
!446 = !DILocalVariable(name: "priority", scope: !440, file: !8, line: 53, type: !406)
!447 = !DILocalVariable(name: "t", scope: !440, file: !8, line: 54, type: !6)
!448 = !DILocalVariable(name: "thread_attr", scope: !440, file: !8, line: 59, type: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_attr_t", file: !23, line: 67, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qurt_thread_attr", file: !23, line: 52, size: 320, flags: DIFlagTypePassByValue, elements: !451, identifier: "_ZTS17_qurt_thread_attr")
!451 = !{!452, !456, !457, !458, !459, !460, !461, !462, !463}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !23, line: 54, baseType: !453, size: 128)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 16)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tcb_partition", scope: !450, file: !23, line: 55, baseType: !262, size: 8, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "affinity", scope: !450, file: !23, line: 57, baseType: !262, size: 8, offset: 136)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !450, file: !23, line: 59, baseType: !407, size: 16, offset: 144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "asid", scope: !450, file: !23, line: 60, baseType: !262, size: 8, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bus_priority", scope: !450, file: !23, line: 61, baseType: !262, size: 8, offset: 168)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "timetest_id", scope: !450, file: !23, line: 62, baseType: !407, size: 16, offset: 176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !450, file: !23, line: 63, baseType: !24, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "stack_addr", scope: !450, file: !23, line: 64, baseType: !15, size: 64, offset: 256)
!464 = !DILocation(line: 0, scope: !440)
!465 = !DILocation(line: 53, column: 25, scope: !440)
!466 = !DILocation(line: 54, column: 43, scope: !440)
!467 = !DILocation(line: 55, column: 8, scope: !440)
!468 = !DILocation(line: 55, column: 10, scope: !440)
!469 = !{!470, !471, i64 0}
!470 = !{!"_ZTSN12_GLOBAL__N_114spawned_threadE", !471, i64 0, !471, i64 8, !471, i64 16, !472, i64 24}
!471 = !{!"any pointer", !432, i64 0}
!472 = !{!"_ZTS13halide_thread", !473, i64 0}
!473 = !{!"int", !432, i64 0}
!474 = !DILocation(line: 56, column: 8, scope: !440)
!475 = !DILocation(line: 56, column: 16, scope: !440)
!476 = !{!470, !471, i64 8}
!477 = !DILocation(line: 57, column: 16, scope: !440)
!478 = !DILocation(line: 57, column: 8, scope: !440)
!479 = !DILocation(line: 57, column: 14, scope: !440)
!480 = !{!470, !471, i64 16}
!481 = !DILocation(line: 58, column: 16, scope: !440)
!482 = !DILocation(line: 58, column: 5, scope: !440)
!483 = !DILocation(line: 59, column: 5, scope: !440)
!484 = !DILocation(line: 59, column: 24, scope: !440)
!485 = !DILocalVariable(name: "attr", arg: 1, scope: !486, file: !23, line: 96, type: !489)
!486 = distinct !DISubprogram(name: "qurt_thread_attr_init", linkageName: "_ZL21qurt_thread_attr_initP17_qurt_thread_attr", scope: !23, file: !23, line: 96, type: !487, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !490)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!490 = !{!485}
!491 = !DILocation(line: 0, scope: !486, inlinedAt: !492)
!492 = distinct !DILocation(line: 60, column: 5, scope: !440)
!493 = !DILocation(line: 98, column: 19, scope: !486, inlinedAt: !492)
!494 = !{!432, !432, i64 0}
!495 = !DILocation(line: 99, column: 11, scope: !486, inlinedAt: !492)
!496 = !DILocation(line: 99, column: 25, scope: !486, inlinedAt: !492)
!497 = !{!498, !432, i64 16}
!498 = !{!"_ZTS17_qurt_thread_attr", !432, i64 0, !432, i64 16, !432, i64 17, !431, i64 18, !432, i64 20, !432, i64 21, !431, i64 22, !473, i64 24, !471, i64 32}
!499 = !DILocation(line: 100, column: 11, scope: !486, inlinedAt: !492)
!500 = !DILocation(line: 101, column: 11, scope: !486, inlinedAt: !492)
!501 = !DILocation(line: 101, column: 16, scope: !486, inlinedAt: !492)
!502 = !{!498, !432, i64 20}
!503 = !DILocation(line: 102, column: 11, scope: !486, inlinedAt: !492)
!504 = !DILocation(line: 102, column: 20, scope: !486, inlinedAt: !492)
!505 = !{!498, !432, i64 17}
!506 = !DILocation(line: 103, column: 11, scope: !486, inlinedAt: !492)
!507 = !DILocation(line: 103, column: 24, scope: !486, inlinedAt: !492)
!508 = !{!498, !432, i64 21}
!509 = !DILocation(line: 104, column: 11, scope: !486, inlinedAt: !492)
!510 = !DILocation(line: 104, column: 23, scope: !486, inlinedAt: !492)
!511 = !{!498, !431, i64 22}
!512 = !DILocation(line: 105, column: 11, scope: !486, inlinedAt: !492)
!513 = !DILocation(line: 106, column: 11, scope: !486, inlinedAt: !492)
!514 = !DILocation(line: 61, column: 54, scope: !440)
!515 = !DILocalVariable(name: "attr", arg: 1, scope: !516, file: !23, line: 152, type: !489)
!516 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_addr", linkageName: "_ZL31qurt_thread_attr_set_stack_addrP17_qurt_thread_attrPv", scope: !23, file: !23, line: 152, type: !517, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !489, !15}
!519 = !{!515, !520}
!520 = !DILocalVariable(name: "stack_addr", arg: 2, scope: !516, file: !23, line: 152, type: !15)
!521 = !DILocation(line: 0, scope: !516, inlinedAt: !522)
!522 = distinct !DILocation(line: 61, column: 5, scope: !440)
!523 = !DILocation(line: 153, column: 22, scope: !516, inlinedAt: !522)
!524 = !{!498, !471, i64 32}
!525 = !DILocalVariable(name: "attr", arg: 1, scope: !526, file: !23, line: 127, type: !489)
!526 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_size", linkageName: "_ZL31qurt_thread_attr_set_stack_sizeP17_qurt_thread_attrj", scope: !23, file: !23, line: 127, type: !527, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !489, !24}
!529 = !{!525, !530}
!530 = !DILocalVariable(name: "stack_size", arg: 2, scope: !526, file: !23, line: 127, type: !24)
!531 = !DILocation(line: 0, scope: !526, inlinedAt: !532)
!532 = distinct !DILocation(line: 62, column: 5, scope: !440)
!533 = !DILocation(line: 128, column: 22, scope: !526, inlinedAt: !532)
!534 = !{!498, !473, i64 24}
!535 = !DILocalVariable(name: "attr", arg: 1, scope: !536, file: !23, line: 170, type: !489)
!536 = distinct !DISubprogram(name: "qurt_thread_attr_set_priority", linkageName: "_ZL29qurt_thread_attr_set_priorityP17_qurt_thread_attrt", scope: !23, file: !23, line: 170, type: !537, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !489, !407}
!539 = !{!535, !540}
!540 = !DILocalVariable(name: "priority", arg: 2, scope: !536, file: !23, line: 170, type: !407)
!541 = !DILocation(line: 0, scope: !536, inlinedAt: !542)
!542 = distinct !DILocation(line: 63, column: 5, scope: !440)
!543 = !DILocation(line: 171, column: 20, scope: !536, inlinedAt: !542)
!544 = !{!498, !431, i64 18}
!545 = !DILocation(line: 64, column: 35, scope: !440)
!546 = !DILocation(line: 64, column: 5, scope: !440)
!547 = !DILocation(line: 65, column: 12, scope: !440)
!548 = !DILocation(line: 66, column: 1, scope: !440)
!549 = !DILocation(line: 65, column: 5, scope: !440)
!550 = !DISubprogram(name: "malloc", scope: !27, file: !27, line: 87, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!551 = !DISubroutineType(types: !552)
!552 = !{!15, !553}
!553 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!554 = !DISubprogram(name: "memalign", scope: !8, file: !8, line: 28, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!555 = !DISubroutineType(types: !556)
!556 = !{!15, !553, !553}
!557 = !DISubprogram(name: "memset", scope: !27, file: !27, line: 96, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!558 = !DISubroutineType(types: !559)
!559 = !{!15, !15, !161, !553}
!560 = !DISubprogram(name: "qurt_thread_create", scope: !23, file: !23, line: 175, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!561 = !DISubroutineType(types: !562)
!562 = !{!161, !563, !564, !12, !15}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!565 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "_ZN12_GLOBAL__N_119spawn_thread_helperEPv", scope: !9, file: !8, line: 20, type: !13, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !566)
!566 = !{!567, !568}
!567 = !DILocalVariable(name: "arg", arg: 1, scope: !565, file: !8, line: 20, type: !15)
!568 = !DILocalVariable(name: "t", scope: !565, file: !8, line: 21, type: !6)
!569 = !DILocation(line: 0, scope: !565)
!570 = !DILocation(line: 22, column: 8, scope: !565)
!571 = !DILocation(line: 22, column: 13, scope: !565)
!572 = !DILocation(line: 22, column: 5, scope: !565)
!573 = !DILocation(line: 23, column: 1, scope: !565)
!574 = distinct !DISubprogram(name: "halide_join_thread", scope: !8, file: !8, line: 68, type: !575, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !25}
!577 = !{!578, !579, !580}
!578 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !574, file: !8, line: 68, type: !25)
!579 = !DILocalVariable(name: "t", scope: !574, file: !8, line: 69, type: !6)
!580 = !DILocalVariable(name: "ret", scope: !574, file: !8, line: 70, type: !161)
!581 = !DILocation(line: 0, scope: !574)
!582 = !DILocation(line: 70, column: 5, scope: !574)
!583 = !DILocation(line: 70, column: 9, scope: !574)
!584 = !{!473, !473, i64 0}
!585 = !DILocation(line: 71, column: 32, scope: !574)
!586 = !{!470, !473, i64 24}
!587 = !DILocation(line: 71, column: 5, scope: !574)
!588 = !DILocation(line: 72, column: 13, scope: !574)
!589 = !DILocation(line: 72, column: 5, scope: !574)
!590 = !DILocation(line: 73, column: 10, scope: !574)
!591 = !DILocation(line: 73, column: 5, scope: !574)
!592 = !DILocation(line: 74, column: 1, scope: !574)
!593 = !DISubprogram(name: "qurt_thread_join", scope: !23, file: !23, line: 194, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!594 = !DISubroutineType(types: !595)
!595 = !{!161, !24, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!597 = !DISubprogram(name: "free", scope: !27, file: !27, line: 86, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!598 = distinct !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !32, line: 321, type: !113, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !112, retainedNodes: !599)
!599 = !{!600, !602, !614, !615, !619, !620, !621}
!600 = !DILocalVariable(name: "this", arg: 1, scope: !598, type: !601, flags: DIFlagArtificial | DIFlagObjectPointer)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!602 = !DILocalVariable(name: "spinner", scope: !598, file: !32, line: 322, type: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !33, file: !32, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !604, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization12spin_controlE")
!604 = !{!605, !606, !610, !613}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !603, file: !32, line: 231, baseType: !161, size: 32)
!606 = !DISubprogram(name: "spin_control", scope: !603, file: !32, line: 235, type: !607, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!610 = !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !603, file: !32, line: 237, type: !611, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DISubroutineType(types: !612)
!612 = !{!66, !609}
!613 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control5resetEv", scope: !603, file: !32, line: 244, type: !607, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DILocalVariable(name: "expected", scope: !598, file: !32, line: 323, type: !26)
!615 = !DILocalVariable(name: "desired", scope: !616, file: !32, line: 328, type: !26)
!616 = distinct !DILexicalBlock(scope: !617, file: !32, line: 327, column: 37)
!617 = distinct !DILexicalBlock(scope: !618, file: !32, line: 327, column: 13)
!618 = distinct !DILexicalBlock(scope: !598, file: !32, line: 326, column: 18)
!619 = !DILocalVariable(name: "node", scope: !618, file: !32, line: 342, type: !31)
!620 = !DILocalVariable(name: "head", scope: !618, file: !32, line: 347, type: !30)
!621 = !DILocalVariable(name: "desired", scope: !618, file: !32, line: 359, type: !26)
!622 = !DILocation(line: 0, scope: !598)
!623 = !DILocation(line: 324, column: 26, scope: !598)
!624 = !DILocalVariable(name: "addr", arg: 1, scope: !625, file: !32, line: 200, type: !629)
!625 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned long long>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_119atomic_load_relaxedIyEEvPT_S6_", scope: !626, file: !32, line: 200, type: !627, scopeLine: 200, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !632, retainedNodes: !630)
!626 = !DINamespace(scope: !33)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !629, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!630 = !{!624, !631}
!631 = !DILocalVariable(name: "val", arg: 2, scope: !625, file: !32, line: 200, type: !629)
!632 = !{!633}
!633 = !DITemplateTypeParameter(name: "T", type: !29)
!634 = !DILocation(line: 0, scope: !625, inlinedAt: !635)
!635 = distinct !DILocation(line: 324, column: 5, scope: !598)
!636 = !DILocation(line: 201, column: 5, scope: !625, inlinedAt: !635)
!637 = !DILocation(line: 326, column: 5, scope: !598)
!638 = !DILocation(line: 327, column: 24, scope: !617)
!639 = !DILocation(line: 327, column: 14, scope: !617)
!640 = !DILocation(line: 327, column: 13, scope: !618)
!641 = !DILocation(line: 328, column: 42, scope: !616)
!642 = !DILocation(line: 0, scope: !616)
!643 = !DILocalVariable(name: "addr", arg: 1, scope: !644, file: !32, line: 191, type: !173)
!644 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_acquire_relaxedEPyS4_S4_", scope: !626, file: !32, line: 191, type: !645, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{!66, !173, !173, !173}
!647 = !{!643, !648, !649}
!648 = !DILocalVariable(name: "expected", arg: 2, scope: !644, file: !32, line: 191, type: !173)
!649 = !DILocalVariable(name: "desired", arg: 3, scope: !644, file: !32, line: 191, type: !173)
!650 = !DILocation(line: 0, scope: !644, inlinedAt: !651)
!651 = distinct !DILocation(line: 330, column: 17, scope: !652)
!652 = distinct !DILexicalBlock(scope: !616, file: !32, line: 330, column: 17)
!653 = !DILocation(line: 192, column: 12, scope: !644, inlinedAt: !651)
!654 = !DILocation(line: 336, column: 67, scope: !655)
!655 = distinct !DILexicalBlock(scope: !618, file: !32, line: 336, column: 13)
!656 = !DILocation(line: 336, column: 73, scope: !655)
!657 = !DILocalVariable(name: "this", arg: 1, scope: !658, type: !660, flags: DIFlagArtificial | DIFlagObjectPointer)
!658 = distinct !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !603, file: !32, line: 237, type: !611, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !610, retainedNodes: !659)
!659 = !{!657}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!661 = !DILocation(line: 0, scope: !658, inlinedAt: !662)
!662 = distinct !DILocation(line: 336, column: 84, scope: !655)
!663 = !DILocation(line: 241, column: 27, scope: !658, inlinedAt: !662)
!664 = !DILocation(line: 336, column: 13, scope: !618)
!665 = !DILocation(line: 239, column: 23, scope: !666, inlinedAt: !662)
!666 = distinct !DILexicalBlock(scope: !667, file: !32, line: 238, column: 29)
!667 = distinct !DILexicalBlock(scope: !658, file: !32, line: 238, column: 13)
!668 = !DILocation(line: 337, column: 13, scope: !669)
!669 = distinct !DILexicalBlock(scope: !655, file: !32, line: 336, column: 99)
!670 = !DILocation(line: 0, scope: !625, inlinedAt: !671)
!671 = distinct !DILocation(line: 338, column: 13, scope: !669)
!672 = !DILocation(line: 201, column: 5, scope: !625, inlinedAt: !671)
!673 = !DILocation(line: 339, column: 13, scope: !669)
!674 = !DILocation(line: 342, column: 9, scope: !618)
!675 = !DILocation(line: 342, column: 30, scope: !618)
!676 = !DILocalVariable(name: "this", arg: 1, scope: !677, type: !30, flags: DIFlagArtificial | DIFlagObjectPointer)
!677 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataC2Ev", scope: !31, file: !32, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !96, retainedNodes: !678)
!678 = !{!676}
!679 = !DILocation(line: 0, scope: !677, inlinedAt: !680)
!680 = distinct !DILocation(line: 342, column: 30, scope: !618)
!681 = !DILocalVariable(name: "this", arg: 1, scope: !682, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!682 = distinct !DISubprogram(name: "thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerC2Ev", scope: !39, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !84, retainedNodes: !683)
!683 = !{!681}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!685 = !DILocation(line: 0, scope: !682, inlinedAt: !686)
!686 = distinct !DILocation(line: 277, column: 19, scope: !677, inlinedAt: !680)
!687 = !DILocation(line: 87, column: 10, scope: !682, inlinedAt: !686)
!688 = !{!689, !690, i64 32}
!689 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE", !432, i64 0, !432, i64 16, !690, i64 32}
!690 = !{!"bool", !432, i64 0}
!691 = !DILocation(line: 95, column: 9, scope: !692, inlinedAt: !686)
!692 = distinct !DILexicalBlock(scope: !682, file: !8, line: 94, column: 35)
!693 = !DILocation(line: 96, column: 9, scope: !692, inlinedAt: !686)
!694 = !DILocation(line: 273, column: 27, scope: !677, inlinedAt: !680)
!695 = !{!696, !471, i64 40}
!696 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE", !689, i64 0, !471, i64 40, !471, i64 48, !471, i64 56}
!697 = !DILocation(line: 274, column: 27, scope: !677, inlinedAt: !680)
!698 = !{!696, !471, i64 48}
!699 = !DILocation(line: 275, column: 27, scope: !677, inlinedAt: !680)
!700 = !{!696, !471, i64 56}
!701 = !DILocalVariable(name: "this", arg: 1, scope: !702, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!702 = distinct !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !39, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !88, retainedNodes: !703)
!703 = !{!701}
!704 = !DILocation(line: 0, scope: !702, inlinedAt: !705)
!705 = distinct !DILocation(line: 344, column: 21, scope: !618)
!706 = !DILocation(line: 106, column: 21, scope: !702, inlinedAt: !705)
!707 = !DILocation(line: 347, column: 72, scope: !618)
!708 = !DILocation(line: 0, scope: !618)
!709 = !DILocation(line: 348, column: 18, scope: !710)
!710 = distinct !DILexicalBlock(scope: !618, file: !32, line: 348, column: 13)
!711 = !DILocation(line: 348, column: 13, scope: !618)
!712 = !DILocation(line: 349, column: 23, scope: !713)
!713 = distinct !DILexicalBlock(scope: !710, file: !32, line: 348, column: 30)
!714 = !DILocation(line: 351, column: 9, scope: !713)
!715 = !DILocation(line: 347, column: 38, scope: !618)
!716 = !DILocation(line: 356, column: 23, scope: !717)
!717 = distinct !DILexicalBlock(scope: !710, file: !32, line: 351, column: 16)
!718 = !DILocation(line: 359, column: 60, scope: !618)
!719 = !DILocation(line: 359, column: 48, scope: !618)
!720 = !DILocalVariable(name: "addr", arg: 1, scope: !721, file: !32, line: 183, type: !173)
!721 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_release_relaxedEPyS4_S4_", scope: !626, file: !32, line: 183, type: !645, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !722)
!722 = !{!720, !723, !724}
!723 = !DILocalVariable(name: "expected", arg: 2, scope: !721, file: !32, line: 183, type: !173)
!724 = !DILocalVariable(name: "desired", arg: 3, scope: !721, file: !32, line: 183, type: !173)
!725 = !DILocation(line: 0, scope: !721, inlinedAt: !726)
!726 = distinct !DILocation(line: 360, column: 13, scope: !727)
!727 = distinct !DILexicalBlock(scope: !618, file: !32, line: 360, column: 13)
!728 = !DILocation(line: 184, column: 12, scope: !721, inlinedAt: !726)
!729 = !DILocalVariable(name: "this", arg: 1, scope: !730, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!730 = distinct !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !39, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !89, retainedNodes: !731)
!731 = !{!729}
!732 = !DILocation(line: 0, scope: !730, inlinedAt: !733)
!733 = distinct !DILocation(line: 361, column: 25, scope: !734)
!734 = distinct !DILexicalBlock(scope: !727, file: !32, line: 360, column: 75)
!735 = !DILocation(line: 110, column: 9, scope: !730, inlinedAt: !733)
!736 = !DILocation(line: 111, column: 16, scope: !730, inlinedAt: !733)
!737 = !{i8 0, i8 2}
!738 = !DILocation(line: 111, column: 9, scope: !730, inlinedAt: !733)
!739 = !DILocation(line: 112, column: 13, scope: !740, inlinedAt: !733)
!740 = distinct !DILexicalBlock(scope: !730, file: !8, line: 111, column: 29)
!741 = distinct !{!741, !738, !742, !743}
!742 = !DILocation(line: 113, column: 9, scope: !730, inlinedAt: !733)
!743 = !{!"llvm.loop.mustprogress"}
!744 = !DILocation(line: 114, column: 9, scope: !730, inlinedAt: !733)
!745 = !DILocation(line: 0, scope: !625, inlinedAt: !746)
!746 = distinct !DILocation(line: 363, column: 13, scope: !734)
!747 = !DILocation(line: 201, column: 5, scope: !625, inlinedAt: !746)
!748 = !DILocation(line: 364, column: 9, scope: !734)
!749 = !DILocalVariable(name: "this", arg: 1, scope: !750, type: !30, flags: DIFlagArtificial | DIFlagObjectPointer)
!750 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataD2Ev", scope: !31, file: !32, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !100, retainedNodes: !751)
!751 = !{!749}
!752 = !DILocation(line: 0, scope: !750, inlinedAt: !753)
!753 = distinct !DILocation(line: 365, column: 5, scope: !598)
!754 = !DILocalVariable(name: "this", arg: 1, scope: !755, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = distinct !DISubprogram(name: "~thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerD2Ev", scope: !39, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !87, retainedNodes: !756)
!756 = !{!754}
!757 = !DILocation(line: 0, scope: !755, inlinedAt: !758)
!758 = distinct !DILocation(line: 280, column: 51, scope: !759, inlinedAt: !753)
!759 = distinct !DILexicalBlock(scope: !750, file: !32, line: 280, column: 51)
!760 = !DILocation(line: 101, column: 9, scope: !761, inlinedAt: !758)
!761 = distinct !DILexicalBlock(scope: !755, file: !8, line: 100, column: 36)
!762 = !DILocation(line: 102, column: 9, scope: !761, inlinedAt: !758)
!763 = !DILocation(line: 365, column: 5, scope: !598)
!764 = distinct !{!764, !637, !763}
!765 = !DILocation(line: 366, column: 1, scope: !598)
!766 = !DISubprogram(name: "halide_thread_yield", scope: !27, file: !27, line: 190, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!767 = !DISubroutineType(types: !768)
!768 = !{null}
!769 = distinct !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !32, line: 368, type: !113, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !116, retainedNodes: !770)
!770 = !{!771, !772, !773, !775, !776, !777, !779, !780, !781, !782, !784, !787, !788, !791}
!771 = !DILocalVariable(name: "this", arg: 1, scope: !769, type: !601, flags: DIFlagArtificial | DIFlagObjectPointer)
!772 = !DILocalVariable(name: "expected", scope: !769, file: !32, line: 369, type: !26)
!773 = !DILocalVariable(name: "thread_queuing", scope: !774, file: !32, line: 375, type: !66)
!774 = distinct !DILexicalBlock(scope: !769, file: !32, line: 372, column: 18)
!775 = !DILocalVariable(name: "none_queued", scope: !774, file: !32, line: 377, type: !66)
!776 = !DILocalVariable(name: "desired", scope: !774, file: !32, line: 382, type: !26)
!777 = !DILocalVariable(name: "head", scope: !778, file: !32, line: 389, type: !30)
!778 = distinct !DILexicalBlock(scope: !769, file: !32, line: 388, column: 18)
!779 = !DILocalVariable(name: "current", scope: !778, file: !32, line: 390, type: !30)
!780 = !DILocalVariable(name: "tail", scope: !778, file: !32, line: 391, type: !30)
!781 = !DILocalVariable(name: "times_through", scope: !778, file: !32, line: 392, type: !161)
!782 = !DILocalVariable(name: "next", scope: !783, file: !32, line: 394, type: !30)
!783 = distinct !DILexicalBlock(scope: !778, file: !32, line: 393, column: 33)
!784 = !DILocalVariable(name: "desired", scope: !785, file: !32, line: 406, type: !26)
!785 = distinct !DILexicalBlock(scope: !786, file: !32, line: 405, column: 34)
!786 = distinct !DILexicalBlock(scope: !778, file: !32, line: 405, column: 13)
!787 = !DILocalVariable(name: "new_tail", scope: !778, file: !32, line: 414, type: !30)
!788 = !DILocalVariable(name: "continue_outer", scope: !789, file: !32, line: 416, type: !66)
!789 = distinct !DILexicalBlock(scope: !790, file: !32, line: 415, column: 34)
!790 = distinct !DILexicalBlock(scope: !778, file: !32, line: 415, column: 13)
!791 = !DILocalVariable(name: "desired", scope: !792, file: !32, line: 418, type: !26)
!792 = distinct !DILexicalBlock(scope: !789, file: !32, line: 417, column: 37)
!793 = !DILocation(line: 0, scope: !769)
!794 = !DILocation(line: 370, column: 26, scope: !769)
!795 = !DILocation(line: 0, scope: !625, inlinedAt: !796)
!796 = distinct !DILocation(line: 370, column: 5, scope: !769)
!797 = !DILocation(line: 201, column: 5, scope: !625, inlinedAt: !796)
!798 = !DILocation(line: 372, column: 5, scope: !769)
!799 = !DILocation(line: 375, column: 41, scope: !774)
!800 = !DILocation(line: 375, column: 31, scope: !774)
!801 = !DILocation(line: 0, scope: !774)
!802 = !DILocation(line: 378, column: 28, scope: !803)
!803 = distinct !DILexicalBlock(scope: !774, file: !32, line: 378, column: 13)
!804 = !DILocation(line: 382, column: 38, scope: !774)
!805 = !DILocation(line: 0, scope: !644, inlinedAt: !806)
!806 = distinct !DILocation(line: 383, column: 13, scope: !807)
!807 = distinct !DILexicalBlock(scope: !774, file: !32, line: 383, column: 13)
!808 = !DILocation(line: 192, column: 12, scope: !644, inlinedAt: !806)
!809 = !DILocation(line: 389, column: 72, scope: !778)
!810 = !DILocation(line: 389, column: 38, scope: !778)
!811 = !DILocation(line: 0, scope: !778)
!812 = !DILocation(line: 391, column: 47, scope: !778)
!813 = !DILocation(line: 393, column: 21, scope: !778)
!814 = !DILocation(line: 393, column: 9, scope: !778)
!815 = !DILocation(line: 394, column: 51, scope: !783)
!816 = !DILocation(line: 0, scope: !783)
!817 = !DILocation(line: 395, column: 13, scope: !818)
!818 = distinct !DILexicalBlock(scope: !819, file: !32, line: 395, column: 13)
!819 = distinct !DILexicalBlock(scope: !783, file: !32, line: 395, column: 13)
!820 = !DILocation(line: 395, column: 13, scope: !819)
!821 = !DILocation(line: 395, column: 13, scope: !822)
!822 = distinct !DILexicalBlock(scope: !818, file: !32, line: 395, column: 13)
!823 = !DILocation(line: 396, column: 19, scope: !783)
!824 = !DILocation(line: 396, column: 24, scope: !783)
!825 = !DILocation(line: 398, column: 29, scope: !783)
!826 = distinct !{!826, !814, !827, !743}
!827 = !DILocation(line: 400, column: 9, scope: !778)
!828 = !DILocation(line: 401, column: 20, scope: !778)
!829 = !DILocation(line: 405, column: 22, scope: !786)
!830 = !DILocation(line: 405, column: 13, scope: !786)
!831 = !DILocation(line: 405, column: 13, scope: !778)
!832 = !DILocation(line: 406, column: 42, scope: !785)
!833 = !DILocation(line: 0, scope: !785)
!834 = !DILocalVariable(name: "addr", arg: 1, scope: !835, file: !32, line: 179, type: !629)
!835 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned long long>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_130atomic_cas_weak_relacq_relaxedIyEEbPT_S6_S6_", scope: !626, file: !32, line: 179, type: !836, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !632, retainedNodes: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!66, !629, !629, !629}
!838 = !{!834, !839, !840}
!839 = !DILocalVariable(name: "expected", arg: 2, scope: !835, file: !32, line: 179, type: !629)
!840 = !DILocalVariable(name: "desired", arg: 3, scope: !835, file: !32, line: 179, type: !629)
!841 = !DILocation(line: 0, scope: !835, inlinedAt: !842)
!842 = distinct !DILocation(line: 407, column: 17, scope: !843)
!843 = distinct !DILexicalBlock(scope: !785, file: !32, line: 407, column: 17)
!844 = !DILocation(line: 180, column: 12, scope: !835, inlinedAt: !842)
!845 = distinct !{!845, !846, !847}
!846 = !DILocation(line: 388, column: 5, scope: !769)
!847 = !DILocation(line: 445, column: 5, scope: !769)
!848 = !DILocation(line: 414, column: 48, scope: !778)
!849 = !DILocation(line: 415, column: 22, scope: !790)
!850 = !DILocation(line: 415, column: 13, scope: !778)
!851 = !DILocation(line: 0, scope: !789)
!852 = !DILocation(line: 418, column: 46, scope: !792)
!853 = !DILocation(line: 0, scope: !792)
!854 = !DILocation(line: 0, scope: !835, inlinedAt: !855)
!855 = distinct !DILocation(line: 419, column: 21, scope: !856)
!856 = distinct !DILexicalBlock(scope: !792, file: !32, line: 419, column: 21)
!857 = !DILocation(line: 180, column: 12, scope: !835, inlinedAt: !855)
!858 = !DILocation(line: 422, column: 74, scope: !859)
!859 = distinct !DILexicalBlock(scope: !792, file: !32, line: 422, column: 21)
!860 = !DILocation(line: 422, column: 21, scope: !792)
!861 = distinct !{!861, !862, !863, !743}
!862 = !DILocation(line: 417, column: 13, scope: !789)
!863 = !DILocation(line: 428, column: 13, scope: !789)
!864 = !DILocation(line: 434, column: 24, scope: !865)
!865 = distinct !DILexicalBlock(scope: !790, file: !32, line: 433, column: 16)
!866 = !DILocalVariable(name: "addr", arg: 1, scope: !867, file: !32, line: 165, type: !173)
!867 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_124atomic_and_fetch_releaseEPyy", scope: !626, file: !32, line: 165, type: !868, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !870)
!868 = !DISubroutineType(types: !869)
!869 = !{!26, !173, !26}
!870 = !{!866, !871}
!871 = !DILocalVariable(name: "val", arg: 2, scope: !867, file: !32, line: 165, type: !26)
!872 = !DILocation(line: 0, scope: !867, inlinedAt: !873)
!873 = distinct !DILocation(line: 435, column: 13, scope: !865)
!874 = !DILocation(line: 166, column: 12, scope: !867, inlinedAt: !873)
!875 = !DILocalVariable(name: "this", arg: 1, scope: !876, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!876 = distinct !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !39, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !90, retainedNodes: !877)
!877 = !{!875}
!878 = !DILocation(line: 0, scope: !876, inlinedAt: !879)
!879 = distinct !DILocation(line: 441, column: 22, scope: !778)
!880 = !DILocation(line: 118, column: 26, scope: !876, inlinedAt: !879)
!881 = !DILocation(line: 118, column: 9, scope: !876, inlinedAt: !879)
!882 = !DILocalVariable(name: "this", arg: 1, scope: !883, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!883 = distinct !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !39, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !91, retainedNodes: !884)
!884 = !{!882}
!885 = !DILocation(line: 0, scope: !883, inlinedAt: !886)
!886 = distinct !DILocation(line: 442, column: 22, scope: !778)
!887 = !DILocation(line: 122, column: 9, scope: !883, inlinedAt: !886)
!888 = !DILocation(line: 122, column: 21, scope: !883, inlinedAt: !886)
!889 = !DILocation(line: 123, column: 27, scope: !883, inlinedAt: !886)
!890 = !DILocation(line: 123, column: 9, scope: !883, inlinedAt: !886)
!891 = !DILocalVariable(name: "this", arg: 1, scope: !892, type: !684, flags: DIFlagArtificial | DIFlagObjectPointer)
!892 = distinct !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !39, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !92, retainedNodes: !893)
!893 = !{!891}
!894 = !DILocation(line: 0, scope: !892, inlinedAt: !895)
!895 = distinct !DILocation(line: 443, column: 22, scope: !778)
!896 = !DILocation(line: 127, column: 9, scope: !892, inlinedAt: !895)
!897 = !DILocation(line: 444, column: 9, scope: !778)
!898 = !DILocation(line: 446, column: 1, scope: !769)
!899 = !DISubprogram(name: "halide_print", scope: !242, file: !242, line: 97, type: !900, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !15, !265}
!902 = !DISubprogram(name: "abort", scope: !27, file: !27, line: 108, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!903 = distinct !DISubprogram(name: "lock_bucket", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization11lock_bucketEy", scope: !33, file: !32, line: 509, type: !904, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !907)
!904 = !DISubroutineType(types: !905)
!905 = !{!906, !26}
!906 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !106, size: 64)
!907 = !{!908, !909, !910}
!908 = !DILocalVariable(name: "addr", arg: 1, scope: !903, file: !32, line: 509, type: !26)
!909 = !DILocalVariable(name: "hash", scope: !903, file: !32, line: 510, type: !26)
!910 = !DILocalVariable(name: "bucket", scope: !903, file: !32, line: 515, type: !906)
!911 = !DILocation(line: 0, scope: !903)
!912 = !DILocalVariable(name: "addr", arg: 1, scope: !913, file: !32, line: 499, type: !26)
!913 = distinct !DISubprogram(name: "addr_hash", linkageName: "_ZN6Halide7Runtime8Internal15SynchronizationL9addr_hashEyj", scope: !33, file: !32, line: 499, type: !914, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !917)
!914 = !DISubroutineType(types: !915)
!915 = !{!26, !26, !916}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 12, baseType: !24)
!917 = !{!912, !918}
!918 = !DILocalVariable(name: "bits", arg: 2, scope: !913, file: !32, line: 499, type: !916)
!919 = !DILocation(line: 0, scope: !913, inlinedAt: !920)
!920 = distinct !DILocation(line: 510, column: 22, scope: !903)
!921 = !DILocation(line: 503, column: 22, scope: !922, inlinedAt: !920)
!922 = distinct !DILexicalBlock(scope: !923, file: !32, line: 502, column: 33)
!923 = distinct !DILexicalBlock(scope: !913, file: !32, line: 502, column: 9)
!924 = !DILocation(line: 503, column: 55, scope: !922, inlinedAt: !920)
!925 = !DILocation(line: 515, column: 27, scope: !903)
!926 = !DILocalVariable(name: "this", arg: 1, scope: !927, type: !601, flags: DIFlagArtificial | DIFlagObjectPointer)
!927 = distinct !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !32, line: 291, type: !113, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !118, retainedNodes: !928)
!928 = !{!926, !929, !930}
!929 = !DILocalVariable(name: "expected", scope: !927, file: !32, line: 294, type: !26)
!930 = !DILocalVariable(name: "desired", scope: !927, file: !32, line: 295, type: !26)
!931 = !DILocation(line: 0, scope: !927, inlinedAt: !932)
!932 = distinct !DILocation(line: 517, column: 18, scope: !903)
!933 = !DILocation(line: 297, column: 47, scope: !934, inlinedAt: !932)
!934 = distinct !DILexicalBlock(scope: !927, file: !32, line: 297, column: 13)
!935 = !DILocation(line: 0, scope: !644, inlinedAt: !936)
!936 = distinct !DILocation(line: 297, column: 14, scope: !934, inlinedAt: !932)
!937 = !DILocation(line: 192, column: 12, scope: !644, inlinedAt: !936)
!938 = !DILocation(line: 297, column: 13, scope: !927, inlinedAt: !932)
!939 = !DILocation(line: 517, column: 12, scope: !903)
!940 = !DILocation(line: 298, column: 13, scope: !941, inlinedAt: !932)
!941 = distinct !DILexicalBlock(scope: !934, file: !32, line: 297, column: 76)
!942 = !DILocation(line: 299, column: 9, scope: !941, inlinedAt: !932)
!943 = !DILocation(line: 519, column: 5, scope: !903)
!944 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization16lock_bucket_pairEyy", scope: !33, file: !32, line: 531, type: !945, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!945 = !DISubroutineType(types: !946)
!946 = !{!947, !26, !26}
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !33, file: !32, line: 522, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !948, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11bucket_pairE")
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !947, file: !32, line: 523, baseType: !906, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !947, file: !32, line: 524, baseType: !906, size: 64, offset: 64)
!951 = !DISubprogram(name: "bucket_pair", scope: !947, file: !32, line: 526, type: !952, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !954, !906, !906}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!955 = !{!956, !957, !958, !959, !960, !963, !966, !967, !969}
!956 = !DILocalVariable(name: "addr_from", arg: 1, scope: !944, file: !32, line: 531, type: !26)
!957 = !DILocalVariable(name: "addr_to", arg: 2, scope: !944, file: !32, line: 531, type: !26)
!958 = !DILocalVariable(name: "hash_from", scope: !944, file: !32, line: 533, type: !26)
!959 = !DILocalVariable(name: "hash_to", scope: !944, file: !32, line: 534, type: !26)
!960 = !DILocalVariable(name: "first", scope: !961, file: !32, line: 542, type: !906)
!961 = distinct !DILexicalBlock(scope: !962, file: !32, line: 541, column: 31)
!962 = distinct !DILexicalBlock(scope: !944, file: !32, line: 541, column: 9)
!963 = !DILocalVariable(name: "first", scope: !964, file: !32, line: 546, type: !906)
!964 = distinct !DILexicalBlock(scope: !965, file: !32, line: 545, column: 37)
!965 = distinct !DILexicalBlock(scope: !962, file: !32, line: 545, column: 16)
!966 = !DILocalVariable(name: "second", scope: !964, file: !32, line: 547, type: !906)
!967 = !DILocalVariable(name: "first", scope: !968, file: !32, line: 552, type: !906)
!968 = distinct !DILexicalBlock(scope: !965, file: !32, line: 551, column: 12)
!969 = !DILocalVariable(name: "second", scope: !968, file: !32, line: 553, type: !906)
!970 = !DILocation(line: 0, scope: !944)
!971 = !DILocation(line: 0, scope: !913, inlinedAt: !972)
!972 = distinct !DILocation(line: 533, column: 27, scope: !944)
!973 = !DILocation(line: 503, column: 22, scope: !922, inlinedAt: !972)
!974 = !DILocation(line: 503, column: 55, scope: !922, inlinedAt: !972)
!975 = !DILocation(line: 0, scope: !913, inlinedAt: !976)
!976 = distinct !DILocation(line: 534, column: 25, scope: !944)
!977 = !DILocation(line: 503, column: 22, scope: !922, inlinedAt: !976)
!978 = !DILocation(line: 503, column: 55, scope: !922, inlinedAt: !976)
!979 = !DILocation(line: 541, column: 19, scope: !962)
!980 = !DILocation(line: 541, column: 9, scope: !944)
!981 = !DILocation(line: 542, column: 30, scope: !961)
!982 = !DILocation(line: 0, scope: !961)
!983 = !DILocation(line: 0, scope: !927, inlinedAt: !984)
!984 = distinct !DILocation(line: 543, column: 21, scope: !961)
!985 = !DILocation(line: 297, column: 47, scope: !934, inlinedAt: !984)
!986 = !DILocation(line: 0, scope: !644, inlinedAt: !987)
!987 = distinct !DILocation(line: 297, column: 14, scope: !934, inlinedAt: !984)
!988 = !DILocation(line: 192, column: 12, scope: !644, inlinedAt: !987)
!989 = !DILocation(line: 297, column: 13, scope: !927, inlinedAt: !984)
!990 = !DILocation(line: 543, column: 15, scope: !961)
!991 = !DILocation(line: 298, column: 13, scope: !941, inlinedAt: !984)
!992 = !DILocation(line: 299, column: 9, scope: !941, inlinedAt: !984)
!993 = !DILocation(line: 545, column: 26, scope: !965)
!994 = !DILocation(line: 545, column: 16, scope: !962)
!995 = !DILocation(line: 546, column: 30, scope: !964)
!996 = !DILocation(line: 0, scope: !964)
!997 = !DILocation(line: 547, column: 31, scope: !964)
!998 = !DILocation(line: 0, scope: !927, inlinedAt: !999)
!999 = distinct !DILocation(line: 548, column: 21, scope: !964)
!1000 = !DILocation(line: 297, column: 47, scope: !934, inlinedAt: !999)
!1001 = !DILocation(line: 0, scope: !644, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 297, column: 14, scope: !934, inlinedAt: !999)
!1003 = !DILocation(line: 192, column: 12, scope: !644, inlinedAt: !1002)
!1004 = !DILocation(line: 297, column: 13, scope: !927, inlinedAt: !999)
!1005 = !DILocation(line: 548, column: 15, scope: !964)
