; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/posix_threads_tsan.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/posix_threads_tsan.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8 }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32 }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i32] }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::spawned_thread" = type { void (i8*)*, i8*, i32 }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13table_storageE", scope: !2, file: !6, line: 478, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Synchronization", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 98304, elements: !9)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!10}
!10 = !DISubrange(count: 12288)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "_ZN6Halide7Runtime8Internal10work_queueE", scope: !3, file: !13, line: 166, type: !14, isLocal: false, isDefinition: true)
!13 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !3, file: !13, line: 94, size: 8640, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTSN6Halide7Runtime8Internal12work_queue_tE")
!15 = !{!16, !28, !30, !31, !89, !90, !91, !92, !96, !97, !98, !99, !100, !106, !107, !108, !109, !114, !117}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !14, file: !13, line: 96, baseType: !17, size: 32)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !18, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !19, identifier: "_ZTS12halide_mutex")
!18 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !17, file: !18, line: 121, baseType: !21, size: 32)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !26)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 68, baseType: !24)
!23 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 12, baseType: !25)
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 1)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !14, file: !13, line: 99, baseType: !29, size: 32, offset: 32)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !14, file: !13, line: 103, baseType: !29, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !14, file: !13, line: 106, baseType: !32, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !3, file: !13, line: 26, size: 640, flags: DIFlagTypePassByValue, elements: !34, identifier: "_ZTSN6Halide7Runtime8Internal4workE")
!34 = !{!35, !65, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !84}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !33, file: !13, line: 27, baseType: !36, size: 288)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !18, line: 201, size: 288, flags: DIFlagTypePassByValue, elements: !37, identifier: "_ZTS22halide_parallel_task_t")
!37 = !{!38, !47, !48, !51, !59, !60, !61, !62, !63}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !36, file: !18, line: 204, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !18, line: 192, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DISubroutineType(types: !42)
!42 = !{!29, !43, !29, !29, !44, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 16, baseType: !46)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !36, file: !18, line: 207, baseType: !44, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !18, line: 210, baseType: !49, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !36, file: !18, line: 214, baseType: !52, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !18, line: 177, size: 64, flags: DIFlagTypePassByValue, elements: !54, identifier: "_ZTS26halide_semaphore_acquire_t")
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !53, file: !18, line: 178, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !18, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS18halide_semaphore_t")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !18, line: 179, baseType: !29, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !36, file: !18, line: 215, baseType: !29, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !36, file: !18, line: 219, baseType: !29, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !36, file: !18, line: 238, baseType: !29, size: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !36, file: !18, line: 243, baseType: !64, size: 8, offset: 256)
!64 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !33, file: !13, line: 31, baseType: !66, size: 32, offset: 288)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !18, line: 158, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DISubroutineType(types: !69)
!69 = !{!29, !43, !29, !44}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !33, file: !13, line: 33, baseType: !32, size: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !33, file: !13, line: 34, baseType: !32, size: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !33, file: !13, line: 35, baseType: !29, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !33, file: !13, line: 36, baseType: !32, size: 32, offset: 416)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !33, file: !13, line: 37, baseType: !29, size: 32, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !33, file: !13, line: 39, baseType: !43, size: 32, offset: 480)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !33, file: !13, line: 40, baseType: !29, size: 32, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !33, file: !13, line: 41, baseType: !29, size: 32, offset: 544)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !33, file: !13, line: 42, baseType: !29, size: 32, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !33, file: !13, line: 44, baseType: !64, size: 8, offset: 608)
!80 = !DISubprogram(name: "make_runnable", linkageName: "_ZN6Halide7Runtime8Internal4work13make_runnableEv", scope: !33, file: !13, line: 46, type: !81, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!81 = !DISubroutineType(types: !82)
!82 = !{!64, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!84 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal4work7runningEv", scope: !33, file: !13, line: 62, type: !85, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{!64, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !14, file: !13, line: 109, baseType: !29, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !14, file: !13, line: 116, baseType: !29, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !14, file: !13, line: 122, baseType: !93, size: 32, offset: 224)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !18, line: 125, size: 32, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTS11halide_cond")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !93, file: !18, line: 126, baseType: !21, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !14, file: !13, line: 122, baseType: !93, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !14, file: !13, line: 122, baseType: !93, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !14, file: !13, line: 126, baseType: !29, size: 32, offset: 352)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !14, file: !13, line: 129, baseType: !101, size: 8192, offset: 384)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8192, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !18, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13halide_thread")
!104 = !{!105}
!105 = !DISubrange(count: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 8576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !14, file: !13, line: 133, baseType: !64, size: 8, offset: 8584)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !14, file: !13, line: 139, baseType: !29, size: 32, offset: 8608)
!109 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t7runningEv", scope: !14, file: !13, line: 141, type: !110, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!64, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!114 = !DISubprogram(name: "assert_zeroed", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t13assert_zeroedEv", scope: !14, file: !13, line: 146, type: !115, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !112}
!117 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal12work_queue_t5resetEv", scope: !14, file: !13, line: 158, type: !118, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "_ZN6Halide7Runtime8Internal14custom_do_taskE", scope: !3, file: !13, line: 567, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !18, line: 259, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!29, !43, !66, !29, !44}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "_ZN6Halide7Runtime8Internal19custom_do_loop_taskE", scope: !3, file: !13, line: 568, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !18, line: 268, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{!29, !43, !39, !29, !29, !44, !43}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "_ZN6Halide7Runtime8Internal17custom_do_par_forE", scope: !3, file: !13, line: 569, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !18, line: 167, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{!29, !43, !66, !29, !29, !44}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "_ZN6Halide7Runtime8Internal24custom_do_parallel_tasksE", scope: !3, file: !13, line: 570, type: !141, isLocal: false, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !18, line: 281, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!29, !43, !29, !145, !43}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "_ZN6Halide7Runtime8Internal21custom_semaphore_initE", scope: !3, file: !13, line: 571, type: !148, isLocal: false, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !18, line: 184, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{!29, !56, !29}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "_ZN6Halide7Runtime8Internal28custom_semaphore_try_acquireE", scope: !3, file: !13, line: 572, type: !154, isLocal: false, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !18, line: 186, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{!64, !56, !29}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "_ZN6Halide7Runtime8Internal24custom_semaphore_releaseE", scope: !3, file: !13, line: 573, type: !160, isLocal: false, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !18, line: 185, baseType: !149)
!161 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !162, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !163, retainedTypes: !164, globals: !375, imports: !386, splitDebugInlining: false, nameTableKind: None)
!162 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/posix_threads_tsan.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!163 = !{}
!164 = !{!165, !102, !22, !177, !231, !266, !267, !307, !332, !342, !313, !352, !365, !369, !32, !370, !302, !49, !374}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !3, file: !167, line: 45, size: 96, flags: DIFlagTypePassByValue, elements: !168, identifier: "_ZTSN6Halide7Runtime8Internal14spawned_threadE")
!167 = !DIFile(filename: "src/runtime/posix_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!168 = !{!169, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !166, file: !167, line: 46, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !43}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !166, file: !167, line: 47, baseType: !43, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !166, file: !167, line: 48, baseType: !175, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !167, line: 20, baseType: !176)
!176 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !2, file: !6, line: 254, size: 1216, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !179, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE")
!179 = !{!180, !223, !224, !225, !226, !230}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !178, file: !6, line: 255, baseType: !181, size: 1088)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !2, file: !167, line: 93, size: 1088, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !182, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE")
!182 = !{!183, !192, !196, !197, !203, !207, !211, !214, !217, !218, !219, !220, !221, !222}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !181, file: !167, line: 94, baseType: !184, size: 512)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", file: !167, line: 12, size: 512, flags: DIFlagTypePassByValue, elements: !185, identifier: "_ZTS15pthread_mutex_t")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !184, file: !167, line: 13, baseType: !187, size: 512)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 512, elements: !190)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 10, baseType: !189)
!189 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!190 = !{!191}
!191 = !DISubrange(count: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !181, file: !167, line: 95, baseType: !193, size: 512, offset: 512)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_cond_t", file: !167, line: 16, size: 512, flags: DIFlagTypePassByValue, elements: !194, identifier: "_ZTS14pthread_cond_t")
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !193, file: !167, line: 17, baseType: !187, size: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !181, file: !167, line: 96, baseType: !64, size: 8, offset: 1024)
!197 = !DISubprogram(name: "thread_parker", scope: !181, file: !167, line: 98, type: !198, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !200, !201}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!201 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!203 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSERKS3_", scope: !181, file: !167, line: 99, type: !204, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !200, !201}
!206 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !181, size: 32)
!207 = !DISubprogram(name: "thread_parker", scope: !181, file: !167, line: 100, type: !208, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !200, !210}
!210 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !181, size: 32)
!211 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSEOS3_", scope: !181, file: !167, line: 101, type: !212, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!212 = !DISubroutineType(types: !213)
!213 = !{!206, !200, !210}
!214 = !DISubprogram(name: "thread_parker", scope: !181, file: !167, line: 103, type: !215, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !200}
!217 = !DISubprogram(name: "~thread_parker", scope: !181, file: !167, line: 108, type: !215, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !181, file: !167, line: 113, type: !215, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !181, file: !167, line: 117, type: !215, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !181, file: !167, line: 125, type: !215, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !181, file: !167, line: 129, type: !215, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !181, file: !167, line: 134, type: !215, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !6, line: 273, baseType: !177, size: 32, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !6, line: 274, baseType: !177, size: 32, offset: 1120)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !178, file: !6, line: 275, baseType: !177, size: 32, offset: 1152)
!226 = !DISubprogram(name: "word_lock_queue_data", scope: !178, file: !6, line: 277, type: !227, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!230 = !DISubprogram(name: "~word_lock_queue_data", scope: !178, file: !6, line: 280, type: !227, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !2, file: !6, line: 475, size: 98304, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !233, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10hash_tableE")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !232, file: !6, line: 476, baseType: !235, size: 98304)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 98304, elements: !264)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !2, file: !6, line: 463, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !237, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11hash_bucketE")
!237 = !{!238, !250, !263}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !236, file: !6, line: 464, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !2, file: !6, line: 283, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !240, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9word_lockE")
!240 = !{!241, !242, !246, !247, !248, !249}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !239, file: !6, line: 284, baseType: !22, size: 32)
!242 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !239, file: !6, line: 286, type: !243, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!246 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !239, file: !6, line: 287, type: !243, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!247 = !DISubprogram(name: "word_lock", scope: !239, file: !6, line: 290, type: !243, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !239, file: !6, line: 291, type: !243, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock6unlockEv", scope: !239, file: !6, line: 304, type: !243, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !236, file: !6, line: 466, baseType: !251, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !2, file: !6, line: 448, size: 1216, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !253, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10queue_dataE")
!253 = !{!254, !255, !256, !257, !258, !262}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !252, file: !6, line: 449, baseType: !181, size: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !252, file: !6, line: 451, baseType: !22, size: 32, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !6, line: 452, baseType: !251, size: 32, offset: 1120)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !252, file: !6, line: 453, baseType: !22, size: 32, offset: 1152)
!258 = !DISubprogram(name: "queue_data", scope: !252, file: !6, line: 455, type: !259, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!262 = !DISubprogram(name: "~queue_data", scope: !252, file: !6, line: 457, type: !259, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !236, file: !6, line: 467, baseType: !251, size: 32, offset: 64)
!264 = !{!265}
!265 = !DISubrange(count: 1024)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !2, file: !6, line: 829, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !269, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization21mutex_parking_controlE")
!269 = !{!270, !301, !303}
!270 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !268, baseType: !271, extraData: i32 0)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !2, file: !6, line: 592, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !272, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15parking_controlE")
!272 = !{!273, !286, !287, !291, !297}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !271, file: !6, line: 593, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!64, !43, !277}
!277 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !278, size: 32)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !2, file: !6, line: 576, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !279, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15validate_actionE")
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !278, file: !6, line: 577, baseType: !64, size: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !278, file: !6, line: 578, baseType: !22, size: 32, offset: 32)
!282 = !DISubprogram(name: "validate_action", scope: !278, file: !6, line: 580, type: !283, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !271, file: !6, line: 594, baseType: !170, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !271, file: !6, line: 595, baseType: !288, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{!22, !43, !29, !64}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !271, file: !6, line: 596, baseType: !292, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !43, !295, !64, !64}
!295 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!297 = !DISubprogram(name: "parking_control", scope: !271, file: !6, line: 598, type: !298, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !268, file: !6, line: 830, baseType: !302, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!303 = !DISubprogram(name: "mutex_parking_control", scope: !268, file: !6, line: 832, type: !304, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !302}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !2, file: !6, line: 958, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !309, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization22signal_parking_controlE")
!309 = !{!310, !311, !312, !328}
!310 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !308, baseType: !271, extraData: i32 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !308, file: !6, line: 959, baseType: !302, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !308, file: !6, line: 960, baseType: !313, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !2, file: !6, line: 859, size: 32, flags: DIFlagTypePassByValue, elements: !315, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10fast_mutexE")
!315 = !{!316, !317, !321, !322, !323, !324, !327}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !6, line: 860, baseType: !22, size: 32)
!317 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex9lock_fullEv", scope: !314, file: !6, line: 862, type: !318, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!321 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11unlock_fullEv", scope: !314, file: !6, line: 906, type: !318, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex4lockEv", scope: !314, file: !6, line: 920, type: !318, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex6unlockEv", scope: !314, file: !6, line: 929, type: !318, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DISubprogram(name: "make_parked_if_locked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex21make_parked_if_lockedEv", scope: !314, file: !6, line: 938, type: !325, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!325 = !DISubroutineType(types: !326)
!326 = !{!64, !320}
!327 = !DISubprogram(name: "make_parked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11make_parkedEv", scope: !314, file: !6, line: 953, type: !318, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DISubprogram(name: "signal_parking_control", scope: !308, file: !6, line: 962, type: !329, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331, !302, !313}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !2, file: !6, line: 985, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !334, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization25broadcast_parking_controlE")
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !333, baseType: !271, extraData: i32 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !333, file: !6, line: 986, baseType: !302, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !333, file: !6, line: 987, baseType: !313, size: 32, offset: 160)
!338 = !DISubprogram(name: "broadcast_parking_control", scope: !333, file: !6, line: 989, type: !339, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !341, !302, !313}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !2, file: !6, line: 1026, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !344, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20wait_parking_controlE")
!344 = !{!345, !346, !347, !348}
!345 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !343, baseType: !271, extraData: i32 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !343, file: !6, line: 1027, baseType: !302, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !343, file: !6, line: 1028, baseType: !313, size: 32, offset: 160)
!348 = !DISubprogram(name: "wait_parking_control", scope: !343, file: !6, line: 1030, type: !349, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351, !302, !313}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !2, file: !6, line: 1072, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !354, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9fast_condE")
!354 = !{!355, !356, !360, !361, !362}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !6, line: 1073, baseType: !22, size: 32)
!356 = !DISubprogram(name: "fast_cond", scope: !353, file: !6, line: 1076, type: !357, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!360 = !DISubprogram(name: "signal", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond6signalEv", scope: !353, file: !6, line: 1078, type: !357, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubprogram(name: "broadcast", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond9broadcastEv", scope: !353, file: !6, line: 1092, type: !357, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!362 = !DISubprogram(name: "wait", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond4waitEPNS2_10fast_mutexE", scope: !353, file: !6, line: 1105, type: !363, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !359, !313}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !6, line: 1164, size: 32, flags: DIFlagTypePassByValue, elements: !367, identifier: "_ZTS18halide_mutex_array")
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !366, file: !6, line: 1165, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !13, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !372, identifier: "_ZTS23halide_semaphore_impl_t")
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !371, file: !13, line: 712, baseType: !29, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!375 = !{!376, !379, !0, !381, !11, !121, !127, !133, !139, !146, !152, !158, !383}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!377 = distinct !DIGlobalVariable(name: "lock_bit", scope: !2, file: !6, line: 250, type: !378, isLocal: true, isDefinition: true)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!380 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !2, file: !6, line: 251, type: !378, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!382 = distinct !DIGlobalVariable(name: "parked_bit", scope: !2, file: !6, line: 252, type: !378, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!384 = distinct !DIGlobalVariable(name: "__tsan_mutex_linker_init", scope: !161, file: !6, line: 37, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!386 = !{!387, !388, !389}
!387 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !23, line: 225)
!388 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !167, line: 62)
!389 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !3, file: !13, line: 579)
!390 = !{i32 7, !"Dwarf Version", i32 4}
!391 = !{i32 2, !"Debug Info Version", i32 3}
!392 = !{i32 1, !"wchar_size", i32 4}
!393 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!394 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "_ZN6Halide7Runtime8Internal19spawn_thread_helperEPv", scope: !3, file: !167, line: 50, type: !395, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!43, !43}
!397 = !{!398, !399}
!398 = !DILocalVariable(name: "arg", arg: 1, scope: !394, file: !167, line: 50, type: !43)
!399 = !DILocalVariable(name: "t", scope: !394, file: !167, line: 51, type: !165)
!400 = !DILocation(line: 0, scope: !394)
!401 = !DILocation(line: 52, column: 8, scope: !394)
!402 = !{!403, !404, i64 0}
!403 = !{!"_ZTSN6Halide7Runtime8Internal14spawned_threadE", !404, i64 0, !404, i64 4, !407, i64 8}
!404 = !{!"any pointer", !405, i64 0}
!405 = !{!"omnipotent char", !406, i64 0}
!406 = !{!"Simple C++ TBAA"}
!407 = !{!"long", !405, i64 0}
!408 = !DILocation(line: 52, column: 13, scope: !394)
!409 = !{!403, !404, i64 4}
!410 = !DILocation(line: 52, column: 5, scope: !394)
!411 = !DILocation(line: 53, column: 5, scope: !394)
!412 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !167, file: !167, line: 64, type: !413, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!102, !170, !43}
!415 = !{!416, !417, !418}
!416 = !DILocalVariable(name: "f", arg: 1, scope: !412, file: !167, line: 64, type: !170)
!417 = !DILocalVariable(name: "closure", arg: 2, scope: !412, file: !167, line: 64, type: !43)
!418 = !DILocalVariable(name: "t", scope: !412, file: !167, line: 65, type: !165)
!419 = !DILocation(line: 0, scope: !412)
!420 = !DILocation(line: 65, column: 43, scope: !412)
!421 = !DILocation(line: 66, column: 8, scope: !412)
!422 = !DILocation(line: 66, column: 10, scope: !412)
!423 = !DILocation(line: 67, column: 8, scope: !412)
!424 = !DILocation(line: 67, column: 16, scope: !412)
!425 = !DILocation(line: 68, column: 8, scope: !412)
!426 = !DILocation(line: 68, column: 15, scope: !412)
!427 = !{!403, !407, i64 8}
!428 = !DILocation(line: 69, column: 5, scope: !412)
!429 = !DILocation(line: 70, column: 12, scope: !412)
!430 = !DILocation(line: 70, column: 5, scope: !412)
!431 = !DISubprogram(name: "malloc", scope: !23, file: !23, line: 87, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!432 = !DISubroutineType(types: !433)
!433 = !{!43, !25}
!434 = !DISubprogram(name: "pthread_create", scope: !167, file: !167, line: 21, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!435 = !DISubroutineType(types: !436)
!436 = !{!29, !437, !438, !440, !43}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!441 = distinct !DISubprogram(name: "halide_join_thread", scope: !167, file: !167, line: 73, type: !442, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !102}
!444 = !{!445, !446, !447}
!445 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !441, file: !167, line: 73, type: !102)
!446 = !DILocalVariable(name: "t", scope: !441, file: !167, line: 74, type: !165)
!447 = !DILocalVariable(name: "ret", scope: !441, file: !167, line: 75, type: !43)
!448 = !DILocation(line: 0, scope: !441)
!449 = !DILocation(line: 74, column: 25, scope: !441)
!450 = !DILocation(line: 75, column: 5, scope: !441)
!451 = !DILocation(line: 75, column: 11, scope: !441)
!452 = !{!404, !404, i64 0}
!453 = !DILocation(line: 76, column: 21, scope: !441)
!454 = !DILocation(line: 76, column: 5, scope: !441)
!455 = !DILocation(line: 77, column: 10, scope: !441)
!456 = !DILocation(line: 77, column: 5, scope: !441)
!457 = !DILocation(line: 78, column: 1, scope: !441)
!458 = !DISubprogram(name: "pthread_join", scope: !167, file: !167, line: 23, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!459 = !DISubroutineType(types: !460)
!460 = !{!29, !176, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!462 = !DISubprogram(name: "free", scope: !23, file: !23, line: 86, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!463 = distinct !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !239, file: !6, line: 321, type: !243, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !242, retainedNodes: !464)
!464 = !{!465, !467, !479, !480, !484, !485, !486}
!465 = !DILocalVariable(name: "this", arg: 1, scope: !463, type: !466, flags: DIFlagArtificial | DIFlagObjectPointer)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!467 = !DILocalVariable(name: "spinner", scope: !463, file: !6, line: 322, type: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !2, file: !6, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !469, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization12spin_controlE")
!469 = !{!470, !471, !475, !478}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !468, file: !6, line: 231, baseType: !29, size: 32)
!471 = !DISubprogram(name: "spin_control", scope: !468, file: !6, line: 235, type: !472, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!475 = !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !468, file: !6, line: 237, type: !476, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!476 = !DISubroutineType(types: !477)
!477 = !{!64, !474}
!478 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control5resetEv", scope: !468, file: !6, line: 244, type: !472, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !DILocalVariable(name: "expected", scope: !463, file: !6, line: 323, type: !22)
!480 = !DILocalVariable(name: "desired", scope: !481, file: !6, line: 328, type: !22)
!481 = distinct !DILexicalBlock(scope: !482, file: !6, line: 327, column: 37)
!482 = distinct !DILexicalBlock(scope: !483, file: !6, line: 327, column: 13)
!483 = distinct !DILexicalBlock(scope: !463, file: !6, line: 326, column: 18)
!484 = !DILocalVariable(name: "node", scope: !483, file: !6, line: 342, type: !178)
!485 = !DILocalVariable(name: "head", scope: !483, file: !6, line: 347, type: !177)
!486 = !DILocalVariable(name: "desired", scope: !483, file: !6, line: 359, type: !22)
!487 = !DILocation(line: 0, scope: !463)
!488 = !DILocation(line: 324, column: 26, scope: !463)
!489 = !DILocation(line: 324, column: 5, scope: !463)
!490 = !{!491, !491, i64 0}
!491 = !{!"int", !405, i64 0}
!492 = !DILocation(line: 326, column: 5, scope: !463)
!493 = !DILocation(line: 327, column: 13, scope: !483)
!494 = !DILocation(line: 327, column: 24, scope: !482)
!495 = !DILocation(line: 327, column: 14, scope: !482)
!496 = !DILocation(line: 328, column: 42, scope: !481)
!497 = !DILocation(line: 0, scope: !481)
!498 = !DILocalVariable(name: "addr", arg: 1, scope: !499, file: !6, line: 126, type: !302)
!499 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_acquire_relaxedEPjS4_S4_", scope: !500, file: !6, line: 126, type: !501, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !503)
!500 = !DINamespace(scope: !2)
!501 = !DISubroutineType(types: !502)
!502 = !{!64, !302, !302, !302}
!503 = !{!498, !504, !505}
!504 = !DILocalVariable(name: "expected", arg: 2, scope: !499, file: !6, line: 126, type: !302)
!505 = !DILocalVariable(name: "desired", arg: 3, scope: !499, file: !6, line: 126, type: !302)
!506 = !DILocation(line: 0, scope: !499, inlinedAt: !507)
!507 = distinct !DILocation(line: 330, column: 17, scope: !508)
!508 = distinct !DILexicalBlock(scope: !481, file: !6, line: 330, column: 17)
!509 = !DILocalVariable(name: "addr", arg: 1, scope: !510, file: !6, line: 102, type: !513)
!510 = distinct !DISubprogram(name: "cas_strong_sequentially_consistent_helper<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_141cas_strong_sequentially_consistent_helperIjEEbPT_S6_S6_", scope: !500, file: !6, line: 102, type: !511, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !519, retainedNodes: !514)
!511 = !DISubroutineType(types: !512)
!512 = !{!64, !513, !513, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!514 = !{!509, !515, !516, !517, !518}
!515 = !DILocalVariable(name: "expected", arg: 2, scope: !510, file: !6, line: 102, type: !513)
!516 = !DILocalVariable(name: "desired", arg: 3, scope: !510, file: !6, line: 102, type: !513)
!517 = !DILocalVariable(name: "oldval", scope: !510, file: !6, line: 103, type: !25)
!518 = !DILocalVariable(name: "gotval", scope: !510, file: !6, line: 104, type: !25)
!519 = !{!520}
!520 = !DITemplateTypeParameter(name: "T", type: !25)
!521 = !DILocation(line: 0, scope: !510, inlinedAt: !522)
!522 = distinct !DILocation(line: 127, column: 12, scope: !499, inlinedAt: !507)
!523 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !522)
!524 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !522)
!525 = !DILocation(line: 336, column: 67, scope: !526)
!526 = distinct !DILexicalBlock(scope: !483, file: !6, line: 336, column: 13)
!527 = !DILocation(line: 336, column: 73, scope: !526)
!528 = !DILocalVariable(name: "this", arg: 1, scope: !529, type: !531, flags: DIFlagArtificial | DIFlagObjectPointer)
!529 = distinct !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !468, file: !6, line: 237, type: !476, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !475, retainedNodes: !530)
!530 = !{!528}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!532 = !DILocation(line: 0, scope: !529, inlinedAt: !533)
!533 = distinct !DILocation(line: 336, column: 84, scope: !526)
!534 = !DILocation(line: 241, column: 27, scope: !529, inlinedAt: !533)
!535 = !DILocation(line: 336, column: 13, scope: !483)
!536 = !DILocation(line: 239, column: 23, scope: !537, inlinedAt: !533)
!537 = distinct !DILexicalBlock(scope: !538, file: !6, line: 238, column: 29)
!538 = distinct !DILexicalBlock(scope: !529, file: !6, line: 238, column: 13)
!539 = !DILocation(line: 337, column: 13, scope: !540)
!540 = distinct !DILexicalBlock(scope: !526, file: !6, line: 336, column: 99)
!541 = !DILocation(line: 338, column: 13, scope: !540)
!542 = !DILocation(line: 339, column: 13, scope: !540)
!543 = !DILocation(line: 342, column: 9, scope: !483)
!544 = !DILocation(line: 342, column: 30, scope: !483)
!545 = !DILocalVariable(name: "this", arg: 1, scope: !546, type: !177, flags: DIFlagArtificial | DIFlagObjectPointer)
!546 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataC2Ev", scope: !178, file: !6, line: 277, type: !227, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !226, retainedNodes: !547)
!547 = !{!545}
!548 = !DILocation(line: 0, scope: !546, inlinedAt: !549)
!549 = distinct !DILocation(line: 342, column: 30, scope: !483)
!550 = !DILocalVariable(name: "this", arg: 1, scope: !551, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!551 = distinct !DISubprogram(name: "thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerC2Ev", scope: !181, file: !167, line: 103, type: !215, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !214, retainedNodes: !552)
!552 = !{!550}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!554 = !DILocation(line: 0, scope: !551, inlinedAt: !555)
!555 = distinct !DILocation(line: 277, column: 19, scope: !546, inlinedAt: !549)
!556 = !DILocation(line: 96, column: 10, scope: !551, inlinedAt: !555)
!557 = !{!558, !561, i64 128}
!558 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE", !559, i64 0, !560, i64 64, !561, i64 128}
!559 = !{!"_ZTS15pthread_mutex_t", !405, i64 0}
!560 = !{!"_ZTS14pthread_cond_t", !405, i64 0}
!561 = !{!"bool", !405, i64 0}
!562 = !DILocation(line: 104, column: 9, scope: !563, inlinedAt: !555)
!563 = distinct !DILexicalBlock(scope: !551, file: !167, line: 103, column: 35)
!564 = !DILocation(line: 105, column: 9, scope: !563, inlinedAt: !555)
!565 = !DILocation(line: 273, column: 27, scope: !546, inlinedAt: !549)
!566 = !{!567, !404, i64 136}
!567 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE", !558, i64 0, !404, i64 136, !404, i64 140, !404, i64 144}
!568 = !DILocation(line: 274, column: 27, scope: !546, inlinedAt: !549)
!569 = !{!567, !404, i64 140}
!570 = !DILocation(line: 275, column: 27, scope: !546, inlinedAt: !549)
!571 = !{!567, !404, i64 144}
!572 = !DILocalVariable(name: "this", arg: 1, scope: !573, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!573 = distinct !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !181, file: !167, line: 113, type: !215, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !218, retainedNodes: !574)
!574 = !{!572}
!575 = !DILocation(line: 0, scope: !573, inlinedAt: !576)
!576 = distinct !DILocation(line: 344, column: 21, scope: !483)
!577 = !DILocation(line: 114, column: 21, scope: !573, inlinedAt: !576)
!578 = !DILocation(line: 347, column: 72, scope: !483)
!579 = !DILocation(line: 0, scope: !483)
!580 = !DILocation(line: 348, column: 18, scope: !581)
!581 = distinct !DILexicalBlock(scope: !483, file: !6, line: 348, column: 13)
!582 = !DILocation(line: 348, column: 13, scope: !483)
!583 = !DILocation(line: 349, column: 23, scope: !584)
!584 = distinct !DILexicalBlock(scope: !581, file: !6, line: 348, column: 30)
!585 = !DILocation(line: 351, column: 9, scope: !584)
!586 = !DILocation(line: 347, column: 38, scope: !483)
!587 = !DILocation(line: 356, column: 23, scope: !588)
!588 = distinct !DILexicalBlock(scope: !581, file: !6, line: 351, column: 16)
!589 = !DILocation(line: 359, column: 60, scope: !483)
!590 = !DILocation(line: 359, column: 48, scope: !483)
!591 = !DILocalVariable(name: "addr", arg: 1, scope: !592, file: !6, line: 113, type: !302)
!592 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_release_relaxedEPjS4_S4_", scope: !500, file: !6, line: 113, type: !501, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !593)
!593 = !{!591, !594, !595}
!594 = !DILocalVariable(name: "expected", arg: 2, scope: !592, file: !6, line: 113, type: !302)
!595 = !DILocalVariable(name: "desired", arg: 3, scope: !592, file: !6, line: 113, type: !302)
!596 = !DILocation(line: 0, scope: !592, inlinedAt: !597)
!597 = distinct !DILocation(line: 360, column: 13, scope: !598)
!598 = distinct !DILexicalBlock(scope: !483, file: !6, line: 360, column: 13)
!599 = !DILocation(line: 0, scope: !510, inlinedAt: !600)
!600 = distinct !DILocation(line: 114, column: 12, scope: !592, inlinedAt: !597)
!601 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !600)
!602 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !600)
!603 = !DILocation(line: 360, column: 13, scope: !483)
!604 = !DILocalVariable(name: "this", arg: 1, scope: !605, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!605 = distinct !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !181, file: !167, line: 117, type: !215, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !219, retainedNodes: !606)
!606 = !{!604}
!607 = !DILocation(line: 0, scope: !605, inlinedAt: !608)
!608 = distinct !DILocation(line: 361, column: 25, scope: !609)
!609 = distinct !DILexicalBlock(scope: !598, file: !6, line: 360, column: 75)
!610 = !DILocation(line: 118, column: 9, scope: !605, inlinedAt: !608)
!611 = !DILocation(line: 119, column: 16, scope: !605, inlinedAt: !608)
!612 = !{i8 0, i8 2}
!613 = !DILocation(line: 119, column: 9, scope: !605, inlinedAt: !608)
!614 = !DILocation(line: 120, column: 13, scope: !615, inlinedAt: !608)
!615 = distinct !DILexicalBlock(scope: !605, file: !167, line: 119, column: 29)
!616 = distinct !{!616, !613, !617, !618}
!617 = !DILocation(line: 121, column: 9, scope: !605, inlinedAt: !608)
!618 = !{!"llvm.loop.mustprogress"}
!619 = !DILocation(line: 122, column: 9, scope: !605, inlinedAt: !608)
!620 = !DILocation(line: 363, column: 13, scope: !609)
!621 = !DILocation(line: 364, column: 9, scope: !609)
!622 = !DILocation(line: 0, scope: !598)
!623 = !DILocalVariable(name: "this", arg: 1, scope: !624, type: !177, flags: DIFlagArtificial | DIFlagObjectPointer)
!624 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataD2Ev", scope: !178, file: !6, line: 280, type: !227, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !230, retainedNodes: !625)
!625 = !{!623}
!626 = !DILocation(line: 0, scope: !624, inlinedAt: !627)
!627 = distinct !DILocation(line: 365, column: 5, scope: !463)
!628 = !DILocalVariable(name: "this", arg: 1, scope: !629, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!629 = distinct !DISubprogram(name: "~thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerD2Ev", scope: !181, file: !167, line: 108, type: !215, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !217, retainedNodes: !630)
!630 = !{!628}
!631 = !DILocation(line: 0, scope: !629, inlinedAt: !632)
!632 = distinct !DILocation(line: 280, column: 51, scope: !633, inlinedAt: !627)
!633 = distinct !DILexicalBlock(scope: !624, file: !6, line: 280, column: 51)
!634 = !DILocation(line: 109, column: 9, scope: !635, inlinedAt: !632)
!635 = distinct !DILexicalBlock(scope: !629, file: !167, line: 108, column: 36)
!636 = !DILocation(line: 110, column: 9, scope: !635, inlinedAt: !632)
!637 = !DILocation(line: 365, column: 5, scope: !463)
!638 = distinct !{!638, !492, !637}
!639 = !DILocation(line: 366, column: 1, scope: !463)
!640 = !DISubprogram(name: "halide_thread_yield", scope: !23, file: !23, line: 190, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!641 = !DISubroutineType(types: !642)
!642 = !{null}
!643 = distinct !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !239, file: !6, line: 368, type: !243, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !246, retainedNodes: !644)
!644 = !{!645, !646, !647, !649, !650, !651, !653, !654, !655, !656, !658, !661, !662, !665}
!645 = !DILocalVariable(name: "this", arg: 1, scope: !643, type: !466, flags: DIFlagArtificial | DIFlagObjectPointer)
!646 = !DILocalVariable(name: "expected", scope: !643, file: !6, line: 369, type: !22)
!647 = !DILocalVariable(name: "thread_queuing", scope: !648, file: !6, line: 375, type: !64)
!648 = distinct !DILexicalBlock(scope: !643, file: !6, line: 372, column: 18)
!649 = !DILocalVariable(name: "none_queued", scope: !648, file: !6, line: 377, type: !64)
!650 = !DILocalVariable(name: "desired", scope: !648, file: !6, line: 382, type: !22)
!651 = !DILocalVariable(name: "head", scope: !652, file: !6, line: 389, type: !177)
!652 = distinct !DILexicalBlock(scope: !643, file: !6, line: 388, column: 18)
!653 = !DILocalVariable(name: "current", scope: !652, file: !6, line: 390, type: !177)
!654 = !DILocalVariable(name: "tail", scope: !652, file: !6, line: 391, type: !177)
!655 = !DILocalVariable(name: "times_through", scope: !652, file: !6, line: 392, type: !29)
!656 = !DILocalVariable(name: "next", scope: !657, file: !6, line: 394, type: !177)
!657 = distinct !DILexicalBlock(scope: !652, file: !6, line: 393, column: 33)
!658 = !DILocalVariable(name: "desired", scope: !659, file: !6, line: 406, type: !22)
!659 = distinct !DILexicalBlock(scope: !660, file: !6, line: 405, column: 34)
!660 = distinct !DILexicalBlock(scope: !652, file: !6, line: 405, column: 13)
!661 = !DILocalVariable(name: "new_tail", scope: !652, file: !6, line: 414, type: !177)
!662 = !DILocalVariable(name: "continue_outer", scope: !663, file: !6, line: 416, type: !64)
!663 = distinct !DILexicalBlock(scope: !664, file: !6, line: 415, column: 34)
!664 = distinct !DILexicalBlock(scope: !652, file: !6, line: 415, column: 13)
!665 = !DILocalVariable(name: "desired", scope: !666, file: !6, line: 418, type: !22)
!666 = distinct !DILexicalBlock(scope: !663, file: !6, line: 417, column: 37)
!667 = !DILocation(line: 0, scope: !643)
!668 = !DILocation(line: 370, column: 26, scope: !643)
!669 = !DILocation(line: 370, column: 5, scope: !643)
!670 = !DILocalVariable(name: "addr", arg: 1, scope: !671, file: !6, line: 135, type: !513)
!671 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_119atomic_load_relaxedIjEEvPT_S6_", scope: !500, file: !6, line: 135, type: !672, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !519, retainedNodes: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !513, !513}
!674 = !{!670, !675}
!675 = !DILocalVariable(name: "val", arg: 2, scope: !671, file: !6, line: 135, type: !513)
!676 = !DILocation(line: 0, scope: !671, inlinedAt: !677)
!677 = distinct !DILocation(line: 370, column: 5, scope: !643)
!678 = !DILocation(line: 372, column: 5, scope: !643)
!679 = !DILocation(line: 136, column: 10, scope: !671, inlinedAt: !677)
!680 = !DILocation(line: 375, column: 41, scope: !648)
!681 = !DILocation(line: 375, column: 31, scope: !648)
!682 = !DILocation(line: 0, scope: !648)
!683 = !DILocation(line: 378, column: 28, scope: !684)
!684 = distinct !DILexicalBlock(scope: !648, file: !6, line: 378, column: 13)
!685 = !DILocation(line: 382, column: 38, scope: !648)
!686 = !DILocation(line: 0, scope: !499, inlinedAt: !687)
!687 = distinct !DILocation(line: 383, column: 13, scope: !688)
!688 = distinct !DILexicalBlock(scope: !648, file: !6, line: 383, column: 13)
!689 = !DILocation(line: 0, scope: !510, inlinedAt: !690)
!690 = distinct !DILocation(line: 127, column: 12, scope: !499, inlinedAt: !687)
!691 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !690)
!692 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !690)
!693 = !DILocation(line: 389, column: 72, scope: !652)
!694 = !DILocation(line: 389, column: 38, scope: !652)
!695 = !DILocation(line: 0, scope: !652)
!696 = !DILocation(line: 391, column: 47, scope: !652)
!697 = !DILocation(line: 393, column: 21, scope: !652)
!698 = !DILocation(line: 393, column: 9, scope: !652)
!699 = !DILocation(line: 394, column: 51, scope: !657)
!700 = !DILocation(line: 0, scope: !657)
!701 = !DILocation(line: 395, column: 13, scope: !702)
!702 = distinct !DILexicalBlock(scope: !703, file: !6, line: 395, column: 13)
!703 = distinct !DILexicalBlock(scope: !657, file: !6, line: 395, column: 13)
!704 = !DILocation(line: 395, column: 13, scope: !703)
!705 = !DILocation(line: 395, column: 13, scope: !706)
!706 = distinct !DILexicalBlock(scope: !702, file: !6, line: 395, column: 13)
!707 = !DILocation(line: 396, column: 19, scope: !657)
!708 = !DILocation(line: 396, column: 24, scope: !657)
!709 = !DILocation(line: 398, column: 29, scope: !657)
!710 = distinct !{!710, !698, !711, !618}
!711 = !DILocation(line: 400, column: 9, scope: !652)
!712 = !DILocation(line: 401, column: 20, scope: !652)
!713 = !DILocation(line: 405, column: 22, scope: !660)
!714 = !DILocation(line: 405, column: 13, scope: !660)
!715 = !DILocation(line: 405, column: 13, scope: !652)
!716 = !DILocation(line: 406, column: 42, scope: !659)
!717 = !DILocation(line: 0, scope: !659)
!718 = !DILocalVariable(name: "addr", arg: 1, scope: !719, file: !6, line: 118, type: !513)
!719 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_130atomic_cas_weak_relacq_relaxedIjEEbPT_S6_S6_", scope: !500, file: !6, line: 118, type: !511, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, templateParams: !519, retainedNodes: !720)
!720 = !{!718, !721, !722}
!721 = !DILocalVariable(name: "expected", arg: 2, scope: !719, file: !6, line: 118, type: !513)
!722 = !DILocalVariable(name: "desired", arg: 3, scope: !719, file: !6, line: 118, type: !513)
!723 = !DILocation(line: 0, scope: !719, inlinedAt: !724)
!724 = distinct !DILocation(line: 407, column: 17, scope: !725)
!725 = distinct !DILexicalBlock(scope: !659, file: !6, line: 407, column: 17)
!726 = !DILocation(line: 0, scope: !510, inlinedAt: !727)
!727 = distinct !DILocation(line: 119, column: 12, scope: !719, inlinedAt: !724)
!728 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !727)
!729 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !727)
!730 = !DILocation(line: 407, column: 17, scope: !659)
!731 = distinct !{!731, !732, !733}
!732 = !DILocation(line: 388, column: 5, scope: !643)
!733 = !DILocation(line: 445, column: 5, scope: !643)
!734 = !DILocation(line: 414, column: 48, scope: !652)
!735 = !DILocation(line: 415, column: 22, scope: !664)
!736 = !DILocation(line: 415, column: 13, scope: !652)
!737 = !DILocation(line: 418, column: 46, scope: !666)
!738 = !DILocation(line: 0, scope: !666)
!739 = !DILocation(line: 0, scope: !719, inlinedAt: !740)
!740 = distinct !DILocation(line: 419, column: 21, scope: !741)
!741 = distinct !DILexicalBlock(scope: !666, file: !6, line: 419, column: 21)
!742 = !DILocation(line: 0, scope: !510, inlinedAt: !743)
!743 = distinct !DILocation(line: 119, column: 12, scope: !719, inlinedAt: !740)
!744 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !743)
!745 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !743)
!746 = !DILocation(line: 419, column: 21, scope: !666)
!747 = !DILocation(line: 422, column: 74, scope: !748)
!748 = distinct !DILexicalBlock(scope: !666, file: !6, line: 422, column: 21)
!749 = !DILocation(line: 422, column: 21, scope: !666)
!750 = distinct !{!750, !751, !752, !618}
!751 = !DILocation(line: 417, column: 13, scope: !663)
!752 = !DILocation(line: 428, column: 13, scope: !663)
!753 = !DILocation(line: 434, column: 24, scope: !754)
!754 = distinct !DILexicalBlock(scope: !664, file: !6, line: 433, column: 16)
!755 = !DILocalVariable(name: "addr", arg: 1, scope: !756, file: !6, line: 92, type: !302)
!756 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_124atomic_and_fetch_releaseEPjj", scope: !500, file: !6, line: 92, type: !757, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{!22, !302, !22}
!759 = !{!755, !760}
!760 = !DILocalVariable(name: "val", arg: 2, scope: !756, file: !6, line: 92, type: !22)
!761 = !DILocation(line: 0, scope: !756, inlinedAt: !762)
!762 = distinct !DILocation(line: 435, column: 13, scope: !754)
!763 = !DILocation(line: 93, column: 12, scope: !756, inlinedAt: !762)
!764 = !DILocalVariable(name: "this", arg: 1, scope: !765, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!765 = distinct !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !181, file: !167, line: 125, type: !215, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !220, retainedNodes: !766)
!766 = !{!764}
!767 = !DILocation(line: 0, scope: !765, inlinedAt: !768)
!768 = distinct !DILocation(line: 441, column: 22, scope: !652)
!769 = !DILocation(line: 126, column: 29, scope: !765, inlinedAt: !768)
!770 = !DILocation(line: 126, column: 9, scope: !765, inlinedAt: !768)
!771 = !DILocalVariable(name: "this", arg: 1, scope: !772, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!772 = distinct !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !181, file: !167, line: 129, type: !215, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !221, retainedNodes: !773)
!773 = !{!771}
!774 = !DILocation(line: 0, scope: !772, inlinedAt: !775)
!775 = distinct !DILocation(line: 442, column: 22, scope: !652)
!776 = !DILocation(line: 130, column: 9, scope: !772, inlinedAt: !775)
!777 = !DILocation(line: 130, column: 21, scope: !772, inlinedAt: !775)
!778 = !DILocation(line: 131, column: 30, scope: !772, inlinedAt: !775)
!779 = !DILocation(line: 131, column: 9, scope: !772, inlinedAt: !775)
!780 = !DILocalVariable(name: "this", arg: 1, scope: !781, type: !553, flags: DIFlagArtificial | DIFlagObjectPointer)
!781 = distinct !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !181, file: !167, line: 134, type: !215, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !222, retainedNodes: !782)
!782 = !{!780}
!783 = !DILocation(line: 0, scope: !781, inlinedAt: !784)
!784 = distinct !DILocation(line: 443, column: 22, scope: !652)
!785 = !DILocation(line: 135, column: 9, scope: !781, inlinedAt: !784)
!786 = !DILocation(line: 444, column: 9, scope: !652)
!787 = !DILocation(line: 0, scope: !663)
!788 = !DILocation(line: 446, column: 1, scope: !643)
!789 = !DISubprogram(name: "halide_print", scope: !18, file: !18, line: 97, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !43, !49}
!792 = !DISubprogram(name: "abort", scope: !23, file: !23, line: 108, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !163)
!793 = distinct !DISubprogram(name: "lock_bucket", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization11lock_bucketEj", scope: !2, file: !6, line: 509, type: !794, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !797)
!794 = !DISubroutineType(types: !795)
!795 = !{!796, !22}
!796 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !236, size: 32)
!797 = !{!798, !799, !800}
!798 = !DILocalVariable(name: "addr", arg: 1, scope: !793, file: !6, line: 509, type: !22)
!799 = !DILocalVariable(name: "hash", scope: !793, file: !6, line: 510, type: !22)
!800 = !DILocalVariable(name: "bucket", scope: !793, file: !6, line: 515, type: !796)
!801 = !DILocation(line: 0, scope: !793)
!802 = !DILocalVariable(name: "addr", arg: 1, scope: !803, file: !6, line: 499, type: !22)
!803 = distinct !DISubprogram(name: "addr_hash", linkageName: "_ZN6Halide7Runtime8Internal15SynchronizationL9addr_hashEjj", scope: !2, file: !6, line: 499, type: !804, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !806)
!804 = !DISubroutineType(types: !805)
!805 = !{!22, !22, !24}
!806 = !{!802, !807}
!807 = !DILocalVariable(name: "bits", arg: 2, scope: !803, file: !6, line: 499, type: !24)
!808 = !DILocation(line: 0, scope: !803, inlinedAt: !809)
!809 = distinct !DILocation(line: 510, column: 22, scope: !793)
!810 = !DILocation(line: 505, column: 22, scope: !811, inlinedAt: !809)
!811 = distinct !DILexicalBlock(scope: !812, file: !6, line: 504, column: 12)
!812 = distinct !DILexicalBlock(scope: !803, file: !6, line: 502, column: 9)
!813 = !DILocation(line: 505, column: 47, scope: !811, inlinedAt: !809)
!814 = !DILocation(line: 515, column: 27, scope: !793)
!815 = !DILocalVariable(name: "this", arg: 1, scope: !816, type: !466, flags: DIFlagArtificial | DIFlagObjectPointer)
!816 = distinct !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !239, file: !6, line: 291, type: !243, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, declaration: !248, retainedNodes: !817)
!817 = !{!815, !818, !819}
!818 = !DILocalVariable(name: "expected", scope: !816, file: !6, line: 294, type: !22)
!819 = !DILocalVariable(name: "desired", scope: !816, file: !6, line: 295, type: !22)
!820 = !DILocation(line: 0, scope: !816, inlinedAt: !821)
!821 = distinct !DILocation(line: 517, column: 18, scope: !793)
!822 = !DILocation(line: 292, column: 26, scope: !816, inlinedAt: !821)
!823 = !DILocalVariable(name: "mutex", arg: 1, scope: !824, file: !6, line: 56, type: !43)
!824 = distinct !DISubprogram(name: "if_tsan_pre_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_116if_tsan_pre_lockEPv", scope: !500, file: !6, line: 56, type: !171, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !825)
!825 = !{!823}
!826 = !DILocation(line: 0, scope: !824, inlinedAt: !827)
!827 = distinct !DILocation(line: 292, column: 9, scope: !816, inlinedAt: !821)
!828 = !DILocation(line: 57, column: 5, scope: !824, inlinedAt: !827)
!829 = !DILocation(line: 297, column: 47, scope: !830, inlinedAt: !821)
!830 = distinct !DILexicalBlock(scope: !816, file: !6, line: 297, column: 13)
!831 = !DILocation(line: 0, scope: !499, inlinedAt: !832)
!832 = distinct !DILocation(line: 297, column: 14, scope: !830, inlinedAt: !821)
!833 = !DILocation(line: 0, scope: !510, inlinedAt: !834)
!834 = distinct !DILocation(line: 127, column: 12, scope: !499, inlinedAt: !832)
!835 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !834)
!836 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !834)
!837 = !DILocation(line: 297, column: 13, scope: !816, inlinedAt: !821)
!838 = !DILocation(line: 517, column: 12, scope: !793)
!839 = !DILocation(line: 298, column: 13, scope: !840, inlinedAt: !821)
!840 = distinct !DILexicalBlock(scope: !830, file: !6, line: 297, column: 76)
!841 = !DILocation(line: 299, column: 9, scope: !840, inlinedAt: !821)
!842 = !DILocalVariable(name: "mutex", arg: 1, scope: !843, file: !6, line: 60, type: !43)
!843 = distinct !DISubprogram(name: "if_tsan_post_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_117if_tsan_post_lockEPv", scope: !500, file: !6, line: 60, type: !171, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !844)
!844 = !{!842}
!845 = !DILocation(line: 0, scope: !843, inlinedAt: !846)
!846 = distinct !DILocation(line: 301, column: 9, scope: !816, inlinedAt: !821)
!847 = !DILocation(line: 61, column: 5, scope: !843, inlinedAt: !846)
!848 = !DILocation(line: 519, column: 5, scope: !793)
!849 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization16lock_bucket_pairEjj", scope: !2, file: !6, line: 531, type: !850, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !860)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !22, !22}
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !2, file: !6, line: 522, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !853, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11bucket_pairE")
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !852, file: !6, line: 523, baseType: !796, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !852, file: !6, line: 524, baseType: !796, size: 32, offset: 32)
!856 = !DISubprogram(name: "bucket_pair", scope: !852, file: !6, line: 526, type: !857, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !859, !796, !796}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!860 = !{!861, !862, !863, !864, !865, !868, !871, !872, !874}
!861 = !DILocalVariable(name: "addr_from", arg: 1, scope: !849, file: !6, line: 531, type: !22)
!862 = !DILocalVariable(name: "addr_to", arg: 2, scope: !849, file: !6, line: 531, type: !22)
!863 = !DILocalVariable(name: "hash_from", scope: !849, file: !6, line: 533, type: !22)
!864 = !DILocalVariable(name: "hash_to", scope: !849, file: !6, line: 534, type: !22)
!865 = !DILocalVariable(name: "first", scope: !866, file: !6, line: 542, type: !796)
!866 = distinct !DILexicalBlock(scope: !867, file: !6, line: 541, column: 31)
!867 = distinct !DILexicalBlock(scope: !849, file: !6, line: 541, column: 9)
!868 = !DILocalVariable(name: "first", scope: !869, file: !6, line: 546, type: !796)
!869 = distinct !DILexicalBlock(scope: !870, file: !6, line: 545, column: 37)
!870 = distinct !DILexicalBlock(scope: !867, file: !6, line: 545, column: 16)
!871 = !DILocalVariable(name: "second", scope: !869, file: !6, line: 547, type: !796)
!872 = !DILocalVariable(name: "first", scope: !873, file: !6, line: 552, type: !796)
!873 = distinct !DILexicalBlock(scope: !870, file: !6, line: 551, column: 12)
!874 = !DILocalVariable(name: "second", scope: !873, file: !6, line: 553, type: !796)
!875 = !DILocation(line: 0, scope: !849)
!876 = !DILocation(line: 0, scope: !803, inlinedAt: !877)
!877 = distinct !DILocation(line: 533, column: 27, scope: !849)
!878 = !DILocation(line: 505, column: 22, scope: !811, inlinedAt: !877)
!879 = !DILocation(line: 505, column: 47, scope: !811, inlinedAt: !877)
!880 = !DILocation(line: 0, scope: !803, inlinedAt: !881)
!881 = distinct !DILocation(line: 534, column: 25, scope: !849)
!882 = !DILocation(line: 505, column: 22, scope: !811, inlinedAt: !881)
!883 = !DILocation(line: 505, column: 47, scope: !811, inlinedAt: !881)
!884 = !DILocation(line: 541, column: 19, scope: !867)
!885 = !DILocation(line: 541, column: 9, scope: !849)
!886 = !DILocation(line: 542, column: 30, scope: !866)
!887 = !DILocation(line: 0, scope: !866)
!888 = !DILocation(line: 0, scope: !816, inlinedAt: !889)
!889 = distinct !DILocation(line: 543, column: 21, scope: !866)
!890 = !DILocation(line: 292, column: 26, scope: !816, inlinedAt: !889)
!891 = !DILocation(line: 0, scope: !824, inlinedAt: !892)
!892 = distinct !DILocation(line: 292, column: 9, scope: !816, inlinedAt: !889)
!893 = !DILocation(line: 57, column: 5, scope: !824, inlinedAt: !892)
!894 = !DILocation(line: 297, column: 47, scope: !830, inlinedAt: !889)
!895 = !DILocation(line: 0, scope: !499, inlinedAt: !896)
!896 = distinct !DILocation(line: 297, column: 14, scope: !830, inlinedAt: !889)
!897 = !DILocation(line: 0, scope: !510, inlinedAt: !898)
!898 = distinct !DILocation(line: 127, column: 12, scope: !499, inlinedAt: !896)
!899 = !DILocation(line: 104, column: 16, scope: !510, inlinedAt: !898)
!900 = !DILocation(line: 106, column: 19, scope: !510, inlinedAt: !898)
!901 = !DILocation(line: 297, column: 13, scope: !816, inlinedAt: !889)
!902 = !DILocation(line: 543, column: 15, scope: !866)
!903 = !DILocation(line: 298, column: 13, scope: !840, inlinedAt: !889)
!904 = !DILocation(line: 299, column: 9, scope: !840, inlinedAt: !889)
!905 = !DILocation(line: 545, column: 26, scope: !870)
!906 = !DILocation(line: 545, column: 16, scope: !867)
!907 = !DILocation(line: 546, column: 30, scope: !869)
!908 = !DILocation(line: 0, scope: !869)
!909 = !DILocation(line: 547, column: 31, scope: !869)
!910 = !DILocation(line: 0, scope: !816, inlinedAt: !911)
