; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/matlab.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/matlab.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.mxArray = type opaque
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [2 x i8] }>
%struct.halide_filter_metadata_t = type { i32, i32, %struct.halide_filter_argument_t*, i8*, i8* }
%struct.halide_filter_argument_t = type { i8*, i32, i32, %struct.halide_type_t, %struct.halide_scalar_value_t*, %struct.halide_scalar_value_t*, %struct.halide_scalar_value_t*, %struct.halide_scalar_value_t*, i64** }
%struct.halide_type_t = type { i8, i8, i16 }
%struct.halide_scalar_value_t = type { %union.anon }
%union.anon = type { i64 }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer.0" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [2 x i8] }>
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }

!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 1415, baseType: !19, size: 32, elements: !125, identifier: "_ZTS19halide_buffer_flags")
!125 = !{!126, !127}
!126 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_argument_kind_t", file: !115, line: 1598, baseType: !19, size: 32, elements: !129, identifier: "_ZTS22halide_argument_kind_t")
!129 = !{!130, !131, !132}
!130 = !DIEnumerator(name: "halide_argument_kind_input_scalar", value: 0, isUnsigned: true)
!131 = !DIEnumerator(name: "halide_argument_kind_input_buffer", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "halide_argument_kind_output_buffer", value: 2, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !115, line: 990, baseType: !28, size: 32, elements: !134, identifier: "_ZTS19halide_error_code_t")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!135 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!136 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!137 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!138 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!139 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!140 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!141 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!142 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!143 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!144 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!145 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!146 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!147 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!148 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!149 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!150 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!151 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!152 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!153 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!154 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!155 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!156 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!157 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!158 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!159 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!160 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!161 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!162 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!163 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!164 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!165 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!166 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!167 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!168 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!169 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!170 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!171 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!172 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!173 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!174 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!175 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!176 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!177 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!178 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!179 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!180 = !{!181, !336, !213, !417, !418, !420, !421, !423, !424, !208, !425, !116, !239, !426, !222, !427, !217, !428, !229, !429, !93, !430, !431, !432, !341, !188, !6, !433, !25, !436, !38, !45, !74, !80, !90, !441, !108, !330}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !183, file: !182, line: 199, baseType: !185)
!182 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!183 = !DINamespace(scope: !184)
!184 = !DINamespace(name: "Internal", scope: !3)
!185 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !183, file: !182, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !186, templateParams: !414)
!186 = !{!187, !189, !190, !191, !192, !193, !197, !201, !205, !210, !214, !219, !223, !226, !230, !235, !241, !274, !396, !399, !402, !407, !408, !411, !412, !413}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !185, file: !182, line: 32, baseType: !188, size: 32, flags: DIFlagPublic)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !185, file: !182, line: 32, baseType: !188, size: 32, offset: 32, flags: DIFlagPublic)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !185, file: !182, line: 32, baseType: !188, size: 32, offset: 64, flags: DIFlagPublic)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !185, file: !182, line: 33, baseType: !77, size: 32, offset: 96, flags: DIFlagPublic)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !185, file: !182, line: 34, baseType: !83, size: 8, offset: 128, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !185, file: !182, line: 35, baseType: !194, size: 8, offset: 136, flags: DIFlagPublic)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 1)
!197 = !DISubprogram(name: "Printer", scope: !185, file: !182, line: 37, type: !198, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !200, !77, !188}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!201 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !185, file: !182, line: 57, type: !202, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !200, !9}
!204 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !185, size: 32)
!205 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !185, file: !182, line: 67, type: !206, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{!204, !200, !208}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !18, line: 9, baseType: !209)
!209 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!210 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !185, file: !182, line: 72, type: !211, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{!204, !200, !213}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 11, baseType: !28)
!214 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !185, file: !182, line: 77, type: !215, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubroutineType(types: !216)
!216 = !{!204, !200, !217}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 10, baseType: !218)
!218 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!219 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !185, file: !182, line: 82, type: !220, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{!204, !200, !222}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 12, baseType: !19)
!223 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !185, file: !182, line: 87, type: !224, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !200, !93}
!226 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !185, file: !182, line: 92, type: !227, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{!204, !200, !229}
!229 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!230 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !185, file: !182, line: 97, type: !231, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DISubroutineType(types: !232)
!232 = !{!204, !200, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!235 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !185, file: !182, line: 102, type: !236, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!236 = !DISubroutineType(types: !237)
!237 = !{!204, !200, !238}
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 14, baseType: !240)
!240 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!241 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !185, file: !182, line: 108, type: !242, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{!204, !200, !244}
!244 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !115, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !247, identifier: "_ZTS13halide_type_t")
!247 = !{!248, !250, !251, !252, !256, !259, !263, !266, !267, !268, !271}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !246, file: !115, line: 434, baseType: !249, size: 8, align: 8)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !115, line: 413, baseType: !114)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !246, file: !115, line: 442, baseType: !116, size: 8, align: 8, offset: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !246, file: !115, line: 446, baseType: !239, size: 16, align: 16, offset: 16)
!252 = !DISubprogram(name: "halide_type_t", scope: !246, file: !115, line: 453, type: !253, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !255, !249, !116, !239}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!256 = !DISubprogram(name: "halide_type_t", scope: !246, file: !115, line: 459, type: !257, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !255}
!259 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !246, file: !115, line: 463, type: !260, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DISubroutineType(types: !261)
!261 = !{!246, !262, !239}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!263 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !246, file: !115, line: 468, type: !264, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!83, !262, !244}
!266 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !246, file: !115, line: 472, type: !264, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!267 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !246, file: !115, line: 476, type: !264, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !246, file: !115, line: 481, type: !269, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!269 = !DISubroutineType(types: !270)
!270 = !{!28, !262}
!271 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !246, file: !115, line: 485, type: !272, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!272 = !DISubroutineType(types: !273)
!273 = !{!222, !262}
!274 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !185, file: !182, line: 113, type: !275, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!275 = !DISubroutineType(types: !276)
!276 = !{!204, !200, !277}
!277 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !115, line: 1550, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !115, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !281, identifier: "_ZTS15halide_buffer_t")
!281 = !{!282, !283, !335, !337, !338, !339, !340, !363, !364, !369, !373, !376, !377, !380, !381, !384, !387, !388, !389, !392, !395}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !280, file: !115, line: 1425, baseType: !217, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !280, file: !115, line: 1428, baseType: !284, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !115, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !287, identifier: "_ZTS25halide_device_interface_t")
!287 = !{!288, !293, !297, !298, !302, !303, !304, !305, !306, !310, !316, !320, !321, !325, !326, !331}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !286, file: !115, line: 724, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!28, !77, !292, !284}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !286, file: !115, line: 726, baseType: !294, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{!28, !77, !292}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !286, file: !115, line: 727, baseType: !294, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !286, file: !115, line: 728, baseType: !299, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !77, !284}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !286, file: !115, line: 730, baseType: !294, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !286, file: !115, line: 731, baseType: !289, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !286, file: !115, line: 733, baseType: !289, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !286, file: !115, line: 735, baseType: !294, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !286, file: !115, line: 736, baseType: !307, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!28, !77, !292, !284, !292}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !286, file: !115, line: 738, baseType: !311, size: 32, offset: 288)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!28, !77, !314, !292}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !286, file: !115, line: 740, baseType: !317, size: 32, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{!28, !77, !314, !28, !28, !292}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !286, file: !115, line: 742, baseType: !294, size: 32, offset: 352)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !286, file: !115, line: 743, baseType: !322, size: 32, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!28, !77, !292, !217, !284}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !286, file: !115, line: 745, baseType: !294, size: 32, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !286, file: !115, line: 746, baseType: !327, size: 32, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{!28, !77, !330, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !286, file: !115, line: 747, baseType: !332, size: 32, offset: 480)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !115, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!335 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !280, file: !115, line: 1433, baseType: !336, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !280, file: !115, line: 1436, baseType: !217, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !115, line: 1439, baseType: !246, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !280, file: !115, line: 1442, baseType: !213, size: 32, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !280, file: !115, line: 1446, baseType: !341, size: 32, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !115, line: 1409, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !115, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !344, identifier: "_ZTS18halide_dimension_t")
!344 = !{!345, !346, !347, !348, !349, !353, !356, !362}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !343, file: !115, line: 1383, baseType: !213, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !343, file: !115, line: 1383, baseType: !213, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !343, file: !115, line: 1383, baseType: !213, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !343, file: !115, line: 1386, baseType: !222, size: 32, offset: 96)
!349 = !DISubprogram(name: "halide_dimension_t", scope: !343, file: !115, line: 1388, type: !350, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!353 = !DISubprogram(name: "halide_dimension_t", scope: !343, file: !115, line: 1389, type: !354, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !352, !213, !213, !213, !222}
!356 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !343, file: !115, line: 1393, type: !357, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubroutineType(types: !358)
!358 = !{!83, !359, !361}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!361 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !360, size: 32)
!362 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !343, file: !115, line: 1400, type: !357, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !280, file: !115, line: 1449, baseType: !77, size: 32, offset: 288)
!364 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !280, file: !115, line: 1454, type: !365, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!365 = !DISubroutineType(types: !366)
!366 = !{!83, !367, !368}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !115, line: 1416, baseType: !124)
!369 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !280, file: !115, line: 1458, type: !370, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372, !368, !83}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!373 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !280, file: !115, line: 1466, type: !374, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!374 = !DISubroutineType(types: !375)
!375 = !{!83, !367}
!376 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !280, file: !115, line: 1470, type: !374, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!377 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !280, file: !115, line: 1474, type: !378, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !372, !83}
!380 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !280, file: !115, line: 1478, type: !378, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!381 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !280, file: !115, line: 1485, type: !382, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!382 = !DISubroutineType(types: !383)
!383 = !{!17, !367}
!384 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !280, file: !115, line: 1495, type: !385, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!385 = !DISubroutineType(types: !386)
!386 = !{!336, !367}
!387 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !280, file: !115, line: 1506, type: !385, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!388 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !280, file: !115, line: 1518, type: !382, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !280, file: !115, line: 1523, type: !390, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!390 = !DISubroutineType(types: !391)
!391 = !{!336, !367, !41}
!392 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !280, file: !115, line: 1534, type: !393, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!393 = !DISubroutineType(types: !394)
!394 = !{!28, !372, !77}
!395 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !280, file: !115, line: 1545, type: !374, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!396 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !185, file: !182, line: 119, type: !397, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!397 = !DISubroutineType(types: !398)
!398 = !{!9, !200}
!399 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !185, file: !182, line: 131, type: !400, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !200}
!402 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !185, file: !182, line: 139, type: !403, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!403 = !DISubroutineType(types: !404)
!404 = !{!217, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!407 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !185, file: !182, line: 143, type: !403, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!408 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !185, file: !182, line: 148, type: !409, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !200, !28}
!411 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !185, file: !182, line: 158, type: !397, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !185, file: !182, line: 162, type: !400, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubprogram(name: "~Printer", scope: !185, file: !182, line: 166, type: !400, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !{!415, !416}
!415 = !DITemplateValueParameter(name: "type", type: !28, value: i32 1)
!416 = !DITemplateValueParameter(name: "length", type: !218, value: i64 1024)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !18, line: 15, baseType: !419)
!419 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 13, baseType: !422)
!422 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DISubroutineType(types: !435)
!435 = !{!19, !20}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !20}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!101, !19, !19, !48, !102}
!444 = !{!0, !12, !23, !29, !36, !43, !72, !78, !84, !86, !88, !94, !96, !106}
!445 = !{!446, !447}
!446 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !111, entity: !184, file: !18, line: 225)
!447 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !111, entity: !2, file: !49, line: 214)
!448 = !{i32 7, !"Dwarf Version", i32 4}
!449 = !{i32 2, !"Debug Info Version", i32 3}
!450 = !{i32 1, !"wchar_size", i32 4}
!451 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!452 = distinct !DISubprogram(name: "get_class_id", linkageName: "_ZN6Halide7Runtime3mex12get_class_idEii", scope: !2, file: !49, line: 78, type: !453, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{!48, !213, !213}
!455 = !{!456, !457}
!456 = !DILocalVariable(name: "type_code", arg: 1, scope: !452, file: !49, line: 78, type: !213)
!457 = !DILocalVariable(name: "type_bits", arg: 2, scope: !452, file: !49, line: 78, type: !213)
!458 = !DILocation(line: 0, scope: !452)
!459 = !DILocation(line: 79, column: 5, scope: !452)
!460 = !DILocation(line: 81, column: 9, scope: !461)
!461 = distinct !DILexicalBlock(scope: !452, file: !49, line: 79, column: 24)
!462 = !DILocation(line: 85, column: 13, scope: !463)
!463 = distinct !DILexicalBlock(scope: !461, file: !49, line: 81, column: 28)
!464 = !DILocation(line: 87, column: 13, scope: !463)
!465 = !DILocation(line: 89, column: 13, scope: !463)
!466 = !DILocation(line: 91, column: 13, scope: !463)
!467 = !DILocation(line: 93, column: 9, scope: !461)
!468 = !DILocation(line: 95, column: 9, scope: !461)
!469 = !DILocation(line: 99, column: 13, scope: !470)
!470 = distinct !DILexicalBlock(scope: !461, file: !49, line: 95, column: 28)
!471 = !DILocation(line: 101, column: 13, scope: !470)
!472 = !DILocation(line: 103, column: 13, scope: !470)
!473 = !DILocation(line: 105, column: 13, scope: !470)
!474 = !DILocation(line: 107, column: 9, scope: !461)
!475 = !DILocation(line: 109, column: 9, scope: !461)
!476 = !DILocation(line: 118, column: 1, scope: !452)
!477 = distinct !DISubprogram(name: "get_class_name", linkageName: "_ZN6Halide7Runtime3mex14get_class_nameENS1_9mxClassIDE", scope: !2, file: !49, line: 121, type: !478, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{!9, !48}
!480 = !{!481}
!481 = !DILocalVariable(name: "id", arg: 1, scope: !477, file: !49, line: 121, type: !48)
!482 = !DILocation(line: 0, scope: !477)
!483 = !DILocation(line: 122, column: 5, scope: !477)
!484 = !DILocation(line: 126, column: 9, scope: !485)
!485 = distinct !DILexicalBlock(scope: !477, file: !49, line: 122, column: 17)
!486 = !DILocation(line: 128, column: 9, scope: !485)
!487 = !DILocation(line: 130, column: 9, scope: !485)
!488 = !DILocation(line: 132, column: 9, scope: !485)
!489 = !DILocation(line: 134, column: 9, scope: !485)
!490 = !DILocation(line: 136, column: 9, scope: !485)
!491 = !DILocation(line: 138, column: 9, scope: !485)
!492 = !DILocation(line: 140, column: 9, scope: !485)
!493 = !DILocation(line: 142, column: 9, scope: !485)
!494 = !DILocation(line: 144, column: 9, scope: !485)
!495 = !DILocation(line: 146, column: 9, scope: !485)
!496 = !DILocation(line: 148, column: 9, scope: !485)
!497 = !DILocation(line: 150, column: 9, scope: !485)
!498 = !DILocation(line: 152, column: 9, scope: !485)
!499 = !DILocation(line: 154, column: 9, scope: !485)
!500 = !DILocation(line: 156, column: 9, scope: !485)
!501 = !DILocation(line: 158, column: 9, scope: !485)
!502 = !DILocation(line: 160, column: 9, scope: !485)
!503 = !DILocation(line: 0, scope: !485)
!504 = !DILocation(line: 162, column: 1, scope: !477)
!505 = distinct !DISubprogram(name: "halide_matlab_describe_pipeline", scope: !49, file: !49, line: 218, type: !506, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !607)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508, !576}
!508 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringstream", scope: !183, file: !182, line: 200, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 1024>", scope: !183, file: !182, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !511, templateParams: !574)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !522, !526, !529, !532, !535, !538, !541, !544, !547, !550, !553, !556, !559, !562, !567, !568, !571, !572, !573}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !510, file: !182, line: 32, baseType: !188, size: 32, flags: DIFlagPublic)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !510, file: !182, line: 32, baseType: !188, size: 32, offset: 32, flags: DIFlagPublic)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !510, file: !182, line: 32, baseType: !188, size: 32, offset: 64, flags: DIFlagPublic)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !510, file: !182, line: 33, baseType: !77, size: 32, offset: 96, flags: DIFlagPublic)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !510, file: !182, line: 34, baseType: !83, size: 8, offset: 128, flags: DIFlagPublic)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !510, file: !182, line: 35, baseType: !194, size: 8, offset: 136, flags: DIFlagPublic)
!518 = !DISubprogram(name: "Printer", scope: !510, file: !182, line: 37, type: !519, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521, !77, !188}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!522 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !510, file: !182, line: 57, type: !523, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !521, !9}
!525 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !510, size: 32)
!526 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEx", scope: !510, file: !182, line: 67, type: !527, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(types: !528)
!528 = !{!525, !521, !208}
!529 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEi", scope: !510, file: !182, line: 72, type: !530, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DISubroutineType(types: !531)
!531 = !{!525, !521, !213}
!532 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEy", scope: !510, file: !182, line: 77, type: !533, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DISubroutineType(types: !534)
!534 = !{!525, !521, !217}
!535 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEj", scope: !510, file: !182, line: 82, type: !536, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubroutineType(types: !537)
!537 = !{!525, !521, !222}
!538 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEd", scope: !510, file: !182, line: 87, type: !539, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DISubroutineType(types: !540)
!540 = !{!525, !521, !93}
!541 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEf", scope: !510, file: !182, line: 92, type: !542, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DISubroutineType(types: !543)
!543 = !{!525, !521, !229}
!544 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKv", scope: !510, file: !182, line: 97, type: !545, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubroutineType(types: !546)
!546 = !{!525, !521, !233}
!547 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE23write_float16_from_bitsEt", scope: !510, file: !182, line: 102, type: !548, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!548 = !DISubroutineType(types: !549)
!549 = !{!525, !521, !238}
!550 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK13halide_type_t", scope: !510, file: !182, line: 108, type: !551, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubroutineType(types: !552)
!552 = !{!525, !521, !244}
!553 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK15halide_buffer_t", scope: !510, file: !182, line: 113, type: !554, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!554 = !DISubroutineType(types: !555)
!555 = !{!525, !521, !277}
!556 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE3strEv", scope: !510, file: !182, line: 119, type: !557, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(types: !558)
!558 = !{!9, !521}
!559 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5clearEv", scope: !510, file: !182, line: 131, type: !560, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !521}
!562 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE4sizeEv", scope: !510, file: !182, line: 139, type: !563, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = !DISubroutineType(types: !564)
!564 = !{!217, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!567 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE8capacityEv", scope: !510, file: !182, line: 143, type: !563, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!568 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5eraseEi", scope: !510, file: !182, line: 148, type: !569, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !521, !28}
!571 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE16allocation_errorEv", scope: !510, file: !182, line: 158, type: !557, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE28msan_annotate_is_initializedEv", scope: !510, file: !182, line: 162, type: !560, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubprogram(name: "~Printer", scope: !510, file: !182, line: 166, type: !560, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !{!575, !416}
!575 = !DITemplateValueParameter(name: "type", type: !28, value: i32 2)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_filter_metadata_t", file: !115, line: 1648, size: 160, flags: DIFlagTypePassByValue, elements: !579, identifier: "_ZTS24halide_filter_metadata_t")
!579 = !{!580, !582, !583, !584, !605, !606}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "VERSION", scope: !578, file: !115, line: 1650, baseType: !581, flags: DIFlagStaticMember, extraData: i32 1)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !578, file: !115, line: 1654, baseType: !213, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "num_arguments", scope: !578, file: !115, line: 1657, baseType: !213, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !578, file: !115, line: 1663, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_filter_argument_t", file: !115, line: 1631, size: 288, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !588, identifier: "_ZTS24halide_filter_argument_t")
!588 = !{!589, !590, !591, !592, !593, !597, !598, !599, !600}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !115, line: 1632, baseType: !9, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !587, file: !115, line: 1633, baseType: !213, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !587, file: !115, line: 1634, baseType: !213, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !115, line: 1635, baseType: !246, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_def", scope: !587, file: !115, line: 1639, baseType: !594, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_scalar_value_t", file: !115, line: 1576, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS21halide_scalar_value_t")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_min", scope: !587, file: !115, line: 1639, baseType: !594, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_max", scope: !587, file: !115, line: 1639, baseType: !594, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_estimate", scope: !587, file: !115, line: 1639, baseType: !594, size: 32, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_estimates", scope: !587, file: !115, line: 1645, baseType: !601, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !578, file: !115, line: 1667, baseType: !9, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !115, line: 1670, baseType: !9, size: 32, offset: 128)
!607 = !{!608, !609, !610, !612}
!608 = !DILocalVariable(name: "desc", arg: 1, scope: !505, file: !49, line: 218, type: !508)
!609 = !DILocalVariable(name: "metadata", arg: 2, scope: !505, file: !49, line: 218, type: !576)
!610 = !DILocalVariable(name: "i", scope: !611, file: !49, line: 220, type: !28)
!611 = distinct !DILexicalBlock(scope: !505, file: !49, line: 220, column: 5)
!612 = !DILocalVariable(name: "arg", scope: !613, file: !49, line: 221, type: !585)
!613 = distinct !DILexicalBlock(scope: !614, file: !49, line: 220, column: 55)
!614 = distinct !DILexicalBlock(scope: !611, file: !49, line: 220, column: 5)
!615 = !DILocation(line: 0, scope: !505)
!616 = !DILocalVariable(name: "this", arg: 1, scope: !617, type: !620, flags: DIFlagArtificial | DIFlagObjectPointer)
!617 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !510, file: !182, line: 57, type: !523, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, declaration: !522, retainedNodes: !618)
!618 = !{!616, !619}
!619 = !DILocalVariable(name: "arg", arg: 2, scope: !617, file: !182, line: 57, type: !9)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!621 = !DILocation(line: 0, scope: !617, inlinedAt: !622)
!622 = distinct !DILocation(line: 219, column: 10, scope: !505)
!623 = !DILocation(line: 62, column: 43, scope: !624, inlinedAt: !622)
!624 = distinct !DILexicalBlock(scope: !625, file: !182, line: 61, column: 16)
!625 = distinct !DILexicalBlock(scope: !617, file: !182, line: 59, column: 13)
!626 = !{!627, !628, i64 4}
!627 = !{!"_ZTSN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EEE", !628, i64 0, !628, i64 4, !628, i64 8, !628, i64 12, !631, i64 16, !629, i64 17}
!628 = !{!"any pointer", !629, i64 0}
!629 = !{!"omnipotent char", !630, i64 0}
!630 = !{!"Simple C++ TBAA"}
!631 = !{!"bool", !629, i64 0}
!632 = !DILocation(line: 62, column: 48, scope: !624, inlinedAt: !622)
!633 = !{!627, !628, i64 8}
!634 = !DILocation(line: 62, column: 19, scope: !624, inlinedAt: !622)
!635 = !DILocation(line: 62, column: 17, scope: !624, inlinedAt: !622)
!636 = !DILocation(line: 219, column: 33, scope: !505)
!637 = !{!638, !628, i64 16}
!638 = !{!"_ZTS24halide_filter_metadata_t", !639, i64 0, !639, i64 4, !628, i64 8, !628, i64 12, !628, i64 16}
!639 = !{!"int", !629, i64 0}
!640 = !DILocation(line: 0, scope: !617, inlinedAt: !641)
!641 = distinct !DILocation(line: 219, column: 20, scope: !505)
!642 = !DILocation(line: 59, column: 17, scope: !625, inlinedAt: !641)
!643 = !DILocation(line: 0, scope: !625, inlinedAt: !641)
!644 = !DILocation(line: 59, column: 13, scope: !617, inlinedAt: !641)
!645 = !DILocation(line: 60, column: 19, scope: !646, inlinedAt: !641)
!646 = distinct !DILexicalBlock(scope: !625, file: !182, line: 59, column: 29)
!647 = !DILocation(line: 61, column: 9, scope: !646, inlinedAt: !641)
!648 = !DILocation(line: 62, column: 19, scope: !624, inlinedAt: !641)
!649 = !DILocation(line: 0, scope: !617, inlinedAt: !650)
!650 = distinct !DILocation(line: 219, column: 38, scope: !505)
!651 = !DILocation(line: 62, column: 48, scope: !624, inlinedAt: !650)
!652 = !DILocation(line: 62, column: 19, scope: !624, inlinedAt: !650)
!653 = !DILocation(line: 62, column: 17, scope: !624, inlinedAt: !650)
!654 = !DILocation(line: 0, scope: !611)
!655 = !DILocation(line: 220, column: 35, scope: !614)
!656 = !{!638, !639, i64 4}
!657 = !DILocation(line: 220, column: 23, scope: !614)
!658 = !DILocation(line: 220, column: 5, scope: !611)
!659 = !DILocation(line: 221, column: 58, scope: !613)
!660 = !{!638, !628, i64 8}
!661 = !DILocation(line: 0, scope: !613)
!662 = !DILocation(line: 225, column: 18, scope: !663)
