; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/halide_buffer_t.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/halide_buffer_t.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }
%struct.halide_device_interface_impl_t = type opaque
%struct.halide_type_t = type { i8, i8, i16 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !1, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, imports: !184, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/halide_buffer_t.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!2 = !{!3, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !4, line: 403, baseType: !5, size: 8, elements: !8, identifier: "_ZTS18halide_type_code_t")
!4 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 16, baseType: !7)
!6 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1415, baseType: !15, size: 32, elements: !16, identifier: "_ZTS19halide_buffer_flags")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!19 = !{!20, !21, !5, !22, !24}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !4, line: 413, baseType: !3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !6, line: 9, baseType: !23)
!23 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !4, line: 1550, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !4, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !28, identifier: "_ZTS15halide_buffer_t")
!28 = !{!29, !32, !86, !87, !88, !122, !124, !147, !148, !153, !157, !160, !161, !164, !165, !170, !173, !174, !175, !180, !183}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !27, file: !4, line: 1425, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !6, line: 10, baseType: !31)
!31 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !27, file: !4, line: 1428, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !4, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !36, identifier: "_ZTS25halide_device_interface_t")
!36 = !{!37, !44, !48, !49, !53, !54, !55, !56, !57, !61, !67, !71, !72, !76, !77, !82}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !35, file: !4, line: 724, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42, !43, !33}
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !35, file: !4, line: 726, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!41, !42, !43}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !35, file: !4, line: 727, baseType: !45, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !35, file: !4, line: 728, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !42, !33}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !35, file: !4, line: 730, baseType: !45, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !35, file: !4, line: 731, baseType: !38, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !35, file: !4, line: 733, baseType: !38, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !35, file: !4, line: 735, baseType: !45, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !35, file: !4, line: 736, baseType: !58, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!41, !42, !43, !33, !43}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !35, file: !4, line: 738, baseType: !62, size: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!41, !42, !65, !43}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !35, file: !4, line: 740, baseType: !68, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!41, !42, !65, !41, !41, !43}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !35, file: !4, line: 742, baseType: !45, size: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !35, file: !4, line: 743, baseType: !73, size: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!41, !42, !43, !30, !33}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !35, file: !4, line: 745, baseType: !45, size: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !35, file: !4, line: 746, baseType: !78, size: 64, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!41, !42, !81, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !35, file: !4, line: 747, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !4, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!86 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !27, file: !4, line: 1433, baseType: !20, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !4, line: 1436, baseType: !30, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !4, line: 1439, baseType: !89, size: 32, offset: 256)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !4, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !90, identifier: "_ZTS13halide_type_t")
!90 = !{!91, !92, !93, !96, !100, !103, !108, !113, !114, !115, !118}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !89, file: !4, line: 434, baseType: !21, size: 8, align: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !89, file: !4, line: 442, baseType: !5, size: 8, align: 8, offset: 8)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !89, file: !4, line: 446, baseType: !94, size: 16, align: 16, offset: 16)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 14, baseType: !95)
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DISubprogram(name: "halide_type_t", scope: !89, file: !4, line: 453, type: !97, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99, !21, !5, !94}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!100 = !DISubprogram(name: "halide_type_t", scope: !89, file: !4, line: 459, type: !101, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !99}
!103 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !89, file: !4, line: 463, type: !104, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!104 = !DISubroutineType(types: !105)
!105 = !{!89, !106, !94}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!108 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !89, file: !4, line: 468, type: !109, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !106, !112}
!111 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!112 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !107, size: 64)
!113 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !89, file: !4, line: 472, type: !109, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!114 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !89, file: !4, line: 476, type: !109, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !89, file: !4, line: 481, type: !116, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!116 = !DISubroutineType(types: !117)
!117 = !{!41, !106}
!118 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !89, file: !4, line: 485, type: !119, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !106}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 12, baseType: !15)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !27, file: !4, line: 1442, baseType: !123, size: 32, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !6, line: 11, baseType: !41)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !27, file: !4, line: 1446, baseType: !125, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !4, line: 1409, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !4, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !128, identifier: "_ZTS18halide_dimension_t")
!128 = !{!129, !130, !131, !132, !133, !137, !140, !146}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !127, file: !4, line: 1383, baseType: !123, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !127, file: !4, line: 1383, baseType: !123, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !127, file: !4, line: 1383, baseType: !123, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !4, line: 1386, baseType: !121, size: 32, offset: 96)
!133 = !DISubprogram(name: "halide_dimension_t", scope: !127, file: !4, line: 1388, type: !134, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!137 = !DISubprogram(name: "halide_dimension_t", scope: !127, file: !4, line: 1389, type: !138, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !136, !123, !123, !123, !121}
!140 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !127, file: !4, line: 1393, type: !141, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!141 = !DISubroutineType(types: !142)
!142 = !{!111, !143, !145}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!145 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !144, size: 64)
!146 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !127, file: !4, line: 1400, type: !141, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !27, file: !4, line: 1449, baseType: !42, size: 64, offset: 384)
!148 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !27, file: !4, line: 1454, type: !149, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!149 = !DISubroutineType(types: !150)
!150 = !{!111, !151, !152}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !4, line: 1416, baseType: !14)
!153 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !27, file: !4, line: 1458, type: !154, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !156, !152, !111}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!157 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !27, file: !4, line: 1466, type: !158, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{!111, !151}
!160 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !27, file: !4, line: 1470, type: !158, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!161 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !27, file: !4, line: 1474, type: !162, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !156, !111}
!164 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !27, file: !4, line: 1478, type: !162, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !27, file: !4, line: 1485, type: !166, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !151}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 27, baseType: !169)
!169 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!170 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !27, file: !4, line: 1495, type: !171, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{!20, !151}
!173 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !27, file: !4, line: 1506, type: !171, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !27, file: !4, line: 1518, type: !166, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !27, file: !4, line: 1523, type: !176, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{!20, !151, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!180 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !27, file: !4, line: 1534, type: !181, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!181 = !DISubroutineType(types: !182)
!182 = !{!41, !156, !42}
