; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_cache_allocator.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_cache_allocator.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::Hexagon::hexagon_local_cache" = type { i8*, i8, [7 x i8], i64, %"struct.Halide::Runtime::Internal::Hexagon::hexagon_local_cache"* }
%struct.halide_mutex = type { [1 x i64] }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer.0" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>

@_ZN6Halide7Runtime8Internal7Hexagon18hexagon_cache_poolE = weak dso_local local_unnamed_addr global %"struct.Halide::Runtime::Internal::Hexagon::hexagon_local_cache"* null, align 8, !dbg !0
@_ZN6Halide7Runtime8Internal7Hexagon19hexagon_cache_mutexE = weak dso_local global %struct.halide_mutex zeroinitializer, align 8, !dbg !22
@.str = private unnamed_addr constant [28 x i8] c"halide_locked_cache_malloc\0A\00", align 1
@.str.1 = private unnamed_addr constant [26 x i8] c"halide_locked_cache_free\0A\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"halide_hexagon_allocate_l2_pool\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hexagon_cache_pool", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon18hexagon_cache_poolE", scope: !2, file: !6, line: 21, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Hexagon", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/hexagon_cache_allocator.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcache_pool", scope: !2, file: !6, line: 19, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "hexagon_cache_pool_t", scope: !2, file: !6, line: 17, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hexagon_local_cache", scope: !2, file: !6, line: 12, size: 256, flags: DIFlagTypePassByValue, elements: !11, identifier: "_ZTSN6Halide7Runtime8Internal7Hexagon19hexagon_local_cacheE")
!11 = !{!12, !14, !16, !20}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "l2memory", scope: !10, file: !6, line: 13, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !10, file: !6, line: 14, baseType: !15, size: 8, offset: 64)
!15 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !10, file: !6, line: 15, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 27, baseType: !19)
!18 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!19 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !6, line: 16, baseType: !21, size: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "hexagon_cache_mutex", linkageName: "_ZN6Halide7Runtime8Internal7Hexagon19hexagon_cache_mutexE", scope: !2, file: !6, line: 22, type: !24, isLocal: false, isDefinition: true)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !25, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !26, identifier: "_ZTS12halide_mutex")
!25 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !24, file: !25, line: 121, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, elements: !32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !18, line: 61, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 10, baseType: !31)
!31 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !{!33}
!33 = !DISubrange(count: 1)
!34 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !35, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !36, retainedTypes: !99, globals: !288, imports: !289, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/hexagon_cache_allocator.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!36 = !{!37, !46, !94}
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !25, line: 403, baseType: !38, size: 8, elements: !40, identifier: "_ZTS18halide_type_code_t")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 16, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!41, !42, !43, !44, !45}
!41 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!45 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !25, line: 990, baseType: !47, size: 32, elements: !48, identifier: "_ZTS19halide_error_code_t")
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!49 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!50 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!51 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!52 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!53 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!54 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!55 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!56 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!57 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!58 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!59 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!60 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!61 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!62 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!63 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!64 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!65 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!66 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!67 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!68 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!69 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!70 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!71 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!72 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!73 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!74 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!75 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!76 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!77 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!78 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!79 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!80 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!81 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!82 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!83 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!84 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!85 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!86 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!87 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!88 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!89 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!90 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!91 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!92 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!93 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 23, baseType: !96, size: 32, align: 32, elements: !97)
!95 = !DIFile(filename: "src/runtime/mini_hexagon_dma.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !{!98}
!98 = !DIEnumerator(name: "QURT_EOK", value: 0, isUnsigned: true)
!99 = !{!100, !13, !7, !220, !287, !106}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !102, file: !101, line: 203, baseType: !103)
!101 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!102 = !DINamespace(scope: !3)
!103 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !102, file: !101, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !104, templateParams: !217)
!104 = !{!105, !108, !109, !110, !111, !112, !114, !118, !124, !129, !133, !136, !140, !144, !148, !153, !159, !192, !199, !202, !205, !210, !211, !214, !215, !216}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !103, file: !101, line: 32, baseType: !106, size: 64, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !103, file: !101, line: 32, baseType: !106, size: 64, offset: 64, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !103, file: !101, line: 32, baseType: !106, size: 64, offset: 128, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !103, file: !101, line: 33, baseType: !13, size: 64, offset: 192, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !103, file: !101, line: 34, baseType: !15, size: 8, offset: 256, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !103, file: !101, line: 35, baseType: !113, size: 8, offset: 264, flags: DIFlagPublic)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8, elements: !32)
!114 = !DISubprogram(name: "Printer", scope: !103, file: !101, line: 37, type: !115, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !13, !106}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!118 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !103, file: !101, line: 57, type: !119, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !117, !122}
!121 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !103, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!124 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !103, file: !101, line: 67, type: !125, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!125 = !DISubroutineType(types: !126)
!126 = !{!121, !117, !127}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !18, line: 9, baseType: !128)
!128 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!129 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !103, file: !101, line: 72, type: !130, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{!121, !117, !132}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 11, baseType: !47)
!133 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !103, file: !101, line: 77, type: !134, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!134 = !DISubroutineType(types: !135)
!135 = !{!121, !117, !30}
!136 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !103, file: !101, line: 82, type: !137, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!137 = !DISubroutineType(types: !138)
!138 = !{!121, !117, !139}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 12, baseType: !96)
!140 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !103, file: !101, line: 87, type: !141, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!141 = !DISubroutineType(types: !142)
!142 = !{!121, !117, !143}
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !103, file: !101, line: 92, type: !145, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{!121, !117, !147}
!147 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!148 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !103, file: !101, line: 97, type: !149, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!149 = !DISubroutineType(types: !150)
!150 = !{!121, !117, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !103, file: !101, line: 102, type: !154, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DISubroutineType(types: !155)
!155 = !{!121, !117, !156}
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 14, baseType: !158)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !103, file: !101, line: 108, type: !160, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubroutineType(types: !161)
!161 = !{!121, !117, !162}
!162 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !25, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !165, identifier: "_ZTS13halide_type_t")
!165 = !{!166, !168, !169, !170, !174, !177, !181, !184, !185, !186, !189}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !164, file: !25, line: 434, baseType: !167, size: 8, align: 8)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !25, line: 413, baseType: !37)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !164, file: !25, line: 442, baseType: !38, size: 8, align: 8, offset: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !164, file: !25, line: 446, baseType: !157, size: 16, align: 16, offset: 16)
!170 = !DISubprogram(name: "halide_type_t", scope: !164, file: !25, line: 453, type: !171, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173, !167, !38, !157}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!174 = !DISubprogram(name: "halide_type_t", scope: !164, file: !25, line: 459, type: !175, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !173}
!177 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !164, file: !25, line: 463, type: !178, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{!164, !180, !157}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!181 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !164, file: !25, line: 468, type: !182, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{!15, !180, !162}
!184 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !164, file: !25, line: 472, type: !182, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!185 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !164, file: !25, line: 476, type: !182, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !164, file: !25, line: 481, type: !187, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!187 = !DISubroutineType(types: !188)
!188 = !{!47, !180}
!189 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !164, file: !25, line: 485, type: !190, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!190 = !DISubroutineType(types: !191)
!191 = !{!139, !180}
!192 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !103, file: !101, line: 113, type: !193, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubroutineType(types: !194)
!194 = !{!121, !117, !195}
!195 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !25, line: 1550, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !25, line: 1423, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15halide_buffer_t")
!199 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !103, file: !101, line: 119, type: !200, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{!122, !117}
!202 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !103, file: !101, line: 131, type: !203, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !117}
!205 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !103, file: !101, line: 139, type: !206, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{!30, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!210 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !103, file: !101, line: 143, type: !206, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !103, file: !101, line: 148, type: !212, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !117, !47}
!214 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !103, file: !101, line: 158, type: !200, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!215 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !103, file: !101, line: 162, type: !203, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!216 = !DISubprogram(name: "~Printer", scope: !103, file: !101, line: 166, type: !203, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !{!218, !219}
!218 = !DITemplateValueParameter(name: "type", type: !47, value: i32 0)
!219 = !DITemplateValueParameter(name: "length", type: !31, value: i64 1024)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !102, file: !101, line: 199, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !102, file: !101, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !222, templateParams: !285)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !233, !237, !240, !243, !246, !249, !252, !255, !258, !261, !264, !267, !270, !273, !278, !279, !282, !283, !284}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !101, line: 32, baseType: !106, size: 64, flags: DIFlagPublic)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !221, file: !101, line: 32, baseType: !106, size: 64, offset: 64, flags: DIFlagPublic)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !221, file: !101, line: 32, baseType: !106, size: 64, offset: 128, flags: DIFlagPublic)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !221, file: !101, line: 33, baseType: !13, size: 64, offset: 192, flags: DIFlagPublic)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !221, file: !101, line: 34, baseType: !15, size: 8, offset: 256, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !221, file: !101, line: 35, baseType: !113, size: 8, offset: 264, flags: DIFlagPublic)
!229 = !DISubprogram(name: "Printer", scope: !221, file: !101, line: 37, type: !230, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232, !13, !106}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!233 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !221, file: !101, line: 57, type: !234, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !232, !122}
!236 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !221, size: 64)
!237 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !221, file: !101, line: 67, type: !238, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{!236, !232, !127}
!240 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !221, file: !101, line: 72, type: !241, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{!236, !232, !132}
!243 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !221, file: !101, line: 77, type: !244, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{!236, !232, !30}
!246 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !221, file: !101, line: 82, type: !247, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!247 = !DISubroutineType(types: !248)
!248 = !{!236, !232, !139}
!249 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !221, file: !101, line: 87, type: !250, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!236, !232, !143}
!252 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !221, file: !101, line: 92, type: !253, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{!236, !232, !147}
!255 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !221, file: !101, line: 97, type: !256, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!236, !232, !151}
!258 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !221, file: !101, line: 102, type: !259, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{!236, !232, !156}
!261 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !221, file: !101, line: 108, type: !262, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{!236, !232, !162}
