; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%struct.halide_profiler_state = type { %struct.halide_mutex, i32, i32, i32, i32, %struct.halide_profiler_pipeline_stats*, void (i32*, i32*)*, %struct.halide_thread* }
%struct.halide_mutex = type { [1 x i64] }
%struct.halide_profiler_pipeline_stats = type { i64, i64, i64, i64, i64, i64, i8*, %struct.halide_profiler_func_stats*, i8*, i32, i32, i32, i32, i32, [4 x i8] }
%struct.halide_profiler_func_stats = type { i64, i64, i64, i64, i64, i64, i64, i8*, i32, [4 x i8] }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>

@_ZZ25halide_profiler_get_stateE1s = internal global %struct.halide_profiler_state { %struct.halide_mutex zeroinitializer, i32 1, i32 0, i32 0, i32 0, %struct.halide_profiler_pipeline_stats* null, void (i32*, i32*)* null, %struct.halide_thread* null }, align 8, !dbg !0
@.str = private unnamed_addr constant [114 x i8] c"/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp:207 Assert failed: p_stats != nullptr\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s", scope: !2, file: !3, line: 12, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "halide_profiler_get_state", scope: !3, file: !3, line: 11, type: !4, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !92)
!3 = !DIFile(filename: "src/runtime/profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_state", file: !8, line: 1766, size: 384, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS21halide_profiler_state")
!8 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !{!10, !21, !23, !24, !25, !26, !60, !65}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !7, file: !8, line: 1770, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !8, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !12, identifier: "_ZTS12halide_mutex")
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !11, file: !8, line: 121, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !19)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 61, baseType: !17)
!16 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 10, baseType: !18)
!18 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !{!20}
!20 = !DISubrange(count: 1)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_time", scope: !7, file: !8, line: 1774, baseType: !22, size: 32, offset: 64)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "first_free_id", scope: !7, file: !8, line: 1777, baseType: !22, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "current_func", scope: !7, file: !8, line: 1781, baseType: !22, size: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads", scope: !7, file: !8, line: 1784, baseType: !22, size: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pipelines", scope: !7, file: !8, line: 1787, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_pipeline_stats", file: !8, line: 1721, size: 768, flags: DIFlagTypePassByValue, elements: !29, identifier: "_ZTS30halide_profiler_pipeline_stats")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !40, !53, !55, !56, !57, !58, !59}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !28, file: !8, line: 1723, baseType: !17, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !28, file: !8, line: 1726, baseType: !17, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !28, file: !8, line: 1729, baseType: !17, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !28, file: !8, line: 1732, baseType: !17, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !28, file: !8, line: 1736, baseType: !17, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !28, file: !8, line: 1736, baseType: !17, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !8, line: 1739, baseType: !37, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !28, file: !8, line: 1742, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_func_stats", file: !8, line: 1693, size: 576, flags: DIFlagTypePassByValue, elements: !43, identifier: "_ZTS26halide_profiler_func_stats")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !42, file: !8, line: 1695, baseType: !17, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !42, file: !8, line: 1698, baseType: !17, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !42, file: !8, line: 1701, baseType: !17, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !42, file: !8, line: 1704, baseType: !17, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "stack_peak", scope: !42, file: !8, line: 1707, baseType: !17, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !42, file: !8, line: 1710, baseType: !17, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !42, file: !8, line: 1710, baseType: !17, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !8, line: 1713, baseType: !37, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !42, file: !8, line: 1716, baseType: !22, size: 32, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !8, line: 1746, baseType: !54, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num_funcs", scope: !28, file: !8, line: 1749, baseType: !22, size: 32, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "first_func_id", scope: !28, file: !8, line: 1752, baseType: !22, size: 32, offset: 608)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "runs", scope: !28, file: !8, line: 1755, baseType: !22, size: 32, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !28, file: !8, line: 1758, baseType: !22, size: 32, offset: 672)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !28, file: !8, line: 1761, baseType: !22, size: 32, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "get_remote_profiler_state", scope: !7, file: !8, line: 1792, baseType: !61, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_thread", scope: !7, file: !8, line: 1795, baseType: !66, size: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13halide_thread")
!68 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !69, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !84, globals: !86, imports: !87, splitDebugInlining: false, nameTableKind: None)
!69 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!70 = !{!71, !75}
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 1799, baseType: !22, size: 32, elements: !72)
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "halide_profiler_outside_of_halide", value: -1)
!74 = !DIEnumerator(name: "halide_profiler_please_stop", value: -2)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !8, line: 403, baseType: !76, size: 8, elements: !78, identifier: "_ZTS18halide_type_code_t")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 16, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!84 = !{!27, !41, !37, !6, !85, !17}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!86 = !{!0}
!87 = !{!88}
!88 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !68, entity: !89, file: !16, line: 225)
!89 = !DINamespace(name: "Internal", scope: !90)
!90 = !DINamespace(name: "Runtime", scope: !91)
!91 = !DINamespace(name: "Halide", scope: null)
!92 = !{}
!93 = !{i32 7, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{i32 1, !"wchar_size", i32 4}
!96 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!97 = !DILocation(line: 13, column: 5, scope: !2)
!98 = distinct !DISubprogram(name: "find_or_create_pipeline", linkageName: "_ZN6Halide7Runtime8Internal23find_or_create_pipelineEPKciPKy", scope: !89, file: !3, line: 21, type: !99, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !103)
!99 = !DISubroutineType(types: !100)
!100 = !{!27, !37, !22, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!103 = !{!104, !105, !106, !107, !108, !110, !111}
!104 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !98, file: !3, line: 21, type: !37)
!105 = !DILocalVariable(name: "num_funcs", arg: 2, scope: !98, file: !3, line: 21, type: !22)
!106 = !DILocalVariable(name: "func_names", arg: 3, scope: !98, file: !3, line: 21, type: !101)
!107 = !DILocalVariable(name: "s", scope: !98, file: !3, line: 22, type: !6)
!108 = !DILocalVariable(name: "p", scope: !109, file: !3, line: 24, type: !27)
!109 = distinct !DILexicalBlock(scope: !98, file: !3, line: 24, column: 5)
!110 = !DILocalVariable(name: "p", scope: !98, file: !3, line: 34, type: !27)
!111 = !DILocalVariable(name: "i", scope: !112, file: !3, line: 57, type: !22)
!112 = distinct !DILexicalBlock(scope: !98, file: !3, line: 57, column: 5)
!113 = !DILocation(line: 0, scope: !98)
!114 = !DILocation(line: 22, column: 32, scope: !98)
!115 = !DILocation(line: 24, column: 49, scope: !109)
!116 = !DILocation(line: 0, scope: !109)
!117 = !{!118, !118, i64 0}
!118 = !{!"any pointer", !119, i64 0}
!119 = !{!"omnipotent char", !120, i64 0}
!120 = !{!"Simple C++ TBAA"}
!121 = !DILocation(line: 24, column: 60, scope: !122)
!122 = distinct !DILexicalBlock(scope: !109, file: !3, line: 24, column: 5)
!123 = !DILocation(line: 24, column: 5, scope: !109)
!124 = !DILocation(line: 28, column: 16, scope: !125)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 28, column: 13)
!126 = distinct !DILexicalBlock(scope: !122, file: !3, line: 25, column: 59)
!127 = !{!128, !118, i64 48}
!128 = !{!"_ZTS30halide_profiler_pipeline_stats", !129, i64 0, !129, i64 8, !129, i64 16, !129, i64 24, !129, i64 32, !129, i64 40, !118, i64 48, !118, i64 56, !118, i64 64, !130, i64 72, !130, i64 76, !130, i64 80, !130, i64 84, !130, i64 88}
!129 = !{!"long long", !119, i64 0}
!130 = !{!"int", !119, i64 0}
!131 = !DILocation(line: 28, column: 21, scope: !125)
!132 = !DILocation(line: 28, column: 38, scope: !125)
!133 = !DILocation(line: 29, column: 16, scope: !125)
!134 = !{!128, !130, i64 72}
!135 = !DILocation(line: 29, column: 26, scope: !125)
!136 = !DILocation(line: 28, column: 13, scope: !126)
!137 = !DILocation(line: 25, column: 52, scope: !122)
!138 = distinct !{!138, !123, !139, !140}
!139 = !DILocation(line: 32, column: 5, scope: !109)
!140 = !{!"llvm.loop.mustprogress"}
!141 = !DILocation(line: 35, column: 43, scope: !98)
!142 = !DILocation(line: 35, column: 9, scope: !98)
!143 = !DILocation(line: 36, column: 10, scope: !144)
!144 = distinct !DILexicalBlock(scope: !98, file: !3, line: 36, column: 9)
!145 = !DILocation(line: 36, column: 9, scope: !98)
!146 = !DILocation(line: 39, column: 18, scope: !98)
!147 = !{!148, !118, i64 24}
!148 = !{!"_ZTS21halide_profiler_state", !149, i64 0, !130, i64 8, !130, i64 12, !130, i64 16, !130, i64 20, !118, i64 24, !118, i64 32, !118, i64 40}
!149 = !{!"_ZTS12halide_mutex", !119, i64 0}
!150 = !DILocation(line: 39, column: 8, scope: !98)
!151 = !DILocation(line: 39, column: 13, scope: !98)
!152 = !{!128, !118, i64 64}
!153 = !DILocation(line: 40, column: 8, scope: !98)
!154 = !DILocation(line: 40, column: 13, scope: !98)
!155 = !DILocation(line: 41, column: 27, scope: !98)
!156 = !{!148, !130, i64 12}
!157 = !DILocation(line: 41, column: 8, scope: !98)
!158 = !DILocation(line: 41, column: 22, scope: !98)
!159 = !{!128, !130, i64 76}
!160 = !DILocation(line: 42, column: 8, scope: !98)
!161 = !DILocation(line: 42, column: 18, scope: !98)
!162 = !DILocation(line: 43, column: 8, scope: !98)
!163 = !DILocation(line: 43, column: 13, scope: !98)
!164 = !{!128, !130, i64 80}
!165 = !DILocation(line: 44, column: 8, scope: !98)
!166 = !DILocation(line: 44, column: 13, scope: !98)
!167 = !{!128, !129, i64 0}
!168 = !DILocation(line: 45, column: 8, scope: !98)
!169 = !DILocation(line: 45, column: 16, scope: !98)
!170 = !{!128, !130, i64 84}
!171 = !DILocation(line: 46, column: 8, scope: !98)
!172 = !DILocation(line: 46, column: 23, scope: !98)
!173 = !{!128, !129, i64 8}
!174 = !DILocation(line: 47, column: 8, scope: !98)
!175 = !DILocation(line: 47, column: 20, scope: !98)
!176 = !{!128, !129, i64 16}
!177 = !DILocation(line: 48, column: 8, scope: !98)
!178 = !DILocation(line: 48, column: 21, scope: !98)
!179 = !{!128, !129, i64 24}
!180 = !DILocation(line: 49, column: 8, scope: !98)
!181 = !DILocation(line: 49, column: 19, scope: !98)
!182 = !{!128, !130, i64 88}
!183 = !DILocation(line: 50, column: 8, scope: !98)
!184 = !DILocation(line: 50, column: 33, scope: !98)
!185 = !{!128, !129, i64 32}
!186 = !DILocation(line: 51, column: 8, scope: !98)
!187 = !DILocation(line: 51, column: 35, scope: !98)
!188 = !{!128, !129, i64 40}
!189 = !DILocation(line: 52, column: 53, scope: !98)
!190 = !DILocation(line: 52, column: 63, scope: !98)
!191 = !DILocation(line: 52, column: 46, scope: !98)
!192 = !DILocation(line: 52, column: 8, scope: !98)
!193 = !DILocation(line: 52, column: 14, scope: !98)
!194 = !{!128, !118, i64 56}
!195 = !DILocation(line: 53, column: 10, scope: !196)
!196 = distinct !DILexicalBlock(scope: !98, file: !3, line: 53, column: 9)
!197 = !DILocation(line: 53, column: 9, scope: !98)
!198 = !DILocation(line: 0, scope: !112)
!199 = !DILocation(line: 57, column: 23, scope: !200)
!200 = distinct !DILexicalBlock(scope: !112, file: !3, line: 57, column: 5)
!201 = !DILocation(line: 57, column: 5, scope: !112)
!202 = !DILocation(line: 54, column: 9, scope: !203)
!203 = distinct !DILexicalBlock(scope: !196, file: !3, line: 53, column: 20)
!204 = !DILocation(line: 55, column: 9, scope: !203)
!205 = !DILocation(line: 68, column: 22, scope: !98)
!206 = !DILocation(line: 69, column: 18, scope: !98)
!207 = !DILocation(line: 70, column: 5, scope: !98)
!208 = !DILocation(line: 58, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !200, file: !3, line: 57, column: 41)
!210 = !DILocation(line: 58, column: 26, scope: !209)
!211 = !{!212, !129, i64 0}
!212 = !{!"_ZTS26halide_profiler_func_stats", !129, i64 0, !129, i64 8, !129, i64 16, !129, i64 24, !129, i64 32, !129, i64 40, !129, i64 48, !118, i64 56, !130, i64 64}
!213 = !DILocation(line: 59, column: 43, scope: !209)
!214 = !{!129, !129, i64 0}
!215 = !DILocation(line: 59, column: 28, scope: !209)
!216 = !DILocation(line: 59, column: 21, scope: !209)
!217 = !DILocation(line: 59, column: 26, scope: !209)
!218 = !{!212, !118, i64 56}
!219 = !DILocation(line: 60, column: 21, scope: !209)
!220 = !DILocation(line: 60, column: 36, scope: !209)
!221 = !{!212, !129, i64 8}
!222 = !DILocation(line: 61, column: 21, scope: !209)
!223 = !DILocation(line: 61, column: 33, scope: !209)
!224 = !{!212, !129, i64 16}
!225 = !DILocation(line: 62, column: 21, scope: !209)
!226 = !DILocation(line: 62, column: 34, scope: !209)
!227 = !{!212, !129, i64 24}
!228 = !DILocation(line: 63, column: 21, scope: !209)
!229 = !DILocation(line: 63, column: 32, scope: !209)
!230 = !{!212, !130, i64 64}
!231 = !DILocation(line: 64, column: 21, scope: !209)
!232 = !DILocation(line: 64, column: 32, scope: !209)
!233 = !{!212, !129, i64 32}
!234 = !DILocation(line: 65, column: 21, scope: !209)
!235 = !DILocation(line: 65, column: 46, scope: !209)
!236 = !{!212, !129, i64 40}
!237 = !DILocation(line: 66, column: 21, scope: !209)
!238 = !DILocation(line: 66, column: 48, scope: !209)
!239 = !{!212, !129, i64 48}
!240 = !DILocation(line: 57, column: 37, scope: !200)
!241 = distinct !{!241, !201, !242, !140}
!242 = !DILocation(line: 67, column: 5, scope: !112)
!243 = !DILocation(line: 71, column: 1, scope: !98)
!244 = !DISubprogram(name: "malloc", scope: !16, file: !16, line: 87, type: !245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!245 = !DISubroutineType(types: !246)
!246 = !{!54, !247}
!247 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!248 = !DISubprogram(name: "free", scope: !16, file: !16, line: 86, type: !249, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !54}
!251 = distinct !DISubprogram(name: "bill_func", linkageName: "_ZN6Halide7Runtime8Internal9bill_funcEP21halide_profiler_stateiyi", scope: !89, file: !3, line: 73, type: !252, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !6, !22, !17, !22}
!254 = !{!255, !256, !257, !258, !259, !260, !262}
!255 = !DILocalVariable(name: "s", arg: 1, scope: !251, file: !3, line: 73, type: !6)
!256 = !DILocalVariable(name: "func_id", arg: 2, scope: !251, file: !3, line: 73, type: !22)
!257 = !DILocalVariable(name: "time", arg: 3, scope: !251, file: !3, line: 73, type: !17)
!258 = !DILocalVariable(name: "active_threads", arg: 4, scope: !251, file: !3, line: 73, type: !22)
!259 = !DILocalVariable(name: "p_prev", scope: !251, file: !3, line: 74, type: !27)
!260 = !DILocalVariable(name: "p", scope: !261, file: !3, line: 75, type: !27)
!261 = distinct !DILexicalBlock(scope: !251, file: !3, line: 75, column: 5)
!262 = !DILocalVariable(name: "f", scope: !263, file: !3, line: 84, type: !41)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 77, column: 87)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 77, column: 13)
!265 = distinct !DILexicalBlock(scope: !266, file: !3, line: 76, column: 59)
!266 = distinct !DILexicalBlock(scope: !261, file: !3, line: 75, column: 5)
!267 = !DILocation(line: 0, scope: !251)
!268 = !DILocation(line: 75, column: 49, scope: !261)
!269 = !DILocation(line: 0, scope: !261)
!270 = !DILocation(line: 75, column: 60, scope: !266)
!271 = !DILocation(line: 75, column: 5, scope: !261)
!272 = !DILocation(line: 77, column: 27, scope: !264)
!273 = !DILocation(line: 77, column: 21, scope: !264)
!274 = !DILocation(line: 77, column: 41, scope: !264)
!275 = !DILocation(line: 77, column: 76, scope: !264)
!276 = !DILocation(line: 77, column: 71, scope: !264)
!277 = !DILocation(line: 77, column: 52, scope: !264)
!278 = !DILocation(line: 77, column: 13, scope: !265)
!279 = !DILocation(line: 78, column: 17, scope: !280)
!280 = distinct !DILexicalBlock(scope: !263, file: !3, line: 78, column: 17)
!281 = !DILocation(line: 78, column: 17, scope: !263)
!282 = !DILocation(line: 80, column: 70, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !3, line: 78, column: 25)
!284 = !DILocation(line: 80, column: 25, scope: !283)
!285 = !DILocation(line: 80, column: 30, scope: !283)
!286 = !DILocation(line: 81, column: 25, scope: !283)
!287 = !DILocation(line: 82, column: 30, scope: !283)
!288 = !DILocation(line: 83, column: 13, scope: !283)
!289 = !DILocation(line: 84, column: 48, scope: !263)
!290 = !DILocation(line: 84, column: 54, scope: !263)
!291 = !DILocation(line: 84, column: 64, scope: !263)
!292 = !DILocation(line: 0, scope: !263)
!293 = !DILocation(line: 85, column: 16, scope: !263)
!294 = !DILocation(line: 85, column: 21, scope: !263)
!295 = !DILocation(line: 86, column: 44, scope: !263)
!296 = !DILocation(line: 86, column: 16, scope: !263)
!297 = !DILocation(line: 86, column: 41, scope: !263)
!298 = !DILocation(line: 87, column: 16, scope: !263)
!299 = !DILocation(line: 87, column: 43, scope: !263)
!300 = !DILocation(line: 88, column: 16, scope: !263)
!301 = !DILocation(line: 88, column: 21, scope: !263)
!302 = !DILocation(line: 89, column: 16, scope: !263)
!303 = !DILocation(line: 89, column: 23, scope: !263)
!304 = !DILocation(line: 90, column: 16, scope: !263)
!305 = !DILocation(line: 90, column: 41, scope: !263)
!306 = !DILocation(line: 91, column: 16, scope: !263)
!307 = !DILocation(line: 91, column: 43, scope: !263)
!308 = !DILocation(line: 76, column: 52, scope: !266)
!309 = distinct !{!309, !271, !310, !140}
!310 = !DILocation(line: 95, column: 5, scope: !261)
!311 = !DILocation(line: 97, column: 1, scope: !251)
!312 = distinct !DISubprogram(name: "sampling_profiler_thread", linkageName: "_ZN6Halide7Runtime8Internal24sampling_profiler_threadEPv", scope: !89, file: !3, line: 99, type: !249, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !313)
!313 = !{!314, !315, !316, !318, !319, !321, !322, !323}
!314 = !DILocalVariable(arg: 1, scope: !312, file: !3, line: 99, type: !54)
!315 = !DILocalVariable(name: "s", scope: !312, file: !3, line: 100, type: !6)
!316 = !DILocalVariable(name: "t1", scope: !317, file: !3, line: 107, type: !17)
!317 = distinct !DILexicalBlock(scope: !312, file: !3, line: 105, column: 60)
!318 = !DILocalVariable(name: "t", scope: !317, file: !3, line: 108, type: !17)
!319 = !DILocalVariable(name: "func", scope: !320, file: !3, line: 110, type: !22)
!320 = distinct !DILexicalBlock(scope: !317, file: !3, line: 109, column: 22)
!321 = !DILocalVariable(name: "active_threads", scope: !320, file: !3, line: 110, type: !22)
!322 = !DILocalVariable(name: "t_now", scope: !320, file: !3, line: 119, type: !17)
!323 = !DILocalVariable(name: "sleep_ms", scope: !320, file: !3, line: 130, type: !22)
!324 = !DILocation(line: 0, scope: !312)
!325 = !DILocation(line: 100, column: 32, scope: !312)
!326 = !DILocation(line: 103, column: 27, scope: !312)
!327 = !DILocation(line: 103, column: 5, scope: !312)
!328 = !DILocation(line: 105, column: 15, scope: !312)
!329 = !{!148, !130, i64 16}
!330 = !DILocation(line: 105, column: 28, scope: !312)
!331 = !DILocation(line: 105, column: 5, scope: !312)
!332 = !DILocation(line: 0, scope: !317)
!333 = !DILocation(line: 134, column: 9, scope: !317)
!334 = distinct !{!334, !331, !335, !140}
!335 = !DILocation(line: 135, column: 5, scope: !312)
!336 = !DILocation(line: 107, column: 23, scope: !317)
!337 = !DILocation(line: 109, column: 9, scope: !317)
!338 = !DILocation(line: 108, column: 18, scope: !317)
!339 = !DILocation(line: 110, column: 13, scope: !320)
!340 = !DILocation(line: 111, column: 20, scope: !341)
!341 = distinct !DILexicalBlock(scope: !320, file: !3, line: 111, column: 17)
!342 = !{!148, !118, i64 32}
!343 = !DILocation(line: 111, column: 17, scope: !341)
!344 = !DILocation(line: 111, column: 17, scope: !320)
!345 = !DILocation(line: 0, scope: !320)
!346 = !DILocation(line: 114, column: 17, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !3, line: 111, column: 47)
!348 = !DILocation(line: 115, column: 13, scope: !347)
!349 = !DILocation(line: 116, column: 27, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !3, line: 115, column: 20)
!351 = !DILocation(line: 116, column: 22, scope: !350)
!352 = !{!130, !130, i64 0}
!353 = !DILocation(line: 117, column: 37, scope: !350)
!354 = !{!148, !130, i64 20}
!355 = !DILocation(line: 117, column: 32, scope: !350)
!356 = !DILocation(line: 119, column: 30, scope: !320)
!357 = !DILocation(line: 120, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !320, file: !3, line: 120, column: 17)
!359 = !DILocation(line: 120, column: 22, scope: !358)
!360 = !DILocation(line: 120, column: 17, scope: !320)
!361 = !DILocation(line: 122, column: 29, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !3, line: 122, column: 24)
!363 = !DILocation(line: 122, column: 24, scope: !358)
!364 = !DILocation(line: 125, column: 42, scope: !365)
!365 = distinct !DILexicalBlock(scope: !362, file: !3, line: 122, column: 35)
!366 = !DILocation(line: 125, column: 47, scope: !365)
!367 = !DILocation(line: 125, column: 17, scope: !365)
!368 = !DILocation(line: 126, column: 13, scope: !365)
!369 = !DILocation(line: 130, column: 31, scope: !320)
!370 = !{!148, !130, i64 8}
!371 = !DILocation(line: 131, column: 13, scope: !320)
!372 = !DILocation(line: 132, column: 13, scope: !320)
!373 = !DILocation(line: 133, column: 13, scope: !320)
!374 = !DILocation(line: 137, column: 5, scope: !312)
!375 = !DILocation(line: 138, column: 1, scope: !312)
!376 = !DISubprogram(name: "halide_mutex_lock", scope: !8, file: !8, line: 133, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!380 = !DISubprogram(name: "halide_current_time_ns", scope: !16, file: !16, line: 136, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !54}
!383 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!384 = !DISubprogram(name: "halide_mutex_unlock", scope: !8, file: !8, line: 134, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!385 = !DISubprogram(name: "halide_sleep_ms", scope: !16, file: !16, line: 137, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !54, !22}
!388 = distinct !DISubprogram(name: "halide_profiler_get_pipeline_state", scope: !3, file: !3, line: 162, type: !389, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!27, !37}
!391 = !{!392, !393, !394, !406}
!392 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !388, file: !3, line: 162, type: !37)
!393 = !DILocalVariable(name: "s", scope: !388, file: !3, line: 163, type: !6)
!394 = !DILocalVariable(name: "lock", scope: !388, file: !3, line: 165, type: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedMutexLock", scope: !89, file: !396, line: 11, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !397, identifier: "_ZTSN6Halide7Runtime8Internal15ScopedMutexLockE")
!396 = !DIFile(filename: "src/runtime/scoped_mutex_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!397 = !{!398, !399, !403}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !395, file: !396, line: 12, baseType: !379, size: 64)
!399 = !DISubprogram(name: "ScopedMutexLock", scope: !395, file: !396, line: 14, type: !400, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !402, !379}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!403 = !DISubprogram(name: "~ScopedMutexLock", scope: !395, file: !396, line: 19, type: !404, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !402}
!406 = !DILocalVariable(name: "p", scope: !407, file: !3, line: 167, type: !27)
!407 = distinct !DILexicalBlock(scope: !388, file: !3, line: 167, column: 5)
!408 = !DILocation(line: 0, scope: !388)
!409 = !DILocation(line: 163, column: 32, scope: !388)
!410 = !DILocation(line: 165, column: 30, scope: !388)
!411 = !DILocalVariable(name: "this", arg: 1, scope: !412, type: !415, flags: DIFlagArtificial | DIFlagObjectPointer)
!412 = distinct !DISubprogram(name: "ScopedMutexLock", linkageName: "_ZN6Halide7Runtime8Internal15ScopedMutexLockC2EP12halide_mutex", scope: !395, file: !396, line: 14, type: !400, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, declaration: !399, retainedNodes: !413)
!413 = !{!411, !414}
!414 = !DILocalVariable(name: "mutex", arg: 2, scope: !412, file: !396, line: 14, type: !379)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!416 = !DILocation(line: 0, scope: !412, inlinedAt: !417)
!417 = distinct !DILocation(line: 165, column: 21, scope: !388)
!418 = !DILocation(line: 16, column: 9, scope: !419, inlinedAt: !417)
!419 = distinct !DILexicalBlock(scope: !412, file: !396, line: 15, column: 24)
!420 = !DILocation(line: 167, column: 49, scope: !407)
!421 = !DILocation(line: 0, scope: !407)
!422 = !DILocation(line: 167, column: 60, scope: !423)
!423 = distinct !DILexicalBlock(scope: !407, file: !3, line: 167, column: 5)
!424 = !DILocation(line: 167, column: 5, scope: !407)
!425 = !DILocation(line: 171, column: 16, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !3, line: 171, column: 13)
!427 = distinct !DILexicalBlock(scope: !423, file: !3, line: 168, column: 59)
!428 = !DILocation(line: 171, column: 21, scope: !426)
!429 = !DILocation(line: 171, column: 13, scope: !427)
!430 = !DILocation(line: 168, column: 52, scope: !423)
!431 = distinct !{!431, !424, !432, !140}
!432 = !DILocation(line: 174, column: 5, scope: !407)
!433 = !DILocalVariable(name: "this", arg: 1, scope: !434, type: !415, flags: DIFlagArtificial | DIFlagObjectPointer)
!434 = distinct !DISubprogram(name: "~ScopedMutexLock", linkageName: "_ZN6Halide7Runtime8Internal15ScopedMutexLockD2Ev", scope: !395, file: !396, line: 19, type: !404, scopeLine: 19, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, declaration: !403, retainedNodes: !435)
!435 = !{!433}
!436 = !DILocation(line: 0, scope: !434, inlinedAt: !437)
!437 = distinct !DILocation(line: 176, column: 1, scope: !388)
!438 = !DILocation(line: 20, column: 9, scope: !439, inlinedAt: !437)
!439 = distinct !DILexicalBlock(scope: !434, file: !396, line: 19, column: 38)
!440 = !DILocation(line: 176, column: 1, scope: !388)
!441 = distinct !DISubprogram(name: "halide_profiler_pipeline_start", scope: !3, file: !3, line: 179, type: !442, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!22, !54, !37, !22, !101}
!444 = !{!445, !446, !447, !448, !449, !450, !451}
!445 = !DILocalVariable(name: "user_context", arg: 1, scope: !441, file: !3, line: 179, type: !54)
!446 = !DILocalVariable(name: "pipeline_name", arg: 2, scope: !441, file: !3, line: 180, type: !37)
!447 = !DILocalVariable(name: "num_funcs", arg: 3, scope: !441, file: !3, line: 181, type: !22)
!448 = !DILocalVariable(name: "func_names", arg: 4, scope: !441, file: !3, line: 182, type: !101)
!449 = !DILocalVariable(name: "s", scope: !441, file: !3, line: 183, type: !6)
!450 = !DILocalVariable(name: "lock", scope: !441, file: !3, line: 185, type: !395)
!451 = !DILocalVariable(name: "p", scope: !441, file: !3, line: 192, type: !27)
!452 = !DILocation(line: 0, scope: !441)
!453 = !DILocation(line: 183, column: 32, scope: !441)
!454 = !DILocation(line: 185, column: 30, scope: !441)
!455 = !DILocation(line: 0, scope: !412, inlinedAt: !456)
!456 = distinct !DILocation(line: 185, column: 21, scope: !441)
!457 = !DILocation(line: 16, column: 9, scope: !419, inlinedAt: !456)
!458 = !DILocation(line: 187, column: 13, scope: !459)
!459 = distinct !DILexicalBlock(scope: !441, file: !3, line: 187, column: 9)
!460 = !{!148, !118, i64 40}
!461 = !DILocation(line: 187, column: 10, scope: !459)
!462 = !DILocation(line: 187, column: 9, scope: !441)
!463 = !DILocation(line: 188, column: 9, scope: !464)
!464 = distinct !DILexicalBlock(scope: !459, file: !3, line: 187, column: 30)
!465 = !DILocation(line: 189, column: 30, scope: !464)
!466 = !DILocation(line: 189, column: 28, scope: !464)
!467 = !DILocation(line: 190, column: 5, scope: !464)
!468 = !DILocation(line: 193, column: 9, scope: !441)
!469 = !DILocation(line: 194, column: 10, scope: !470)
!470 = distinct !DILexicalBlock(scope: !441, file: !3, line: 194, column: 9)
!471 = !DILocation(line: 194, column: 9, scope: !441)
!472 = !DILocation(line: 196, column: 16, scope: !473)
!473 = distinct !DILexicalBlock(scope: !470, file: !3, line: 194, column: 13)
!474 = !DILocation(line: 196, column: 9, scope: !473)
!475 = !DILocation(line: 198, column: 8, scope: !441)
!476 = !DILocation(line: 198, column: 12, scope: !441)
!477 = !DILocation(line: 200, column: 15, scope: !441)
!478 = !DILocation(line: 200, column: 5, scope: !441)
!479 = !DILocation(line: 0, scope: !434, inlinedAt: !480)
!480 = distinct !DILocation(line: 201, column: 1, scope: !441)
!481 = !DILocation(line: 20, column: 9, scope: !439, inlinedAt: !480)
!482 = !DILocation(line: 201, column: 1, scope: !441)
!483 = !DISubprogram(name: "halide_start_clock", scope: !16, file: !16, line: 135, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!484 = !DISubroutineType(types: !485)
!485 = !{!22, !54}
!486 = !DISubprogram(name: "halide_spawn_thread", scope: !8, file: !8, line: 317, type: !487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!487 = !DISubroutineType(types: !488)
!488 = !{!66, !489, !54}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!490 = !DISubprogram(name: "halide_error_out_of_memory", scope: !8, file: !8, line: 1227, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!491 = distinct !DISubprogram(name: "halide_profiler_stack_peak_update", scope: !3, file: !3, line: 203, type: !492, scopeLine: 205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !495)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !54, !54, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!495 = !{!496, !497, !498, !499, !500}
!496 = !DILocalVariable(name: "user_context", arg: 1, scope: !491, file: !3, line: 203, type: !54)
!497 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !491, file: !3, line: 204, type: !54)
!498 = !DILocalVariable(name: "f_values", arg: 3, scope: !491, file: !3, line: 205, type: !494)
!499 = !DILocalVariable(name: "p_stats", scope: !491, file: !3, line: 206, type: !27)
!500 = !DILocalVariable(name: "i", scope: !501, file: !3, line: 216, type: !22)
!501 = distinct !DILexicalBlock(scope: !491, file: !3, line: 216, column: 5)
!502 = !DILocation(line: 0, scope: !491)
!503 = !DILocation(line: 207, column: 5, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 207, column: 5)
!505 = distinct !DILexicalBlock(scope: !491, file: !3, line: 207, column: 5)
!506 = !DILocation(line: 207, column: 5, scope: !505)
!507 = !DILocation(line: 207, column: 5, scope: !508)
!508 = distinct !DILexicalBlock(scope: !504, file: !3, line: 207, column: 5)
!509 = !DILocation(line: 0, scope: !501)
!510 = !DILocation(line: 216, column: 34, scope: !511)
!511 = distinct !DILexicalBlock(scope: !501, file: !3, line: 216, column: 5)
!512 = !DILocation(line: 216, column: 23, scope: !511)
!513 = !DILocation(line: 216, column: 5, scope: !501)
!514 = !DILocation(line: 221, column: 1, scope: !491)
!515 = !DILocation(line: 217, column: 13, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 217, column: 13)
!517 = distinct !DILexicalBlock(scope: !511, file: !3, line: 216, column: 50)
!518 = !DILocation(line: 217, column: 25, scope: !516)
!519 = !DILocation(line: 217, column: 13, scope: !517)
!520 = !DILocation(line: 218, column: 50, scope: !521)
!521 = distinct !DILexicalBlock(scope: !516, file: !3, line: 217, column: 31)
!522 = !DILocation(line: 218, column: 60, scope: !521)
!523 = !DILocalVariable(name: "ptr", arg: 1, scope: !524, file: !3, line: 147, type: !528)
!524 = distinct !DISubprogram(name: "sync_compare_max_and_swap<unsigned long long>", linkageName: "_ZN12_GLOBAL__N_125sync_compare_max_and_swapIyEEvPT_S1_", scope: !525, file: !3, line: 147, type: !526, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !68, templateParams: !534, retainedNodes: !529)
!525 = !DINamespace(scope: null)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528, !18}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!529 = !{!523, !530, !531, !532}
!530 = !DILocalVariable(name: "val", arg: 2, scope: !524, file: !3, line: 147, type: !18)
!531 = !DILocalVariable(name: "old_val", scope: !524, file: !3, line: 148, type: !18)
!532 = !DILocalVariable(name: "temp", scope: !533, file: !3, line: 150, type: !18)
!533 = distinct !DILexicalBlock(scope: !524, file: !3, line: 149, column: 27)
!534 = !{!535}
!535 = !DITemplateTypeParameter(name: "T", type: !18)
!536 = !DILocation(line: 0, scope: !524, inlinedAt: !537)
!537 = distinct !DILocation(line: 218, column: 13, scope: !521)
!538 = !DILocation(line: 148, column: 17, scope: !524, inlinedAt: !537)
!539 = !DILocation(line: 149, column: 5, scope: !524, inlinedAt: !537)
!540 = !DILocation(line: 149, column: 16, scope: !524, inlinedAt: !537)
!541 = !DILocation(line: 0, scope: !533, inlinedAt: !537)
!542 = !DILocation(line: 151, column: 19, scope: !533, inlinedAt: !537)
!543 = !DILocation(line: 152, column: 18, scope: !544, inlinedAt: !537)
!544 = distinct !DILexicalBlock(scope: !533, file: !3, line: 152, column: 13)
!545 = distinct !{!545, !539, !546, !140}
!546 = !DILocation(line: 155, column: 5, scope: !524, inlinedAt: !537)
!547 = !DILocation(line: 216, column: 45, scope: !511)
!548 = distinct !{!548, !513, !549, !140}
!549 = !DILocation(line: 220, column: 5, scope: !501)
!550 = !DISubprogram(name: "halide_print", scope: !8, file: !8, line: 97, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !54, !37}
!553 = !DISubprogram(name: "abort", scope: !16, file: !16, line: 108, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !92)
!554 = !DISubroutineType(types: !555)
!555 = !{null}
!556 = distinct !DISubprogram(name: "halide_profiler_memory_allocate", scope: !3, file: !3, line: 223, type: !557, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !54, !54, !22, !17}
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567}
!560 = !DILocalVariable(name: "user_context", arg: 1, scope: !556, file: !3, line: 223, type: !54)
!561 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !556, file: !3, line: 224, type: !54)
!562 = !DILocalVariable(name: "func_id", arg: 3, scope: !556, file: !3, line: 225, type: !22)
!563 = !DILocalVariable(name: "incr", arg: 4, scope: !556, file: !3, line: 226, type: !17)
!564 = !DILocalVariable(name: "p_stats", scope: !556, file: !3, line: 233, type: !27)
!565 = !DILocalVariable(name: "f_stats", scope: !556, file: !3, line: 238, type: !41)
!566 = !DILocalVariable(name: "p_mem_current", scope: !556, file: !3, line: 249, type: !17)
!567 = !DILocalVariable(name: "f_mem_current", scope: !556, file: !3, line: 255, type: !17)
!568 = !DILocation(line: 0, scope: !556)
!569 = !DILocation(line: 229, column: 14, scope: !570)
!570 = distinct !DILexicalBlock(scope: !556, file: !3, line: 229, column: 9)
!571 = !DILocation(line: 229, column: 9, scope: !556)
!572 = !DILocation(line: 234, column: 5, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 234, column: 5)
!574 = distinct !DILexicalBlock(scope: !556, file: !3, line: 234, column: 5)
!575 = !DILocation(line: 234, column: 5, scope: !574)
!576 = !DILocation(line: 234, column: 5, scope: !577)
!577 = distinct !DILexicalBlock(scope: !573, file: !3, line: 234, column: 5)
!578 = !DILocation(line: 235, column: 5, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 235, column: 5)
!580 = distinct !DILexicalBlock(scope: !556, file: !3, line: 235, column: 5)
!581 = !DILocation(line: 235, column: 5, scope: !580)
!582 = !DILocation(line: 235, column: 5, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !3, line: 235, column: 5)
!584 = !DILocation(line: 236, column: 5, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !3, line: 236, column: 5)
!586 = distinct !DILexicalBlock(scope: !556, file: !3, line: 236, column: 5)
!587 = !DILocation(line: 236, column: 5, scope: !586)
!588 = !DILocation(line: 236, column: 5, scope: !589)
!589 = distinct !DILexicalBlock(scope: !585, file: !3, line: 236, column: 5)
!590 = !DILocation(line: 238, column: 53, scope: !556)
!591 = !DILocation(line: 238, column: 44, scope: !556)
!592 = !DILocation(line: 247, column: 36, scope: !556)
!593 = !DILocation(line: 247, column: 5, scope: !556)
!594 = !DILocation(line: 248, column: 36, scope: !556)
!595 = !DILocation(line: 248, column: 5, scope: !556)
!596 = !DILocation(line: 249, column: 61, scope: !556)
!597 = !DILocation(line: 249, column: 30, scope: !556)
!598 = !DILocation(line: 250, column: 41, scope: !556)
!599 = !DILocation(line: 0, scope: !524, inlinedAt: !600)
!600 = distinct !DILocation(line: 250, column: 5, scope: !556)
!601 = !DILocation(line: 148, column: 17, scope: !524, inlinedAt: !600)
!602 = !DILocation(line: 149, column: 5, scope: !524, inlinedAt: !600)
!603 = !DILocation(line: 149, column: 16, scope: !524, inlinedAt: !600)
!604 = !DILocation(line: 0, scope: !533, inlinedAt: !600)
!605 = !DILocation(line: 151, column: 19, scope: !533, inlinedAt: !600)
!606 = !DILocation(line: 152, column: 18, scope: !544, inlinedAt: !600)
!607 = distinct !{!607, !602, !608, !140}
!608 = !DILocation(line: 155, column: 5, scope: !524, inlinedAt: !600)
!609 = !DILocation(line: 253, column: 36, scope: !556)
!610 = !DILocation(line: 253, column: 5, scope: !556)
!611 = !DILocation(line: 254, column: 36, scope: !556)
!612 = !DILocation(line: 254, column: 5, scope: !556)
!613 = !DILocation(line: 255, column: 61, scope: !556)
!614 = !DILocation(line: 255, column: 30, scope: !556)
!615 = !DILocation(line: 256, column: 41, scope: !556)
!616 = !DILocation(line: 0, scope: !524, inlinedAt: !617)
!617 = distinct !DILocation(line: 256, column: 5, scope: !556)
!618 = !DILocation(line: 148, column: 17, scope: !524, inlinedAt: !617)
!619 = !DILocation(line: 149, column: 5, scope: !524, inlinedAt: !617)
!620 = !DILocation(line: 149, column: 16, scope: !524, inlinedAt: !617)
!621 = !DILocation(line: 0, scope: !533, inlinedAt: !617)
!622 = !DILocation(line: 151, column: 19, scope: !533, inlinedAt: !617)
!623 = !DILocation(line: 152, column: 18, scope: !544, inlinedAt: !617)
!624 = distinct !{!624, !619, !625, !140}
!625 = !DILocation(line: 155, column: 5, scope: !524, inlinedAt: !617)
!626 = !DILocation(line: 257, column: 1, scope: !556)
!627 = distinct !DISubprogram(name: "halide_profiler_memory_free", scope: !3, file: !3, line: 259, type: !557, scopeLine: 262, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !628)
!628 = !{!629, !630, !631, !632, !633, !634}
!629 = !DILocalVariable(name: "user_context", arg: 1, scope: !627, file: !3, line: 259, type: !54)
!630 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !627, file: !3, line: 260, type: !54)
!631 = !DILocalVariable(name: "func_id", arg: 3, scope: !627, file: !3, line: 261, type: !22)
!632 = !DILocalVariable(name: "decr", arg: 4, scope: !627, file: !3, line: 262, type: !17)
!633 = !DILocalVariable(name: "p_stats", scope: !627, file: !3, line: 269, type: !27)
!634 = !DILocalVariable(name: "f_stats", scope: !627, file: !3, line: 274, type: !41)
!635 = !DILocation(line: 0, scope: !627)
!636 = !DILocation(line: 265, column: 14, scope: !637)
!637 = distinct !DILexicalBlock(scope: !627, file: !3, line: 265, column: 9)
!638 = !DILocation(line: 265, column: 9, scope: !627)
!639 = !DILocation(line: 270, column: 5, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !3, line: 270, column: 5)
!641 = distinct !DILexicalBlock(scope: !627, file: !3, line: 270, column: 5)
!642 = !DILocation(line: 270, column: 5, scope: !641)
!643 = !DILocation(line: 270, column: 5, scope: !644)
!644 = distinct !DILexicalBlock(scope: !640, file: !3, line: 270, column: 5)
!645 = !DILocation(line: 271, column: 5, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !3, line: 271, column: 5)
!647 = distinct !DILexicalBlock(scope: !627, file: !3, line: 271, column: 5)
!648 = !DILocation(line: 271, column: 5, scope: !647)
!649 = !DILocation(line: 271, column: 5, scope: !650)
!650 = distinct !DILexicalBlock(scope: !646, file: !3, line: 271, column: 5)
!651 = !DILocation(line: 272, column: 5, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !3, line: 272, column: 5)
!653 = distinct !DILexicalBlock(scope: !627, file: !3, line: 272, column: 5)
!654 = !DILocation(line: 272, column: 5, scope: !653)
!655 = !DILocation(line: 272, column: 5, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !3, line: 272, column: 5)
!657 = !DILocation(line: 274, column: 53, scope: !627)
!658 = !DILocation(line: 274, column: 44, scope: !627)
!659 = !DILocation(line: 283, column: 36, scope: !627)
!660 = !DILocation(line: 283, column: 5, scope: !627)
!661 = !DILocation(line: 286, column: 36, scope: !627)
!662 = !DILocation(line: 286, column: 5, scope: !627)
!663 = !DILocation(line: 287, column: 1, scope: !627)
!664 = distinct !DISubprogram(name: "halide_profiler_report_unlocked", scope: !3, file: !3, line: 289, type: !665, scopeLine: 289, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !667)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !54, !6}
!667 = !{!668, !669, !670, !674, !791, !793, !796, !797, !798, !799, !800, !804, !807, !811, !815, !816, !817, !818, !821}
!668 = !DILocalVariable(name: "user_context", arg: 1, scope: !664, file: !3, line: 289, type: !54)
!669 = !DILocalVariable(name: "s", arg: 2, scope: !664, file: !3, line: 289, type: !6)
!670 = !DILocalVariable(name: "line_buf", scope: !664, file: !3, line: 291, type: !671)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8192, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 1024)
!674 = !DILocalVariable(name: "sstr", scope: !664, file: !3, line: 292, type: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 1024>", scope: !677, file: !676, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !678, templateParams: !788)
!676 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!677 = !DINamespace(scope: !89)
!678 = !{!679, !680, !681, !682, !683, !685, !687, !691, !695, !699, !703, !706, !711, !715, !719, !724, !730, !763, !770, !773, !776, !781, !782, !785, !786, !787}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !675, file: !676, line: 32, baseType: !85, size: 64, flags: DIFlagPublic)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !675, file: !676, line: 32, baseType: !85, size: 64, offset: 64, flags: DIFlagPublic)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !675, file: !676, line: 32, baseType: !85, size: 64, offset: 128, flags: DIFlagPublic)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !675, file: !676, line: 33, baseType: !54, size: 64, offset: 192, flags: DIFlagPublic)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !675, file: !676, line: 34, baseType: !684, size: 8, offset: 256, flags: DIFlagPublic)
!684 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !675, file: !676, line: 35, baseType: !686, size: 8, offset: 264, flags: DIFlagPublic)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !19)
!687 = !DISubprogram(name: "Printer", scope: !675, file: !676, line: 37, type: !688, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !690, !54, !85}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!691 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !675, file: !676, line: 57, type: !692, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!692 = !DISubroutineType(types: !693)
!693 = !{!694, !690, !37}
!694 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !675, size: 64)
!695 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEx", scope: !675, file: !676, line: 67, type: !696, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DISubroutineType(types: !697)
!697 = !{!694, !690, !698}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 9, baseType: !383)
!699 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEi", scope: !675, file: !676, line: 72, type: !700, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!700 = !DISubroutineType(types: !701)
!701 = !{!694, !690, !702}
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !16, line: 11, baseType: !22)
!703 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEy", scope: !675, file: !676, line: 77, type: !704, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!704 = !DISubroutineType(types: !705)
!705 = !{!694, !690, !17}
!706 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEj", scope: !675, file: !676, line: 82, type: !707, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!707 = !DISubroutineType(types: !708)
!708 = !{!694, !690, !709}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 12, baseType: !710)
!710 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!711 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEd", scope: !675, file: !676, line: 87, type: !712, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!712 = !DISubroutineType(types: !713)
!713 = !{!694, !690, !714}
!714 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!715 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEf", scope: !675, file: !676, line: 92, type: !716, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!716 = !DISubroutineType(types: !717)
!717 = !{!694, !690, !718}
!718 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!719 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKv", scope: !675, file: !676, line: 97, type: !720, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!720 = !DISubroutineType(types: !721)
!721 = !{!694, !690, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!724 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE23write_float16_from_bitsEt", scope: !675, file: !676, line: 102, type: !725, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(types: !726)
!726 = !{!694, !690, !727}
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 14, baseType: !729)
!729 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!730 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK13halide_type_t", scope: !675, file: !676, line: 108, type: !731, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!731 = !DISubroutineType(types: !732)
!732 = !{!694, !690, !733}
!733 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !8, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !736, identifier: "_ZTS13halide_type_t")
!736 = !{!737, !739, !740, !741, !745, !748, !752, !755, !756, !757, !760}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !735, file: !8, line: 434, baseType: !738, size: 8, align: 8)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !8, line: 413, baseType: !75)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !735, file: !8, line: 442, baseType: !76, size: 8, align: 8, offset: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !735, file: !8, line: 446, baseType: !728, size: 16, align: 16, offset: 16)
!741 = !DISubprogram(name: "halide_type_t", scope: !735, file: !8, line: 453, type: !742, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !744, !738, !76, !728}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!745 = !DISubprogram(name: "halide_type_t", scope: !735, file: !8, line: 459, type: !746, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !744}
!748 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !735, file: !8, line: 463, type: !749, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!735, !751, !728}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!752 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !735, file: !8, line: 468, type: !753, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!753 = !DISubroutineType(types: !754)
!754 = !{!684, !751, !733}
!755 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !735, file: !8, line: 472, type: !753, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!756 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !735, file: !8, line: 476, type: !753, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!757 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !735, file: !8, line: 481, type: !758, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!758 = !DISubroutineType(types: !759)
!759 = !{!22, !751}
!760 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !735, file: !8, line: 485, type: !761, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!761 = !DISubroutineType(types: !762)
!762 = !{!709, !751}
!763 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK15halide_buffer_t", scope: !675, file: !676, line: 113, type: !764, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!764 = !DISubroutineType(types: !765)
!765 = !{!694, !690, !766}
!766 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !8, line: 1550, baseType: !769)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !8, line: 1423, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15halide_buffer_t")
!770 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE3strEv", scope: !675, file: !676, line: 119, type: !771, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DISubroutineType(types: !772)
!772 = !{!37, !690}
!773 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5clearEv", scope: !675, file: !676, line: 131, type: !774, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !690}
!776 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE4sizeEv", scope: !675, file: !676, line: 139, type: !777, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!777 = !DISubroutineType(types: !778)
!778 = !{!17, !779}
