; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/to_string.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/to_string.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_type_t = type { i8, i8, i16 }
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }
%struct.halide_device_interface_t = type { i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, void (i8*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_device_interface_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i32, i32, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, %struct.halide_buffer_t*, i64, %struct.halide_device_interface_t*)*, i32 (i8*, %struct.halide_buffer_t*)*, i32 (i8*, i32*, i32*)*, %struct.halide_device_interface_impl_t* }
%struct.halide_device_interface_impl_t = type opaque
%struct.halide_dimension_t = type { i32, i32, i32, i32 }


!339 = !DILocation(line: 190, column: 9, scope: !166)
!340 = !DILocation(line: 198, column: 9, scope: !160)
!341 = !DILocation(line: 198, column: 14, scope: !160)
!342 = !DILocation(line: 201, column: 34, scope: !160)
!343 = !DILocation(line: 201, column: 40, scope: !160)
!344 = !DILocation(line: 202, column: 25, scope: !160)
!345 = !DILocation(line: 0, scope: !180)
!346 = !DILocation(line: 203, column: 27, scope: !183)
!347 = !DILocation(line: 203, column: 9, scope: !180)
!348 = !DILocation(line: 0, scope: !185)
!349 = !DILocation(line: 0, scope: !182)
!350 = !DILocation(line: 206, column: 59, scope: !188)
!351 = !DILocation(line: 206, column: 43, scope: !188)
!352 = !DILocation(line: 206, column: 13, scope: !185)
!353 = !DILocation(line: 224, column: 15, scope: !160)
!354 = !DILocation(line: 225, column: 15, scope: !160)
!355 = !DILocation(line: 226, column: 15, scope: !160)
!356 = !DILocation(line: 227, column: 5, scope: !155)
!357 = !DILocation(line: 217, column: 17, scope: !182)
!358 = !DILocation(line: 207, column: 34, scope: !187)
!359 = !DILocation(line: 0, scope: !187)
!360 = !DILocation(line: 208, column: 44, scope: !187)
!361 = !DILocation(line: 208, column: 48, scope: !187)
!362 = !DILocation(line: 209, column: 31, scope: !363)
!363 = distinct !DILexicalBlock(scope: !187, file: !32, line: 209, column: 21)
!364 = !DILocation(line: 209, column: 21, scope: !187)
!365 = !DILocation(line: 215, column: 32, scope: !187)
!366 = !DILocation(line: 215, column: 20, scope: !187)
!367 = distinct !{!367, !352, !368, !112}
!368 = !DILocation(line: 216, column: 13, scope: !185)
!369 = !DILocation(line: 221, column: 31, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !32, line: 217, column: 24)
!371 = distinct !DILexicalBlock(scope: !182, file: !32, line: 217, column: 17)
!372 = !DILocation(line: 222, column: 13, scope: !370)
!373 = !DILocation(line: 203, column: 48, scope: !183)
!374 = distinct !{!374, !347, !375, !112}
!375 = !DILocation(line: 223, column: 9, scope: !180)
!376 = !DILocation(line: 230, column: 1, scope: !134)
!377 = !DISubprogram(name: "memcpy", scope: !6, file: !6, line: 94, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !383)
!378 = !DISubroutineType(types: !379)
!379 = !{!380, !380, !381, !15}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!383 = !{}
!384 = distinct !DISubprogram(name: "halide_pointer_to_string", scope: !32, file: !32, line: 232, type: !385, scopeLine: 232, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{!35, !35, !35, !381}
!387 = !{!388, !389, !390, !391, !392, !396, !397, !398}
!388 = !DILocalVariable(name: "dst", arg: 1, scope: !384, file: !32, line: 232, type: !35)
!389 = !DILocalVariable(name: "end", arg: 2, scope: !384, file: !32, line: 232, type: !35)
!390 = !DILocalVariable(name: "arg", arg: 3, scope: !384, file: !32, line: 232, type: !381)
!391 = !DILocalVariable(name: "hex_digits", scope: !384, file: !32, line: 233, type: !37)
!392 = !DILocalVariable(name: "buf", scope: !384, file: !32, line: 234, type: !393)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 20)
!396 = !DILocalVariable(name: "buf_ptr", scope: !384, file: !32, line: 235, type: !35)
!397 = !DILocalVariable(name: "bits", scope: !384, file: !32, line: 236, type: !20)
!398 = !DILocalVariable(name: "i", scope: !399, file: !32, line: 237, type: !71)
!399 = distinct !DILexicalBlock(scope: !384, file: !32, line: 237, column: 5)
!400 = !DILocation(line: 0, scope: !384)
!401 = !DILocation(line: 234, column: 5, scope: !384)
!402 = !DILocation(line: 234, column: 10, scope: !384)
!403 = !DILocation(line: 235, column: 25, scope: !384)
!404 = !DILocation(line: 236, column: 21, scope: !384)
!405 = !DILocation(line: 0, scope: !399)
!406 = !DILocation(line: 238, column: 22, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !32, line: 237, column: 34)
!408 = distinct !DILexicalBlock(scope: !399, file: !32, line: 237, column: 5)
!409 = !DILocation(line: 238, column: 17, scope: !407)
!410 = !DILocation(line: 238, column: 20, scope: !407)
!411 = !DILocation(line: 239, column: 14, scope: !407)
!412 = !DILocation(line: 240, column: 14, scope: !413)
!413 = distinct !DILexicalBlock(scope: !407, file: !32, line: 240, column: 13)
!414 = !DILocation(line: 240, column: 13, scope: !407)
!415 = !DILocation(line: 244, column: 13, scope: !384)
!416 = !DILocation(line: 244, column: 16, scope: !384)
!417 = !DILocation(line: 245, column: 14, scope: !384)
!418 = !DILocation(line: 246, column: 12, scope: !384)
!419 = !DILocation(line: 247, column: 1, scope: !384)
!420 = !DILocation(line: 246, column: 5, scope: !384)
!421 = distinct !DISubprogram(name: "halide_type_to_string", scope: !32, file: !32, line: 249, type: !422, scopeLine: 249, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !459)
!422 = !DISubroutineType(types: !423)
!423 = !{!35, !35, !35, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !4, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !427, identifier: "_ZTS13halide_type_t")
!427 = !{!428, !430, !431, !434, !438, !441, !445, !450, !451, !452, !455}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !426, file: !4, line: 434, baseType: !429, size: 8, align: 8)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !4, line: 413, baseType: !3)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !426, file: !4, line: 442, baseType: !5, size: 8, align: 8, offset: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !426, file: !4, line: 446, baseType: !432, size: 16, align: 16, offset: 16)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 14, baseType: !433)
!433 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!434 = !DISubprogram(name: "halide_type_t", scope: !426, file: !4, line: 453, type: !435, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437, !429, !5, !432}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!438 = !DISubprogram(name: "halide_type_t", scope: !426, file: !4, line: 459, type: !439, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !437}
!441 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !426, file: !4, line: 463, type: !442, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!426, !444, !432}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!445 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !426, file: !4, line: 468, type: !446, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !444, !449}
!448 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!449 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !425, size: 32)
!450 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !426, file: !4, line: 472, type: !446, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !426, file: !4, line: 476, type: !446, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!452 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !426, file: !4, line: 481, type: !453, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!453 = !DISubroutineType(types: !454)
!454 = !{!71, !444}
!455 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !426, file: !4, line: 485, type: !456, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !444}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 12, baseType: !15)
!459 = !{!460, !461, !462, !463}
!460 = !DILocalVariable(name: "dst", arg: 1, scope: !421, file: !32, line: 249, type: !35)
!461 = !DILocalVariable(name: "end", arg: 2, scope: !421, file: !32, line: 249, type: !35)
!462 = !DILocalVariable(name: "t", arg: 3, scope: !421, file: !32, line: 249, type: !424)
!463 = !DILocalVariable(name: "code_name", scope: !421, file: !32, line: 250, type: !37)
!464 = !DILocation(line: 0, scope: !421)
!465 = !DILocation(line: 251, column: 16, scope: !421)
!466 = !{!467, !468, i64 0}
!467 = !{!"_ZTS13halide_type_t", !468, i64 0, !52, i64 1, !469, i64 2}
!468 = !{!"_ZTS18halide_type_code_t", !52, i64 0}
!469 = !{!"short", !52, i64 0}
!470 = !DILocation(line: 251, column: 5, scope: !421)
!471 = !DILocation(line: 257, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !421, file: !32, line: 251, column: 22)
!473 = !DILocation(line: 260, column: 9, scope: !472)
!474 = !DILocation(line: 263, column: 9, scope: !472)
!475 = !DILocation(line: 266, column: 9, scope: !472)
!476 = !DILocation(line: 0, scope: !472)
!477 = !DILocation(line: 268, column: 11, scope: !421)
!478 = !DILocation(line: 269, column: 48, scope: !421)
!479 = !{!467, !52, i64 1}
!480 = !DILocation(line: 269, column: 45, scope: !421)
!481 = !DILocation(line: 269, column: 11, scope: !421)
!482 = !DILocation(line: 270, column: 12, scope: !483)
!483 = distinct !DILexicalBlock(scope: !421, file: !32, line: 270, column: 9)
!484 = !{!467, !469, i64 2}
!485 = !DILocation(line: 270, column: 18, scope: !483)
!486 = !DILocation(line: 270, column: 9, scope: !421)
!487 = !DILocation(line: 271, column: 15, scope: !488)
!488 = distinct !DILexicalBlock(scope: !483, file: !32, line: 270, column: 24)
!489 = !DILocation(line: 272, column: 52, scope: !488)
!490 = !DILocation(line: 272, column: 49, scope: !488)
!491 = !DILocation(line: 272, column: 15, scope: !488)
!492 = !DILocation(line: 273, column: 5, scope: !488)
!493 = !DILocation(line: 274, column: 5, scope: !421)
!494 = distinct !DISubprogram(name: "halide_buffer_to_string", scope: !32, file: !32, line: 277, type: !495, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !619)
!495 = !DISubroutineType(types: !496)
!496 = !{!35, !35, !35, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !4, line: 1550, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !4, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !501, identifier: "_ZTS15halide_buffer_t")
!501 = !{!502, !503, !555, !557, !558, !559, !561, !584, !585, !590, !594, !597, !598, !601, !602, !606, !609, !610, !611, !615, !618}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !500, file: !4, line: 1425, baseType: !20, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !500, file: !4, line: 1428, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !4, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !507, identifier: "_ZTS25halide_device_interface_t")
!507 = !{!508, !513, !517, !518, !522, !523, !524, !525, !526, !530, !536, !540, !541, !545, !546, !551}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !506, file: !4, line: 724, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DISubroutineType(types: !511)
!511 = !{!71, !380, !512, !504}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !506, file: !4, line: 726, baseType: !514, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!71, !380, !512}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !506, file: !4, line: 727, baseType: !514, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !506, file: !4, line: 728, baseType: !519, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !380, !504}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !506, file: !4, line: 730, baseType: !514, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !506, file: !4, line: 731, baseType: !509, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !506, file: !4, line: 733, baseType: !509, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !506, file: !4, line: 735, baseType: !514, size: 32, offset: 224)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !506, file: !4, line: 736, baseType: !527, size: 32, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DISubroutineType(types: !529)
!529 = !{!71, !380, !512, !504, !512}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !506, file: !4, line: 738, baseType: !531, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DISubroutineType(types: !533)
!533 = !{!71, !380, !534, !512}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !506, file: !4, line: 740, baseType: !537, size: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DISubroutineType(types: !539)
!539 = !{!71, !380, !534, !71, !71, !512}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !506, file: !4, line: 742, baseType: !514, size: 32, offset: 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !506, file: !4, line: 743, baseType: !542, size: 32, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DISubroutineType(types: !544)
!544 = !{!71, !380, !512, !20, !504}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !506, file: !4, line: 745, baseType: !514, size: 32, offset: 416)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !506, file: !4, line: 746, baseType: !547, size: 32, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!71, !380, !550, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !506, file: !4, line: 747, baseType: !552, size: 32, offset: 480)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !4, line: 707, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS30halide_device_interface_impl_t")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !500, file: !4, line: 1433, baseType: !556, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !4, line: 1436, baseType: !20, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !4, line: 1439, baseType: !426, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !500, file: !4, line: 1442, baseType: !560, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !6, line: 11, baseType: !71)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !500, file: !4, line: 1446, baseType: !562, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !4, line: 1409, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !4, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !565, identifier: "_ZTS18halide_dimension_t")
!565 = !{!566, !567, !568, !569, !570, !574, !577, !583}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !564, file: !4, line: 1383, baseType: !560, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !564, file: !4, line: 1383, baseType: !560, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !564, file: !4, line: 1383, baseType: !560, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !564, file: !4, line: 1386, baseType: !458, size: 32, offset: 96)
!570 = !DISubprogram(name: "halide_dimension_t", scope: !564, file: !4, line: 1388, type: !571, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!574 = !DISubprogram(name: "halide_dimension_t", scope: !564, file: !4, line: 1389, type: !575, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !573, !560, !560, !560, !458}
!577 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !564, file: !4, line: 1393, type: !578, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!578 = !DISubroutineType(types: !579)
!579 = !{!448, !580, !582}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!582 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !581, size: 32)
!583 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !564, file: !4, line: 1400, type: !578, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !500, file: !4, line: 1449, baseType: !380, size: 32, offset: 288)
!585 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !500, file: !4, line: 1454, type: !586, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!586 = !DISubroutineType(types: !587)
!587 = !{!448, !588, !589}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !4, line: 1416, baseType: !14)
!590 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !500, file: !4, line: 1458, type: !591, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !593, !589, !448}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!594 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !500, file: !4, line: 1466, type: !595, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!595 = !DISubroutineType(types: !596)
!596 = !{!448, !588}
!597 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !500, file: !4, line: 1470, type: !595, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !500, file: !4, line: 1474, type: !599, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !593, !448}
!601 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !500, file: !4, line: 1478, type: !599, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!602 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !500, file: !4, line: 1485, type: !603, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !588}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 27, baseType: !15)
!606 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !500, file: !4, line: 1495, type: !607, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!607 = !DISubroutineType(types: !608)
!608 = !{!556, !588}
!609 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !500, file: !4, line: 1506, type: !607, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!610 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !500, file: !4, line: 1518, type: !603, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !500, file: !4, line: 1523, type: !612, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(types: !613)
!613 = !{!556, !588, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!615 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !500, file: !4, line: 1534, type: !616, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!616 = !DISubroutineType(types: !617)
!617 = !{!71, !593, !380}
!618 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !500, file: !4, line: 1545, type: !595, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !{!620, !621, !622, !623}
