; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8 }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32 }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i32] }
%struct.halide_thread = type { i32 }
%struct._qurt_thread_attr = type { [16 x i8], i8, i8, i16, i8, i8, i16, i32, i8* }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "halide_qurt_default_thread_priority", scope: !2, file: !8, line: 37, type: !406, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !3, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !310, imports: !401, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!4 = !{}
!5 = !{!6, !25, !26, !29, !101, !136, !137, !178, !203, !213, !184, !223, !236, !240, !248, !305, !173, !265, !309}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !9, file: !8, line: 14, size: 128, flags: DIFlagTypePassByValue, elements: !10)
!8 = !DIFile(filename: "src/runtime/qurt_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !DINamespace(scope: null)
!10 = !{!11, !16, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !7, file: !8, line: 15, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !7, file: !8, line: 16, baseType: !15, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !7, file: !8, line: 17, baseType: !15, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !7, file: !8, line: 18, baseType: !19, size: 32, offset: 96)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 9, size: 32, flags: DIFlagTypePassByValue, elements: !20, identifier: "_ZTS13halide_thread")
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !8, line: 10, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_t", file: !23, line: 18, baseType: !24)
!23 = !DIFile(filename: "src/runtime/mini_qurt.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !27, line: 68, baseType: !28)
!27 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 12, baseType: !24)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !32, file: !31, line: 254, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !36, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE")
!31 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!32 = !DINamespace(name: "Synchronization", scope: !33)
!33 = !DINamespace(name: "Internal", scope: !34)
!34 = !DINamespace(name: "Runtime", scope: !35)
!35 = !DINamespace(name: "Halide", scope: null)
!36 = !{!37, !93, !94, !95, !96, !100}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !30, file: !31, line: 255, baseType: !38, size: 320)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !32, file: !8, line: 84, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !39, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE")
!39 = !{!40, !53, !65, !67, !73, !77, !81, !84, !87, !88, !89, !90, !91, !92}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !38, file: !8, line: 85, baseType: !41, size: 128)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_mutex_t", file: !23, line: 211, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "qurt_mutex_aligned8", file: !23, line: 201, size: 128, flags: DIFlagTypePassByValue, elements: !43, identifier: "_ZTS19qurt_mutex_aligned8")
!43 = !{!44, !51}
!44 = !DIDerivedType(tag: DW_TAG_member, scope: !42, file: !23, line: 203, baseType: !45, size: 128)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !42, file: !23, line: 203, size: 128, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !46, identifier: "_ZTSN19qurt_mutex_aligned8Ut_E")
!46 = !{!47, !48, !49, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "holder", scope: !45, file: !23, line: 204, baseType: !24, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !45, file: !23, line: 205, baseType: !24, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !45, file: !23, line: 206, baseType: !24, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !45, file: !23, line: 207, baseType: !24, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !42, file: !23, line: 209, baseType: !52, size: 64)
!52 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !38, file: !8, line: 86, baseType: !54, size: 128, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_cond_t", file: !23, line: 224, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !23, line: 214, size: 128, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTS11qurt_cond_t")
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !55, file: !23, line: 216, baseType: !52, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !55, file: !23, line: 222, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !23, line: 217, size: 128, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN11qurt_cond_tUt_E")
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !59, file: !23, line: 218, baseType: !24, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting", scope: !59, file: !23, line: 219, baseType: !24, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !59, file: !23, line: 220, baseType: !24, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !59, file: !23, line: 221, baseType: !24, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !38, file: !8, line: 87, baseType: !66, size: 8, offset: 256)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DISubprogram(name: "thread_parker", scope: !38, file: !8, line: 89, type: !68, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!73 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSERKS3_", scope: !38, file: !8, line: 90, type: !74, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !70, !71}
!76 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38, size: 32)
!77 = !DISubprogram(name: "thread_parker", scope: !38, file: !8, line: 91, type: !78, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !70, !80}
!80 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !38, size: 32)
!81 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSEOS3_", scope: !38, file: !8, line: 92, type: !82, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!82 = !DISubroutineType(types: !83)
!83 = !{!76, !70, !80}
!84 = !DISubprogram(name: "thread_parker", scope: !38, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !70}
!87 = !DISubprogram(name: "~thread_parker", scope: !38, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !38, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!89 = !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !38, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !38, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!91 = !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !38, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !38, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !31, line: 273, baseType: !29, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !30, file: !31, line: 274, baseType: !29, size: 32, offset: 352)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !30, file: !31, line: 275, baseType: !29, size: 32, offset: 384)
!96 = !DISubprogram(name: "word_lock_queue_data", scope: !30, file: !31, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!100 = !DISubprogram(name: "~word_lock_queue_data", scope: !30, file: !31, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !32, file: !31, line: 475, size: 98304, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !103, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10hash_tableE")
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !102, file: !31, line: 476, baseType: !105, size: 98304)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 98304, elements: !134)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !32, file: !31, line: 463, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !107, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11hash_bucketE")
!107 = !{!108, !120, !133}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !106, file: !31, line: 464, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !32, file: !31, line: 283, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !110, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9word_lockE")
!110 = !{!111, !112, !116, !117, !118, !119}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !31, line: 284, baseType: !26, size: 32)
!112 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !31, line: 286, type: !113, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !31, line: 287, type: !113, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubprogram(name: "word_lock", scope: !109, file: !31, line: 290, type: !113, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !31, line: 291, type: !113, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock6unlockEv", scope: !109, file: !31, line: 304, type: !113, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !106, file: !31, line: 466, baseType: !121, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !32, file: !31, line: 448, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !123, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10queue_dataE")
!123 = !{!124, !125, !126, !127, !128, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !122, file: !31, line: 449, baseType: !38, size: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !122, file: !31, line: 451, baseType: !26, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !31, line: 452, baseType: !121, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !122, file: !31, line: 453, baseType: !26, size: 32, offset: 384)
!128 = !DISubprogram(name: "queue_data", scope: !122, file: !31, line: 455, type: !129, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!132 = !DISubprogram(name: "~queue_data", scope: !122, file: !31, line: 457, type: !129, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !106, file: !31, line: 467, baseType: !121, size: 32, offset: 64)
!134 = !{!135}
!135 = !DISubrange(count: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !32, file: !31, line: 829, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !139, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization21mutex_parking_controlE")
!139 = !{!140, !172, !174}
!140 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !138, baseType: !141, extraData: i32 0)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !32, file: !31, line: 592, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !142, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15parking_controlE")
!142 = !{!143, !156, !157, !162, !168}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !141, file: !31, line: 593, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DISubroutineType(types: !146)
!146 = !{!66, !15, !147}
!147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !148, size: 32)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !32, file: !31, line: 576, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !149, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15validate_actionE")
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !148, file: !31, line: 577, baseType: !66, size: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !148, file: !31, line: 578, baseType: !26, size: 32, offset: 32)
!152 = !DISubprogram(name: "validate_action", scope: !148, file: !31, line: 580, type: !153, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !141, file: !31, line: 594, baseType: !12, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !141, file: !31, line: 595, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!26, !15, !161, !66}
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !141, file: !31, line: 596, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !15, !166, !66, !66}
!166 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!168 = !DISubprogram(name: "parking_control", scope: !141, file: !31, line: 598, type: !169, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !138, file: !31, line: 830, baseType: !173, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!174 = !DISubprogram(name: "mutex_parking_control", scope: !138, file: !31, line: 832, type: !175, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !173}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !32, file: !31, line: 958, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !180, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization22signal_parking_controlE")
!180 = !{!181, !182, !183, !199}
!181 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !179, baseType: !141, extraData: i32 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !179, file: !31, line: 959, baseType: !173, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !179, file: !31, line: 960, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !32, file: !31, line: 859, size: 32, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10fast_mutexE")
!186 = !{!187, !188, !192, !193, !194, !195, !198}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !185, file: !31, line: 860, baseType: !26, size: 32)
!188 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex9lock_fullEv", scope: !185, file: !31, line: 862, type: !189, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!192 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11unlock_fullEv", scope: !185, file: !31, line: 906, type: !189, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex4lockEv", scope: !185, file: !31, line: 920, type: !189, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex6unlockEv", scope: !185, file: !31, line: 929, type: !189, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubprogram(name: "make_parked_if_locked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex21make_parked_if_lockedEv", scope: !185, file: !31, line: 938, type: !196, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !191}
!198 = !DISubprogram(name: "make_parked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11make_parkedEv", scope: !185, file: !31, line: 953, type: !189, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubprogram(name: "signal_parking_control", scope: !179, file: !31, line: 962, type: !200, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202, !173, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !32, file: !31, line: 985, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !205, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization25broadcast_parking_controlE")
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !204, baseType: !141, extraData: i32 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !204, file: !31, line: 986, baseType: !173, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !204, file: !31, line: 987, baseType: !184, size: 32, offset: 160)
!209 = !DISubprogram(name: "broadcast_parking_control", scope: !204, file: !31, line: 989, type: !210, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212, !173, !184}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !32, file: !31, line: 1026, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !215, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20wait_parking_controlE")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !214, baseType: !141, extraData: i32 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !214, file: !31, line: 1027, baseType: !173, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !214, file: !31, line: 1028, baseType: !184, size: 32, offset: 160)
!219 = !DISubprogram(name: "wait_parking_control", scope: !214, file: !31, line: 1030, type: !220, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !173, !184}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !32, file: !31, line: 1072, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !225, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9fast_condE")
!225 = !{!226, !227, !231, !232, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !31, line: 1073, baseType: !26, size: 32)
!227 = !DISubprogram(name: "fast_cond", scope: !224, file: !31, line: 1076, type: !228, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!231 = !DISubprogram(name: "signal", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond6signalEv", scope: !224, file: !31, line: 1078, type: !228, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubprogram(name: "broadcast", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond9broadcastEv", scope: !224, file: !31, line: 1092, type: !228, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubprogram(name: "wait", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond4waitEPNS2_10fast_mutexE", scope: !224, file: !31, line: 1105, type: !234, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !230, !184}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !31, line: 1164, size: 32, flags: DIFlagTypePassByValue, elements: !238, identifier: "_ZTS18halide_mutex_array")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !237, file: !31, line: 1165, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !242, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !243, identifier: "_ZTS12halide_mutex")
!242 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !241, file: !242, line: 121, baseType: !245, size: 32)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !33, file: !250, line: 26, size: 640, flags: DIFlagTypePassByValue, elements: !251, identifier: "_ZTSN6Halide7Runtime8Internal4workE")
!250 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!251 = !{!252, !281, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !249, file: !250, line: 27, baseType: !253, size: 288)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !242, line: 201, size: 288, flags: DIFlagTypePassByValue, elements: !254, identifier: "_ZTS22halide_parallel_task_t")
!254 = !{!255, !263, !264, !268, !276, !277, !278, !279, !280}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !253, file: !242, line: 204, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !242, line: 192, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DISubroutineType(types: !259)
!259 = !{!161, !15, !161, !161, !260, !15}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 16, baseType: !262)
!262 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !253, file: !242, line: 207, baseType: !260, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !242, line: 210, baseType: !265, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !253, file: !242, line: 214, baseType: !269, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !242, line: 177, size: 64, flags: DIFlagTypePassByValue, elements: !271, identifier: "_ZTS26halide_semaphore_acquire_t")
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !270, file: !242, line: 178, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !242, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS18halide_semaphore_t")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !242, line: 179, baseType: !161, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !253, file: !242, line: 215, baseType: !161, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !253, file: !242, line: 238, baseType: !161, size: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !253, file: !242, line: 243, baseType: !66, size: 8, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !249, file: !250, line: 31, baseType: !282, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !242, line: 158, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!161, !15, !161, !260}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !249, file: !250, line: 33, baseType: !248, size: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !249, file: !250, line: 34, baseType: !248, size: 32, offset: 352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !249, file: !250, line: 35, baseType: !161, size: 32, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !249, file: !250, line: 36, baseType: !248, size: 32, offset: 416)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !249, file: !250, line: 37, baseType: !161, size: 32, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !249, file: !250, line: 39, baseType: !15, size: 32, offset: 480)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !249, file: !250, line: 40, baseType: !161, size: 32, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !249, file: !250, line: 41, baseType: !161, size: 32, offset: 544)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !249, file: !250, line: 42, baseType: !161, size: 32, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !249, file: !250, line: 44, baseType: !66, size: 8, offset: 608)
!296 = !DISubprogram(name: "make_runnable", linkageName: "_ZN6Halide7Runtime8Internal4work13make_runnableEv", scope: !249, file: !250, line: 46, type: !297, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!66, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!300 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal4work7runningEv", scope: !249, file: !250, line: 62, type: !301, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!301 = !DISubroutineType(types: !302)
!302 = !{!66, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !250, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !307, identifier: "_ZTS23halide_semaphore_impl_t")
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !306, file: !250, line: 712, baseType: !161, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!310 = !{!0, !311, !314, !316, !321, !323, !361, !367, !373, !379, !386, !392, !398}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!312 = distinct !DIGlobalVariable(name: "lock_bit", scope: !32, file: !31, line: 250, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!315 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !32, file: !31, line: 251, type: !313, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13table_storageE", scope: !32, file: !31, line: 478, type: !318, isLocal: false, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 98304, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 12288)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!322 = distinct !DIGlobalVariable(name: "parked_bit", scope: !32, file: !31, line: 252, type: !313, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "_ZN6Halide7Runtime8Internal10work_queueE", scope: !33, file: !250, line: 166, type: !325, isLocal: false, isDefinition: true)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !33, file: !250, line: 94, size: 8640, flags: DIFlagTypePassByValue, elements: !326, identifier: "_ZTSN6Halide7Runtime8Internal12work_queue_tE")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !346, !347, !348, !349, !354, !357}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !325, file: !250, line: 96, baseType: !241, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !325, file: !250, line: 99, baseType: !161, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !325, file: !250, line: 103, baseType: !161, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !325, file: !250, line: 106, baseType: !248, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !325, file: !250, line: 109, baseType: !161, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !325, file: !250, line: 122, baseType: !335, size: 32, offset: 224)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !242, line: 125, size: 32, flags: DIFlagTypePassByValue, elements: !336, identifier: "_ZTS11halide_cond")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !335, file: !242, line: 126, baseType: !245, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !325, file: !250, line: 122, baseType: !335, size: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !325, file: !250, line: 122, baseType: !335, size: 32, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !325, file: !250, line: 129, baseType: !343, size: 8192, offset: 384)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8192, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 8576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 8584)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !325, file: !250, line: 139, baseType: !161, size: 32, offset: 8608)
!349 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t7runningEv", scope: !325, file: !250, line: 141, type: !350, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!66, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!354 = !DISubprogram(name: "assert_zeroed", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t13assert_zeroedEv", scope: !325, file: !250, line: 146, type: !355, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !352}
!357 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal12work_queue_t5resetEv", scope: !325, file: !250, line: 158, type: !358, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "_ZN6Halide7Runtime8Internal14custom_do_taskE", scope: !33, file: !250, line: 567, type: !363, isLocal: false, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !242, line: 259, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{!161, !15, !282, !161, !260}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "_ZN6Halide7Runtime8Internal19custom_do_loop_taskE", scope: !33, file: !250, line: 568, type: !369, isLocal: false, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !242, line: 268, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{!161, !15, !256, !161, !161, !260, !15}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "_ZN6Halide7Runtime8Internal17custom_do_par_forE", scope: !33, file: !250, line: 569, type: !375, isLocal: false, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !242, line: 167, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DISubroutineType(types: !378)
!378 = !{!161, !15, !282, !161, !161, !260}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "_ZN6Halide7Runtime8Internal24custom_do_parallel_tasksE", scope: !33, file: !250, line: 570, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !242, line: 281, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DISubroutineType(types: !384)
!384 = !{!161, !15, !161, !385, !15}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "_ZN6Halide7Runtime8Internal21custom_semaphore_initE", scope: !33, file: !250, line: 571, type: !388, isLocal: false, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !242, line: 184, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{!161, !273, !161}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "_ZN6Halide7Runtime8Internal28custom_semaphore_try_acquireE", scope: !33, file: !250, line: 572, type: !394, isLocal: false, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !242, line: 186, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!66, !273, !161}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "_ZN6Halide7Runtime8Internal24custom_semaphore_releaseE", scope: !33, file: !250, line: 573, type: !400, isLocal: false, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !242, line: 185, baseType: !389)
!401 = !{!402, !403, !405}
!402 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !33, file: !27, line: 225)
!403 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !404, file: !8, line: 7)
!404 = !DINamespace(name: "Qurt", scope: !33)
!405 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !33, file: !250, line: 579)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 14, baseType: !407)
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !{i32 7, !"Dwarf Version", i32 4}
!409 = !{i32 2, !"Debug Info Version", i32 3}
!410 = !{i32 1, !"wchar_size", i32 4}
!411 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!412 = distinct !DISubprogram(name: "halide_host_cpu_count", scope: !8, file: !8, line: 30, type: !413, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!413 = !DISubroutineType(types: !414)
!414 = !{!161}
!415 = !DILocation(line: 32, column: 5, scope: !412)
!416 = distinct !DISubprogram(name: "halide_set_default_thread_priority", scope: !8, file: !8, line: 39, type: !417, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !161}
!419 = !{!420}
!420 = !DILocalVariable(name: "priority", arg: 1, scope: !416, file: !8, line: 39, type: !161)
!421 = !DILocation(line: 0, scope: !416)
!422 = !DILocation(line: 40, column: 18, scope: !423)
!423 = distinct !DILexicalBlock(scope: !416, file: !8, line: 40, column: 9)
!424 = !DILocation(line: 40, column: 9, scope: !416)
!425 = !DILocation(line: 42, column: 25, scope: !426)
!426 = distinct !DILexicalBlock(scope: !423, file: !8, line: 42, column: 16)
!427 = !DILocation(line: 42, column: 16, scope: !423)
!428 = !DILocation(line: 45, column: 41, scope: !416)
!429 = !{!430, !430, i64 0}
!430 = !{!"short", !431, i64 0}
!431 = !{!"omnipotent char", !432, i64 0}
!432 = !{!"Simple C++ TBAA"}
!433 = !DILocation(line: 46, column: 1, scope: !416)
!434 = distinct !DISubprogram(name: "halide_get_default_thread_priority", scope: !8, file: !8, line: 48, type: !435, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!435 = !DISubroutineType(types: !436)
!436 = !{!406}
!437 = !DILocation(line: 49, column: 12, scope: !434)
!438 = !DILocation(line: 49, column: 5, scope: !434)
!439 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !8, file: !8, line: 52, type: !440, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!25, !12, !15}
!442 = !{!443, !444, !445, !446, !447}
!443 = !DILocalVariable(name: "f", arg: 1, scope: !439, file: !8, line: 52, type: !12)
!444 = !DILocalVariable(name: "closure", arg: 2, scope: !439, file: !8, line: 52, type: !15)
!445 = !DILocalVariable(name: "priority", scope: !439, file: !8, line: 53, type: !406)
!446 = !DILocalVariable(name: "t", scope: !439, file: !8, line: 54, type: !6)
!447 = !DILocalVariable(name: "thread_attr", scope: !439, file: !8, line: 59, type: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_attr_t", file: !23, line: 67, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qurt_thread_attr", file: !23, line: 52, size: 256, flags: DIFlagTypePassByValue, elements: !450, identifier: "_ZTS17_qurt_thread_attr")
!450 = !{!451, !455, !456, !457, !458, !459, !460, !461, !462}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !449, file: !23, line: 54, baseType: !452, size: 128)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 16)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tcb_partition", scope: !449, file: !23, line: 55, baseType: !262, size: 8, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "affinity", scope: !449, file: !23, line: 57, baseType: !262, size: 8, offset: 136)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !449, file: !23, line: 59, baseType: !407, size: 16, offset: 144)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "asid", scope: !449, file: !23, line: 60, baseType: !262, size: 8, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bus_priority", scope: !449, file: !23, line: 61, baseType: !262, size: 8, offset: 168)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "timetest_id", scope: !449, file: !23, line: 62, baseType: !407, size: 16, offset: 176)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !449, file: !23, line: 63, baseType: !24, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "stack_addr", scope: !449, file: !23, line: 64, baseType: !15, size: 32, offset: 224)
!463 = !DILocation(line: 0, scope: !439)
!464 = !DILocation(line: 53, column: 25, scope: !439)
!465 = !DILocation(line: 54, column: 43, scope: !439)
!466 = !DILocation(line: 55, column: 8, scope: !439)
!467 = !DILocation(line: 55, column: 10, scope: !439)
!468 = !{!469, !470, i64 0}
!469 = !{!"_ZTSN12_GLOBAL__N_114spawned_threadE", !470, i64 0, !470, i64 4, !470, i64 8, !471, i64 12}
!470 = !{!"any pointer", !431, i64 0}
!471 = !{!"_ZTS13halide_thread", !472, i64 0}
!472 = !{!"int", !431, i64 0}
!473 = !DILocation(line: 56, column: 8, scope: !439)
!474 = !DILocation(line: 56, column: 16, scope: !439)
!475 = !{!469, !470, i64 4}
!476 = !DILocation(line: 57, column: 16, scope: !439)
!477 = !DILocation(line: 57, column: 8, scope: !439)
!478 = !DILocation(line: 57, column: 14, scope: !439)
!479 = !{!469, !470, i64 8}
!480 = !DILocation(line: 58, column: 16, scope: !439)
!481 = !DILocation(line: 58, column: 5, scope: !439)
!482 = !DILocation(line: 59, column: 5, scope: !439)
!483 = !DILocation(line: 59, column: 24, scope: !439)
!484 = !DILocalVariable(name: "attr", arg: 1, scope: !485, file: !23, line: 96, type: !488)
!485 = distinct !DISubprogram(name: "qurt_thread_attr_init", linkageName: "_ZL21qurt_thread_attr_initP17_qurt_thread_attr", scope: !23, file: !23, line: 96, type: !486, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !489)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!489 = !{!484}
!490 = !DILocation(line: 0, scope: !485, inlinedAt: !491)
!491 = distinct !DILocation(line: 60, column: 5, scope: !439)
!492 = !DILocation(line: 98, column: 19, scope: !485, inlinedAt: !491)
!493 = !{!431, !431, i64 0}
!494 = !DILocation(line: 99, column: 11, scope: !485, inlinedAt: !491)
!495 = !DILocation(line: 99, column: 25, scope: !485, inlinedAt: !491)
!496 = !{!497, !431, i64 16}
!497 = !{!"_ZTS17_qurt_thread_attr", !431, i64 0, !431, i64 16, !431, i64 17, !430, i64 18, !431, i64 20, !431, i64 21, !430, i64 22, !472, i64 24, !470, i64 28}
!498 = !DILocation(line: 100, column: 11, scope: !485, inlinedAt: !491)
!499 = !DILocation(line: 101, column: 11, scope: !485, inlinedAt: !491)
!500 = !DILocation(line: 101, column: 16, scope: !485, inlinedAt: !491)
!501 = !{!497, !431, i64 20}
!502 = !DILocation(line: 102, column: 11, scope: !485, inlinedAt: !491)
!503 = !DILocation(line: 102, column: 20, scope: !485, inlinedAt: !491)
!504 = !{!497, !431, i64 17}
!505 = !DILocation(line: 103, column: 11, scope: !485, inlinedAt: !491)
!506 = !DILocation(line: 103, column: 24, scope: !485, inlinedAt: !491)
!507 = !{!497, !431, i64 21}
!508 = !DILocation(line: 104, column: 11, scope: !485, inlinedAt: !491)
!509 = !DILocation(line: 104, column: 23, scope: !485, inlinedAt: !491)
!510 = !{!497, !430, i64 22}
!511 = !DILocation(line: 105, column: 11, scope: !485, inlinedAt: !491)
!512 = !DILocation(line: 106, column: 11, scope: !485, inlinedAt: !491)
!513 = !DILocation(line: 61, column: 54, scope: !439)
!514 = !DILocalVariable(name: "attr", arg: 1, scope: !515, file: !23, line: 152, type: !488)
!515 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_addr", linkageName: "_ZL31qurt_thread_attr_set_stack_addrP17_qurt_thread_attrPv", scope: !23, file: !23, line: 152, type: !516, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !488, !15}
!518 = !{!514, !519}
!519 = !DILocalVariable(name: "stack_addr", arg: 2, scope: !515, file: !23, line: 152, type: !15)
!520 = !DILocation(line: 0, scope: !515, inlinedAt: !521)
!521 = distinct !DILocation(line: 61, column: 5, scope: !439)
!522 = !DILocation(line: 153, column: 22, scope: !515, inlinedAt: !521)
!523 = !{!497, !470, i64 28}
!524 = !DILocalVariable(name: "attr", arg: 1, scope: !525, file: !23, line: 127, type: !488)
!525 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_size", linkageName: "_ZL31qurt_thread_attr_set_stack_sizeP17_qurt_thread_attrj", scope: !23, file: !23, line: 127, type: !526, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !488, !24}
!528 = !{!524, !529}
!529 = !DILocalVariable(name: "stack_size", arg: 2, scope: !525, file: !23, line: 127, type: !24)
!530 = !DILocation(line: 0, scope: !525, inlinedAt: !531)
!531 = distinct !DILocation(line: 62, column: 5, scope: !439)
!532 = !DILocation(line: 128, column: 22, scope: !525, inlinedAt: !531)
!533 = !{!497, !472, i64 24}
!534 = !DILocalVariable(name: "attr", arg: 1, scope: !535, file: !23, line: 170, type: !488)
!535 = distinct !DISubprogram(name: "qurt_thread_attr_set_priority", linkageName: "_ZL29qurt_thread_attr_set_priorityP17_qurt_thread_attrt", scope: !23, file: !23, line: 170, type: !536, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !538)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !488, !407}
!538 = !{!534, !539}
!539 = !DILocalVariable(name: "priority", arg: 2, scope: !535, file: !23, line: 170, type: !407)
!540 = !DILocation(line: 0, scope: !535, inlinedAt: !541)
!541 = distinct !DILocation(line: 63, column: 5, scope: !439)
!542 = !DILocation(line: 171, column: 20, scope: !535, inlinedAt: !541)
!543 = !{!497, !430, i64 18}
!544 = !DILocation(line: 64, column: 35, scope: !439)
!545 = !DILocation(line: 64, column: 5, scope: !439)
!546 = !DILocation(line: 65, column: 12, scope: !439)
!547 = !DILocation(line: 66, column: 1, scope: !439)
!548 = !DILocation(line: 65, column: 5, scope: !439)
!549 = !DISubprogram(name: "malloc", scope: !27, file: !27, line: 87, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!550 = !DISubroutineType(types: !551)
!551 = !{!15, !24}
!552 = !DISubprogram(name: "memalign", scope: !8, file: !8, line: 28, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!553 = !DISubroutineType(types: !554)
!554 = !{!15, !24, !24}
!555 = !DISubprogram(name: "memset", scope: !27, file: !27, line: 96, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!556 = !DISubroutineType(types: !557)
!557 = !{!15, !15, !161, !24}
!558 = !DISubprogram(name: "qurt_thread_create", scope: !23, file: !23, line: 175, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!559 = !DISubroutineType(types: !560)
!560 = !{!161, !561, !562, !12, !15}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!563 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "_ZN12_GLOBAL__N_119spawn_thread_helperEPv", scope: !9, file: !8, line: 20, type: !13, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !564)
!564 = !{!565, !566}
!565 = !DILocalVariable(name: "arg", arg: 1, scope: !563, file: !8, line: 20, type: !15)
!566 = !DILocalVariable(name: "t", scope: !563, file: !8, line: 21, type: !6)
!567 = !DILocation(line: 0, scope: !563)
!568 = !DILocation(line: 22, column: 8, scope: !563)
!569 = !DILocation(line: 22, column: 13, scope: !563)
!570 = !DILocation(line: 22, column: 5, scope: !563)
!571 = !DILocation(line: 23, column: 1, scope: !563)
!572 = distinct !DISubprogram(name: "halide_join_thread", scope: !8, file: !8, line: 68, type: !573, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !575)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !25}
!575 = !{!576, !577, !578}
!576 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !572, file: !8, line: 68, type: !25)
!577 = !DILocalVariable(name: "t", scope: !572, file: !8, line: 69, type: !6)
!578 = !DILocalVariable(name: "ret", scope: !572, file: !8, line: 70, type: !161)
!579 = !DILocation(line: 0, scope: !572)
!580 = !DILocation(line: 70, column: 5, scope: !572)
!581 = !DILocation(line: 70, column: 9, scope: !572)
!582 = !{!472, !472, i64 0}
!583 = !DILocation(line: 71, column: 32, scope: !572)
!584 = !{!469, !472, i64 12}
!585 = !DILocation(line: 71, column: 5, scope: !572)
!586 = !DILocation(line: 72, column: 13, scope: !572)
!587 = !DILocation(line: 72, column: 5, scope: !572)
!588 = !DILocation(line: 73, column: 10, scope: !572)
!589 = !DILocation(line: 73, column: 5, scope: !572)
!590 = !DILocation(line: 74, column: 1, scope: !572)
!591 = !DISubprogram(name: "qurt_thread_join", scope: !23, file: !23, line: 194, type: !592, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!592 = !DISubroutineType(types: !593)
!593 = !{!161, !24, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!595 = !DISubprogram(name: "free", scope: !27, file: !27, line: 86, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!596 = distinct !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !31, line: 321, type: !113, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !112, retainedNodes: !597)
!597 = !{!598, !600, !612, !613, !617, !618, !619}
!598 = !DILocalVariable(name: "this", arg: 1, scope: !596, type: !599, flags: DIFlagArtificial | DIFlagObjectPointer)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!600 = !DILocalVariable(name: "spinner", scope: !596, file: !31, line: 322, type: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !32, file: !31, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !602, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization12spin_controlE")
!602 = !{!603, !604, !608, !611}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !601, file: !31, line: 231, baseType: !161, size: 32)
!604 = !DISubprogram(name: "spin_control", scope: !601, file: !31, line: 235, type: !605, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!608 = !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !601, file: !31, line: 237, type: !609, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!609 = !DISubroutineType(types: !610)
!610 = !{!66, !607}
!611 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control5resetEv", scope: !601, file: !31, line: 244, type: !605, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DILocalVariable(name: "expected", scope: !596, file: !31, line: 323, type: !26)
!613 = !DILocalVariable(name: "desired", scope: !614, file: !31, line: 328, type: !26)
!614 = distinct !DILexicalBlock(scope: !615, file: !31, line: 327, column: 37)
!615 = distinct !DILexicalBlock(scope: !616, file: !31, line: 327, column: 13)
!616 = distinct !DILexicalBlock(scope: !596, file: !31, line: 326, column: 18)
!617 = !DILocalVariable(name: "node", scope: !616, file: !31, line: 342, type: !30)
!618 = !DILocalVariable(name: "head", scope: !616, file: !31, line: 347, type: !29)
!619 = !DILocalVariable(name: "desired", scope: !616, file: !31, line: 359, type: !26)
!620 = !DILocation(line: 0, scope: !596)
!621 = !DILocation(line: 324, column: 26, scope: !596)
!622 = !DILocation(line: 324, column: 5, scope: !596)
!623 = !DILocation(line: 326, column: 5, scope: !596)
!624 = !DILocation(line: 327, column: 13, scope: !616)
!625 = !DILocation(line: 327, column: 24, scope: !615)
!626 = !DILocation(line: 327, column: 14, scope: !615)
!627 = !DILocation(line: 328, column: 42, scope: !614)
!628 = !DILocation(line: 0, scope: !614)
!629 = !DILocalVariable(name: "addr", arg: 1, scope: !630, file: !31, line: 126, type: !173)
!630 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_acquire_relaxedEPjS4_S4_", scope: !631, file: !31, line: 126, type: !632, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !634)
!631 = !DINamespace(scope: !32)
!632 = !DISubroutineType(types: !633)
!633 = !{!66, !173, !173, !173}
!634 = !{!629, !635, !636}
!635 = !DILocalVariable(name: "expected", arg: 2, scope: !630, file: !31, line: 126, type: !173)
!636 = !DILocalVariable(name: "desired", arg: 3, scope: !630, file: !31, line: 126, type: !173)
!637 = !DILocation(line: 0, scope: !630, inlinedAt: !638)
!638 = distinct !DILocation(line: 330, column: 17, scope: !639)
!639 = distinct !DILexicalBlock(scope: !614, file: !31, line: 330, column: 17)
!640 = !DILocalVariable(name: "addr", arg: 1, scope: !641, file: !31, line: 102, type: !561)
!641 = distinct !DISubprogram(name: "cas_strong_sequentially_consistent_helper<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_141cas_strong_sequentially_consistent_helperIjEEbPT_S6_S6_", scope: !631, file: !31, line: 102, type: !642, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !649, retainedNodes: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{!66, !561, !561, !561}
!644 = !{!640, !645, !646, !647, !648}
!645 = !DILocalVariable(name: "expected", arg: 2, scope: !641, file: !31, line: 102, type: !561)
!646 = !DILocalVariable(name: "desired", arg: 3, scope: !641, file: !31, line: 102, type: !561)
!647 = !DILocalVariable(name: "oldval", scope: !641, file: !31, line: 103, type: !24)
!648 = !DILocalVariable(name: "gotval", scope: !641, file: !31, line: 104, type: !24)
!649 = !{!650}
!650 = !DITemplateTypeParameter(name: "T", type: !24)
!651 = !DILocation(line: 0, scope: !641, inlinedAt: !652)
!652 = distinct !DILocation(line: 127, column: 12, scope: !630, inlinedAt: !638)
!653 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !652)
!654 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !652)
!655 = !DILocation(line: 336, column: 67, scope: !656)
!656 = distinct !DILexicalBlock(scope: !616, file: !31, line: 336, column: 13)
!657 = !DILocation(line: 336, column: 73, scope: !656)
!658 = !DILocalVariable(name: "this", arg: 1, scope: !659, type: !661, flags: DIFlagArtificial | DIFlagObjectPointer)
!659 = distinct !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !601, file: !31, line: 237, type: !609, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !608, retainedNodes: !660)
!660 = !{!658}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!662 = !DILocation(line: 0, scope: !659, inlinedAt: !663)
!663 = distinct !DILocation(line: 336, column: 84, scope: !656)
!664 = !DILocation(line: 241, column: 27, scope: !659, inlinedAt: !663)
!665 = !DILocation(line: 336, column: 13, scope: !616)
!666 = !DILocation(line: 239, column: 23, scope: !667, inlinedAt: !663)
!667 = distinct !DILexicalBlock(scope: !668, file: !31, line: 238, column: 29)
!668 = distinct !DILexicalBlock(scope: !659, file: !31, line: 238, column: 13)
!669 = !DILocation(line: 337, column: 13, scope: !670)
!670 = distinct !DILexicalBlock(scope: !656, file: !31, line: 336, column: 99)
!671 = !DILocation(line: 338, column: 13, scope: !670)
!672 = !DILocation(line: 339, column: 13, scope: !670)
!673 = !DILocation(line: 342, column: 9, scope: !616)
!674 = !DILocation(line: 342, column: 30, scope: !616)
!675 = !DILocalVariable(name: "this", arg: 1, scope: !676, type: !29, flags: DIFlagArtificial | DIFlagObjectPointer)
!676 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataC2Ev", scope: !30, file: !31, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !96, retainedNodes: !677)
!677 = !{!675}
!678 = !DILocation(line: 0, scope: !676, inlinedAt: !679)
!679 = distinct !DILocation(line: 342, column: 30, scope: !616)
!680 = !DILocalVariable(name: "this", arg: 1, scope: !681, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!681 = distinct !DISubprogram(name: "thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerC2Ev", scope: !38, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !84, retainedNodes: !682)
!682 = !{!680}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!684 = !DILocation(line: 0, scope: !681, inlinedAt: !685)
!685 = distinct !DILocation(line: 277, column: 19, scope: !676, inlinedAt: !679)
!686 = !DILocation(line: 87, column: 10, scope: !681, inlinedAt: !685)
!687 = !{!688, !689, i64 32}
!688 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE", !431, i64 0, !431, i64 16, !689, i64 32}
!689 = !{!"bool", !431, i64 0}
!690 = !DILocation(line: 95, column: 9, scope: !691, inlinedAt: !685)
!691 = distinct !DILexicalBlock(scope: !681, file: !8, line: 94, column: 35)
!692 = !DILocation(line: 96, column: 9, scope: !691, inlinedAt: !685)
!693 = !DILocation(line: 273, column: 27, scope: !676, inlinedAt: !679)
!694 = !{!695, !470, i64 40}
!695 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE", !688, i64 0, !470, i64 40, !470, i64 44, !470, i64 48}
!696 = !DILocation(line: 274, column: 27, scope: !676, inlinedAt: !679)
!697 = !{!695, !470, i64 44}
!698 = !DILocation(line: 275, column: 27, scope: !676, inlinedAt: !679)
!699 = !{!695, !470, i64 48}
!700 = !DILocalVariable(name: "this", arg: 1, scope: !701, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!701 = distinct !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !38, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !88, retainedNodes: !702)
!702 = !{!700}
!703 = !DILocation(line: 0, scope: !701, inlinedAt: !704)
!704 = distinct !DILocation(line: 344, column: 21, scope: !616)
!705 = !DILocation(line: 106, column: 21, scope: !701, inlinedAt: !704)
!706 = !DILocation(line: 347, column: 72, scope: !616)
!707 = !DILocation(line: 0, scope: !616)
!708 = !DILocation(line: 348, column: 18, scope: !709)
!709 = distinct !DILexicalBlock(scope: !616, file: !31, line: 348, column: 13)
!710 = !DILocation(line: 348, column: 13, scope: !616)
!711 = !DILocation(line: 349, column: 23, scope: !712)
!712 = distinct !DILexicalBlock(scope: !709, file: !31, line: 348, column: 30)
!713 = !DILocation(line: 351, column: 9, scope: !712)
!714 = !DILocation(line: 347, column: 38, scope: !616)
!715 = !DILocation(line: 356, column: 23, scope: !716)
!716 = distinct !DILexicalBlock(scope: !709, file: !31, line: 351, column: 16)
!717 = !DILocation(line: 359, column: 60, scope: !616)
!718 = !DILocation(line: 359, column: 48, scope: !616)
!719 = !DILocalVariable(name: "addr", arg: 1, scope: !720, file: !31, line: 113, type: !173)
!720 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_release_relaxedEPjS4_S4_", scope: !631, file: !31, line: 113, type: !632, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !721)
!721 = !{!719, !722, !723}
!722 = !DILocalVariable(name: "expected", arg: 2, scope: !720, file: !31, line: 113, type: !173)
!723 = !DILocalVariable(name: "desired", arg: 3, scope: !720, file: !31, line: 113, type: !173)
!724 = !DILocation(line: 0, scope: !720, inlinedAt: !725)
!725 = distinct !DILocation(line: 360, column: 13, scope: !726)
!726 = distinct !DILexicalBlock(scope: !616, file: !31, line: 360, column: 13)
!727 = !DILocation(line: 0, scope: !641, inlinedAt: !728)
!728 = distinct !DILocation(line: 114, column: 12, scope: !720, inlinedAt: !725)
!729 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !728)
!730 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !728)
!731 = !DILocation(line: 360, column: 13, scope: !616)
!732 = !DILocalVariable(name: "this", arg: 1, scope: !733, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!733 = distinct !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !38, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !89, retainedNodes: !734)
!734 = !{!732}
!735 = !DILocation(line: 0, scope: !733, inlinedAt: !736)
!736 = distinct !DILocation(line: 361, column: 25, scope: !737)
!737 = distinct !DILexicalBlock(scope: !726, file: !31, line: 360, column: 75)
!738 = !DILocation(line: 110, column: 9, scope: !733, inlinedAt: !736)
!739 = !DILocation(line: 111, column: 16, scope: !733, inlinedAt: !736)
!740 = !{i8 0, i8 2}
!741 = !DILocation(line: 111, column: 9, scope: !733, inlinedAt: !736)
!742 = !DILocation(line: 112, column: 13, scope: !743, inlinedAt: !736)
!743 = distinct !DILexicalBlock(scope: !733, file: !8, line: 111, column: 29)
!744 = distinct !{!744, !741, !745, !746}
!745 = !DILocation(line: 113, column: 9, scope: !733, inlinedAt: !736)
!746 = !{!"llvm.loop.mustprogress"}
!747 = !DILocation(line: 114, column: 9, scope: !733, inlinedAt: !736)
!748 = !DILocation(line: 363, column: 13, scope: !737)
!749 = !DILocation(line: 364, column: 9, scope: !737)
!750 = !DILocation(line: 0, scope: !726)
!751 = !DILocalVariable(name: "this", arg: 1, scope: !752, type: !29, flags: DIFlagArtificial | DIFlagObjectPointer)
!752 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataD2Ev", scope: !30, file: !31, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !100, retainedNodes: !753)
!753 = !{!751}
!754 = !DILocation(line: 0, scope: !752, inlinedAt: !755)
!755 = distinct !DILocation(line: 365, column: 5, scope: !596)
!756 = !DILocalVariable(name: "this", arg: 1, scope: !757, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!757 = distinct !DISubprogram(name: "~thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerD2Ev", scope: !38, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !87, retainedNodes: !758)
!758 = !{!756}
!759 = !DILocation(line: 0, scope: !757, inlinedAt: !760)
!760 = distinct !DILocation(line: 280, column: 51, scope: !761, inlinedAt: !755)
!761 = distinct !DILexicalBlock(scope: !752, file: !31, line: 280, column: 51)
!762 = !DILocation(line: 101, column: 9, scope: !763, inlinedAt: !760)
!763 = distinct !DILexicalBlock(scope: !757, file: !8, line: 100, column: 36)
!764 = !DILocation(line: 102, column: 9, scope: !763, inlinedAt: !760)
!765 = !DILocation(line: 365, column: 5, scope: !596)
!766 = distinct !{!766, !623, !765}
!767 = !DILocation(line: 366, column: 1, scope: !596)
!768 = !DISubprogram(name: "halide_thread_yield", scope: !27, file: !27, line: 190, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!769 = !DISubroutineType(types: !770)
!770 = !{null}
!771 = distinct !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !31, line: 368, type: !113, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !116, retainedNodes: !772)
!772 = !{!773, !774, !775, !777, !778, !779, !781, !782, !783, !784, !786, !789, !790, !793}
!773 = !DILocalVariable(name: "this", arg: 1, scope: !771, type: !599, flags: DIFlagArtificial | DIFlagObjectPointer)
!774 = !DILocalVariable(name: "expected", scope: !771, file: !31, line: 369, type: !26)
!775 = !DILocalVariable(name: "thread_queuing", scope: !776, file: !31, line: 375, type: !66)
!776 = distinct !DILexicalBlock(scope: !771, file: !31, line: 372, column: 18)
!777 = !DILocalVariable(name: "none_queued", scope: !776, file: !31, line: 377, type: !66)
!778 = !DILocalVariable(name: "desired", scope: !776, file: !31, line: 382, type: !26)
!779 = !DILocalVariable(name: "head", scope: !780, file: !31, line: 389, type: !29)
!780 = distinct !DILexicalBlock(scope: !771, file: !31, line: 388, column: 18)
!781 = !DILocalVariable(name: "current", scope: !780, file: !31, line: 390, type: !29)
!782 = !DILocalVariable(name: "tail", scope: !780, file: !31, line: 391, type: !29)
!783 = !DILocalVariable(name: "times_through", scope: !780, file: !31, line: 392, type: !161)
!784 = !DILocalVariable(name: "next", scope: !785, file: !31, line: 394, type: !29)
!785 = distinct !DILexicalBlock(scope: !780, file: !31, line: 393, column: 33)
!786 = !DILocalVariable(name: "desired", scope: !787, file: !31, line: 406, type: !26)
!787 = distinct !DILexicalBlock(scope: !788, file: !31, line: 405, column: 34)
!788 = distinct !DILexicalBlock(scope: !780, file: !31, line: 405, column: 13)
!789 = !DILocalVariable(name: "new_tail", scope: !780, file: !31, line: 414, type: !29)
!790 = !DILocalVariable(name: "continue_outer", scope: !791, file: !31, line: 416, type: !66)
!791 = distinct !DILexicalBlock(scope: !792, file: !31, line: 415, column: 34)
!792 = distinct !DILexicalBlock(scope: !780, file: !31, line: 415, column: 13)
!793 = !DILocalVariable(name: "desired", scope: !794, file: !31, line: 418, type: !26)
!794 = distinct !DILexicalBlock(scope: !791, file: !31, line: 417, column: 37)
!795 = !DILocation(line: 0, scope: !771)
!796 = !DILocation(line: 370, column: 26, scope: !771)
!797 = !DILocation(line: 370, column: 5, scope: !771)
!798 = !DILocalVariable(name: "addr", arg: 1, scope: !799, file: !31, line: 135, type: !561)
!799 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_119atomic_load_relaxedIjEEvPT_S6_", scope: !631, file: !31, line: 135, type: !800, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !649, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !561, !561}
!802 = !{!798, !803}
!803 = !DILocalVariable(name: "val", arg: 2, scope: !799, file: !31, line: 135, type: !561)
!804 = !DILocation(line: 0, scope: !799, inlinedAt: !805)
!805 = distinct !DILocation(line: 370, column: 5, scope: !771)
!806 = !DILocation(line: 372, column: 5, scope: !771)
!807 = !DILocation(line: 136, column: 10, scope: !799, inlinedAt: !805)
!808 = !DILocation(line: 375, column: 41, scope: !776)
!809 = !DILocation(line: 375, column: 31, scope: !776)
!810 = !DILocation(line: 0, scope: !776)
!811 = !DILocation(line: 378, column: 28, scope: !812)
!812 = distinct !DILexicalBlock(scope: !776, file: !31, line: 378, column: 13)
!813 = !DILocation(line: 382, column: 38, scope: !776)
!814 = !DILocation(line: 0, scope: !630, inlinedAt: !815)
!815 = distinct !DILocation(line: 383, column: 13, scope: !816)
!816 = distinct !DILexicalBlock(scope: !776, file: !31, line: 383, column: 13)
!817 = !DILocation(line: 0, scope: !641, inlinedAt: !818)
!818 = distinct !DILocation(line: 127, column: 12, scope: !630, inlinedAt: !815)
!819 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !818)
!820 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !818)
!821 = !DILocation(line: 389, column: 72, scope: !780)
!822 = !DILocation(line: 389, column: 38, scope: !780)
!823 = !DILocation(line: 0, scope: !780)
!824 = !DILocation(line: 391, column: 47, scope: !780)
!825 = !DILocation(line: 393, column: 21, scope: !780)
!826 = !DILocation(line: 393, column: 9, scope: !780)
!827 = !DILocation(line: 394, column: 51, scope: !785)
!828 = !DILocation(line: 0, scope: !785)
!829 = !DILocation(line: 395, column: 13, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !31, line: 395, column: 13)
!831 = distinct !DILexicalBlock(scope: !785, file: !31, line: 395, column: 13)
!832 = !DILocation(line: 395, column: 13, scope: !831)
!833 = !DILocation(line: 395, column: 13, scope: !834)
!834 = distinct !DILexicalBlock(scope: !830, file: !31, line: 395, column: 13)
!835 = !DILocation(line: 396, column: 19, scope: !785)
!836 = !DILocation(line: 396, column: 24, scope: !785)
!837 = !DILocation(line: 398, column: 29, scope: !785)
!838 = distinct !{!838, !826, !839, !746}
!839 = !DILocation(line: 400, column: 9, scope: !780)
!840 = !DILocation(line: 401, column: 20, scope: !780)
!841 = !DILocation(line: 405, column: 22, scope: !788)
!842 = !DILocation(line: 405, column: 13, scope: !788)
!843 = !DILocation(line: 405, column: 13, scope: !780)
!844 = !DILocation(line: 406, column: 42, scope: !787)
!845 = !DILocation(line: 0, scope: !787)
!846 = !DILocalVariable(name: "addr", arg: 1, scope: !847, file: !31, line: 118, type: !561)
!847 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned int>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_130atomic_cas_weak_relacq_relaxedIjEEbPT_S6_S6_", scope: !631, file: !31, line: 118, type: !642, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !649, retainedNodes: !848)
!848 = !{!846, !849, !850}
!849 = !DILocalVariable(name: "expected", arg: 2, scope: !847, file: !31, line: 118, type: !561)
!850 = !DILocalVariable(name: "desired", arg: 3, scope: !847, file: !31, line: 118, type: !561)
!851 = !DILocation(line: 0, scope: !847, inlinedAt: !852)
!852 = distinct !DILocation(line: 407, column: 17, scope: !853)
!853 = distinct !DILexicalBlock(scope: !787, file: !31, line: 407, column: 17)
!854 = !DILocation(line: 0, scope: !641, inlinedAt: !855)
!855 = distinct !DILocation(line: 119, column: 12, scope: !847, inlinedAt: !852)
!856 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !855)
!857 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !855)
!858 = !DILocation(line: 407, column: 17, scope: !787)
!859 = distinct !{!859, !860, !861}
!860 = !DILocation(line: 388, column: 5, scope: !771)
!861 = !DILocation(line: 445, column: 5, scope: !771)
!862 = !DILocation(line: 414, column: 48, scope: !780)
!863 = !DILocation(line: 415, column: 22, scope: !792)
!864 = !DILocation(line: 415, column: 13, scope: !780)
!865 = !DILocation(line: 418, column: 46, scope: !794)
!866 = !DILocation(line: 0, scope: !794)
!867 = !DILocation(line: 0, scope: !847, inlinedAt: !868)
!868 = distinct !DILocation(line: 419, column: 21, scope: !869)
!869 = distinct !DILexicalBlock(scope: !794, file: !31, line: 419, column: 21)
!870 = !DILocation(line: 0, scope: !641, inlinedAt: !871)
!871 = distinct !DILocation(line: 119, column: 12, scope: !847, inlinedAt: !868)
!872 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !871)
!873 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !871)
!874 = !DILocation(line: 419, column: 21, scope: !794)
!875 = !DILocation(line: 422, column: 74, scope: !876)
!876 = distinct !DILexicalBlock(scope: !794, file: !31, line: 422, column: 21)
!877 = !DILocation(line: 422, column: 21, scope: !794)
!878 = distinct !{!878, !879, !880, !746}
!879 = !DILocation(line: 417, column: 13, scope: !791)
!880 = !DILocation(line: 428, column: 13, scope: !791)
!881 = !DILocation(line: 434, column: 24, scope: !882)
!882 = distinct !DILexicalBlock(scope: !792, file: !31, line: 433, column: 16)
!883 = !DILocalVariable(name: "addr", arg: 1, scope: !884, file: !31, line: 92, type: !173)
!884 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_124atomic_and_fetch_releaseEPjj", scope: !631, file: !31, line: 92, type: !885, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{!26, !173, !26}
!887 = !{!883, !888}
!888 = !DILocalVariable(name: "val", arg: 2, scope: !884, file: !31, line: 92, type: !26)
!889 = !DILocation(line: 0, scope: !884, inlinedAt: !890)
!890 = distinct !DILocation(line: 435, column: 13, scope: !882)
!891 = !DILocation(line: 93, column: 12, scope: !884, inlinedAt: !890)
!892 = !DILocalVariable(name: "this", arg: 1, scope: !893, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!893 = distinct !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !38, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !90, retainedNodes: !894)
!894 = !{!892}
!895 = !DILocation(line: 0, scope: !893, inlinedAt: !896)
!896 = distinct !DILocation(line: 441, column: 22, scope: !780)
!897 = !DILocation(line: 118, column: 26, scope: !893, inlinedAt: !896)
!898 = !DILocation(line: 118, column: 9, scope: !893, inlinedAt: !896)
!899 = !DILocalVariable(name: "this", arg: 1, scope: !900, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!900 = distinct !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !38, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !91, retainedNodes: !901)
!901 = !{!899}
!902 = !DILocation(line: 0, scope: !900, inlinedAt: !903)
!903 = distinct !DILocation(line: 442, column: 22, scope: !780)
!904 = !DILocation(line: 122, column: 9, scope: !900, inlinedAt: !903)
!905 = !DILocation(line: 122, column: 21, scope: !900, inlinedAt: !903)
!906 = !DILocation(line: 123, column: 27, scope: !900, inlinedAt: !903)
!907 = !DILocation(line: 123, column: 9, scope: !900, inlinedAt: !903)
!908 = !DILocalVariable(name: "this", arg: 1, scope: !909, type: !683, flags: DIFlagArtificial | DIFlagObjectPointer)
!909 = distinct !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !38, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !92, retainedNodes: !910)
!910 = !{!908}
!911 = !DILocation(line: 0, scope: !909, inlinedAt: !912)
!912 = distinct !DILocation(line: 443, column: 22, scope: !780)
!913 = !DILocation(line: 127, column: 9, scope: !909, inlinedAt: !912)
!914 = !DILocation(line: 444, column: 9, scope: !780)
!915 = !DILocation(line: 0, scope: !791)
!916 = !DILocation(line: 446, column: 1, scope: !771)
!917 = !DISubprogram(name: "halide_print", scope: !242, file: !242, line: 97, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !15, !265}
!920 = !DISubprogram(name: "abort", scope: !27, file: !27, line: 108, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!921 = distinct !DISubprogram(name: "lock_bucket", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization11lock_bucketEj", scope: !32, file: !31, line: 509, type: !922, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !925)
!922 = !DISubroutineType(types: !923)
!923 = !{!924, !26}
!924 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !106, size: 32)
!925 = !{!926, !927, !928}
!926 = !DILocalVariable(name: "addr", arg: 1, scope: !921, file: !31, line: 509, type: !26)
!927 = !DILocalVariable(name: "hash", scope: !921, file: !31, line: 510, type: !26)
!928 = !DILocalVariable(name: "bucket", scope: !921, file: !31, line: 515, type: !924)
!929 = !DILocation(line: 0, scope: !921)
!930 = !DILocalVariable(name: "addr", arg: 1, scope: !931, file: !31, line: 499, type: !26)
!931 = distinct !DISubprogram(name: "addr_hash", linkageName: "_ZN6Halide7Runtime8Internal15SynchronizationL9addr_hashEjj", scope: !32, file: !31, line: 499, type: !932, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !934)
!932 = !DISubroutineType(types: !933)
!933 = !{!26, !26, !28}
!934 = !{!930, !935}
!935 = !DILocalVariable(name: "bits", arg: 2, scope: !931, file: !31, line: 499, type: !28)
!936 = !DILocation(line: 0, scope: !931, inlinedAt: !937)
!937 = distinct !DILocation(line: 510, column: 22, scope: !921)
!938 = !DILocation(line: 505, column: 22, scope: !939, inlinedAt: !937)
!939 = distinct !DILexicalBlock(scope: !940, file: !31, line: 504, column: 12)
!940 = distinct !DILexicalBlock(scope: !931, file: !31, line: 502, column: 9)
!941 = !DILocation(line: 505, column: 47, scope: !939, inlinedAt: !937)
!942 = !DILocation(line: 515, column: 27, scope: !921)
!943 = !DILocalVariable(name: "this", arg: 1, scope: !944, type: !599, flags: DIFlagArtificial | DIFlagObjectPointer)
!944 = distinct !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !31, line: 291, type: !113, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !118, retainedNodes: !945)
!945 = !{!943, !946, !947}
!946 = !DILocalVariable(name: "expected", scope: !944, file: !31, line: 294, type: !26)
!947 = !DILocalVariable(name: "desired", scope: !944, file: !31, line: 295, type: !26)
!948 = !DILocation(line: 0, scope: !944, inlinedAt: !949)
!949 = distinct !DILocation(line: 517, column: 18, scope: !921)
!950 = !DILocation(line: 297, column: 47, scope: !951, inlinedAt: !949)
!951 = distinct !DILexicalBlock(scope: !944, file: !31, line: 297, column: 13)
!952 = !DILocation(line: 0, scope: !630, inlinedAt: !953)
!953 = distinct !DILocation(line: 297, column: 14, scope: !951, inlinedAt: !949)
!954 = !DILocation(line: 0, scope: !641, inlinedAt: !955)
!955 = distinct !DILocation(line: 127, column: 12, scope: !630, inlinedAt: !953)
!956 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !955)
!957 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !955)
!958 = !DILocation(line: 297, column: 13, scope: !944, inlinedAt: !949)
!959 = !DILocation(line: 517, column: 12, scope: !921)
!960 = !DILocation(line: 298, column: 13, scope: !961, inlinedAt: !949)
!961 = distinct !DILexicalBlock(scope: !951, file: !31, line: 297, column: 76)
!962 = !DILocation(line: 299, column: 9, scope: !961, inlinedAt: !949)
!963 = !DILocation(line: 519, column: 5, scope: !921)
!964 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization16lock_bucket_pairEjj", scope: !32, file: !31, line: 531, type: !965, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !975)
!965 = !DISubroutineType(types: !966)
!966 = !{!967, !26, !26}
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !32, file: !31, line: 522, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !968, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11bucket_pairE")
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !967, file: !31, line: 523, baseType: !924, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !967, file: !31, line: 524, baseType: !924, size: 32, offset: 32)
!971 = !DISubprogram(name: "bucket_pair", scope: !967, file: !31, line: 526, type: !972, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !974, !924, !924}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!975 = !{!976, !977, !978, !979, !980, !983, !986, !987, !989}
!976 = !DILocalVariable(name: "addr_from", arg: 1, scope: !964, file: !31, line: 531, type: !26)
!977 = !DILocalVariable(name: "addr_to", arg: 2, scope: !964, file: !31, line: 531, type: !26)
!978 = !DILocalVariable(name: "hash_from", scope: !964, file: !31, line: 533, type: !26)
!979 = !DILocalVariable(name: "hash_to", scope: !964, file: !31, line: 534, type: !26)
!980 = !DILocalVariable(name: "first", scope: !981, file: !31, line: 542, type: !924)
!981 = distinct !DILexicalBlock(scope: !982, file: !31, line: 541, column: 31)
!982 = distinct !DILexicalBlock(scope: !964, file: !31, line: 541, column: 9)
!983 = !DILocalVariable(name: "first", scope: !984, file: !31, line: 546, type: !924)
!984 = distinct !DILexicalBlock(scope: !985, file: !31, line: 545, column: 37)
!985 = distinct !DILexicalBlock(scope: !982, file: !31, line: 545, column: 16)
!986 = !DILocalVariable(name: "second", scope: !984, file: !31, line: 547, type: !924)
!987 = !DILocalVariable(name: "first", scope: !988, file: !31, line: 552, type: !924)
!988 = distinct !DILexicalBlock(scope: !985, file: !31, line: 551, column: 12)
!989 = !DILocalVariable(name: "second", scope: !988, file: !31, line: 553, type: !924)
!990 = !DILocation(line: 0, scope: !964)
!991 = !DILocation(line: 0, scope: !931, inlinedAt: !992)
!992 = distinct !DILocation(line: 533, column: 27, scope: !964)
!993 = !DILocation(line: 505, column: 22, scope: !939, inlinedAt: !992)
!994 = !DILocation(line: 505, column: 47, scope: !939, inlinedAt: !992)
!995 = !DILocation(line: 0, scope: !931, inlinedAt: !996)
!996 = distinct !DILocation(line: 534, column: 25, scope: !964)
!997 = !DILocation(line: 505, column: 22, scope: !939, inlinedAt: !996)
!998 = !DILocation(line: 505, column: 47, scope: !939, inlinedAt: !996)
!999 = !DILocation(line: 541, column: 19, scope: !982)
!1000 = !DILocation(line: 541, column: 9, scope: !964)
!1001 = !DILocation(line: 542, column: 30, scope: !981)
!1002 = !DILocation(line: 0, scope: !981)
!1003 = !DILocation(line: 0, scope: !944, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 543, column: 21, scope: !981)
!1005 = !DILocation(line: 297, column: 47, scope: !951, inlinedAt: !1004)
!1006 = !DILocation(line: 0, scope: !630, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 297, column: 14, scope: !951, inlinedAt: !1004)
!1008 = !DILocation(line: 0, scope: !641, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 127, column: 12, scope: !630, inlinedAt: !1007)
!1010 = !DILocation(line: 104, column: 16, scope: !641, inlinedAt: !1009)
!1011 = !DILocation(line: 106, column: 19, scope: !641, inlinedAt: !1009)
!1012 = !DILocation(line: 297, column: 13, scope: !944, inlinedAt: !1004)
!1013 = !DILocation(line: 543, column: 15, scope: !981)
!1014 = !DILocation(line: 298, column: 13, scope: !961, inlinedAt: !1004)
!1015 = !DILocation(line: 299, column: 9, scope: !961, inlinedAt: !1004)
!1016 = !DILocation(line: 545, column: 26, scope: !985)
!1017 = !DILocation(line: 545, column: 16, scope: !982)
!1018 = !DILocation(line: 546, column: 30, scope: !984)
!1019 = !DILocation(line: 0, scope: !984)
!1020 = !DILocation(line: 547, column: 31, scope: !984)
!1021 = !DILocation(line: 0, scope: !944, inlinedAt: !1022)
!1022 = distinct !DILocation(line: 548, column: 21, scope: !984)
!1023 = !DILocation(line: 297, column: 47, scope: !951, inlinedAt: !1022)
!1024 = !DILocation(line: 0, scope: !630, inlinedAt: !1025)
