; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_profiler.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_profiler.cpp"
target datalayout = "e-m:x-p:32:32-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:32-n8:16:32-a:0:32-S32"
target triple = "i386-unknown-windows-msvc19.11.0"

%struct.halide_profiler_state = type { %struct.halide_mutex, i32, i32, i32, i32, %struct.halide_profiler_pipeline_stats*, void (i32*, i32*)*, %struct.halide_thread* }
%struct.halide_mutex = type { [1 x i32] }
%struct.halide_profiler_pipeline_stats = type { i64, i64, i64, i64, i64, i64, i8*, %struct.halide_profiler_func_stats*, i8*, i32, i32, i32, i32, i32 }
%struct.halide_profiler_func_stats = type { i64, i64, i64, i64, i64, i64, i64, i8*, i32 }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type { i8*, i8*, i8*, i8*, i8, [1 x i8] }

$"??_C@_0HC@NOIAIGCC@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0HC@MJAJLJCF@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0GM@GJMNAOKK@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0HM@KEKFGDCE@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0HC@PMOKBCNB@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any

$"??_C@_0GM@CDNILHME@?1media?1maaz?1Data?1Repos?1rake?1Hali@" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s", scope: !2, file: !3, line: 12, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "halide_profiler_get_state", scope: !3, file: !3, line: 11, type: !4, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !98)
!3 = !DIFile(filename: "src/runtime/profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "900600451b4b8bae854b3e4a030fb5c9")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_state", file: !8, line: 1766, size: 256, flags: DIFlagTypePassByValue, elements: !9, identifier: ".?AUhalide_profiler_state@@")
!8 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!9 = !{!10, !21, !23, !24, !25, !26, !62, !67}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !7, file: !8, line: 1770, baseType: !11, size: 32)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !8, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !12, identifier: ".?AUhalide_mutex@@")
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !11, file: !8, line: 121, baseType: !14, size: 32)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, elements: !19)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 68, baseType: !17)
!16 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "0c7b3d8a4f3a5581b3edea53998e0f01")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 12, baseType: !18)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20}
!20 = !DISubrange(count: 1)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_time", scope: !7, file: !8, line: 1774, baseType: !22, size: 32, offset: 32)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "first_free_id", scope: !7, file: !8, line: 1777, baseType: !22, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "current_func", scope: !7, file: !8, line: 1781, baseType: !22, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads", scope: !7, file: !8, line: 1784, baseType: !22, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pipelines", scope: !7, file: !8, line: 1787, baseType: !27, size: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_pipeline_stats", file: !8, line: 1721, size: 640, flags: DIFlagTypePassByValue, elements: !29, identifier: ".?AUhalide_profiler_pipeline_stats@@")
!29 = !{!30, !33, !34, !35, !36, !37, !38, !42, !55, !57, !58, !59, !60, !61}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !28, file: !8, line: 1723, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 10, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !28, file: !8, line: 1726, baseType: !31, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !28, file: !8, line: 1729, baseType: !31, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !28, file: !8, line: 1732, baseType: !31, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !28, file: !8, line: 1736, baseType: !31, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !28, file: !8, line: 1736, baseType: !31, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !8, line: 1739, baseType: !39, size: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !28, file: !8, line: 1742, baseType: !43, size: 32, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_func_stats", file: !8, line: 1693, size: 512, flags: DIFlagTypePassByValue, elements: !45, identifier: ".?AUhalide_profiler_func_stats@@")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !44, file: !8, line: 1695, baseType: !31, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !44, file: !8, line: 1698, baseType: !31, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !44, file: !8, line: 1701, baseType: !31, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !44, file: !8, line: 1704, baseType: !31, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "stack_peak", scope: !44, file: !8, line: 1707, baseType: !31, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !44, file: !8, line: 1710, baseType: !31, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !44, file: !8, line: 1710, baseType: !31, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !8, line: 1713, baseType: !39, size: 32, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !44, file: !8, line: 1716, baseType: !22, size: 32, offset: 480)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !8, line: 1746, baseType: !56, size: 32, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "num_funcs", scope: !28, file: !8, line: 1749, baseType: !22, size: 32, offset: 480)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "first_func_id", scope: !28, file: !8, line: 1752, baseType: !22, size: 32, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "runs", scope: !28, file: !8, line: 1755, baseType: !22, size: 32, offset: 544)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !28, file: !8, line: 1758, baseType: !22, size: 32, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !28, file: !8, line: 1761, baseType: !22, size: 32, offset: 608)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "get_remote_profiler_state", scope: !7, file: !8, line: 1792, baseType: !63, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_thread", scope: !7, file: !8, line: 1795, baseType: !68, size: 32, offset: 224)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AUhalide_thread@@")
!70 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !71, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72, retainedTypes: !86, globals: !88, imports: !93, nameTableKind: None)
!71 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "3382dfd7821992c2e028aabed8bd4d40")
!72 = !{!73, !77}
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 1799, baseType: !22, size: 32, elements: !74, identifier: ".?AW4<unnamed-enum-halide_profiler_outside_of_halide>@@")
!74 = !{!75, !76}
!75 = !DIEnumerator(name: "halide_profiler_outside_of_halide", value: -1)
!76 = !DIEnumerator(name: "halide_profiler_please_stop", value: -2)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !8, line: 403, baseType: !78, size: 8, elements: !80, identifier: ".?AW4halide_type_code_t@@")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 16, baseType: !79)
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!86 = !{!27, !43, !39, !6, !87, !31}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!88 = !{!0, !89, !91}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression(DW_OP_constu, 18446744073709551614, DW_OP_stack_value))
!90 = distinct !DIGlobalVariable(name: "halide_profiler_please_stop", scope: !70, file: !8, line: 1805, type: !73, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!92 = distinct !DIGlobalVariable(name: "halide_profiler_outside_of_halide", scope: !70, file: !8, line: 1801, type: !73, isLocal: true, isDefinition: true)
!93 = !{!94}
!94 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !70, entity: !95, file: !16, line: 225)
!95 = !DINamespace(name: "Internal", scope: !96)
!96 = !DINamespace(name: "Runtime", scope: !97)
!97 = !DINamespace(name: "Halide", scope: null)
!98 = !{}
!99 = !{i32 1, !"NumRegisterParameters", i32 0}
!100 = !{i32 2, !"CodeView", i32 1}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{i32 1, !"wchar_size", i32 2}
!103 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!104 = !DILocation(line: 13, scope: !2)
!105 = distinct !DISubprogram(name: "find_or_create_pipeline", linkageName: "?find_or_create_pipeline@Internal@Runtime@Halide@@YAPAUhalide_profiler_pipeline_stats@@PBDHPB_K@Z", scope: !95, file: !3, line: 21, type: !106, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !110)
!106 = !DISubroutineType(types: !107)
!107 = !{!27, !39, !22, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!110 = !{!111, !112, !113, !114, !115, !117, !118}
!111 = !DILocalVariable(name: "func_names", arg: 3, scope: !105, file: !3, line: 21, type: !108)
!112 = !DILocalVariable(name: "num_funcs", arg: 2, scope: !105, file: !3, line: 21, type: !22)
!113 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !105, file: !3, line: 21, type: !39)
!114 = !DILocalVariable(name: "s", scope: !105, file: !3, line: 22, type: !6)
!115 = !DILocalVariable(name: "p", scope: !116, file: !3, line: 24, type: !27)
!116 = distinct !DILexicalBlock(scope: !105, file: !3, line: 24)
!117 = !DILocalVariable(name: "p", scope: !105, file: !3, line: 34, type: !27)
!118 = !DILocalVariable(name: "i", scope: !119, file: !3, line: 57, type: !22)
!119 = distinct !DILexicalBlock(scope: !105, file: !3, line: 57)
!120 = !DILocation(line: 0, scope: !105)
!121 = !DILocation(line: 22, scope: !105)
!122 = !DILocation(line: 24, scope: !116)
!123 = !DILocation(line: 0, scope: !116)
!124 = !{!125, !125, i64 0}
!125 = !{!"any pointer", !126, i64 0}
!126 = !{!"omnipotent char", !127, i64 0}
!127 = !{!"Simple C++ TBAA"}
!128 = !DILocation(line: 28, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 25)
!130 = distinct !DILexicalBlock(scope: !116, file: !3, line: 24)
!131 = !{!132, !125, i64 48}
!132 = !{!"?AUhalide_profiler_pipeline_stats@@", !133, i64 0, !133, i64 8, !133, i64 16, !133, i64 24, !133, i64 32, !133, i64 40, !125, i64 48, !125, i64 52, !125, i64 56, !134, i64 60, !134, i64 64, !134, i64 68, !134, i64 72, !134, i64 76}
!133 = !{!"long long", !126, i64 0}
!134 = !{!"int", !126, i64 0}
!135 = !{!132, !134, i64 60}
!136 = !DILocation(line: 25, scope: !130)
!137 = distinct !{!137, !122, !138, !139}
!138 = !DILocation(line: 32, scope: !116)
!139 = !{!"llvm.loop.mustprogress"}
!140 = !DILocation(line: 34, scope: !105)
!141 = !DILocation(line: 36, scope: !105)
!142 = !DILocation(line: 39, scope: !105)
!143 = !{!144, !125, i64 20}
!144 = !{!"?AUhalide_profiler_state@@", !145, i64 0, !134, i64 4, !134, i64 8, !134, i64 12, !134, i64 16, !125, i64 20, !125, i64 24, !125, i64 28}
!145 = !{!"?AUhalide_mutex@@", !126, i64 0}
!146 = !{!132, !125, i64 56}
!147 = !DILocation(line: 40, scope: !105)
!148 = !DILocation(line: 41, scope: !105)
!149 = !{!144, !134, i64 8}
!150 = !{!132, !134, i64 64}
!151 = !DILocation(line: 42, scope: !105)
!152 = !DILocation(line: 43, scope: !105)
!153 = !{!132, !134, i64 68}
!154 = !DILocation(line: 44, scope: !105)
!155 = !{!132, !133, i64 0}
!156 = !DILocation(line: 45, scope: !105)
!157 = !{!132, !134, i64 72}
!158 = !DILocation(line: 46, scope: !105)
!159 = !{!132, !133, i64 8}
!160 = !DILocation(line: 47, scope: !105)
!161 = !{!132, !133, i64 16}
!162 = !DILocation(line: 48, scope: !105)
!163 = !{!132, !133, i64 24}
!164 = !DILocation(line: 49, scope: !105)
!165 = !{!132, !134, i64 76}
!166 = !DILocation(line: 50, scope: !105)
!167 = !{!132, !133, i64 32}
!168 = !DILocation(line: 51, scope: !105)
!169 = !{!132, !133, i64 40}
!170 = !DILocation(line: 52, scope: !105)
!171 = !{!132, !125, i64 52}
!172 = !DILocation(line: 53, scope: !105)
!173 = !DILocation(line: 0, scope: !119)
!174 = !DILocation(line: 57, scope: !119)
!175 = !DILocation(line: 54, scope: !176)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 53)
!177 = distinct !DILexicalBlock(scope: !105, file: !3, line: 53)
!178 = !DILocation(line: 55, scope: !176)
!179 = !DILocation(line: 68, scope: !105)
!180 = !DILocation(line: 69, scope: !105)
!181 = !DILocation(line: 70, scope: !105)
!182 = !DILocation(line: 58, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !3, line: 57)
!184 = distinct !DILexicalBlock(scope: !119, file: !3, line: 57)
!185 = !{!186, !133, i64 0}
!186 = !{!"?AUhalide_profiler_func_stats@@", !133, i64 0, !133, i64 8, !133, i64 16, !133, i64 24, !133, i64 32, !133, i64 40, !133, i64 48, !125, i64 56, !134, i64 60}
!187 = !DILocation(line: 59, scope: !183)
!188 = !{!133, !133, i64 0}
!189 = !{!186, !125, i64 56}
!190 = !DILocation(line: 60, scope: !183)
!191 = !{!186, !133, i64 8}
!192 = !DILocation(line: 61, scope: !183)
!193 = !{!186, !133, i64 16}
!194 = !DILocation(line: 62, scope: !183)
!195 = !{!186, !133, i64 24}
!196 = !DILocation(line: 63, scope: !183)
!197 = !{!186, !134, i64 60}
!198 = !DILocation(line: 64, scope: !183)
!199 = !{!186, !133, i64 32}
!200 = !DILocation(line: 65, scope: !183)
!201 = !{!186, !133, i64 40}
!202 = !DILocation(line: 66, scope: !183)
!203 = !{!186, !133, i64 48}
!204 = !DILocation(line: 57, scope: !184)
!205 = distinct !{!205, !174, !206, !139}
!206 = !DILocation(line: 67, scope: !119)
!207 = !DILocation(line: 71, scope: !105)
!208 = distinct !DISubprogram(name: "bill_func", linkageName: "?bill_func@Internal@Runtime@Halide@@YAXPAUhalide_profiler_state@@H_KH@Z", scope: !95, file: !3, line: 73, type: !209, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !6, !22, !31, !22}
!211 = !{!212, !213, !214, !215, !216, !217, !219}
!212 = !DILocalVariable(name: "active_threads", arg: 4, scope: !208, file: !3, line: 73, type: !22)
!213 = !DILocalVariable(name: "time", arg: 3, scope: !208, file: !3, line: 73, type: !31)
!214 = !DILocalVariable(name: "func_id", arg: 2, scope: !208, file: !3, line: 73, type: !22)
!215 = !DILocalVariable(name: "s", arg: 1, scope: !208, file: !3, line: 73, type: !6)
!216 = !DILocalVariable(name: "p_prev", scope: !208, file: !3, line: 74, type: !27)
!217 = !DILocalVariable(name: "p", scope: !218, file: !3, line: 75, type: !27)
!218 = distinct !DILexicalBlock(scope: !208, file: !3, line: 75)
!219 = !DILocalVariable(name: "f", scope: !220, file: !3, line: 84, type: !43)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 77)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 77)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 76)
!223 = distinct !DILexicalBlock(scope: !218, file: !3, line: 75)
!224 = !DILocation(line: 0, scope: !208)
!225 = !DILocation(line: 75, scope: !218)
!226 = !DILocation(line: 0, scope: !218)
!227 = !DILocation(line: 77, scope: !222)
!228 = !DILocation(line: 78, scope: !220)
!229 = !DILocation(line: 80, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 78)
!231 = distinct !DILexicalBlock(scope: !220, file: !3, line: 78)
!232 = !DILocation(line: 81, scope: !230)
!233 = !DILocation(line: 82, scope: !230)
!234 = !DILocation(line: 83, scope: !230)
!235 = !DILocation(line: 84, scope: !220)
!236 = !DILocation(line: 0, scope: !220)
!237 = !DILocation(line: 85, scope: !220)
!238 = !DILocation(line: 86, scope: !220)
!239 = !DILocation(line: 87, scope: !220)
!240 = !DILocation(line: 88, scope: !220)
!241 = !DILocation(line: 89, scope: !220)
!242 = !DILocation(line: 90, scope: !220)
!243 = !DILocation(line: 91, scope: !220)
!244 = !DILocation(line: 76, scope: !223)
!245 = distinct !{!245, !225, !246, !139}
!246 = !DILocation(line: 95, scope: !218)
!247 = !DILocation(line: 97, scope: !208)
!248 = distinct !DISubprogram(name: "sampling_profiler_thread", linkageName: "?sampling_profiler_thread@Internal@Runtime@Halide@@YAXPAX@Z", scope: !95, file: !3, line: 99, type: !249, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !56}
!251 = !{!252, !253, !254, !256, !257, !259, !260, !261}
!252 = !DILocalVariable(arg: 1, scope: !248, file: !3, line: 99, type: !56)
!253 = !DILocalVariable(name: "s", scope: !248, file: !3, line: 100, type: !6)
!254 = !DILocalVariable(name: "t1", scope: !255, file: !3, line: 107, type: !31)
!255 = distinct !DILexicalBlock(scope: !248, file: !3, line: 105)
!256 = !DILocalVariable(name: "t", scope: !255, file: !3, line: 108, type: !31)
!257 = !DILocalVariable(name: "func", scope: !258, file: !3, line: 110, type: !22)
!258 = distinct !DILexicalBlock(scope: !255, file: !3, line: 109)
!259 = !DILocalVariable(name: "active_threads", scope: !258, file: !3, line: 110, type: !22)
!260 = !DILocalVariable(name: "t_now", scope: !258, file: !3, line: 119, type: !31)
!261 = !DILocalVariable(name: "sleep_ms", scope: !258, file: !3, line: 130, type: !22)
!262 = !DILocation(line: 0, scope: !248)
!263 = !DILocation(line: 100, scope: !248)
!264 = !DILocation(line: 103, scope: !248)
!265 = !DILocation(line: 105, scope: !248)
!266 = !{!144, !134, i64 12}
!267 = !DILocation(line: 0, scope: !255)
!268 = !DILocation(line: 134, scope: !258)
!269 = distinct !{!269, !265, !270, !139}
!270 = !DILocation(line: 135, scope: !248)
!271 = !DILocation(line: 107, scope: !255)
!272 = !DILocation(line: 109, scope: !255)
!273 = !DILocation(line: 108, scope: !255)
!274 = !DILocation(line: 110, scope: !258)
!275 = !DILocation(line: 111, scope: !258)
!276 = !{!144, !125, i64 24}
!277 = !DILocation(line: 0, scope: !258)
!278 = !DILocation(line: 114, scope: !279)
!279 = distinct !DILexicalBlock(scope: !280, file: !3, line: 111)
!280 = distinct !DILexicalBlock(scope: !258, file: !3, line: 111)
!281 = !DILocation(line: 115, scope: !279)
!282 = !DILocation(line: 116, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !3, line: 115)
!284 = !{!134, !134, i64 0}
!285 = !DILocation(line: 117, scope: !283)
!286 = !{!144, !134, i64 16}
!287 = !DILocation(line: 118, scope: !283)
!288 = !DILocation(line: 119, scope: !258)
!289 = !DILocation(line: 120, scope: !258)
!290 = !DILocation(line: 122, scope: !291)
!291 = distinct !DILexicalBlock(scope: !258, file: !3, line: 120)
!292 = !DILocation(line: 125, scope: !293)
!293 = distinct !DILexicalBlock(scope: !294, file: !3, line: 122)
!294 = distinct !DILexicalBlock(scope: !291, file: !3, line: 122)
!295 = !DILocation(line: 126, scope: !293)
!296 = !DILocation(line: 130, scope: !258)
!297 = !{!144, !134, i64 4}
!298 = !DILocation(line: 131, scope: !258)
!299 = !DILocation(line: 132, scope: !258)
!300 = !DILocation(line: 133, scope: !258)
!301 = !DILocation(line: 137, scope: !248)
!302 = !DILocation(line: 138, scope: !248)
!303 = distinct !DISubprogram(name: "halide_profiler_get_pipeline_state", scope: !3, file: !3, line: 162, type: !304, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !306)
!304 = !DISubroutineType(types: !305)
!305 = !{!27, !39}
!306 = !{!307, !308, !309, !322}
!307 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !303, file: !3, line: 162, type: !39)
!308 = !DILocalVariable(name: "s", scope: !303, file: !3, line: 163, type: !6)
!309 = !DILocalVariable(name: "lock", scope: !303, file: !3, line: 165, type: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedMutexLock", scope: !95, file: !311, line: 11, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !312, identifier: ".?AUScopedMutexLock@Internal@Runtime@Halide@@")
!311 = !DIFile(filename: "src/runtime/scoped_mutex_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "642ccaf34ebe2e8cca3ae0e35e43768c")
!312 = !{!313, !315, !319}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !310, file: !311, line: 12, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!315 = !DISubprogram(name: "ScopedMutexLock", scope: !310, file: !311, line: 14, type: !316, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !317)
!317 = !{null, !318, !314}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!319 = !DISubprogram(name: "~ScopedMutexLock", scope: !310, file: !311, line: 19, type: !320, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !321)
!321 = !{null, !318}
!322 = !DILocalVariable(name: "p", scope: !323, file: !3, line: 167, type: !27)
!323 = distinct !DILexicalBlock(scope: !303, file: !3, line: 167)
!324 = !DILocation(line: 0, scope: !303)
!325 = !DILocation(line: 163, scope: !303)
!326 = !DILocation(line: 165, scope: !303)
!327 = !DILocalVariable(name: "mutex", arg: 2, scope: !328, file: !311, line: 14, type: !314)
!328 = distinct !DISubprogram(name: "ScopedMutexLock", linkageName: "??0ScopedMutexLock@Internal@Runtime@Halide@@QAE@PAUhalide_mutex@@@Z", scope: !310, file: !311, line: 14, type: !316, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, declaration: !315, retainedNodes: !329)
!329 = !{!327, !330}
!330 = !DILocalVariable(name: "this", arg: 1, scope: !328, type: !331, flags: DIFlagArtificial | DIFlagObjectPointer)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!332 = !DILocation(line: 0, scope: !328, inlinedAt: !333)
!333 = distinct !DILocation(line: 165, scope: !303)
!334 = !DILocation(line: 16, scope: !335, inlinedAt: !333)
!335 = distinct !DILexicalBlock(scope: !328, file: !311, line: 15)
!336 = !DILocation(line: 167, scope: !323)
!337 = !DILocation(line: 0, scope: !323)
!338 = !DILocation(line: 171, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 168)
!340 = distinct !DILexicalBlock(scope: !323, file: !3, line: 167)
!341 = !DILocation(line: 168, scope: !340)
!342 = distinct !{!342, !336, !343, !139}
!343 = !DILocation(line: 174, scope: !323)
!344 = !DILocalVariable(name: "this", arg: 1, scope: !345, type: !331, flags: DIFlagArtificial | DIFlagObjectPointer)
!345 = distinct !DISubprogram(name: "~ScopedMutexLock", linkageName: "??1ScopedMutexLock@Internal@Runtime@Halide@@QAE@XZ", scope: !310, file: !311, line: 19, type: !320, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, declaration: !319, retainedNodes: !346)
!346 = !{!344}
!347 = !DILocation(line: 0, scope: !345, inlinedAt: !348)
!348 = distinct !DILocation(line: 176, scope: !303)
!349 = !DILocation(line: 20, scope: !350, inlinedAt: !348)
!350 = distinct !DILexicalBlock(scope: !345, file: !311, line: 19)
!351 = !DILocation(line: 176, scope: !303)
!352 = distinct !DISubprogram(name: "halide_profiler_pipeline_start", scope: !3, file: !3, line: 179, type: !353, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{!22, !56, !39, !22, !108}
!355 = !{!356, !357, !358, !359, !360, !361, !362}
!356 = !DILocalVariable(name: "func_names", arg: 4, scope: !352, file: !3, line: 182, type: !108)
!357 = !DILocalVariable(name: "num_funcs", arg: 3, scope: !352, file: !3, line: 181, type: !22)
!358 = !DILocalVariable(name: "pipeline_name", arg: 2, scope: !352, file: !3, line: 180, type: !39)
!359 = !DILocalVariable(name: "user_context", arg: 1, scope: !352, file: !3, line: 179, type: !56)
!360 = !DILocalVariable(name: "s", scope: !352, file: !3, line: 183, type: !6)
!361 = !DILocalVariable(name: "lock", scope: !352, file: !3, line: 185, type: !310)
!362 = !DILocalVariable(name: "p", scope: !352, file: !3, line: 192, type: !27)
!363 = !DILocation(line: 0, scope: !352)
!364 = !DILocation(line: 183, scope: !352)
!365 = !DILocation(line: 185, scope: !352)
!366 = !DILocation(line: 0, scope: !328, inlinedAt: !367)
!367 = distinct !DILocation(line: 185, scope: !352)
!368 = !DILocation(line: 16, scope: !335, inlinedAt: !367)
!369 = !DILocation(line: 187, scope: !352)
!370 = !{!144, !125, i64 28}
!371 = !DILocation(line: 188, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 187)
!373 = distinct !DILexicalBlock(scope: !352, file: !3, line: 187)
!374 = !DILocation(line: 189, scope: !372)
!375 = !DILocation(line: 190, scope: !372)
!376 = !DILocation(line: 192, scope: !352)
!377 = !DILocation(line: 194, scope: !352)
!378 = !DILocation(line: 196, scope: !379)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 194)
!380 = distinct !DILexicalBlock(scope: !352, file: !3, line: 194)
!381 = !DILocation(line: 198, scope: !352)
!382 = !DILocation(line: 200, scope: !352)
!383 = !DILocation(line: 0, scope: !345, inlinedAt: !384)
!384 = distinct !DILocation(line: 201, scope: !352)
!385 = !DILocation(line: 20, scope: !350, inlinedAt: !384)
!386 = !DILocation(line: 201, scope: !352)
!387 = distinct !DISubprogram(name: "halide_profiler_stack_peak_update", scope: !3, file: !3, line: 203, type: !388, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !391)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !56, !56, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!391 = !{!392, !393, !394, !395, !396}
!392 = !DILocalVariable(name: "f_values", arg: 3, scope: !387, file: !3, line: 205, type: !390)
!393 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !387, file: !3, line: 204, type: !56)
!394 = !DILocalVariable(name: "user_context", arg: 1, scope: !387, file: !3, line: 203, type: !56)
!395 = !DILocalVariable(name: "p_stats", scope: !387, file: !3, line: 206, type: !27)
!396 = !DILocalVariable(name: "i", scope: !397, file: !3, line: 216, type: !22)
!397 = distinct !DILexicalBlock(scope: !387, file: !3, line: 216)
!398 = !DILocation(line: 0, scope: !387)
!399 = !DILocation(line: 207, scope: !400)
!400 = distinct !DILexicalBlock(scope: !387, file: !3, line: 207)
!401 = !DILocation(line: 207, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !3, line: 207)
!403 = distinct !DILexicalBlock(scope: !400, file: !3, line: 207)
!404 = !DILocation(line: 0, scope: !397)
!405 = !DILocation(line: 216, scope: !397)
!406 = !DILocation(line: 221, scope: !387)
!407 = !DILocation(line: 217, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !3, line: 216)
!409 = distinct !DILexicalBlock(scope: !397, file: !3, line: 216)
!410 = !DILocation(line: 218, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 217)
!412 = distinct !DILexicalBlock(scope: !408, file: !3, line: 217)
!413 = !DILocalVariable(name: "val", arg: 2, scope: !414, file: !3, line: 147, type: !32)
!414 = distinct !DISubprogram(name: "sync_compare_max_and_swap<unsigned long long>", linkageName: "??$sync_compare_max_and_swap@_K@?A0x3E95B2E2@@YAXPA_K_K@Z", scope: !415, file: !3, line: 147, type: !416, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, templateParams: !424, retainedNodes: !419)
!415 = !DINamespace(scope: null)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418, !32}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!419 = !{!413, !420, !421, !422}
!420 = !DILocalVariable(name: "ptr", arg: 1, scope: !414, file: !3, line: 147, type: !418)
!421 = !DILocalVariable(name: "old_val", scope: !414, file: !3, line: 148, type: !32)
!422 = !DILocalVariable(name: "temp", scope: !423, file: !3, line: 150, type: !32)
!423 = distinct !DILexicalBlock(scope: !414, file: !3, line: 149)
!424 = !{!425}
!425 = !DITemplateTypeParameter(name: "T", type: !32)
!426 = !DILocation(line: 0, scope: !414, inlinedAt: !427)
!427 = distinct !DILocation(line: 218, scope: !411)
!428 = !DILocation(line: 148, scope: !414, inlinedAt: !427)
!429 = !DILocation(line: 149, scope: !414, inlinedAt: !427)
!430 = !DILocation(line: 0, scope: !423, inlinedAt: !427)
!431 = !DILocation(line: 151, scope: !423, inlinedAt: !427)
!432 = !DILocation(line: 152, scope: !423, inlinedAt: !427)
!433 = distinct !{!433, !429, !434, !139}
!434 = !DILocation(line: 155, scope: !414, inlinedAt: !427)
!435 = !DILocation(line: 216, scope: !409)
!436 = distinct !{!436, !405, !437, !139}
!437 = !DILocation(line: 220, scope: !397)
!438 = distinct !DISubprogram(name: "halide_profiler_memory_allocate", scope: !3, file: !3, line: 223, type: !439, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !441)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !56, !56, !22, !31}
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449}
!442 = !DILocalVariable(name: "incr", arg: 4, scope: !438, file: !3, line: 226, type: !31)
!443 = !DILocalVariable(name: "func_id", arg: 3, scope: !438, file: !3, line: 225, type: !22)
!444 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !438, file: !3, line: 224, type: !56)
!445 = !DILocalVariable(name: "user_context", arg: 1, scope: !438, file: !3, line: 223, type: !56)
!446 = !DILocalVariable(name: "p_stats", scope: !438, file: !3, line: 233, type: !27)
!447 = !DILocalVariable(name: "f_stats", scope: !438, file: !3, line: 238, type: !43)
!448 = !DILocalVariable(name: "p_mem_current", scope: !438, file: !3, line: 249, type: !31)
!449 = !DILocalVariable(name: "f_mem_current", scope: !438, file: !3, line: 255, type: !31)
!450 = !DILocation(line: 0, scope: !438)
!451 = !DILocation(line: 229, scope: !438)
!452 = !DILocation(line: 234, scope: !453)
!453 = distinct !DILexicalBlock(scope: !438, file: !3, line: 234)
!454 = !DILocation(line: 234, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 234)
!456 = distinct !DILexicalBlock(scope: !453, file: !3, line: 234)
!457 = !DILocation(line: 235, scope: !458)
!458 = distinct !DILexicalBlock(scope: !438, file: !3, line: 235)
!459 = !DILocation(line: 235, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !3, line: 235)
!461 = distinct !DILexicalBlock(scope: !458, file: !3, line: 235)
!462 = !DILocation(line: 236, scope: !463)
!463 = distinct !DILexicalBlock(scope: !438, file: !3, line: 236)
!464 = !DILocation(line: 236, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 236)
!466 = distinct !DILexicalBlock(scope: !463, file: !3, line: 236)
!467 = !DILocation(line: 238, scope: !438)
!468 = !DILocation(line: 247, scope: !438)
!469 = !DILocation(line: 248, scope: !438)
!470 = !DILocation(line: 249, scope: !438)
!471 = !DILocation(line: 250, scope: !438)
!472 = !DILocation(line: 0, scope: !414, inlinedAt: !473)
!473 = distinct !DILocation(line: 250, scope: !438)
!474 = !DILocation(line: 148, scope: !414, inlinedAt: !473)
!475 = !DILocation(line: 149, scope: !414, inlinedAt: !473)
!476 = !DILocation(line: 0, scope: !423, inlinedAt: !473)
!477 = !DILocation(line: 151, scope: !423, inlinedAt: !473)
!478 = !DILocation(line: 152, scope: !423, inlinedAt: !473)
!479 = distinct !{!479, !475, !480, !139}
!480 = !DILocation(line: 155, scope: !414, inlinedAt: !473)
!481 = !DILocation(line: 253, scope: !438)
!482 = !DILocation(line: 254, scope: !438)
!483 = !DILocation(line: 255, scope: !438)
!484 = !DILocation(line: 256, scope: !438)
!485 = !DILocation(line: 0, scope: !414, inlinedAt: !486)
!486 = distinct !DILocation(line: 256, scope: !438)
!487 = !DILocation(line: 148, scope: !414, inlinedAt: !486)
!488 = !DILocation(line: 149, scope: !414, inlinedAt: !486)
!489 = !DILocation(line: 0, scope: !423, inlinedAt: !486)
!490 = !DILocation(line: 151, scope: !423, inlinedAt: !486)
!491 = !DILocation(line: 152, scope: !423, inlinedAt: !486)
!492 = distinct !{!492, !488, !493, !139}
!493 = !DILocation(line: 155, scope: !414, inlinedAt: !486)
!494 = !DILocation(line: 257, scope: !438)
!495 = distinct !DISubprogram(name: "halide_profiler_memory_free", scope: !3, file: !3, line: 259, type: !439, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !496)
!496 = !{!497, !498, !499, !500, !501, !502}
!497 = !DILocalVariable(name: "decr", arg: 4, scope: !495, file: !3, line: 262, type: !31)
!498 = !DILocalVariable(name: "func_id", arg: 3, scope: !495, file: !3, line: 261, type: !22)
!499 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !495, file: !3, line: 260, type: !56)
!500 = !DILocalVariable(name: "user_context", arg: 1, scope: !495, file: !3, line: 259, type: !56)
!501 = !DILocalVariable(name: "p_stats", scope: !495, file: !3, line: 269, type: !27)
!502 = !DILocalVariable(name: "f_stats", scope: !495, file: !3, line: 274, type: !43)
!503 = !DILocation(line: 0, scope: !495)
!504 = !DILocation(line: 265, scope: !495)
!505 = !DILocation(line: 270, scope: !506)
!506 = distinct !DILexicalBlock(scope: !495, file: !3, line: 270)
!507 = !DILocation(line: 270, scope: !508)
!508 = distinct !DILexicalBlock(scope: !509, file: !3, line: 270)
!509 = distinct !DILexicalBlock(scope: !506, file: !3, line: 270)
!510 = !DILocation(line: 271, scope: !511)
!511 = distinct !DILexicalBlock(scope: !495, file: !3, line: 271)
!512 = !DILocation(line: 271, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !3, line: 271)
!514 = distinct !DILexicalBlock(scope: !511, file: !3, line: 271)
!515 = !DILocation(line: 272, scope: !516)
!516 = distinct !DILexicalBlock(scope: !495, file: !3, line: 272)
!517 = !DILocation(line: 272, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !3, line: 272)
!519 = distinct !DILexicalBlock(scope: !516, file: !3, line: 272)
!520 = !DILocation(line: 274, scope: !495)
!521 = !DILocation(line: 283, scope: !495)
!522 = !DILocation(line: 286, scope: !495)
!523 = !DILocation(line: 287, scope: !495)
!524 = distinct !DISubprogram(name: "halide_profiler_report_unlocked", scope: !3, file: !3, line: 289, type: !525, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !56, !6}
!527 = !{!528, !529, !530, !534, !650, !652, !655, !656, !657, !658, !659, !663, !666, !670, !674, !675, !676, !677, !680}
!528 = !DILocalVariable(name: "s", arg: 2, scope: !524, file: !3, line: 289, type: !6)
!529 = !DILocalVariable(name: "user_context", arg: 1, scope: !524, file: !3, line: 289, type: !56)
!530 = !DILocalVariable(name: "line_buf", scope: !524, file: !3, line: 291, type: !531)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 1024)
!534 = !DILocalVariable(name: "sstr", scope: !524, file: !3, line: 292, type: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2,1024>", scope: !537, file: !536, line: 30, size: 160, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !538, templateParams: !647, identifier: ".?AV?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@")
!536 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a97d2909b01229a33f8a6f2cb0fa6ab8")
!537 = !DINamespace(scope: !95)
!538 = !{!539, !540, !541, !542, !543, !545, !547, !551, !555, !560, !564, !567, !570, !574, !578, !583, !589, !622, !629, !632, !635, !640, !641, !644, !645, !646}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !535, file: !536, line: 32, baseType: !87, size: 32, flags: DIFlagPublic)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !535, file: !536, line: 32, baseType: !87, size: 32, offset: 32, flags: DIFlagPublic)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !535, file: !536, line: 32, baseType: !87, size: 32, offset: 64, flags: DIFlagPublic)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !535, file: !536, line: 33, baseType: !56, size: 32, offset: 96, flags: DIFlagPublic)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !535, file: !536, line: 34, baseType: !544, size: 8, offset: 128, flags: DIFlagPublic)
!544 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !535, file: !536, line: 35, baseType: !546, size: 8, offset: 136, flags: DIFlagPublic)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !19)
!547 = !DISubprogram(name: "Printer", scope: !535, file: !536, line: 37, type: !548, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!548 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !549)
!549 = !{null, !550, !56, !87}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!551 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@PBD@Z", scope: !535, file: !536, line: 57, type: !552, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !553)
!553 = !{!554, !550, !39}
!554 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !535, size: 32)
!555 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@_J@Z", scope: !535, file: !536, line: 67, type: !556, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !557)
!557 = !{!554, !550, !558}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 9, baseType: !559)
!559 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!560 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@H@Z", scope: !535, file: !536, line: 72, type: !561, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !562)
!562 = !{!554, !550, !563}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !16, line: 11, baseType: !22)
!564 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@_K@Z", scope: !535, file: !536, line: 77, type: !565, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !566)
!566 = !{!554, !550, !31}
!567 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@I@Z", scope: !535, file: !536, line: 82, type: !568, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!568 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !569)
!569 = !{!554, !550, !17}
!570 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@N@Z", scope: !535, file: !536, line: 87, type: !571, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !572)
!572 = !{!554, !550, !573}
!573 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!574 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@M@Z", scope: !535, file: !536, line: 92, type: !575, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !576)
!576 = !{!554, !550, !577}
!577 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!578 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@PBX@Z", scope: !535, file: !536, line: 97, type: !579, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !580)
!580 = !{!554, !550, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!583 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV1?A0x3E95B2E2@234@G@Z", scope: !535, file: !536, line: 102, type: !584, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !585)
!585 = !{!554, !550, !586}
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 14, baseType: !588)
!588 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!589 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@ABUhalide_type_t@@@Z", scope: !535, file: !536, line: 108, type: !590, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !591)
!591 = !{!554, !550, !592}
!592 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !8, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !595, identifier: ".?AUhalide_type_t@@")
!595 = !{!596, !598, !599, !600, !604, !607, !611, !614, !615, !616, !619}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !594, file: !8, line: 434, baseType: !597, size: 8, align: 8)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !8, line: 413, baseType: !77)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !594, file: !8, line: 442, baseType: !78, size: 8, align: 8, offset: 8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !594, file: !8, line: 446, baseType: !587, size: 16, align: 16, offset: 16)
!600 = !DISubprogram(name: "halide_type_t", scope: !594, file: !8, line: 453, type: !601, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!601 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !602)
!602 = !{null, !603, !597, !78, !587}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!604 = !DISubprogram(name: "halide_type_t", scope: !594, file: !8, line: 459, type: !605, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !606)
!606 = !{null, !603}
!607 = !DISubprogram(name: "with_lanes", linkageName: "?with_lanes@halide_type_t@@QBE?AU1@G@Z", scope: !594, file: !8, line: 463, type: !608, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !609)
!609 = !{!594, !610, !587}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!611 = !DISubprogram(name: "operator==", linkageName: "??8halide_type_t@@QBE_NABU0@@Z", scope: !594, file: !8, line: 468, type: !612, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !613)
!613 = !{!544, !610, !592}
!614 = !DISubprogram(name: "operator!=", linkageName: "??9halide_type_t@@QBE_NABU0@@Z", scope: !594, file: !8, line: 472, type: !612, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubprogram(name: "operator<", linkageName: "??Mhalide_type_t@@QBE_NABU0@@Z", scope: !594, file: !8, line: 476, type: !612, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!616 = !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QBEHXZ", scope: !594, file: !8, line: 481, type: !617, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !618)
!618 = !{!22, !610}
!619 = !DISubprogram(name: "as_u32", linkageName: "?as_u32@halide_type_t@@QBEIXZ", scope: !594, file: !8, line: 485, type: !620, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !621)
!621 = !{!17, !610}
!622 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEAAV0?A0x3E95B2E2@123@ABUhalide_buffer_t@@@Z", scope: !535, file: !536, line: 113, type: !623, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !624)
!624 = !{!554, !550, !625}
!625 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !8, line: 1550, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !8, line: 1423, size: 320, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AUhalide_buffer_t@@")
!629 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEPBDXZ", scope: !535, file: !536, line: 119, type: !630, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!630 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !631)
!631 = !{!39, !550}
!632 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$01$0EAA@@?A0x3E95B2E2@Internal@Runtime@Halide@@QAEXXZ", scope: !535, file: !536, line: 131, type: !633, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!633 = !DISubroutineType(cc: DW_CC_BORLAND_thiscall, types: !634)
!634 = !{null, !550}
