; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/openglcompute.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/openglcompute.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%"struct.Halide::Runtime::Internal::OpenGLCompute::GlobalState" = type { i8, void (i32, i32)*, void (i32, i32)*, void (i32, i32, i32)*, void (i32, i32, i8*, i32)*, i32 ()*, void (i32)*, i32 (i32)*, void (i32, i32*)*, void (i32)*, void (i32)*, void (i32, i32, i32)*, void ()*, void (i32, i32*)*, i32 ()*, void (i32, i32, i32*, i8*)*, void (i32, i32, i32*)*, void (i32, i32, i32*, i8*)*, void (i32, i32, i32*)*, i8* (i32)*, void (i32)*, i8* (i32, i32, i32, i32)*, void (i32)*, void (i32, i32, i8**, i32*)*, void (i32, i32)*, void (i32, i32)*, void (i32, float)*, void (i32)*, void (i32)*, void (i32, i32, i32, i32*, i32*, i32*, i8*)*, i32 (i32, i8*)* }
%"struct.Halide::Runtime::Internal::OpenGLCompute::ModuleState" = type { %"struct.Halide::Runtime::Internal::OpenGLCompute::KernelInfo"*, %"struct.Halide::Runtime::Internal::OpenGLCompute::ModuleState"* }
%"struct.Halide::Runtime::Internal::OpenGLCompute::KernelInfo" = type { i8*, i32, %"struct.Halide::Runtime::Internal::OpenGLCompute::KernelInfo"* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "global_state", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute12global_stateE", scope: !2, file: !6, line: 147, type: !7, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "OpenGLCompute", scope: !3)
!3 = !DINamespace(name: "Internal", scope: !4)
!4 = !DINamespace(name: "Runtime", scope: !5)
!5 = !DINamespace(name: "Halide", scope: null)
!6 = !DIFile(filename: "src/runtime/openglcompute.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalState", scope: !2, file: !6, line: 123, size: 992, flags: DIFlagTypePassByValue, elements: !8, identifier: "_ZTSN6Halide7Runtime8Internal13OpenGLCompute11GlobalStateE")
!8 = !{!9, !11, !19, !25, !30, !42, !47, !52, !57, !65, !67, !69, !74, !79, !85, !90, !99, !106, !108, !110, !119, !121, !129, !134, !144, !149, !150, !157, !162, !164, !170, !175, !179}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !7, file: !6, line: 127, baseType: !10, size: 8)
!10 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "AttachShader", scope: !7, file: !6, line: 131, baseType: !12, size: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLATTACHSHADERPROC", file: !13, line: 128, baseType: !14)
!13 = !DIFile(filename: "src/runtime/mini_opengl.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !17}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !13, line: 11, baseType: !18)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "BindBuffer", scope: !7, file: !6, line: 131, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLBINDBUFFERPROC", file: !13, line: 111, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24, !17}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLenum", file: !13, line: 8, baseType: !18)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "BindBufferBase", scope: !7, file: !6, line: 131, baseType: !26, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLBINDBUFFERBASEPROC", file: !13, line: 215, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !24, !17, !17}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "BufferData", scope: !7, file: !6, line: 131, baseType: !31, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLBUFFERDATAPROC", file: !13, line: 112, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !24, !35, !39, !24}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLsizeiptr", file: !13, line: 13, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !37, line: 28, baseType: !38)
!37 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLvoid", file: !13, line: 16, baseType: null)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "CreateProgram", scope: !7, file: !6, line: 131, baseType: !43, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLCREATEPROGRAMPROC", file: !13, line: 130, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DISubroutineType(types: !46)
!46 = !{!17}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "CompileShader", scope: !7, file: !6, line: 131, baseType: !48, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLCOMPILESHADERPROC", file: !13, line: 129, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !17}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "CreateShader", scope: !7, file: !6, line: 131, baseType: !53, size: 32, offset: 224)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLCREATESHADERPROC", file: !13, line: 131, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DISubroutineType(types: !56)
!56 = !{!17, !24}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteBuffers", scope: !7, file: !6, line: 131, baseType: !58, size: 32, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDELETEBUFFERSPROC", file: !13, line: 216, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !63}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLsizei", file: !13, line: 12, baseType: !38)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteProgram", scope: !7, file: !6, line: 131, baseType: !66, size: 32, offset: 288)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDELETEPROGRAMPROC", file: !13, line: 132, baseType: !49)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteShader", scope: !7, file: !6, line: 131, baseType: !68, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDELETESHADERPROC", file: !13, line: 133, baseType: !49)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchCompute", scope: !7, file: !6, line: 131, baseType: !70, size: 32, offset: 352)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLDISPATCHCOMPUTEPROC", file: !13, line: 213, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !17, !17, !17}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !7, file: !6, line: 131, baseType: !75, size: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLFINISHPROC", file: !13, line: 153, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DISubroutineType(types: !78)
!78 = !{null}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "GenBuffers", scope: !7, file: !6, line: 131, baseType: !80, size: 32, offset: 416)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGENBUFFERSPROC", file: !13, line: 109, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !62, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "GetError", scope: !7, file: !6, line: 131, baseType: !86, size: 32, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETERRORPROC", file: !13, line: 70, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DISubroutineType(types: !89)
!89 = !{!24}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "GetProgramInfoLog", scope: !7, file: !6, line: 131, baseType: !91, size: 32, offset: 480)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETPROGRAMINFOLOGPROC", file: !13, line: 138, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !17, !62, !95, !96}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLchar", file: !13, line: 6, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "GetProgramiv", scope: !7, file: !6, line: 131, baseType: !100, size: 32, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETPROGRAMIVPROC", file: !13, line: 137, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !17, !24, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLint", file: !13, line: 10, baseType: !38)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "GetShaderInfoLog", scope: !7, file: !6, line: 131, baseType: !107, size: 32, offset: 544)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETSHADERINFOLOGPROC", file: !13, line: 140, baseType: !92)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "GetShaderiv", scope: !7, file: !6, line: 131, baseType: !109, size: 32, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETSHADERIVPROC", file: !13, line: 139, baseType: !101)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "GetString", scope: !7, file: !6, line: 131, baseType: !111, size: 32, offset: 608)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETSTRINGPROC", file: !13, line: 71, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !24}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !13, line: 7, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "LinkProgram", scope: !7, file: !6, line: 131, baseType: !120, size: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLLINKPROGRAMPROC", file: !13, line: 142, baseType: !49)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "MapBufferRange", scope: !7, file: !6, line: 131, baseType: !122, size: 32, offset: 672)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLMAPBUFFERRANGEPROC", file: !13, line: 212, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !24, !127, !35, !128}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLintptr", file: !13, line: 207, baseType: !36)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLbitfield", file: !13, line: 206, baseType: !18)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "MemoryBarrier", scope: !7, file: !6, line: 131, baseType: !130, size: 32, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLMEMORYBARRIERPROC", file: !13, line: 211, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !128}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ShaderSource", scope: !7, file: !6, line: 131, baseType: !135, size: 32, offset: 736)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLSHADERSOURCEPROC", file: !13, line: 143, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !17, !62, !139, !142}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Uniform1i", scope: !7, file: !6, line: 131, baseType: !145, size: 32, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUNIFORM1IPROC", file: !13, line: 145, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !17, !105}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Uniform1ui", scope: !7, file: !6, line: 131, baseType: !145, size: 32, offset: 800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Uniform1f", scope: !7, file: !6, line: 131, baseType: !151, size: 32, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUNIFORM1FPROC", file: !13, line: 144, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !17, !155}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLfloat", file: !13, line: 14, baseType: !156)
!156 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "UnmapBuffer", scope: !7, file: !6, line: 131, baseType: !158, size: 32, offset: 864)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUNMAPBUFFERPROC", file: !13, line: 214, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !24}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "UseProgram", scope: !7, file: !6, line: 131, baseType: !163, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLUSEPROGRAMPROC", file: !13, line: 149, baseType: !49)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "GetActiveUniform", scope: !7, file: !6, line: 131, baseType: !165, size: 32, offset: 928)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETACTIVEUNIFORM", file: !13, line: 218, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !17, !17, !62, !95, !104, !169, !96}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "GetUniformLocation", scope: !7, file: !6, line: 131, baseType: !171, size: 32, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PFNGLGETUNIFORMLOCATION", file: !13, line: 219, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DISubroutineType(types: !174)
!174 = !{!105, !17, !140}
!175 = !DISubprogram(name: "init", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute11GlobalState4initEv", scope: !7, file: !6, line: 124, type: !176, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!179 = !DISubprogram(name: "CheckAndReportError", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute11GlobalState19CheckAndReportErrorEPvPKc", scope: !7, file: !6, line: 125, type: !180, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{!10, !178, !126, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "state_list", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute10state_listE", scope: !2, file: !6, line: 150, type: !186, isLocal: false, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModuleState", scope: !2, file: !6, line: 109, size: 64, flags: DIFlagTypePassByValue, elements: !188, identifier: "_ZTSN6Halide7Runtime8Internal13OpenGLCompute11ModuleStateE")
!188 = !{!189, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "kernel", scope: !187, file: !6, line: 110, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", scope: !2, file: !6, line: 103, size: 96, flags: DIFlagTypePassByValue, elements: !192, identifier: "_ZTSN6Halide7Runtime8Internal13OpenGLCompute10KernelInfoE")
!192 = !{!193, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_name", scope: !191, file: !6, line: 104, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "program_id", scope: !191, file: !6, line: 105, baseType: !17, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !6, line: 106, baseType: !190, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !6, line: 111, baseType: !186, size: 32, offset: 32)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "openglcompute_device_interface", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute30openglcompute_device_interfaceE", scope: !2, file: !6, line: 948, type: !200, isLocal: false, isDefinition: true)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !201, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !202, identifier: "_ZTS25halide_device_interface_t")
!201 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!202 = !{!203, !327, !331, !332, !336, !337, !338, !339, !340, !344, !349, !353, !354, !358, !359, !364}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !200, file: !201, line: 724, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{!38, !126, !207, !214}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !201, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !209, identifier: "_ZTS15halide_buffer_t")
!209 = !{!210, !213, !216, !219, !220, !261, !263, !286, !287, !297, !301, !304, !305, !308, !309, !313, !316, !317, !318, !323, !326}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !208, file: !201, line: 1425, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !37, line: 10, baseType: !212)
!212 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !208, file: !201, line: 1428, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !208, file: !201, line: 1433, baseType: !217, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !37, line: 16, baseType: !118)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !208, file: !201, line: 1436, baseType: !211, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !201, line: 1439, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !201, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !222, identifier: "_ZTS13halide_type_t")
!222 = !{!223, !232, !233, !236, !240, !243, !248, !252, !253, !254, !257}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !221, file: !201, line: 434, baseType: !224, size: 8, align: 8)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !201, line: 413, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !201, line: 403, baseType: !218, size: 8, elements: !226, identifier: "_ZTS18halide_type_code_t")
!226 = !{!227, !228, !229, !230, !231}
!227 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!228 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!231 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !221, file: !201, line: 442, baseType: !218, size: 8, align: 8, offset: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !221, file: !201, line: 446, baseType: !234, size: 16, align: 16, offset: 16)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !37, line: 14, baseType: !235)
!235 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!236 = !DISubprogram(name: "halide_type_t", scope: !221, file: !201, line: 453, type: !237, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !239, !224, !218, !234}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!240 = !DISubprogram(name: "halide_type_t", scope: !221, file: !201, line: 459, type: !241, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !239}
!243 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !221, file: !201, line: 463, type: !244, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{!221, !246, !234}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!248 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !221, file: !201, line: 468, type: !249, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DISubroutineType(types: !250)
!250 = !{!10, !246, !251}
!251 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !247, size: 32)
!252 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !221, file: !201, line: 472, type: !249, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !221, file: !201, line: 476, type: !249, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !221, file: !201, line: 481, type: !255, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!38, !246}
!257 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !221, file: !201, line: 485, type: !258, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !246}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !37, line: 12, baseType: !18)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !208, file: !201, line: 1442, baseType: !262, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !37, line: 11, baseType: !38)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !208, file: !201, line: 1446, baseType: !264, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !201, line: 1409, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !201, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !267, identifier: "_ZTS18halide_dimension_t")
!267 = !{!268, !269, !270, !271, !272, !276, !279, !285}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !266, file: !201, line: 1383, baseType: !262, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !266, file: !201, line: 1383, baseType: !262, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !266, file: !201, line: 1383, baseType: !262, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !201, line: 1386, baseType: !260, size: 32, offset: 96)
!272 = !DISubprogram(name: "halide_dimension_t", scope: !266, file: !201, line: 1388, type: !273, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!276 = !DISubprogram(name: "halide_dimension_t", scope: !266, file: !201, line: 1389, type: !277, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !275, !262, !262, !262, !260}
!279 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !266, file: !201, line: 1393, type: !280, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DISubroutineType(types: !281)
!281 = !{!10, !282, !284}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!284 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !283, size: 32)
!285 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !266, file: !201, line: 1400, type: !280, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !208, file: !201, line: 1449, baseType: !126, size: 32, offset: 288)
!287 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !208, file: !201, line: 1454, type: !288, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!288 = !DISubroutineType(types: !289)
!289 = !{!10, !290, !292}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !201, line: 1416, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !201, line: 1415, baseType: !18, size: 32, elements: !294, identifier: "_ZTS19halide_buffer_flags")
!294 = !{!295, !296}
!295 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!297 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !208, file: !201, line: 1458, type: !298, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300, !292, !10}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!301 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !208, file: !201, line: 1466, type: !302, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{!10, !290}
!304 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !208, file: !201, line: 1470, type: !302, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!305 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !208, file: !201, line: 1474, type: !306, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !300, !10}
!308 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !208, file: !201, line: 1478, type: !306, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !208, file: !201, line: 1485, type: !310, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !290}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 27, baseType: !18)
!313 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !208, file: !201, line: 1495, type: !314, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{!217, !290}
!316 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !208, file: !201, line: 1506, type: !314, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !208, file: !201, line: 1518, type: !310, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !208, file: !201, line: 1523, type: !319, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubroutineType(types: !320)
!320 = !{!217, !290, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!323 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !208, file: !201, line: 1534, type: !324, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DISubroutineType(types: !325)
!325 = !{!38, !300, !126}
!326 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !208, file: !201, line: 1545, type: !302, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !200, file: !201, line: 726, baseType: !328, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{!38, !126, !207}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !200, file: !201, line: 727, baseType: !328, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !200, file: !201, line: 728, baseType: !333, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !126, !214}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !200, file: !201, line: 730, baseType: !328, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !200, file: !201, line: 731, baseType: !204, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !200, file: !201, line: 733, baseType: !204, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !200, file: !201, line: 735, baseType: !328, size: 32, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !200, file: !201, line: 736, baseType: !341, size: 32, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{!38, !126, !207, !214, !207}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !200, file: !201, line: 738, baseType: !345, size: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{!38, !126, !348, !207}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !200, file: !201, line: 740, baseType: !350, size: 32, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DISubroutineType(types: !352)
!352 = !{!38, !126, !348, !38, !38, !207}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !200, file: !201, line: 742, baseType: !328, size: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !200, file: !201, line: 743, baseType: !355, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DISubroutineType(types: !357)
!357 = !{!38, !126, !207, !211, !214}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !200, file: !201, line: 745, baseType: !328, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !200, file: !201, line: 746, baseType: !360, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{!38, !126, !363, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !200, file: !201, line: 747, baseType: !365, size: 32, offset: 480)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !368, line: 10, size: 512, flags: DIFlagTypePassByValue, elements: !369, identifier: "_ZTS30halide_device_interface_impl_t")
!368 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!369 = !{!370, !371, !372, !373, !374, !375, !379, !380, !381, !382, !383, !384, !385, !386, !387, !391}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !367, file: !368, line: 16, baseType: !76, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !367, file: !368, line: 17, baseType: !76, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !367, file: !368, line: 18, baseType: !328, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !367, file: !368, line: 19, baseType: !328, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !367, file: !368, line: 20, baseType: !328, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !367, file: !368, line: 21, baseType: !376, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DISubroutineType(types: !378)
!378 = !{!38, !126}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !367, file: !368, line: 22, baseType: !328, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !367, file: !368, line: 23, baseType: !328, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !367, file: !368, line: 24, baseType: !328, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !367, file: !368, line: 25, baseType: !328, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !367, file: !368, line: 26, baseType: !341, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !367, file: !368, line: 28, baseType: !345, size: 32, offset: 352)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !367, file: !368, line: 31, baseType: !350, size: 32, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !367, file: !368, line: 35, baseType: !328, size: 32, offset: 416)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !367, file: !368, line: 37, baseType: !388, size: 32, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DISubroutineType(types: !390)
!390 = !{!38, !126, !207, !211}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !367, file: !368, line: 38, baseType: !328, size: 32, offset: 480)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "openglcompute_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute35openglcompute_device_interface_implE", scope: !2, file: !6, line: 929, type: !367, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !395, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !396, retainedTypes: !397, globals: !566, imports: !567, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/openglcompute.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!396 = !{!225, !293}
!397 = !{!126, !398, !211, !480, !38, !17, !547, !18, !186, !548, !551, !554, !217, !555, !556, !557, !558, !194, !559, !190, !105, !560, !312, !36, !561, !363, !562, !563, !564, !565, !550, !553, !118, !235}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !400, file: !399, line: 203, baseType: !401)
!399 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!400 = !DINamespace(scope: !3)
!401 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !400, file: !399, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !402, templateParams: !477)
!402 = !{!403, !404, !405, !406, !407, !408, !412, !416, !420, !425, !428, !431, !434, !438, !441, !446, !450, !453, !459, !462, !465, !470, !471, !474, !475, !476}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !401, file: !399, line: 32, baseType: !194, size: 32, flags: DIFlagPublic)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !401, file: !399, line: 32, baseType: !194, size: 32, offset: 32, flags: DIFlagPublic)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !401, file: !399, line: 32, baseType: !194, size: 32, offset: 64, flags: DIFlagPublic)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !401, file: !399, line: 33, baseType: !126, size: 32, offset: 96, flags: DIFlagPublic)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !401, file: !399, line: 34, baseType: !10, size: 8, offset: 128, flags: DIFlagPublic)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !401, file: !399, line: 35, baseType: !409, size: 8, offset: 136, flags: DIFlagPublic)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 1)
!412 = !DISubprogram(name: "Printer", scope: !401, file: !399, line: 37, type: !413, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !415, !126, !194}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!416 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !401, file: !399, line: 57, type: !417, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !415, !182}
!419 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !401, size: 32)
!420 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !401, file: !399, line: 67, type: !421, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{!419, !415, !423}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !37, line: 9, baseType: !424)
!424 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!425 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !401, file: !399, line: 72, type: !426, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(types: !427)
!427 = !{!419, !415, !262}
!428 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !401, file: !399, line: 77, type: !429, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{!419, !415, !211}
!431 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !401, file: !399, line: 82, type: !432, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!432 = !DISubroutineType(types: !433)
!433 = !{!419, !415, !260}
!434 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !401, file: !399, line: 87, type: !435, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{!419, !415, !437}
!437 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!438 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !401, file: !399, line: 92, type: !439, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{!419, !415, !156}
!441 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !401, file: !399, line: 97, type: !442, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!419, !415, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!446 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !401, file: !399, line: 102, type: !447, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!447 = !DISubroutineType(types: !448)
!448 = !{!419, !415, !449}
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!450 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !401, file: !399, line: 108, type: !451, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!419, !415, !251}
!453 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !401, file: !399, line: 113, type: !454, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!454 = !DISubroutineType(types: !455)
!455 = !{!419, !415, !456}
!456 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !457, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !201, line: 1550, baseType: !208)
!459 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !401, file: !399, line: 119, type: !460, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!460 = !DISubroutineType(types: !461)
!461 = !{!182, !415}
!462 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !401, file: !399, line: 131, type: !463, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !415}
!465 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !401, file: !399, line: 139, type: !466, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubroutineType(types: !467)
!467 = !{!211, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!470 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !401, file: !399, line: 143, type: !466, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !401, file: !399, line: 148, type: !472, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !415, !38}
!474 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !401, file: !399, line: 158, type: !460, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!475 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !401, file: !399, line: 162, type: !463, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!476 = !DISubprogram(name: "~Printer", scope: !401, file: !399, line: 166, type: !463, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!477 = !{!478, !479}
!478 = !DITemplateValueParameter(name: "type", type: !38, value: i32 0)
!479 = !DITemplateValueParameter(name: "length", type: !212, value: i64 1024)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !400, file: !399, line: 199, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !400, file: !399, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !482, templateParams: !545)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !493, !497, !500, !503, !506, !509, !512, !515, !518, !521, !524, !527, !530, !533, !538, !539, !542, !543, !544}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !481, file: !399, line: 32, baseType: !194, size: 32, flags: DIFlagPublic)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !481, file: !399, line: 32, baseType: !194, size: 32, offset: 32, flags: DIFlagPublic)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !481, file: !399, line: 32, baseType: !194, size: 32, offset: 64, flags: DIFlagPublic)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !481, file: !399, line: 33, baseType: !126, size: 32, offset: 96, flags: DIFlagPublic)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !481, file: !399, line: 34, baseType: !10, size: 8, offset: 128, flags: DIFlagPublic)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !481, file: !399, line: 35, baseType: !409, size: 8, offset: 136, flags: DIFlagPublic)
!489 = !DISubprogram(name: "Printer", scope: !481, file: !399, line: 37, type: !490, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492, !126, !194}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!493 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !481, file: !399, line: 57, type: !494, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !492, !182}
!496 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !481, size: 32)
!497 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !481, file: !399, line: 67, type: !498, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubroutineType(types: !499)
!499 = !{!496, !492, !423}
!500 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !481, file: !399, line: 72, type: !501, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!501 = !DISubroutineType(types: !502)
!502 = !{!496, !492, !262}
!503 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !481, file: !399, line: 77, type: !504, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{!496, !492, !211}
!506 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !481, file: !399, line: 82, type: !507, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!507 = !DISubroutineType(types: !508)
!508 = !{!496, !492, !260}
!509 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !481, file: !399, line: 87, type: !510, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(types: !511)
!511 = !{!496, !492, !437}
!512 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !481, file: !399, line: 92, type: !513, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!513 = !DISubroutineType(types: !514)
!514 = !{!496, !492, !156}
!515 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !481, file: !399, line: 97, type: !516, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(types: !517)
!517 = !{!496, !492, !444}
!518 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !481, file: !399, line: 102, type: !519, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubroutineType(types: !520)
!520 = !{!496, !492, !449}
!521 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !481, file: !399, line: 108, type: !522, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!522 = !DISubroutineType(types: !523)
!523 = !{!496, !492, !251}
!524 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !481, file: !399, line: 113, type: !525, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{!496, !492, !456}
!527 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !481, file: !399, line: 119, type: !528, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{!182, !492}
!530 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !481, file: !399, line: 131, type: !531, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !492}
!533 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !481, file: !399, line: 139, type: !534, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!211, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!538 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !481, file: !399, line: 143, type: !534, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !481, file: !399, line: 148, type: !540, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !492, !38}
!542 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !481, file: !399, line: 158, type: !528, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !481, file: !399, line: 162, type: !531, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DISubprogram(name: "~Printer", scope: !481, file: !399, line: 166, type: !531, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !{!546, !479}
!546 = !DITemplateValueParameter(name: "type", type: !38, value: i32 1)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !37, line: 15, baseType: !550)
!550 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !37, line: 13, baseType: !553)
!553 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "print", scope: !400, file: !399, line: 198, baseType: !401)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!566 = !{!0, !184, !392, !198}
!567 = !{!568, !569, !570}
!568 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !394, entity: !3, file: !37, line: 225)
!569 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !394, entity: !3, file: !6, line: 50)
!570 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !394, entity: !2, file: !6, line: 585)
!571 = !{i32 7, !"Dwarf Version", i32 4}
!572 = !{i32 2, !"Debug Info Version", i32 3}
!573 = !{i32 1, !"wchar_size", i32 4}
!574 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!575 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !576, line: 47, type: !577, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !593)
!576 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579, !38, !423, !423}
!579 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !576, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !582, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!582 = !{!583, !584, !585, !586, !590, !591, !592}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !581, file: !576, line: 35, baseType: !211, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !581, file: !576, line: 35, baseType: !211, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !581, file: !576, line: 37, baseType: !211, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !581, file: !576, line: 39, baseType: !587, size: 1024, offset: 192)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 1024, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 16)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !581, file: !576, line: 41, baseType: !587, size: 1024, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !581, file: !576, line: 42, baseType: !587, size: 1024, offset: 2240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !581, file: !576, line: 44, baseType: !211, size: 64, offset: 3264)
!593 = !{!594, !595, !596, !597, !598, !601, !602}
!594 = !DILocalVariable(name: "copy", arg: 1, scope: !575, file: !576, line: 47, type: !579)
!595 = !DILocalVariable(name: "d", arg: 2, scope: !575, file: !576, line: 47, type: !38)
!596 = !DILocalVariable(name: "src_off", arg: 3, scope: !575, file: !576, line: 47, type: !423)
!597 = !DILocalVariable(name: "dst_off", arg: 4, scope: !575, file: !576, line: 47, type: !423)
!598 = !DILocalVariable(name: "from", scope: !599, file: !576, line: 54, type: !444)
!599 = distinct !DILexicalBlock(scope: !600, file: !576, line: 53, column: 18)
!600 = distinct !DILexicalBlock(scope: !575, file: !576, line: 53, column: 9)
!601 = !DILocalVariable(name: "to", scope: !599, file: !576, line: 55, type: !126)
!602 = !DILocalVariable(name: "i", scope: !603, file: !576, line: 58, type: !211)
!603 = distinct !DILexicalBlock(scope: !604, file: !576, line: 58, column: 9)
!604 = distinct !DILexicalBlock(scope: !600, file: !576, line: 57, column: 12)
!605 = !DILocation(line: 0, scope: !575)
!606 = !DILocation(line: 49, column: 14, scope: !575)
!607 = !DILocation(line: 49, column: 19, scope: !575)
!608 = !DILocation(line: 49, column: 22, scope: !575)
!609 = !{!610, !610, i64 0}
!610 = !{!"long long", !611, i64 0}
!611 = !{!"omnipotent char", !612, i64 0}
!612 = !{!"Simple C++ TBAA"}
!613 = !DILocation(line: 49, column: 37, scope: !575)
!614 = !DILocation(line: 49, column: 5, scope: !575)
!615 = !DILocation(line: 50, column: 10, scope: !616)
!616 = distinct !DILexicalBlock(scope: !575, file: !576, line: 49, column: 43)
!617 = distinct !{!617, !614, !618, !619}
!618 = !DILocation(line: 51, column: 5, scope: !575)
!619 = !{!"llvm.loop.mustprogress"}
!620 = !DILocation(line: 53, column: 11, scope: !600)
!621 = !DILocation(line: 53, column: 9, scope: !575)
!622 = !DILocation(line: 0, scope: !603)
!623 = !DILocation(line: 58, column: 34, scope: !624)
!624 = distinct !DILexicalBlock(scope: !603, file: !576, line: 58, column: 9)
!625 = !DILocation(line: 58, column: 32, scope: !624)
!626 = !DILocation(line: 58, column: 9, scope: !603)
!627 = !DILocation(line: 54, column: 42, scope: !599)
!628 = !{!629, !610, i64 0}
!629 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !610, i64 0, !610, i64 8, !610, i64 16, !611, i64 24, !611, i64 152, !611, i64 280, !610, i64 408}
!630 = !DILocation(line: 54, column: 46, scope: !599)
!631 = !DILocation(line: 54, column: 28, scope: !599)
!632 = !DILocation(line: 0, scope: !599)
!633 = !DILocation(line: 55, column: 34, scope: !599)
!634 = !{!629, !610, i64 8}
!635 = !DILocation(line: 55, column: 38, scope: !599)
!636 = !DILocation(line: 55, column: 20, scope: !599)
!637 = !DILocation(line: 56, column: 31, scope: !599)
!638 = !{!629, !610, i64 408}
!639 = !DILocation(line: 56, column: 26, scope: !599)
!640 = !DILocation(line: 56, column: 9, scope: !599)
!641 = !DILocation(line: 57, column: 5, scope: !599)
!642 = !DILocation(line: 59, column: 13, scope: !643)
!643 = distinct !DILexicalBlock(scope: !624, file: !576, line: 58, column: 55)
!644 = !DILocation(line: 60, column: 24, scope: !643)
!645 = !DILocation(line: 60, column: 21, scope: !643)
!646 = !DILocation(line: 61, column: 24, scope: !643)
!647 = !DILocation(line: 61, column: 21, scope: !643)
!648 = !DILocation(line: 58, column: 51, scope: !624)
!649 = distinct !{!649, !626, !650, !619}
!650 = !DILocation(line: 62, column: 9, scope: !603)
!651 = !DILocation(line: 64, column: 1, scope: !575)
!652 = !DISubprogram(name: "memcpy", scope: !37, file: !37, line: 94, type: !653, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{!126, !126, !444, !18}
!655 = !{}
!656 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !576, line: 66, type: !657, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !579, !126}
!659 = !{!660, !661}
!660 = !DILocalVariable(name: "copy", arg: 1, scope: !656, file: !576, line: 66, type: !579)
!661 = !DILocalVariable(name: "user_context", arg: 2, scope: !656, file: !576, line: 66, type: !126)
!662 = !DILocation(line: 0, scope: !656)
!663 = !DILocation(line: 68, column: 14, scope: !664)
!664 = distinct !DILexicalBlock(scope: !656, file: !576, line: 68, column: 9)
!665 = !DILocation(line: 68, column: 26, scope: !664)
!666 = !DILocation(line: 68, column: 18, scope: !664)
!667 = !DILocation(line: 68, column: 9, scope: !656)
!668 = !DILocation(line: 69, column: 58, scope: !669)
!669 = distinct !DILexicalBlock(scope: !664, file: !576, line: 68, column: 31)
!670 = !{!629, !610, i64 16}
!671 = !DILocation(line: 69, column: 9, scope: !669)
!672 = !DILocation(line: 70, column: 5, scope: !669)
!673 = !DILocalVariable(name: "this", arg: 1, scope: !674, type: !678, flags: DIFlagArtificial | DIFlagObjectPointer)
!674 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !401, file: !399, line: 37, type: !413, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !412, retainedNodes: !675)
!675 = !{!673, !676, !677}
!676 = !DILocalVariable(name: "ctx", arg: 2, scope: !674, file: !399, line: 37, type: !126)
!677 = !DILocalVariable(name: "mem", arg: 3, scope: !674, file: !399, line: 37, type: !194)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!679 = !DILocation(line: 0, scope: !674, inlinedAt: !680)
!680 = distinct !DILocation(line: 71, column: 9, scope: !681)
!681 = distinct !DILexicalBlock(scope: !664, file: !576, line: 70, column: 12)
!682 = !DILocation(line: 44, column: 27, scope: !683, inlinedAt: !680)
!683 = distinct !DILexicalBlock(scope: !684, file: !399, line: 43, column: 16)
!684 = distinct !DILexicalBlock(scope: !685, file: !399, line: 41, column: 20)
!685 = distinct !DILexicalBlock(scope: !686, file: !399, line: 39, column: 13)
!686 = distinct !DILexicalBlock(scope: !674, file: !399, line: 38, column: 54)
!687 = !DILocation(line: 48, column: 13, scope: !688, inlinedAt: !680)
!688 = distinct !DILexicalBlock(scope: !686, file: !399, line: 48, column: 13)
!689 = !DILocation(line: 48, column: 13, scope: !686, inlinedAt: !680)
!690 = !DILocalVariable(name: "this", arg: 1, scope: !691, type: !678, flags: DIFlagArtificial | DIFlagObjectPointer)
!691 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !401, file: !399, line: 57, type: !417, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !416, retainedNodes: !692)
!692 = !{!690, !693}
!693 = !DILocalVariable(name: "arg", arg: 2, scope: !691, file: !399, line: 57, type: !182)
!694 = !DILocation(line: 0, scope: !691, inlinedAt: !695)
!695 = distinct !DILocation(line: 71, column: 29, scope: !681)
!696 = !DILocation(line: 62, column: 19, scope: !697, inlinedAt: !695)
!697 = distinct !DILexicalBlock(scope: !698, file: !399, line: 61, column: 16)
!698 = distinct !DILexicalBlock(scope: !691, file: !399, line: 59, column: 13)
!699 = !DILocalVariable(name: "this", arg: 1, scope: !700, type: !678, flags: DIFlagArtificial | DIFlagObjectPointer)
!700 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !401, file: !399, line: 166, type: !463, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !476, retainedNodes: !701)
!701 = !{!699}
!702 = !DILocation(line: 0, scope: !700, inlinedAt: !703)
!703 = distinct !DILocation(line: 71, column: 9, scope: !681)
!704 = !DILocation(line: 168, column: 13, scope: !705, inlinedAt: !703)
!705 = distinct !DILexicalBlock(scope: !706, file: !399, line: 167, column: 19)
!706 = distinct !DILexicalBlock(scope: !707, file: !399, line: 167, column: 13)
!707 = distinct !DILexicalBlock(scope: !700, file: !399, line: 166, column: 16)
!708 = !DILocation(line: 169, column: 9, scope: !705, inlinedAt: !703)
!709 = !DILocation(line: 49, column: 23, scope: !710, inlinedAt: !680)
!710 = distinct !DILexicalBlock(scope: !688, file: !399, line: 48, column: 18)
!711 = !DILocation(line: 50, column: 18, scope: !710, inlinedAt: !680)
!712 = !{!611, !611, i64 0}
!713 = !DILocalVariable(name: "this", arg: 1, scope: !714, type: !678, flags: DIFlagArtificial | DIFlagObjectPointer)
!714 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !401, file: !399, line: 162, type: !463, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !475, retainedNodes: !715)
!715 = !{!713}
!716 = !DILocation(line: 0, scope: !714, inlinedAt: !717)
!717 = distinct !DILocation(line: 170, column: 13, scope: !718, inlinedAt: !703)
!718 = distinct !DILexicalBlock(scope: !706, file: !399, line: 169, column: 16)
!719 = !DILocation(line: 163, column: 81, scope: !714, inlinedAt: !717)
!720 = !DILocation(line: 163, column: 87, scope: !714, inlinedAt: !717)
!721 = !DILocation(line: 163, column: 77, scope: !714, inlinedAt: !717)
!722 = !DILocation(line: 163, column: 15, scope: !714, inlinedAt: !717)
!723 = !DILocation(line: 174, column: 17, scope: !724, inlinedAt: !703)
!724 = distinct !DILexicalBlock(scope: !725, file: !399, line: 173, column: 46)
!725 = distinct !DILexicalBlock(scope: !726, file: !399, line: 173, column: 24)
!726 = distinct !DILexicalBlock(scope: !718, file: !399, line: 171, column: 17)
!727 = !DILocation(line: 181, column: 13, scope: !728, inlinedAt: !703)
!728 = distinct !DILexicalBlock(scope: !729, file: !399, line: 180, column: 40)
!729 = distinct !DILexicalBlock(scope: !707, file: !399, line: 180, column: 13)
!730 = !DILocation(line: 73, column: 1, scope: !656)
!731 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !576, line: 76, type: !732, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !735)
!732 = !DISubroutineType(types: !733)
!733 = !{!581, !734, !10, !734, !10}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!735 = !{!736, !737, !738, !739, !740, !741, !743, !745, !748, !751, !753, !756, !757, !758, !760}
!736 = !DILocalVariable(name: "src", arg: 1, scope: !731, file: !576, line: 76, type: !734)
!737 = !DILocalVariable(name: "src_host", arg: 2, scope: !731, file: !576, line: 76, type: !10)
!738 = !DILocalVariable(name: "dst", arg: 3, scope: !731, file: !576, line: 77, type: !734)
!739 = !DILocalVariable(name: "dst_host", arg: 4, scope: !731, file: !576, line: 77, type: !10)
!740 = !DILocalVariable(name: "c", scope: !731, file: !576, line: 79, type: !581)
!741 = !DILocalVariable(name: "i", scope: !742, file: !576, line: 83, type: !38)
!742 = distinct !DILexicalBlock(scope: !731, file: !576, line: 83, column: 5)
!743 = !DILocalVariable(name: "i", scope: !744, file: !576, line: 91, type: !38)
!744 = distinct !DILexicalBlock(scope: !731, file: !576, line: 91, column: 5)
!745 = !DILocalVariable(name: "zero", scope: !746, file: !576, line: 100, type: !581)
!746 = distinct !DILexicalBlock(scope: !747, file: !576, line: 98, column: 42)
!747 = distinct !DILexicalBlock(scope: !731, file: !576, line: 96, column: 9)
!748 = !DILocalVariable(name: "zero", scope: !749, file: !576, line: 107, type: !581)
!749 = distinct !DILexicalBlock(scope: !750, file: !576, line: 104, column: 28)
!750 = distinct !DILexicalBlock(scope: !731, file: !576, line: 104, column: 9)
!751 = !DILocalVariable(name: "i", scope: !752, file: !576, line: 115, type: !38)
!752 = distinct !DILexicalBlock(scope: !731, file: !576, line: 115, column: 5)
!753 = !DILocalVariable(name: "dst_stride_bytes", scope: !754, file: !576, line: 117, type: !211)
!754 = distinct !DILexicalBlock(scope: !755, file: !576, line: 115, column: 47)
!755 = distinct !DILexicalBlock(scope: !752, file: !576, line: 115, column: 5)
!756 = !DILocalVariable(name: "src_stride_bytes", scope: !754, file: !576, line: 118, type: !211)
!757 = !DILocalVariable(name: "insert", scope: !754, file: !576, line: 120, type: !38)
!758 = !DILocalVariable(name: "j", scope: !759, file: !576, line: 128, type: !38)
!759 = distinct !DILexicalBlock(scope: !754, file: !576, line: 128, column: 9)
!760 = !DILocalVariable(name: "j", scope: !761, file: !576, line: 151, type: !38)
!761 = distinct !DILexicalBlock(scope: !762, file: !576, line: 151, column: 9)
!762 = distinct !DILexicalBlock(scope: !731, file: !576, line: 145, column: 51)
!763 = !DILocation(line: 0, scope: !731)
!764 = !DILocation(line: 79, column: 5, scope: !731)
!765 = !DILocation(line: 79, column: 17, scope: !731)
!766 = !DILocation(line: 80, column: 13, scope: !731)
!767 = !DILocation(line: 80, column: 39, scope: !731)
!768 = !{!769, !770, i64 12}
!769 = !{!"_ZTS15halide_buffer_t", !610, i64 0, !770, i64 8, !770, i64 12, !610, i64 16, !771, i64 24, !774, i64 28, !770, i64 32, !770, i64 36}
!770 = !{!"any pointer", !611, i64 0}
!771 = !{!"_ZTS13halide_type_t", !772, i64 0, !611, i64 1, !773, i64 2}
!772 = !{!"_ZTS18halide_type_code_t", !611, i64 0}
!773 = !{!"short", !611, i64 0}
!774 = !{!"int", !611, i64 0}
!775 = !DILocation(line: 80, column: 24, scope: !731)
!776 = !DILocation(line: 80, column: 51, scope: !731)
!777 = !{!769, !610, i64 0}
!778 = !DILocation(line: 80, column: 7, scope: !731)
!779 = !DILocation(line: 80, column: 11, scope: !731)
!780 = !DILocation(line: 81, column: 13, scope: !731)
!781 = !DILocation(line: 81, column: 39, scope: !731)
!782 = !DILocation(line: 81, column: 24, scope: !731)
!783 = !DILocation(line: 81, column: 51, scope: !731)
!784 = !DILocation(line: 81, column: 7, scope: !731)
!785 = !DILocation(line: 81, column: 11, scope: !731)
!786 = !DILocalVariable(name: "this", arg: 1, scope: !787, type: !789, flags: DIFlagArtificial | DIFlagObjectPointer)
!787 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !221, file: !201, line: 481, type: !255, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !254, retainedNodes: !788)
!788 = !{!786}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!790 = !DILocation(line: 0, scope: !787, inlinedAt: !791)
!791 = distinct !DILocation(line: 82, column: 30, scope: !731)
!792 = !DILocation(line: 482, column: 17, scope: !787, inlinedAt: !791)
!793 = !{!771, !611, i64 1}
!794 = !DILocation(line: 482, column: 22, scope: !787, inlinedAt: !791)
!795 = !DILocation(line: 482, column: 27, scope: !787, inlinedAt: !791)
!796 = !DILocation(line: 82, column: 20, scope: !731)
!797 = !DILocation(line: 82, column: 7, scope: !731)
!798 = !DILocation(line: 82, column: 18, scope: !731)
!799 = !DILocation(line: 0, scope: !742)
!800 = !DILocation(line: 84, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !576, line: 83, column: 45)
!802 = distinct !DILexicalBlock(scope: !742, file: !576, line: 83, column: 5)
!803 = !DILocation(line: 84, column: 21, scope: !801)
!804 = !DILocation(line: 85, column: 9, scope: !801)
!805 = !DILocation(line: 85, column: 31, scope: !801)
!806 = !DILocation(line: 86, column: 9, scope: !801)
!807 = !DILocation(line: 86, column: 31, scope: !801)
!808 = !DILocation(line: 90, column: 7, scope: !731)
!809 = !DILocation(line: 0, scope: !744)
!810 = !DILocation(line: 91, column: 30, scope: !811)
!811 = distinct !DILexicalBlock(scope: !744, file: !576, line: 91, column: 5)
!812 = !{!769, !774, i64 28}
!813 = !DILocation(line: 91, column: 23, scope: !811)
!814 = !DILocation(line: 91, column: 5, scope: !744)
!815 = !{!769, !770, i64 32}
!816 = !DILocation(line: 94, column: 17, scope: !731)
!817 = !DILocation(line: 94, column: 22, scope: !731)
!818 = !DILocation(line: 96, column: 33, scope: !747)
!819 = !DILocation(line: 96, column: 25, scope: !747)
!820 = !DILocation(line: 96, column: 44, scope: !747)
!821 = !DILocation(line: 92, column: 46, scope: !822)
!822 = distinct !DILexicalBlock(scope: !811, file: !576, line: 91, column: 47)
!823 = !{!824, !774, i64 8}
!824 = !{!"_ZTS18halide_dimension_t", !774, i64 0, !774, i64 4, !774, i64 8, !774, i64 12}
!825 = !DILocation(line: 92, column: 34, scope: !822)
!826 = !DILocation(line: 92, column: 68, scope: !822)
!827 = !{!824, !774, i64 0}
!828 = !DILocation(line: 92, column: 86, scope: !822)
!829 = !DILocation(line: 92, column: 72, scope: !822)
!830 = !DILocation(line: 92, column: 55, scope: !822)
!831 = !DILocation(line: 92, column: 53, scope: !822)
!832 = !DILocation(line: 92, column: 21, scope: !822)
!833 = !DILocation(line: 91, column: 43, scope: !811)
!834 = distinct !{!834, !814, !835, !619}
!835 = !DILocation(line: 93, column: 5, scope: !744)
!836 = !DILocation(line: 0, scope: !787, inlinedAt: !837)
!837 = distinct !DILocation(line: 97, column: 19, scope: !747)
!838 = !DILocation(line: 0, scope: !787, inlinedAt: !839)
!839 = distinct !DILocation(line: 97, column: 40, scope: !747)
!840 = !DILocation(line: 482, column: 17, scope: !787, inlinedAt: !839)
!841 = !DILocation(line: 482, column: 22, scope: !787, inlinedAt: !839)
!842 = !DILocation(line: 482, column: 27, scope: !787, inlinedAt: !839)
!843 = !DILocation(line: 97, column: 27, scope: !747)
!844 = !DILocation(line: 97, column: 48, scope: !747)
!845 = !DILocation(line: 100, column: 21, scope: !746)
!846 = !DILocation(line: 101, column: 9, scope: !746)
!847 = !DILocation(line: 104, column: 22, scope: !750)
!848 = !DILocation(line: 104, column: 9, scope: !731)
!849 = !DILocation(line: 0, scope: !752)
!850 = !DILocation(line: 115, column: 5, scope: !752)
!851 = !DILocation(line: 107, column: 21, scope: !749)
!852 = !DILocation(line: 108, column: 9, scope: !749)
!853 = !DILocation(line: 144, column: 14, scope: !731)
!854 = !DILocation(line: 144, column: 28, scope: !731)
!855 = !DILocation(line: 144, column: 25, scope: !731)
!856 = !DILocation(line: 144, column: 50, scope: !731)
!857 = !DILocation(line: 145, column: 28, scope: !731)
!858 = !DILocation(line: 117, column: 59, scope: !754)
!859 = !DILocation(line: 117, column: 47, scope: !754)
!860 = !DILocation(line: 0, scope: !787, inlinedAt: !861)
!861 = distinct !DILocation(line: 117, column: 78, scope: !754)
!862 = !DILocation(line: 117, column: 66, scope: !754)
!863 = !DILocation(line: 0, scope: !754)
!864 = !DILocation(line: 118, column: 59, scope: !754)
!865 = !DILocation(line: 118, column: 47, scope: !754)
!866 = !DILocation(line: 0, scope: !787, inlinedAt: !867)
!867 = distinct !DILocation(line: 118, column: 78, scope: !754)
!868 = !DILocation(line: 118, column: 66, scope: !754)
!869 = !DILocation(line: 121, column: 33, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !576, line: 121, column: 9)
!871 = distinct !DILexicalBlock(scope: !754, file: !576, line: 121, column: 9)
!872 = !DILocation(line: 121, column: 9, scope: !871)
!873 = !DILocation(line: 124, column: 36, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !576, line: 124, column: 17)
!875 = distinct !DILexicalBlock(scope: !870, file: !576, line: 121, column: 48)
!876 = !DILocation(line: 124, column: 34, scope: !874)
!877 = !DILocation(line: 124, column: 63, scope: !874)
!878 = !DILocation(line: 121, column: 44, scope: !870)
!879 = distinct !{!879, !872, !880, !619}
!880 = !DILocation(line: 127, column: 9, scope: !871)
!881 = !DILocation(line: 0, scope: !871)
!882 = !DILocation(line: 0, scope: !759)
!883 = !DILocation(line: 128, column: 27, scope: !884)
!884 = distinct !DILexicalBlock(scope: !759, file: !576, line: 128, column: 9)
!885 = !DILocation(line: 128, column: 9, scope: !759)
!886 = !DILocation(line: 133, column: 40, scope: !754)
!887 = !{!824, !774, i64 4}
!888 = !DILocation(line: 133, column: 28, scope: !754)
!889 = !DILocation(line: 133, column: 9, scope: !754)
!890 = !DILocation(line: 133, column: 26, scope: !754)
!891 = !DILocation(line: 135, column: 9, scope: !754)
!892 = !DILocation(line: 135, column: 36, scope: !754)
!893 = !DILocation(line: 136, column: 9, scope: !754)
!894 = !DILocation(line: 136, column: 36, scope: !754)
!895 = !DILocation(line: 115, column: 43, scope: !755)
!896 = !DILocation(line: 115, column: 23, scope: !755)
!897 = distinct !{!897, !850, !898, !619}
!898 = !DILocation(line: 137, column: 5, scope: !752)
!899 = !DILocation(line: 129, column: 38, scope: !900)
!900 = distinct !DILexicalBlock(scope: !884, file: !576, line: 128, column: 42)
!901 = !DILocation(line: 129, column: 27, scope: !900)
!902 = !DILocation(line: 129, column: 13, scope: !900)
!903 = !DILocation(line: 129, column: 25, scope: !900)
!904 = !DILocation(line: 130, column: 37, scope: !900)
!905 = !DILocation(line: 130, column: 13, scope: !900)
!906 = !DILocation(line: 130, column: 35, scope: !900)
!907 = !DILocation(line: 131, column: 37, scope: !900)
!908 = !DILocation(line: 131, column: 13, scope: !900)
!909 = !DILocation(line: 131, column: 35, scope: !900)
!910 = distinct !{!910, !885, !911, !619}
!911 = !DILocation(line: 132, column: 9, scope: !759)
!912 = !DILocation(line: 145, column: 25, scope: !731)
!913 = !DILocation(line: 144, column: 5, scope: !731)
!914 = !DILocation(line: 147, column: 25, scope: !762)
!915 = !DILocation(line: 147, column: 22, scope: !762)
!916 = !DILocation(line: 0, scope: !761)
!917 = !DILocation(line: 152, column: 31, scope: !918)
!918 = distinct !DILexicalBlock(scope: !919, file: !576, line: 151, column: 49)
!919 = distinct !DILexicalBlock(scope: !761, file: !576, line: 151, column: 9)
!920 = !DILocation(line: 152, column: 29, scope: !918)
!921 = !DILocation(line: 153, column: 41, scope: !918)
!922 = !DILocation(line: 153, column: 39, scope: !918)
!923 = !DILocation(line: 154, column: 41, scope: !918)
!924 = !DILocation(line: 154, column: 39, scope: !918)
!925 = !DILocation(line: 156, column: 37, scope: !762)
!926 = !DILocation(line: 157, column: 47, scope: !762)
!927 = !DILocation(line: 158, column: 47, scope: !762)
!928 = distinct !{!928, !913, !929, !619}
!929 = !DILocation(line: 159, column: 5, scope: !731)
!930 = !DILocation(line: 160, column: 12, scope: !731)
!931 = !{i64 0, i64 8, !609, i64 8, i64 8, !609, i64 16, i64 8, !609, i64 24, i64 128, !712, i64 152, i64 128, !712, i64 280, i64 128, !712, i64 408, i64 8, !609}
!932 = !DILocation(line: 160, column: 5, scope: !731)
!933 = !DILocation(line: 161, column: 1, scope: !731)
!934 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !576, line: 163, type: !935, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !937)
!935 = !DISubroutineType(types: !936)
!936 = !{!581, !734}
!937 = !{!938}
!938 = !DILocalVariable(name: "buf", arg: 1, scope: !934, file: !576, line: 163, type: !734)
!939 = !DILocation(line: 0, scope: !934)
!940 = !DILocation(line: 164, column: 12, scope: !934)
!941 = !DILocation(line: 164, column: 5, scope: !934)
!942 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !576, line: 167, type: !935, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !943)
!943 = !{!944}
!944 = !DILocalVariable(name: "buf", arg: 1, scope: !942, file: !576, line: 167, type: !734)
!945 = !DILocation(line: 0, scope: !942)
!946 = !DILocation(line: 168, column: 12, scope: !942)
!947 = !DILocation(line: 168, column: 5, scope: !942)
!948 = distinct !DISubprogram(name: "gl_error_name", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute13gl_error_nameEi", scope: !2, file: !6, line: 59, type: !949, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{!182, !262}
!951 = !{!952}
!952 = !DILocalVariable(name: "err", arg: 1, scope: !948, file: !6, line: 59, type: !262)
!953 = !DILocation(line: 0, scope: !948)
!954 = !DILocation(line: 60, column: 5, scope: !948)
!955 = !DILocation(line: 65, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !948, file: !6, line: 60, column: 18)
!957 = !DILocation(line: 68, column: 9, scope: !956)
!958 = !DILocation(line: 71, column: 9, scope: !956)
!959 = !DILocation(line: 74, column: 9, scope: !956)
!960 = !DILocation(line: 77, column: 9, scope: !956)
!961 = !DILocation(line: 80, column: 9, scope: !956)
!962 = !DILocation(line: 83, column: 9, scope: !956)
!963 = !DILocation(line: 86, column: 9, scope: !956)
!964 = !DILocation(line: 89, column: 5, scope: !948)
!965 = !DILocation(line: 90, column: 1, scope: !948)
!966 = distinct !DISubprogram(name: "find_kernel_by_name", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute19find_kernel_by_nameEPKcPKNS2_11ModuleStateE", scope: !2, file: !6, line: 114, type: !967, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !971)
!967 = !DISubroutineType(types: !968)
!968 = !{!190, !182, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!971 = !{!972, !973, !974}
!972 = !DILocalVariable(name: "kernel_name", arg: 1, scope: !966, file: !6, line: 114, type: !182)
!973 = !DILocalVariable(name: "module", arg: 2, scope: !966, file: !6, line: 114, type: !969)
!974 = !DILocalVariable(name: "kernel", scope: !966, file: !6, line: 115, type: !190)
!975 = !DILocation(line: 0, scope: !966)
!976 = !DILocation(line: 115, column: 34, scope: !966)
!977 = !{!770, !770, i64 0}
!978 = !DILocation(line: 116, column: 12, scope: !966)
!979 = !DILocation(line: 116, column: 19, scope: !966)
!980 = !DILocation(line: 116, column: 50, scope: !966)
!981 = !{!982, !770, i64 0}
!982 = !{!"_ZTSN6Halide7Runtime8Internal13OpenGLCompute10KernelInfoE", !770, i64 0, !774, i64 4, !770, i64 8}
!983 = !DILocation(line: 116, column: 22, scope: !966)
!984 = !DILocation(line: 116, column: 63, scope: !966)
!985 = !DILocation(line: 116, column: 5, scope: !966)
!986 = !DILocation(line: 117, column: 26, scope: !987)
!987 = distinct !DILexicalBlock(scope: !966, file: !6, line: 116, column: 69)
!988 = distinct !{!988, !985, !989, !619}
!989 = !DILocation(line: 118, column: 5, scope: !966)
!990 = !DILocation(line: 119, column: 5, scope: !966)
!991 = !DISubprogram(name: "strcmp", scope: !37, file: !37, line: 90, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!992 = !DISubroutineType(types: !993)
!993 = !{!38, !182, !182}
!994 = distinct !DISubprogram(name: "CheckAndReportError", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute11GlobalState19CheckAndReportErrorEPvPKc", scope: !7, file: !6, line: 135, type: !180, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !179, retainedNodes: !995)
!995 = !{!996, !998, !999, !1000}
!996 = !DILocalVariable(name: "this", arg: 1, scope: !994, type: !997, flags: DIFlagArtificial | DIFlagObjectPointer)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!998 = !DILocalVariable(name: "user_context", arg: 2, scope: !994, file: !6, line: 135, type: !126)
!999 = !DILocalVariable(name: "location", arg: 3, scope: !994, file: !6, line: 135, type: !182)
!1000 = !DILocalVariable(name: "err", scope: !994, file: !6, line: 136, type: !24)
!1001 = !DILocation(line: 0, scope: !994)
!1002 = !DILocation(line: 136, column: 18, scope: !994)
!1003 = !{!1004, !770, i64 56}
!1004 = !{!"_ZTSN6Halide7Runtime8Internal13OpenGLCompute11GlobalStateE", !1005, i64 0, !770, i64 4, !770, i64 8, !770, i64 12, !770, i64 16, !770, i64 20, !770, i64 24, !770, i64 28, !770, i64 32, !770, i64 36, !770, i64 40, !770, i64 44, !770, i64 48, !770, i64 52, !770, i64 56, !770, i64 60, !770, i64 64, !770, i64 68, !770, i64 72, !770, i64 76, !770, i64 80, !770, i64 84, !770, i64 88, !770, i64 92, !770, i64 96, !770, i64 100, !770, i64 104, !770, i64 108, !770, i64 112, !770, i64 116, !770, i64 120}
!1005 = !{!"bool", !611, i64 0}
!1006 = !DILocation(line: 137, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !994, file: !6, line: 137, column: 9)
!1008 = !DILocation(line: 137, column: 9, scope: !994)
!1009 = !DILocalVariable(name: "this", arg: 1, scope: !1010, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1010 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EEC2EPvPc", scope: !481, file: !399, line: 37, type: !490, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !489, retainedNodes: !1011)
!1011 = !{!1009, !1012, !1013}
!1012 = !DILocalVariable(name: "ctx", arg: 2, scope: !1010, file: !399, line: 37, type: !126)
!1013 = !DILocalVariable(name: "mem", arg: 3, scope: !1010, file: !399, line: 37, type: !194)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!1015 = !DILocation(line: 0, scope: !1010, inlinedAt: !1016)
!1016 = distinct !DILocation(line: 138, column: 9, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1007, file: !6, line: 137, column: 29)
!1018 = !DILocation(line: 44, column: 27, scope: !1019, inlinedAt: !1016)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !399, line: 43, column: 16)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !399, line: 41, column: 20)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !399, line: 39, column: 13)
!1022 = distinct !DILexicalBlock(scope: !1010, file: !399, line: 38, column: 54)
!1023 = !DILocation(line: 48, column: 13, scope: !1024, inlinedAt: !1016)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !399, line: 48, column: 13)
!1025 = !DILocation(line: 48, column: 13, scope: !1022, inlinedAt: !1016)
!1026 = !DILocation(line: 49, column: 23, scope: !1027, inlinedAt: !1016)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !399, line: 48, column: 18)
!1028 = !DILocation(line: 50, column: 18, scope: !1027, inlinedAt: !1016)
!1029 = !DILocation(line: 51, column: 9, scope: !1027, inlinedAt: !1016)
!1030 = !DILocation(line: 0, scope: !1024, inlinedAt: !1016)
!1031 = !DILocalVariable(name: "this", arg: 1, scope: !1032, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1032 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !481, file: !399, line: 57, type: !494, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !493, retainedNodes: !1033)
!1033 = !{!1031, !1034}
!1034 = !DILocalVariable(name: "arg", arg: 2, scope: !1032, file: !399, line: 57, type: !182)
!1035 = !DILocation(line: 0, scope: !1032, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 139, column: 13, scope: !1017)
!1037 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1036)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !399, line: 61, column: 16)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !399, line: 59, column: 13)
!1040 = !DILocation(line: 139, column: 35, scope: !1017)
!1041 = !DILocation(line: 0, scope: !1032, inlinedAt: !1042)
!1042 = distinct !DILocation(line: 139, column: 32, scope: !1017)
!1043 = !DILocation(line: 59, column: 17, scope: !1039, inlinedAt: !1042)
!1044 = !DILocation(line: 59, column: 13, scope: !1032, inlinedAt: !1042)
!1045 = !DILocation(line: 60, column: 19, scope: !1046, inlinedAt: !1042)
!1046 = distinct !DILexicalBlock(scope: !1039, file: !399, line: 59, column: 29)
!1047 = !DILocation(line: 61, column: 9, scope: !1046, inlinedAt: !1042)
!1048 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1042)
!1049 = !DILocation(line: 0, scope: !1039, inlinedAt: !1042)
!1050 = !DILocation(line: 0, scope: !1032, inlinedAt: !1051)
!1051 = distinct !DILocation(line: 140, column: 13, scope: !1017)
!1052 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1051)
!1053 = !DILocalVariable(name: "this", arg: 1, scope: !1054, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1054 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !481, file: !399, line: 72, type: !501, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !500, retainedNodes: !1055)
!1055 = !{!1053, !1056}
!1056 = !DILocalVariable(name: "arg", arg: 2, scope: !1054, file: !399, line: 72, type: !262)
!1057 = !DILocation(line: 0, scope: !1054, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 140, column: 20, scope: !1017)
!1059 = !DILocation(line: 73, column: 48, scope: !1054, inlinedAt: !1058)
!1060 = !DILocation(line: 73, column: 15, scope: !1054, inlinedAt: !1058)
!1061 = !DILocation(line: 0, scope: !1032, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 140, column: 32, scope: !1017)
!1063 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1062)
!1064 = !DILocation(line: 0, scope: !1032, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 141, column: 13, scope: !1017)
!1066 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1065)
!1067 = !DILocation(line: 0, scope: !1032, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 141, column: 23, scope: !1017)
!1069 = !DILocation(line: 59, column: 17, scope: !1039, inlinedAt: !1068)
!1070 = !DILocation(line: 59, column: 13, scope: !1032, inlinedAt: !1068)
!1071 = !DILocation(line: 60, column: 19, scope: !1046, inlinedAt: !1068)
!1072 = !DILocation(line: 61, column: 9, scope: !1046, inlinedAt: !1068)
!1073 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1068)
!1074 = !DILocation(line: 0, scope: !1039, inlinedAt: !1068)
!1075 = !DILocation(line: 0, scope: !1032, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 141, column: 35, scope: !1017)
!1077 = !DILocation(line: 62, column: 19, scope: !1038, inlinedAt: !1076)
!1078 = !DILocalVariable(name: "this", arg: 1, scope: !1079, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1079 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EED2Ev", scope: !481, file: !399, line: 166, type: !531, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !544, retainedNodes: !1080)
!1080 = !{!1078}
!1081 = !DILocation(line: 0, scope: !1079, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 138, column: 9, scope: !1017)
!1083 = !DILocation(line: 167, column: 13, scope: !1084, inlinedAt: !1082)
!1084 = distinct !DILexicalBlock(scope: !1079, file: !399, line: 166, column: 16)
!1085 = !DILocation(line: 168, column: 13, scope: !1086, inlinedAt: !1082)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !399, line: 167, column: 19)
!1087 = distinct !DILexicalBlock(scope: !1084, file: !399, line: 167, column: 13)
!1088 = !DILocation(line: 169, column: 9, scope: !1086, inlinedAt: !1082)
!1089 = !DILocalVariable(name: "this", arg: 1, scope: !1090, type: !1014, flags: DIFlagArtificial | DIFlagObjectPointer)
!1090 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !481, file: !399, line: 162, type: !531, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !394, declaration: !543, retainedNodes: !1091)
!1091 = !{!1089}
!1092 = !DILocation(line: 0, scope: !1090, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 170, column: 13, scope: !1094, inlinedAt: !1082)
!1094 = distinct !DILexicalBlock(scope: !1087, file: !399, line: 169, column: 16)
!1095 = !DILocation(line: 163, column: 81, scope: !1090, inlinedAt: !1093)
!1096 = !DILocation(line: 163, column: 87, scope: !1090, inlinedAt: !1093)
!1097 = !DILocation(line: 163, column: 77, scope: !1090, inlinedAt: !1093)
!1098 = !DILocation(line: 163, column: 15, scope: !1090, inlinedAt: !1093)
!1099 = !DILocation(line: 172, column: 17, scope: !1100, inlinedAt: !1082)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !399, line: 171, column: 39)
!1101 = distinct !DILexicalBlock(scope: !1094, file: !399, line: 171, column: 17)
!1102 = !DILocation(line: 181, column: 13, scope: !1103, inlinedAt: !1082)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !399, line: 180, column: 40)
!1104 = distinct !DILexicalBlock(scope: !1084, file: !399, line: 180, column: 13)
!1105 = !DILocation(line: 142, column: 9, scope: !1017)
!1106 = !DILocation(line: 145, column: 1, scope: !994)
!1107 = distinct !DISubprogram(name: "debug_buffer", linkageName: "_ZN6Halide7Runtime8Internal13OpenGLCompute12debug_bufferEPvP15halide_buffer_t", scope: !2, file: !6, line: 154, type: !1108, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !1110)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !126, !558}
!1110 = !{!1111, !1112}
!1111 = !DILocalVariable(name: "user_context", arg: 1, scope: !1107, file: !6, line: 154, type: !126)
!1112 = !DILocalVariable(name: "buf", arg: 2, scope: !1107, file: !6, line: 154, type: !558)
!1113 = !DILocation(line: 0, scope: !1107)
!1114 = !DILocation(line: 155, column: 5, scope: !1107)
!1115 = !DILocation(line: 0, scope: !674, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 155, column: 5, scope: !1107)
!1117 = !DILocation(line: 38, column: 11, scope: !674, inlinedAt: !1116)
!1118 = !{!1119, !770, i64 12}
!1119 = !{!"_ZTSN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEE", !770, i64 0, !770, i64 4, !770, i64 8, !770, i64 12, !1005, i64 16, !611, i64 17}
!1120 = !DILocation(line: 38, column: 30, scope: !674, inlinedAt: !1116)
!1121 = !{!1119, !1005, i64 16}
!1122 = !DILocation(line: 44, column: 27, scope: !683, inlinedAt: !1116)
!1123 = !DILocation(line: 44, column: 13, scope: !683, inlinedAt: !1116)
!1124 = !DILocation(line: 44, column: 17, scope: !683, inlinedAt: !1116)
!1125 = !{!1119, !770, i64 0}
!1126 = !DILocation(line: 47, column: 9, scope: !686, inlinedAt: !1116)
