; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads_tsan.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads_tsan.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::work_queue_t" = type { %struct.halide_mutex, i32, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i32, i32, [4 x i8], %struct.halide_cond, %struct.halide_cond, %struct.halide_cond, i32, i32, [256 x %struct.halide_thread*], i8, i8, i32 }
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::work" = type { %struct.halide_parallel_task_t, i32 (i8*, i32, i8*)*, %"struct.Halide::Runtime::Internal::work"*, %"struct.Halide::Runtime::Internal::work"*, i32, %"struct.Halide::Runtime::Internal::work"*, i32, i8*, i32, i32, i32, i8 }
%struct.halide_parallel_task_t = type { i32 (i8*, i32, i32, i8*, i8*)*, i8*, i8*, %struct.halide_semaphore_acquire_t*, i32, i32, i32, i32, i8, [7 x i8] }
%struct.halide_semaphore_acquire_t = type { %struct.halide_semaphore_t*, i32, [4 x i8] }
%struct.halide_semaphore_t = type { [2 x i64] }
%struct.halide_cond = type { [1 x i64] }
%struct.halide_thread = type { i32 }
%struct._qurt_thread_attr = type { [16 x i8], i8, i8, i16, i8, i8, i16, i32, i8* }
%"class.Halide::Runtime::Internal::Synchronization::word_lock" = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "halide_qurt_default_thread_priority", scope: !2, file: !8, line: 37, type: !409, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !3, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !310, imports: !404, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/qurt_threads_tsan.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!4 = !{}
!5 = !{!6, !25, !26, !30, !101, !136, !137, !178, !203, !213, !184, !223, !236, !240, !248, !305, !173, !265, !309}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spawned_thread", scope: !9, file: !8, line: 14, size: 256, flags: DIFlagTypePassByValue, elements: !10)
!8 = !DIFile(filename: "src/runtime/qurt_threads.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !DINamespace(scope: null)
!10 = !{!11, !16, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !7, file: !8, line: 15, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !7, file: !8, line: 16, baseType: !15, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !7, file: !8, line: 17, baseType: !15, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !7, file: !8, line: 18, baseType: !19, size: 32, offset: 192)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 9, size: 32, flags: DIFlagTypePassByValue, elements: !20, identifier: "_ZTS13halide_thread")
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !8, line: 10, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_t", file: !23, line: 18, baseType: !24)
!23 = !DIFile(filename: "src/runtime/mini_qurt.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !27, line: 61, baseType: !28)
!27 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !27, line: 10, baseType: !29)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word_lock_queue_data", scope: !33, file: !32, line: 254, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !37, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE")
!32 = !DIFile(filename: "src/runtime/synchronization_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!33 = !DINamespace(name: "Synchronization", scope: !34)
!34 = !DINamespace(name: "Internal", scope: !35)
!35 = !DINamespace(name: "Runtime", scope: !36)
!36 = !DINamespace(name: "Halide", scope: null)
!37 = !{!38, !93, !94, !95, !96, !100}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !31, file: !32, line: 255, baseType: !39, size: 320)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_parker", scope: !33, file: !8, line: 84, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !40, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE")
!40 = !{!41, !53, !65, !67, !73, !77, !81, !84, !87, !88, !89, !90, !91, !92}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !39, file: !8, line: 85, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_mutex_t", file: !23, line: 211, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "qurt_mutex_aligned8", file: !23, line: 201, size: 128, flags: DIFlagTypePassByValue, elements: !44, identifier: "_ZTS19qurt_mutex_aligned8")
!44 = !{!45, !52}
!45 = !DIDerivedType(tag: DW_TAG_member, scope: !43, file: !23, line: 203, baseType: !46, size: 128)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !23, line: 203, size: 128, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !47, identifier: "_ZTSN19qurt_mutex_aligned8Ut_E")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "holder", scope: !46, file: !23, line: 204, baseType: !24, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !23, line: 205, baseType: !24, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !46, file: !23, line: 206, baseType: !24, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !46, file: !23, line: 207, baseType: !24, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !43, file: !23, line: 209, baseType: !29, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !39, file: !8, line: 86, baseType: !54, size: 128, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_cond_t", file: !23, line: 224, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !23, line: 214, size: 128, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTS11qurt_cond_t")
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !55, file: !23, line: 216, baseType: !29, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !55, file: !23, line: 222, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !55, file: !23, line: 217, size: 128, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN11qurt_cond_tUt_E")
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !59, file: !23, line: 218, baseType: !24, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "n_waiting", scope: !59, file: !23, line: 219, baseType: !24, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !59, file: !23, line: 220, baseType: !24, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !59, file: !23, line: 221, baseType: !24, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "should_park", scope: !39, file: !8, line: 87, baseType: !66, size: 8, offset: 256)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DISubprogram(name: "thread_parker", scope: !39, file: !8, line: 89, type: !68, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!73 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSERKS3_", scope: !39, file: !8, line: 90, type: !74, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !70, !71}
!76 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39, size: 64)
!77 = !DISubprogram(name: "thread_parker", scope: !39, file: !8, line: 91, type: !78, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !70, !80}
!80 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !39, size: 64)
!81 = !DISubprogram(name: "operator=", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkeraSEOS3_", scope: !39, file: !8, line: 92, type: !82, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!82 = !DISubroutineType(types: !83)
!83 = !{!76, !70, !80}
!84 = !DISubprogram(name: "thread_parker", scope: !39, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !70}
!87 = !DISubprogram(name: "~thread_parker", scope: !39, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !39, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!89 = !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !39, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !39, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!91 = !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !39, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !39, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !32, line: 273, baseType: !30, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !32, line: 274, baseType: !30, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !31, file: !32, line: 275, baseType: !30, size: 64, offset: 448)
!96 = !DISubprogram(name: "word_lock_queue_data", scope: !31, file: !32, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!100 = !DISubprogram(name: "~word_lock_queue_data", scope: !31, file: !32, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", scope: !33, file: !32, line: 475, size: 196608, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !103, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10hash_tableE")
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !102, file: !32, line: 476, baseType: !105, size: 196608)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 196608, elements: !134)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_bucket", scope: !33, file: !32, line: 463, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !107, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11hash_bucketE")
!107 = !{!108, !120, !133}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !106, file: !32, line: 464, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "word_lock", scope: !33, file: !32, line: 283, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !110, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9word_lockE")
!110 = !{!111, !112, !116, !117, !118, !119}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !32, line: 284, baseType: !26, size: 64)
!112 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !32, line: 286, type: !113, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!116 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !32, line: 287, type: !113, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubprogram(name: "word_lock", scope: !109, file: !32, line: 290, type: !113, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !32, line: 291, type: !113, scopeLine: 291, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock6unlockEv", scope: !109, file: !32, line: 304, type: !113, scopeLine: 304, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !106, file: !32, line: 466, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_data", scope: !33, file: !32, line: 448, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !123, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10queue_dataE")
!123 = !{!124, !125, !126, !127, !128, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !122, file: !32, line: 449, baseType: !39, size: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_address", scope: !122, file: !32, line: 451, baseType: !26, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !32, line: 452, baseType: !121, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_info", scope: !122, file: !32, line: 453, baseType: !26, size: 64, offset: 448)
!128 = !DISubprogram(name: "queue_data", scope: !122, file: !32, line: 455, type: !129, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!132 = !DISubprogram(name: "~queue_data", scope: !122, file: !32, line: 457, type: !129, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !106, file: !32, line: 467, baseType: !121, size: 64, offset: 128)
!134 = !{!135}
!135 = !DISubrange(count: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex_parking_control", scope: !33, file: !32, line: 829, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !139, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization21mutex_parking_controlE")
!139 = !{!140, !172, !174}
!140 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !138, baseType: !141, extraData: i32 0)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parking_control", scope: !33, file: !32, line: 592, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !142, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15parking_controlE")
!142 = !{!143, !156, !157, !162, !168}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !141, file: !32, line: 593, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!66, !15, !147}
!147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "validate_action", scope: !33, file: !32, line: 576, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !149, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization15validate_actionE")
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "unpark_one", scope: !148, file: !32, line: 577, baseType: !66, size: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_unpark_info", scope: !148, file: !32, line: 578, baseType: !26, size: 64, offset: 64)
!152 = !DISubprogram(name: "validate_action", scope: !148, file: !32, line: 580, type: !153, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "before_sleep", scope: !141, file: !32, line: 594, baseType: !12, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "unpark", scope: !141, file: !32, line: 595, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!26, !15, !161, !66}
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "requeue_callback", scope: !141, file: !32, line: 596, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !15, !166, !66, !66}
!166 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!168 = !DISubprogram(name: "parking_control", scope: !141, file: !32, line: 598, type: !169, scopeLine: 598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lock_state", scope: !138, file: !32, line: 830, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!174 = !DISubprogram(name: "mutex_parking_control", scope: !138, file: !32, line: 832, type: !175, scopeLine: 832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !173}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "signal_parking_control", scope: !33, file: !32, line: 958, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !180, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization22signal_parking_controlE")
!180 = !{!181, !182, !183, !199}
!181 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !179, baseType: !141, extraData: i32 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !179, file: !32, line: 959, baseType: !173, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !179, file: !32, line: 960, baseType: !184, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_mutex", scope: !33, file: !32, line: 859, size: 64, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization10fast_mutexE")
!186 = !{!187, !188, !192, !193, !194, !195, !198}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !185, file: !32, line: 860, baseType: !26, size: 64)
!188 = !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex9lock_fullEv", scope: !185, file: !32, line: 862, type: !189, scopeLine: 862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!192 = !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11unlock_fullEv", scope: !185, file: !32, line: 906, type: !189, scopeLine: 906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!193 = !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex4lockEv", scope: !185, file: !32, line: 920, type: !189, scopeLine: 920, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DISubprogram(name: "unlock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex6unlockEv", scope: !185, file: !32, line: 929, type: !189, scopeLine: 929, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubprogram(name: "make_parked_if_locked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex21make_parked_if_lockedEv", scope: !185, file: !32, line: 938, type: !196, scopeLine: 938, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !191}
!198 = !DISubprogram(name: "make_parked", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization10fast_mutex11make_parkedEv", scope: !185, file: !32, line: 953, type: !189, scopeLine: 953, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubprogram(name: "signal_parking_control", scope: !179, file: !32, line: 962, type: !200, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202, !173, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "broadcast_parking_control", scope: !33, file: !32, line: 985, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !205, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization25broadcast_parking_controlE")
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !204, baseType: !141, extraData: i32 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !204, file: !32, line: 986, baseType: !173, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !204, file: !32, line: 987, baseType: !184, size: 64, offset: 320)
!209 = !DISubprogram(name: "broadcast_parking_control", scope: !204, file: !32, line: 989, type: !210, scopeLine: 989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212, !173, !184}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_parking_control", scope: !33, file: !32, line: 1026, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !215, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization20wait_parking_controlE")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !214, baseType: !141, extraData: i32 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cond_state", scope: !214, file: !32, line: 1027, baseType: !173, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !214, file: !32, line: 1028, baseType: !184, size: 64, offset: 320)
!219 = !DISubprogram(name: "wait_parking_control", scope: !214, file: !32, line: 1030, type: !220, scopeLine: 1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !173, !184}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "fast_cond", scope: !33, file: !32, line: 1072, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !225, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization9fast_condE")
!225 = !{!226, !227, !231, !232, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !32, line: 1073, baseType: !26, size: 64)
!227 = !DISubprogram(name: "fast_cond", scope: !224, file: !32, line: 1076, type: !228, scopeLine: 1076, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!231 = !DISubprogram(name: "signal", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond6signalEv", scope: !224, file: !32, line: 1078, type: !228, scopeLine: 1078, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubprogram(name: "broadcast", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond9broadcastEv", scope: !224, file: !32, line: 1092, type: !228, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubprogram(name: "wait", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9fast_cond4waitEPNS2_10fast_mutexE", scope: !224, file: !32, line: 1105, type: !234, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !230, !184}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex_array", file: !32, line: 1164, size: 64, flags: DIFlagTypePassByValue, elements: !238, identifier: "_ZTS18halide_mutex_array")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !237, file: !32, line: 1165, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !242, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !243, identifier: "_ZTS12halide_mutex")
!242 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !241, file: !242, line: 121, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work", scope: !34, file: !250, line: 26, size: 1024, flags: DIFlagTypePassByValue, elements: !251, identifier: "_ZTSN6Halide7Runtime8Internal4workE")
!250 = !DIFile(filename: "src/runtime/thread_pool_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!251 = !{!252, !281, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !249, file: !250, line: 27, baseType: !253, size: 448)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_parallel_task_t", file: !242, line: 201, size: 448, flags: DIFlagTypePassByValue, elements: !254, identifier: "_ZTS22halide_parallel_task_t")
!254 = !{!255, !263, !264, !268, !276, !277, !278, !279, !280}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !253, file: !242, line: 204, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_loop_task_t", file: !242, line: 192, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!161, !15, !161, !161, !260, !15}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 16, baseType: !262)
!262 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !253, file: !242, line: 207, baseType: !260, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !242, line: 210, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "semaphores", scope: !253, file: !242, line: 214, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_acquire_t", file: !242, line: 177, size: 128, flags: DIFlagTypePassByValue, elements: !271, identifier: "_ZTS26halide_semaphore_acquire_t")
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !270, file: !242, line: 178, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_t", file: !242, line: 171, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS18halide_semaphore_t")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !242, line: 179, baseType: !161, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_semaphores", scope: !253, file: !242, line: 215, baseType: !161, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !253, file: !242, line: 219, baseType: !161, size: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "min_threads", scope: !253, file: !242, line: 238, baseType: !161, size: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !253, file: !242, line: 243, baseType: !66, size: 8, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "task_fn", scope: !249, file: !250, line: 31, baseType: !282, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_task_t", file: !242, line: 158, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!161, !15, !161, !260}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next_job", scope: !249, file: !250, line: 33, baseType: !248, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !249, file: !250, line: 34, baseType: !248, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_count", scope: !249, file: !250, line: 35, baseType: !161, size: 32, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent_job", scope: !249, file: !250, line: 36, baseType: !248, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !249, file: !250, line: 37, baseType: !161, size: 32, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !249, file: !250, line: 39, baseType: !15, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_workers", scope: !249, file: !250, line: 40, baseType: !161, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "exit_status", scope: !249, file: !250, line: 41, baseType: !161, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next_semaphore", scope: !249, file: !250, line: 42, baseType: !161, size: 32, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "owner_is_sleeping", scope: !249, file: !250, line: 44, baseType: !66, size: 8, offset: 992)
!296 = !DISubprogram(name: "make_runnable", linkageName: "_ZN6Halide7Runtime8Internal4work13make_runnableEv", scope: !249, file: !250, line: 46, type: !297, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = !DISubroutineType(types: !298)
!298 = !{!66, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!300 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal4work7runningEv", scope: !249, file: !250, line: 62, type: !301, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!301 = !DISubroutineType(types: !302)
!302 = !{!66, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_semaphore_impl_t", file: !250, line: 711, size: 32, flags: DIFlagTypePassByValue, elements: !307, identifier: "_ZTS23halide_semaphore_impl_t")
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !306, file: !250, line: 712, baseType: !161, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!310 = !{!0, !311, !314, !316, !321, !323, !361, !367, !373, !379, !386, !392, !398, !401}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!312 = distinct !DIGlobalVariable(name: "lock_bit", scope: !33, file: !32, line: 250, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!315 = distinct !DIGlobalVariable(name: "queue_lock_bit", scope: !33, file: !32, line: 251, type: !313, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "table_storage", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13table_storageE", scope: !33, file: !32, line: 478, type: !318, isLocal: false, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 196608, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 24576)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!322 = distinct !DIGlobalVariable(name: "parked_bit", scope: !33, file: !32, line: 252, type: !313, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "work_queue", linkageName: "_ZN6Halide7Runtime8Internal10work_queueE", scope: !34, file: !250, line: 166, type: !325, isLocal: false, isDefinition: true)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_queue_t", scope: !34, file: !250, line: 94, size: 17024, flags: DIFlagTypePassByValue, elements: !326, identifier: "_ZTSN6Halide7Runtime8Internal12work_queue_tE")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !346, !347, !348, !349, !354, !357}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !325, file: !250, line: 96, baseType: !241, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "desired_threads_working", scope: !325, file: !250, line: 99, baseType: !161, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "zero_marker", scope: !325, file: !250, line: 103, baseType: !161, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !325, file: !250, line: 106, baseType: !248, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "threads_created", scope: !325, file: !250, line: 109, baseType: !161, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "target_a_team_size", scope: !325, file: !250, line: 116, baseType: !161, size: 32, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "wake_a_team", scope: !325, file: !250, line: 122, baseType: !335, size: 64, offset: 320)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_cond", file: !242, line: 125, size: 64, flags: DIFlagTypePassByValue, elements: !336, identifier: "_ZTS11halide_cond")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !335, file: !242, line: 126, baseType: !245, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "wake_b_team", scope: !325, file: !250, line: 122, baseType: !335, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wake_owners", scope: !325, file: !250, line: 122, baseType: !335, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "workers_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "owners_sleeping", scope: !325, file: !250, line: 126, baseType: !161, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !325, file: !250, line: 129, baseType: !343, size: 16384, offset: 576)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 16384, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 16960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !325, file: !250, line: 133, baseType: !66, size: 8, offset: 16968)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "threads_reserved", scope: !325, file: !250, line: 139, baseType: !161, size: 32, offset: 16992)
!349 = !DISubprogram(name: "running", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t7runningEv", scope: !325, file: !250, line: 141, type: !350, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!66, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!354 = !DISubprogram(name: "assert_zeroed", linkageName: "_ZNK6Halide7Runtime8Internal12work_queue_t13assert_zeroedEv", scope: !325, file: !250, line: 146, type: !355, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !352}
!357 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal12work_queue_t5resetEv", scope: !325, file: !250, line: 158, type: !358, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "custom_do_task", linkageName: "_ZN6Halide7Runtime8Internal14custom_do_taskE", scope: !34, file: !250, line: 567, type: !363, isLocal: false, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_task_t", file: !242, line: 259, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!161, !15, !282, !161, !260}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "custom_do_loop_task", linkageName: "_ZN6Halide7Runtime8Internal19custom_do_loop_taskE", scope: !34, file: !250, line: 568, type: !369, isLocal: false, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_loop_task_t", file: !242, line: 268, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!161, !15, !256, !161, !161, !260, !15}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "custom_do_par_for", linkageName: "_ZN6Halide7Runtime8Internal17custom_do_par_forE", scope: !34, file: !250, line: 569, type: !375, isLocal: false, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_par_for_t", file: !242, line: 167, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!161, !15, !282, !161, !161, !260}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "custom_do_parallel_tasks", linkageName: "_ZN6Halide7Runtime8Internal24custom_do_parallel_tasksE", scope: !34, file: !250, line: 570, type: !381, isLocal: false, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_do_parallel_tasks_t", file: !242, line: 281, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!161, !15, !161, !385, !15}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "custom_semaphore_init", linkageName: "_ZN6Halide7Runtime8Internal21custom_semaphore_initE", scope: !34, file: !250, line: 571, type: !388, isLocal: false, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_init_t", file: !242, line: 184, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!161, !273, !161}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "custom_semaphore_try_acquire", linkageName: "_ZN6Halide7Runtime8Internal28custom_semaphore_try_acquireE", scope: !34, file: !250, line: 572, type: !394, isLocal: false, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_try_acquire_t", file: !242, line: 186, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!66, !273, !161}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "custom_semaphore_release", linkageName: "_ZN6Halide7Runtime8Internal24custom_semaphore_releaseE", scope: !34, file: !250, line: 573, type: !400, isLocal: false, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_semaphore_release_t", file: !242, line: 185, baseType: !389)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!402 = distinct !DIGlobalVariable(name: "__tsan_mutex_linker_init", scope: !2, file: !32, line: 37, type: !403, isLocal: true, isDefinition: true)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!404 = !{!405, !406, !408}
!405 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !34, file: !27, line: 225)
!406 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !407, file: !8, line: 7)
!407 = !DINamespace(name: "Qurt", scope: !34)
!408 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !34, file: !250, line: 579)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 14, baseType: !410)
!410 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!411 = !{i32 7, !"Dwarf Version", i32 4}
!412 = !{i32 2, !"Debug Info Version", i32 3}
!413 = !{i32 1, !"wchar_size", i32 4}
!414 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!415 = distinct !DISubprogram(name: "halide_host_cpu_count", scope: !8, file: !8, line: 30, type: !416, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!416 = !DISubroutineType(types: !417)
!417 = !{!161}
!418 = !DILocation(line: 32, column: 5, scope: !415)
!419 = distinct !DISubprogram(name: "halide_set_default_thread_priority", scope: !8, file: !8, line: 39, type: !420, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !161}
!422 = !{!423}
!423 = !DILocalVariable(name: "priority", arg: 1, scope: !419, file: !8, line: 39, type: !161)
!424 = !DILocation(line: 0, scope: !419)
!425 = !DILocation(line: 40, column: 18, scope: !426)
!426 = distinct !DILexicalBlock(scope: !419, file: !8, line: 40, column: 9)
!427 = !DILocation(line: 40, column: 9, scope: !419)
!428 = !DILocation(line: 42, column: 25, scope: !429)
!429 = distinct !DILexicalBlock(scope: !426, file: !8, line: 42, column: 16)
!430 = !DILocation(line: 42, column: 16, scope: !426)
!431 = !DILocation(line: 45, column: 43, scope: !419)
!432 = !DILocation(line: 45, column: 41, scope: !419)
!433 = !{!434, !434, i64 0}
!434 = !{!"short", !435, i64 0}
!435 = !{!"omnipotent char", !436, i64 0}
!436 = !{!"Simple C++ TBAA"}
!437 = !DILocation(line: 46, column: 1, scope: !419)
!438 = distinct !DISubprogram(name: "halide_get_default_thread_priority", scope: !8, file: !8, line: 48, type: !439, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!439 = !DISubroutineType(types: !440)
!440 = !{!409}
!441 = !DILocation(line: 49, column: 12, scope: !438)
!442 = !DILocation(line: 49, column: 5, scope: !438)
!443 = distinct !DISubprogram(name: "halide_spawn_thread", scope: !8, file: !8, line: 52, type: !444, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !446)
!444 = !DISubroutineType(types: !445)
!445 = !{!25, !12, !15}
!446 = !{!447, !448, !449, !450, !451}
!447 = !DILocalVariable(name: "f", arg: 1, scope: !443, file: !8, line: 52, type: !12)
!448 = !DILocalVariable(name: "closure", arg: 2, scope: !443, file: !8, line: 52, type: !15)
!449 = !DILocalVariable(name: "priority", scope: !443, file: !8, line: 53, type: !409)
!450 = !DILocalVariable(name: "t", scope: !443, file: !8, line: 54, type: !6)
!451 = !DILocalVariable(name: "thread_attr", scope: !443, file: !8, line: 59, type: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "qurt_thread_attr_t", file: !23, line: 67, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qurt_thread_attr", file: !23, line: 52, size: 320, flags: DIFlagTypePassByValue, elements: !454, identifier: "_ZTS17_qurt_thread_attr")
!454 = !{!455, !459, !460, !461, !462, !463, !464, !465, !466}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !23, line: 54, baseType: !456, size: 128)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tcb_partition", scope: !453, file: !23, line: 55, baseType: !262, size: 8, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "affinity", scope: !453, file: !23, line: 57, baseType: !262, size: 8, offset: 136)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !453, file: !23, line: 59, baseType: !410, size: 16, offset: 144)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "asid", scope: !453, file: !23, line: 60, baseType: !262, size: 8, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bus_priority", scope: !453, file: !23, line: 61, baseType: !262, size: 8, offset: 168)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "timetest_id", scope: !453, file: !23, line: 62, baseType: !410, size: 16, offset: 176)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !453, file: !23, line: 63, baseType: !24, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stack_addr", scope: !453, file: !23, line: 64, baseType: !15, size: 64, offset: 256)
!467 = !DILocation(line: 0, scope: !443)
!468 = !DILocation(line: 53, column: 25, scope: !443)
!469 = !DILocation(line: 54, column: 43, scope: !443)
!470 = !DILocation(line: 55, column: 8, scope: !443)
!471 = !DILocation(line: 55, column: 10, scope: !443)
!472 = !{!473, !474, i64 0}
!473 = !{!"_ZTSN12_GLOBAL__N_114spawned_threadE", !474, i64 0, !474, i64 8, !474, i64 16, !475, i64 24}
!474 = !{!"any pointer", !435, i64 0}
!475 = !{!"_ZTS13halide_thread", !476, i64 0}
!476 = !{!"int", !435, i64 0}
!477 = !DILocation(line: 56, column: 8, scope: !443)
!478 = !DILocation(line: 56, column: 16, scope: !443)
!479 = !{!473, !474, i64 8}
!480 = !DILocation(line: 57, column: 16, scope: !443)
!481 = !DILocation(line: 57, column: 8, scope: !443)
!482 = !DILocation(line: 57, column: 14, scope: !443)
!483 = !{!473, !474, i64 16}
!484 = !DILocation(line: 58, column: 16, scope: !443)
!485 = !DILocation(line: 58, column: 5, scope: !443)
!486 = !DILocation(line: 59, column: 5, scope: !443)
!487 = !DILocation(line: 59, column: 24, scope: !443)
!488 = !DILocalVariable(name: "attr", arg: 1, scope: !489, file: !23, line: 96, type: !492)
!489 = distinct !DISubprogram(name: "qurt_thread_attr_init", linkageName: "_ZL21qurt_thread_attr_initP17_qurt_thread_attr", scope: !23, file: !23, line: 96, type: !490, scopeLine: 96, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !493)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!493 = !{!488}
!494 = !DILocation(line: 0, scope: !489, inlinedAt: !495)
!495 = distinct !DILocation(line: 60, column: 5, scope: !443)
!496 = !DILocation(line: 98, column: 19, scope: !489, inlinedAt: !495)
!497 = !{!435, !435, i64 0}
!498 = !DILocation(line: 99, column: 11, scope: !489, inlinedAt: !495)
!499 = !DILocation(line: 99, column: 25, scope: !489, inlinedAt: !495)
!500 = !{!501, !435, i64 16}
!501 = !{!"_ZTS17_qurt_thread_attr", !435, i64 0, !435, i64 16, !435, i64 17, !434, i64 18, !435, i64 20, !435, i64 21, !434, i64 22, !476, i64 24, !474, i64 32}
!502 = !DILocation(line: 100, column: 11, scope: !489, inlinedAt: !495)
!503 = !DILocation(line: 101, column: 11, scope: !489, inlinedAt: !495)
!504 = !DILocation(line: 101, column: 16, scope: !489, inlinedAt: !495)
!505 = !{!501, !435, i64 20}
!506 = !DILocation(line: 102, column: 11, scope: !489, inlinedAt: !495)
!507 = !DILocation(line: 102, column: 20, scope: !489, inlinedAt: !495)
!508 = !{!501, !435, i64 17}
!509 = !DILocation(line: 103, column: 11, scope: !489, inlinedAt: !495)
!510 = !DILocation(line: 103, column: 24, scope: !489, inlinedAt: !495)
!511 = !{!501, !435, i64 21}
!512 = !DILocation(line: 104, column: 11, scope: !489, inlinedAt: !495)
!513 = !DILocation(line: 104, column: 23, scope: !489, inlinedAt: !495)
!514 = !{!501, !434, i64 22}
!515 = !DILocation(line: 105, column: 11, scope: !489, inlinedAt: !495)
!516 = !DILocation(line: 106, column: 11, scope: !489, inlinedAt: !495)
!517 = !DILocation(line: 61, column: 54, scope: !443)
!518 = !DILocalVariable(name: "attr", arg: 1, scope: !519, file: !23, line: 152, type: !492)
!519 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_addr", linkageName: "_ZL31qurt_thread_attr_set_stack_addrP17_qurt_thread_attrPv", scope: !23, file: !23, line: 152, type: !520, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !492, !15}
!522 = !{!518, !523}
!523 = !DILocalVariable(name: "stack_addr", arg: 2, scope: !519, file: !23, line: 152, type: !15)
!524 = !DILocation(line: 0, scope: !519, inlinedAt: !525)
!525 = distinct !DILocation(line: 61, column: 5, scope: !443)
!526 = !DILocation(line: 153, column: 22, scope: !519, inlinedAt: !525)
!527 = !{!501, !474, i64 32}
!528 = !DILocalVariable(name: "attr", arg: 1, scope: !529, file: !23, line: 127, type: !492)
!529 = distinct !DISubprogram(name: "qurt_thread_attr_set_stack_size", linkageName: "_ZL31qurt_thread_attr_set_stack_sizeP17_qurt_thread_attrj", scope: !23, file: !23, line: 127, type: !530, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !492, !24}
!532 = !{!528, !533}
!533 = !DILocalVariable(name: "stack_size", arg: 2, scope: !529, file: !23, line: 127, type: !24)
!534 = !DILocation(line: 0, scope: !529, inlinedAt: !535)
!535 = distinct !DILocation(line: 62, column: 5, scope: !443)
!536 = !DILocation(line: 128, column: 22, scope: !529, inlinedAt: !535)
!537 = !{!501, !476, i64 24}
!538 = !DILocalVariable(name: "attr", arg: 1, scope: !539, file: !23, line: 170, type: !492)
!539 = distinct !DISubprogram(name: "qurt_thread_attr_set_priority", linkageName: "_ZL29qurt_thread_attr_set_priorityP17_qurt_thread_attrt", scope: !23, file: !23, line: 170, type: !540, scopeLine: 170, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !492, !410}
!542 = !{!538, !543}
!543 = !DILocalVariable(name: "priority", arg: 2, scope: !539, file: !23, line: 170, type: !410)
!544 = !DILocation(line: 0, scope: !539, inlinedAt: !545)
!545 = distinct !DILocation(line: 63, column: 5, scope: !443)
!546 = !DILocation(line: 171, column: 20, scope: !539, inlinedAt: !545)
!547 = !{!501, !434, i64 18}
!548 = !DILocation(line: 64, column: 35, scope: !443)
!549 = !DILocation(line: 64, column: 5, scope: !443)
!550 = !DILocation(line: 65, column: 12, scope: !443)
!551 = !DILocation(line: 66, column: 1, scope: !443)
!552 = !DILocation(line: 65, column: 5, scope: !443)
!553 = !DISubprogram(name: "malloc", scope: !27, file: !27, line: 87, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!554 = !DISubroutineType(types: !555)
!555 = !{!15, !556}
!556 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!557 = !DISubprogram(name: "memalign", scope: !8, file: !8, line: 28, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!558 = !DISubroutineType(types: !559)
!559 = !{!15, !556, !556}
!560 = !DISubprogram(name: "memset", scope: !27, file: !27, line: 96, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!561 = !DISubroutineType(types: !562)
!562 = !{!15, !15, !161, !556}
!563 = !DISubprogram(name: "qurt_thread_create", scope: !23, file: !23, line: 175, type: !564, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!564 = !DISubroutineType(types: !565)
!565 = !{!161, !566, !567, !12, !15}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!568 = distinct !DISubprogram(name: "spawn_thread_helper", linkageName: "_ZN12_GLOBAL__N_119spawn_thread_helperEPv", scope: !9, file: !8, line: 20, type: !13, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !569)
!569 = !{!570, !571}
!570 = !DILocalVariable(name: "arg", arg: 1, scope: !568, file: !8, line: 20, type: !15)
!571 = !DILocalVariable(name: "t", scope: !568, file: !8, line: 21, type: !6)
!572 = !DILocation(line: 0, scope: !568)
!573 = !DILocation(line: 22, column: 8, scope: !568)
!574 = !DILocation(line: 22, column: 13, scope: !568)
!575 = !DILocation(line: 22, column: 5, scope: !568)
!576 = !DILocation(line: 23, column: 1, scope: !568)
!577 = distinct !DISubprogram(name: "halide_join_thread", scope: !8, file: !8, line: 68, type: !578, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !25}
!580 = !{!581, !582, !583}
!581 = !DILocalVariable(name: "thread_arg", arg: 1, scope: !577, file: !8, line: 68, type: !25)
!582 = !DILocalVariable(name: "t", scope: !577, file: !8, line: 69, type: !6)
!583 = !DILocalVariable(name: "ret", scope: !577, file: !8, line: 70, type: !161)
!584 = !DILocation(line: 0, scope: !577)
!585 = !DILocation(line: 70, column: 5, scope: !577)
!586 = !DILocation(line: 70, column: 9, scope: !577)
!587 = !{!476, !476, i64 0}
!588 = !DILocation(line: 71, column: 32, scope: !577)
!589 = !{!473, !476, i64 24}
!590 = !DILocation(line: 71, column: 5, scope: !577)
!591 = !DILocation(line: 72, column: 13, scope: !577)
!592 = !DILocation(line: 72, column: 5, scope: !577)
!593 = !DILocation(line: 73, column: 10, scope: !577)
!594 = !DILocation(line: 73, column: 5, scope: !577)
!595 = !DILocation(line: 74, column: 1, scope: !577)
!596 = !DISubprogram(name: "qurt_thread_join", scope: !23, file: !23, line: 194, type: !597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!597 = !DISubroutineType(types: !598)
!598 = !{!161, !24, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!600 = !DISubprogram(name: "free", scope: !27, file: !27, line: 86, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!601 = distinct !DISubprogram(name: "lock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock9lock_fullEv", scope: !109, file: !32, line: 321, type: !113, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !112, retainedNodes: !602)
!602 = !{!603, !605, !617, !618, !622, !623, !624}
!603 = !DILocalVariable(name: "this", arg: 1, scope: !601, type: !604, flags: DIFlagArtificial | DIFlagObjectPointer)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!605 = !DILocalVariable(name: "spinner", scope: !601, file: !32, line: 322, type: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "spin_control", scope: !33, file: !32, line: 230, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !607, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization12spin_controlE")
!607 = !{!608, !609, !613, !616}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "spin_count", scope: !606, file: !32, line: 231, baseType: !161, size: 32)
!609 = !DISubprogram(name: "spin_control", scope: !606, file: !32, line: 235, type: !610, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!613 = !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !606, file: !32, line: 237, type: !614, scopeLine: 237, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DISubroutineType(types: !615)
!615 = !{!66, !612}
!616 = !DISubprogram(name: "reset", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control5resetEv", scope: !606, file: !32, line: 244, type: !610, scopeLine: 244, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DILocalVariable(name: "expected", scope: !601, file: !32, line: 323, type: !26)
!618 = !DILocalVariable(name: "desired", scope: !619, file: !32, line: 328, type: !26)
!619 = distinct !DILexicalBlock(scope: !620, file: !32, line: 327, column: 37)
!620 = distinct !DILexicalBlock(scope: !621, file: !32, line: 327, column: 13)
!621 = distinct !DILexicalBlock(scope: !601, file: !32, line: 326, column: 18)
!622 = !DILocalVariable(name: "node", scope: !621, file: !32, line: 342, type: !31)
!623 = !DILocalVariable(name: "head", scope: !621, file: !32, line: 347, type: !30)
!624 = !DILocalVariable(name: "desired", scope: !621, file: !32, line: 359, type: !26)
!625 = !DILocation(line: 0, scope: !601)
!626 = !DILocation(line: 324, column: 26, scope: !601)
!627 = !DILocalVariable(name: "addr", arg: 1, scope: !628, file: !32, line: 200, type: !632)
!628 = distinct !DISubprogram(name: "atomic_load_relaxed<unsigned long long>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_119atomic_load_relaxedIyEEvPT_S6_", scope: !629, file: !32, line: 200, type: !630, scopeLine: 200, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !635, retainedNodes: !633)
!629 = !DINamespace(scope: !33)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !632, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!633 = !{!627, !634}
!634 = !DILocalVariable(name: "val", arg: 2, scope: !628, file: !32, line: 200, type: !632)
!635 = !{!636}
!636 = !DITemplateTypeParameter(name: "T", type: !29)
!637 = !DILocation(line: 0, scope: !628, inlinedAt: !638)
!638 = distinct !DILocation(line: 324, column: 5, scope: !601)
!639 = !DILocation(line: 201, column: 5, scope: !628, inlinedAt: !638)
!640 = !DILocation(line: 326, column: 5, scope: !601)
!641 = !DILocation(line: 327, column: 24, scope: !620)
!642 = !DILocation(line: 327, column: 14, scope: !620)
!643 = !DILocation(line: 327, column: 13, scope: !621)
!644 = !DILocation(line: 328, column: 42, scope: !619)
!645 = !DILocation(line: 0, scope: !619)
!646 = !DILocalVariable(name: "addr", arg: 1, scope: !647, file: !32, line: 191, type: !173)
!647 = distinct !DISubprogram(name: "atomic_cas_weak_acquire_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_acquire_relaxedEPyS4_S4_", scope: !629, file: !32, line: 191, type: !648, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !650)
!648 = !DISubroutineType(types: !649)
!649 = !{!66, !173, !173, !173}
!650 = !{!646, !651, !652}
!651 = !DILocalVariable(name: "expected", arg: 2, scope: !647, file: !32, line: 191, type: !173)
!652 = !DILocalVariable(name: "desired", arg: 3, scope: !647, file: !32, line: 191, type: !173)
!653 = !DILocation(line: 0, scope: !647, inlinedAt: !654)
!654 = distinct !DILocation(line: 330, column: 17, scope: !655)
!655 = distinct !DILexicalBlock(scope: !619, file: !32, line: 330, column: 17)
!656 = !DILocation(line: 192, column: 12, scope: !647, inlinedAt: !654)
!657 = !DILocation(line: 336, column: 67, scope: !658)
!658 = distinct !DILexicalBlock(scope: !621, file: !32, line: 336, column: 13)
!659 = !DILocation(line: 336, column: 73, scope: !658)
!660 = !DILocalVariable(name: "this", arg: 1, scope: !661, type: !663, flags: DIFlagArtificial | DIFlagObjectPointer)
!661 = distinct !DISubprogram(name: "should_spin", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12spin_control11should_spinEv", scope: !606, file: !32, line: 237, type: !614, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !613, retainedNodes: !662)
!662 = !{!660}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!664 = !DILocation(line: 0, scope: !661, inlinedAt: !665)
!665 = distinct !DILocation(line: 336, column: 84, scope: !658)
!666 = !DILocation(line: 241, column: 27, scope: !661, inlinedAt: !665)
!667 = !DILocation(line: 336, column: 13, scope: !621)
!668 = !DILocation(line: 239, column: 23, scope: !669, inlinedAt: !665)
!669 = distinct !DILexicalBlock(scope: !670, file: !32, line: 238, column: 29)
!670 = distinct !DILexicalBlock(scope: !661, file: !32, line: 238, column: 13)
!671 = !DILocation(line: 337, column: 13, scope: !672)
!672 = distinct !DILexicalBlock(scope: !658, file: !32, line: 336, column: 99)
!673 = !DILocation(line: 0, scope: !628, inlinedAt: !674)
!674 = distinct !DILocation(line: 338, column: 13, scope: !672)
!675 = !DILocation(line: 201, column: 5, scope: !628, inlinedAt: !674)
!676 = !DILocation(line: 339, column: 13, scope: !672)
!677 = !DILocation(line: 342, column: 9, scope: !621)
!678 = !DILocation(line: 342, column: 30, scope: !621)
!679 = !DILocalVariable(name: "this", arg: 1, scope: !680, type: !30, flags: DIFlagArtificial | DIFlagObjectPointer)
!680 = distinct !DISubprogram(name: "word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataC2Ev", scope: !31, file: !32, line: 277, type: !97, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !96, retainedNodes: !681)
!681 = !{!679}
!682 = !DILocation(line: 0, scope: !680, inlinedAt: !683)
!683 = distinct !DILocation(line: 342, column: 30, scope: !621)
!684 = !DILocalVariable(name: "this", arg: 1, scope: !685, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!685 = distinct !DISubprogram(name: "thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerC2Ev", scope: !39, file: !8, line: 94, type: !85, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !84, retainedNodes: !686)
!686 = !{!684}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!688 = !DILocation(line: 0, scope: !685, inlinedAt: !689)
!689 = distinct !DILocation(line: 277, column: 19, scope: !680, inlinedAt: !683)
!690 = !DILocation(line: 87, column: 10, scope: !685, inlinedAt: !689)
!691 = !{!692, !693, i64 32}
!692 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization13thread_parkerE", !435, i64 0, !435, i64 16, !693, i64 32}
!693 = !{!"bool", !435, i64 0}
!694 = !DILocation(line: 95, column: 9, scope: !695, inlinedAt: !689)
!695 = distinct !DILexicalBlock(scope: !685, file: !8, line: 94, column: 35)
!696 = !DILocation(line: 96, column: 9, scope: !695, inlinedAt: !689)
!697 = !DILocation(line: 273, column: 27, scope: !680, inlinedAt: !683)
!698 = !{!699, !474, i64 40}
!699 = !{!"_ZTSN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataE", !692, i64 0, !474, i64 40, !474, i64 48, !474, i64 56}
!700 = !DILocation(line: 274, column: 27, scope: !680, inlinedAt: !683)
!701 = !{!699, !474, i64 48}
!702 = !DILocation(line: 275, column: 27, scope: !680, inlinedAt: !683)
!703 = !{!699, !474, i64 56}
!704 = !DILocalVariable(name: "this", arg: 1, scope: !705, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!705 = distinct !DISubprogram(name: "prepare_park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12prepare_parkEv", scope: !39, file: !8, line: 105, type: !85, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !88, retainedNodes: !706)
!706 = !{!704}
!707 = !DILocation(line: 0, scope: !705, inlinedAt: !708)
!708 = distinct !DILocation(line: 344, column: 21, scope: !621)
!709 = !DILocation(line: 106, column: 21, scope: !705, inlinedAt: !708)
!710 = !DILocation(line: 347, column: 72, scope: !621)
!711 = !DILocation(line: 0, scope: !621)
!712 = !DILocation(line: 348, column: 18, scope: !713)
!713 = distinct !DILexicalBlock(scope: !621, file: !32, line: 348, column: 13)
!714 = !DILocation(line: 348, column: 13, scope: !621)
!715 = !DILocation(line: 349, column: 23, scope: !716)
!716 = distinct !DILexicalBlock(scope: !713, file: !32, line: 348, column: 30)
!717 = !DILocation(line: 351, column: 9, scope: !716)
!718 = !DILocation(line: 347, column: 38, scope: !621)
!719 = !DILocation(line: 356, column: 23, scope: !720)
!720 = distinct !DILexicalBlock(scope: !713, file: !32, line: 351, column: 16)
!721 = !DILocation(line: 359, column: 60, scope: !621)
!722 = !DILocation(line: 359, column: 48, scope: !621)
!723 = !DILocalVariable(name: "addr", arg: 1, scope: !724, file: !32, line: 183, type: !173)
!724 = distinct !DISubprogram(name: "atomic_cas_weak_release_relaxed", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_131atomic_cas_weak_release_relaxedEPyS4_S4_", scope: !629, file: !32, line: 183, type: !648, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !725)
!725 = !{!723, !726, !727}
!726 = !DILocalVariable(name: "expected", arg: 2, scope: !724, file: !32, line: 183, type: !173)
!727 = !DILocalVariable(name: "desired", arg: 3, scope: !724, file: !32, line: 183, type: !173)
!728 = !DILocation(line: 0, scope: !724, inlinedAt: !729)
!729 = distinct !DILocation(line: 360, column: 13, scope: !730)
!730 = distinct !DILexicalBlock(scope: !621, file: !32, line: 360, column: 13)
!731 = !DILocation(line: 184, column: 12, scope: !724, inlinedAt: !729)
!732 = !DILocalVariable(name: "this", arg: 1, scope: !733, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!733 = distinct !DISubprogram(name: "park", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker4parkEv", scope: !39, file: !8, line: 109, type: !85, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !89, retainedNodes: !734)
!734 = !{!732}
!735 = !DILocation(line: 0, scope: !733, inlinedAt: !736)
!736 = distinct !DILocation(line: 361, column: 25, scope: !737)
!737 = distinct !DILexicalBlock(scope: !730, file: !32, line: 360, column: 75)
!738 = !DILocation(line: 110, column: 9, scope: !733, inlinedAt: !736)
!739 = !DILocation(line: 111, column: 16, scope: !733, inlinedAt: !736)
!740 = !{i8 0, i8 2}
!741 = !DILocation(line: 111, column: 9, scope: !733, inlinedAt: !736)
!742 = !DILocation(line: 112, column: 13, scope: !743, inlinedAt: !736)
!743 = distinct !DILexicalBlock(scope: !733, file: !8, line: 111, column: 29)
!744 = distinct !{!744, !741, !745, !746}
!745 = !DILocation(line: 113, column: 9, scope: !733, inlinedAt: !736)
!746 = !{!"llvm.loop.mustprogress"}
!747 = !DILocation(line: 114, column: 9, scope: !733, inlinedAt: !736)
!748 = !DILocation(line: 0, scope: !628, inlinedAt: !749)
!749 = distinct !DILocation(line: 363, column: 13, scope: !737)
!750 = !DILocation(line: 201, column: 5, scope: !628, inlinedAt: !749)
!751 = !DILocation(line: 364, column: 9, scope: !737)
!752 = !DILocalVariable(name: "this", arg: 1, scope: !753, type: !30, flags: DIFlagArtificial | DIFlagObjectPointer)
!753 = distinct !DISubprogram(name: "~word_lock_queue_data", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization20word_lock_queue_dataD2Ev", scope: !31, file: !32, line: 280, type: !97, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !100, retainedNodes: !754)
!754 = !{!752}
!755 = !DILocation(line: 0, scope: !753, inlinedAt: !756)
!756 = distinct !DILocation(line: 365, column: 5, scope: !601)
!757 = !DILocalVariable(name: "this", arg: 1, scope: !758, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!758 = distinct !DISubprogram(name: "~thread_parker", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parkerD2Ev", scope: !39, file: !8, line: 100, type: !85, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !87, retainedNodes: !759)
!759 = !{!757}
!760 = !DILocation(line: 0, scope: !758, inlinedAt: !761)
!761 = distinct !DILocation(line: 280, column: 51, scope: !762, inlinedAt: !756)
!762 = distinct !DILexicalBlock(scope: !753, file: !32, line: 280, column: 51)
!763 = !DILocation(line: 101, column: 9, scope: !764, inlinedAt: !761)
!764 = distinct !DILexicalBlock(scope: !758, file: !8, line: 100, column: 36)
!765 = !DILocation(line: 102, column: 9, scope: !764, inlinedAt: !761)
!766 = !DILocation(line: 365, column: 5, scope: !601)
!767 = distinct !{!767, !640, !766}
!768 = !DILocation(line: 366, column: 1, scope: !601)
!769 = !DISubprogram(name: "halide_thread_yield", scope: !27, file: !27, line: 190, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!770 = !DISubroutineType(types: !771)
!771 = !{null}
!772 = distinct !DISubprogram(name: "unlock_full", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock11unlock_fullEv", scope: !109, file: !32, line: 368, type: !113, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !116, retainedNodes: !773)
!773 = !{!774, !775, !776, !778, !779, !780, !782, !783, !784, !785, !787, !790, !791, !794}
!774 = !DILocalVariable(name: "this", arg: 1, scope: !772, type: !604, flags: DIFlagArtificial | DIFlagObjectPointer)
!775 = !DILocalVariable(name: "expected", scope: !772, file: !32, line: 369, type: !26)
!776 = !DILocalVariable(name: "thread_queuing", scope: !777, file: !32, line: 375, type: !66)
!777 = distinct !DILexicalBlock(scope: !772, file: !32, line: 372, column: 18)
!778 = !DILocalVariable(name: "none_queued", scope: !777, file: !32, line: 377, type: !66)
!779 = !DILocalVariable(name: "desired", scope: !777, file: !32, line: 382, type: !26)
!780 = !DILocalVariable(name: "head", scope: !781, file: !32, line: 389, type: !30)
!781 = distinct !DILexicalBlock(scope: !772, file: !32, line: 388, column: 18)
!782 = !DILocalVariable(name: "current", scope: !781, file: !32, line: 390, type: !30)
!783 = !DILocalVariable(name: "tail", scope: !781, file: !32, line: 391, type: !30)
!784 = !DILocalVariable(name: "times_through", scope: !781, file: !32, line: 392, type: !161)
!785 = !DILocalVariable(name: "next", scope: !786, file: !32, line: 394, type: !30)
!786 = distinct !DILexicalBlock(scope: !781, file: !32, line: 393, column: 33)
!787 = !DILocalVariable(name: "desired", scope: !788, file: !32, line: 406, type: !26)
!788 = distinct !DILexicalBlock(scope: !789, file: !32, line: 405, column: 34)
!789 = distinct !DILexicalBlock(scope: !781, file: !32, line: 405, column: 13)
!790 = !DILocalVariable(name: "new_tail", scope: !781, file: !32, line: 414, type: !30)
!791 = !DILocalVariable(name: "continue_outer", scope: !792, file: !32, line: 416, type: !66)
!792 = distinct !DILexicalBlock(scope: !793, file: !32, line: 415, column: 34)
!793 = distinct !DILexicalBlock(scope: !781, file: !32, line: 415, column: 13)
!794 = !DILocalVariable(name: "desired", scope: !795, file: !32, line: 418, type: !26)
!795 = distinct !DILexicalBlock(scope: !792, file: !32, line: 417, column: 37)
!796 = !DILocation(line: 0, scope: !772)
!797 = !DILocation(line: 370, column: 26, scope: !772)
!798 = !DILocation(line: 0, scope: !628, inlinedAt: !799)
!799 = distinct !DILocation(line: 370, column: 5, scope: !772)
!800 = !DILocation(line: 201, column: 5, scope: !628, inlinedAt: !799)
!801 = !DILocation(line: 372, column: 5, scope: !772)
!802 = !DILocation(line: 375, column: 41, scope: !777)
!803 = !DILocation(line: 375, column: 31, scope: !777)
!804 = !DILocation(line: 0, scope: !777)
!805 = !DILocation(line: 378, column: 28, scope: !806)
!806 = distinct !DILexicalBlock(scope: !777, file: !32, line: 378, column: 13)
!807 = !DILocation(line: 382, column: 38, scope: !777)
!808 = !DILocation(line: 0, scope: !647, inlinedAt: !809)
!809 = distinct !DILocation(line: 383, column: 13, scope: !810)
!810 = distinct !DILexicalBlock(scope: !777, file: !32, line: 383, column: 13)
!811 = !DILocation(line: 192, column: 12, scope: !647, inlinedAt: !809)
!812 = !DILocation(line: 389, column: 72, scope: !781)
!813 = !DILocation(line: 389, column: 38, scope: !781)
!814 = !DILocation(line: 0, scope: !781)
!815 = !DILocation(line: 391, column: 47, scope: !781)
!816 = !DILocation(line: 393, column: 21, scope: !781)
!817 = !DILocation(line: 393, column: 9, scope: !781)
!818 = !DILocation(line: 394, column: 51, scope: !786)
!819 = !DILocation(line: 0, scope: !786)
!820 = !DILocation(line: 395, column: 13, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !32, line: 395, column: 13)
!822 = distinct !DILexicalBlock(scope: !786, file: !32, line: 395, column: 13)
!823 = !DILocation(line: 395, column: 13, scope: !822)
!824 = !DILocation(line: 395, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !821, file: !32, line: 395, column: 13)
!826 = !DILocation(line: 396, column: 19, scope: !786)
!827 = !DILocation(line: 396, column: 24, scope: !786)
!828 = !DILocation(line: 398, column: 29, scope: !786)
!829 = distinct !{!829, !817, !830, !746}
!830 = !DILocation(line: 400, column: 9, scope: !781)
!831 = !DILocation(line: 401, column: 20, scope: !781)
!832 = !DILocation(line: 405, column: 22, scope: !789)
!833 = !DILocation(line: 405, column: 13, scope: !789)
!834 = !DILocation(line: 405, column: 13, scope: !781)
!835 = !DILocation(line: 406, column: 42, scope: !788)
!836 = !DILocation(line: 0, scope: !788)
!837 = !DILocalVariable(name: "addr", arg: 1, scope: !838, file: !32, line: 179, type: !632)
!838 = distinct !DISubprogram(name: "atomic_cas_weak_relacq_relaxed<unsigned long long>", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_130atomic_cas_weak_relacq_relaxedIyEEbPT_S6_S6_", scope: !629, file: !32, line: 179, type: !839, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, templateParams: !635, retainedNodes: !841)
!839 = !DISubroutineType(types: !840)
!840 = !{!66, !632, !632, !632}
!841 = !{!837, !842, !843}
!842 = !DILocalVariable(name: "expected", arg: 2, scope: !838, file: !32, line: 179, type: !632)
!843 = !DILocalVariable(name: "desired", arg: 3, scope: !838, file: !32, line: 179, type: !632)
!844 = !DILocation(line: 0, scope: !838, inlinedAt: !845)
!845 = distinct !DILocation(line: 407, column: 17, scope: !846)
!846 = distinct !DILexicalBlock(scope: !788, file: !32, line: 407, column: 17)
!847 = !DILocation(line: 180, column: 12, scope: !838, inlinedAt: !845)
!848 = distinct !{!848, !849, !850}
!849 = !DILocation(line: 388, column: 5, scope: !772)
!850 = !DILocation(line: 445, column: 5, scope: !772)
!851 = !DILocation(line: 414, column: 48, scope: !781)
!852 = !DILocation(line: 415, column: 22, scope: !793)
!853 = !DILocation(line: 415, column: 13, scope: !781)
!854 = !DILocation(line: 0, scope: !792)
!855 = !DILocation(line: 418, column: 46, scope: !795)
!856 = !DILocation(line: 0, scope: !795)
!857 = !DILocation(line: 0, scope: !838, inlinedAt: !858)
!858 = distinct !DILocation(line: 419, column: 21, scope: !859)
!859 = distinct !DILexicalBlock(scope: !795, file: !32, line: 419, column: 21)
!860 = !DILocation(line: 180, column: 12, scope: !838, inlinedAt: !858)
!861 = !DILocation(line: 422, column: 74, scope: !862)
!862 = distinct !DILexicalBlock(scope: !795, file: !32, line: 422, column: 21)
!863 = !DILocation(line: 422, column: 21, scope: !795)
!864 = distinct !{!864, !865, !866, !746}
!865 = !DILocation(line: 417, column: 13, scope: !792)
!866 = !DILocation(line: 428, column: 13, scope: !792)
!867 = !DILocation(line: 434, column: 24, scope: !868)
!868 = distinct !DILexicalBlock(scope: !793, file: !32, line: 433, column: 16)
!869 = !DILocalVariable(name: "addr", arg: 1, scope: !870, file: !32, line: 165, type: !173)
!870 = distinct !DISubprogram(name: "atomic_and_fetch_release", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_124atomic_and_fetch_releaseEPyy", scope: !629, file: !32, line: 165, type: !871, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{!26, !173, !26}
!873 = !{!869, !874}
!874 = !DILocalVariable(name: "val", arg: 2, scope: !870, file: !32, line: 165, type: !26)
!875 = !DILocation(line: 0, scope: !870, inlinedAt: !876)
!876 = distinct !DILocation(line: 435, column: 13, scope: !868)
!877 = !DILocation(line: 166, column: 12, scope: !870, inlinedAt: !876)
!878 = !DILocalVariable(name: "this", arg: 1, scope: !879, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!879 = distinct !DISubprogram(name: "unpark_start", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker12unpark_startEv", scope: !39, file: !8, line: 117, type: !85, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !90, retainedNodes: !880)
!880 = !{!878}
!881 = !DILocation(line: 0, scope: !879, inlinedAt: !882)
!882 = distinct !DILocation(line: 441, column: 22, scope: !781)
!883 = !DILocation(line: 118, column: 26, scope: !879, inlinedAt: !882)
!884 = !DILocation(line: 118, column: 9, scope: !879, inlinedAt: !882)
!885 = !DILocalVariable(name: "this", arg: 1, scope: !886, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!886 = distinct !DISubprogram(name: "unpark", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker6unparkEv", scope: !39, file: !8, line: 121, type: !85, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !91, retainedNodes: !887)
!887 = !{!885}
!888 = !DILocation(line: 0, scope: !886, inlinedAt: !889)
!889 = distinct !DILocation(line: 442, column: 22, scope: !781)
!890 = !DILocation(line: 122, column: 9, scope: !886, inlinedAt: !889)
!891 = !DILocation(line: 122, column: 21, scope: !886, inlinedAt: !889)
!892 = !DILocation(line: 123, column: 27, scope: !886, inlinedAt: !889)
!893 = !DILocation(line: 123, column: 9, scope: !886, inlinedAt: !889)
!894 = !DILocalVariable(name: "this", arg: 1, scope: !895, type: !687, flags: DIFlagArtificial | DIFlagObjectPointer)
!895 = distinct !DISubprogram(name: "unpark_finish", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization13thread_parker13unpark_finishEv", scope: !39, file: !8, line: 126, type: !85, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !92, retainedNodes: !896)
!896 = !{!894}
!897 = !DILocation(line: 0, scope: !895, inlinedAt: !898)
!898 = distinct !DILocation(line: 443, column: 22, scope: !781)
!899 = !DILocation(line: 127, column: 9, scope: !895, inlinedAt: !898)
!900 = !DILocation(line: 444, column: 9, scope: !781)
!901 = !DILocation(line: 446, column: 1, scope: !772)
!902 = !DISubprogram(name: "halide_print", scope: !242, file: !242, line: 97, type: !903, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !15, !265}
!905 = !DISubprogram(name: "abort", scope: !27, file: !27, line: 108, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!906 = distinct !DISubprogram(name: "lock_bucket", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization11lock_bucketEy", scope: !33, file: !32, line: 509, type: !907, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !910)
!907 = !DISubroutineType(types: !908)
!908 = !{!909, !26}
!909 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !106, size: 64)
!910 = !{!911, !912, !913}
!911 = !DILocalVariable(name: "addr", arg: 1, scope: !906, file: !32, line: 509, type: !26)
!912 = !DILocalVariable(name: "hash", scope: !906, file: !32, line: 510, type: !26)
!913 = !DILocalVariable(name: "bucket", scope: !906, file: !32, line: 515, type: !909)
!914 = !DILocation(line: 0, scope: !906)
!915 = !DILocalVariable(name: "addr", arg: 1, scope: !916, file: !32, line: 499, type: !26)
!916 = distinct !DISubprogram(name: "addr_hash", linkageName: "_ZN6Halide7Runtime8Internal15SynchronizationL9addr_hashEyj", scope: !33, file: !32, line: 499, type: !917, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !920)
!917 = !DISubroutineType(types: !918)
!918 = !{!26, !26, !919}
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 12, baseType: !24)
!920 = !{!915, !921}
!921 = !DILocalVariable(name: "bits", arg: 2, scope: !916, file: !32, line: 499, type: !919)
!922 = !DILocation(line: 0, scope: !916, inlinedAt: !923)
!923 = distinct !DILocation(line: 510, column: 22, scope: !906)
!924 = !DILocation(line: 503, column: 22, scope: !925, inlinedAt: !923)
!925 = distinct !DILexicalBlock(scope: !926, file: !32, line: 502, column: 33)
!926 = distinct !DILexicalBlock(scope: !916, file: !32, line: 502, column: 9)
!927 = !DILocation(line: 503, column: 55, scope: !925, inlinedAt: !923)
!928 = !DILocation(line: 515, column: 27, scope: !906)
!929 = !DILocalVariable(name: "this", arg: 1, scope: !930, type: !604, flags: DIFlagArtificial | DIFlagObjectPointer)
!930 = distinct !DISubprogram(name: "lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization9word_lock4lockEv", scope: !109, file: !32, line: 291, type: !113, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, declaration: !118, retainedNodes: !931)
!931 = !{!929, !932, !933}
!932 = !DILocalVariable(name: "expected", scope: !930, file: !32, line: 294, type: !26)
!933 = !DILocalVariable(name: "desired", scope: !930, file: !32, line: 295, type: !26)
!934 = !DILocation(line: 0, scope: !930, inlinedAt: !935)
!935 = distinct !DILocation(line: 517, column: 18, scope: !906)
!936 = !DILocation(line: 292, column: 26, scope: !930, inlinedAt: !935)
!937 = !DILocalVariable(name: "mutex", arg: 1, scope: !938, file: !32, line: 56, type: !15)
!938 = distinct !DISubprogram(name: "if_tsan_pre_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_116if_tsan_pre_lockEPv", scope: !629, file: !32, line: 56, type: !13, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !939)
!939 = !{!937}
!940 = !DILocation(line: 0, scope: !938, inlinedAt: !941)
!941 = distinct !DILocation(line: 292, column: 9, scope: !930, inlinedAt: !935)
!942 = !DILocation(line: 57, column: 5, scope: !938, inlinedAt: !941)
!943 = !DILocation(line: 297, column: 47, scope: !944, inlinedAt: !935)
!944 = distinct !DILexicalBlock(scope: !930, file: !32, line: 297, column: 13)
!945 = !DILocation(line: 0, scope: !647, inlinedAt: !946)
!946 = distinct !DILocation(line: 297, column: 14, scope: !944, inlinedAt: !935)
!947 = !DILocation(line: 192, column: 12, scope: !647, inlinedAt: !946)
!948 = !DILocation(line: 297, column: 13, scope: !930, inlinedAt: !935)
!949 = !DILocation(line: 517, column: 12, scope: !906)
!950 = !DILocation(line: 298, column: 13, scope: !951, inlinedAt: !935)
!951 = distinct !DILexicalBlock(scope: !944, file: !32, line: 297, column: 76)
!952 = !DILocation(line: 299, column: 9, scope: !951, inlinedAt: !935)
!953 = !DILocalVariable(name: "mutex", arg: 1, scope: !954, file: !32, line: 60, type: !15)
!954 = distinct !DISubprogram(name: "if_tsan_post_lock", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization12_GLOBAL__N_117if_tsan_post_lockEPv", scope: !629, file: !32, line: 60, type: !13, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!955 = !{!953}
!956 = !DILocation(line: 0, scope: !954, inlinedAt: !957)
!957 = distinct !DILocation(line: 301, column: 9, scope: !930, inlinedAt: !935)
!958 = !DILocation(line: 61, column: 5, scope: !954, inlinedAt: !957)
!959 = !DILocation(line: 519, column: 5, scope: !906)
!960 = distinct !DISubprogram(name: "lock_bucket_pair", linkageName: "_ZN6Halide7Runtime8Internal15Synchronization16lock_bucket_pairEyy", scope: !33, file: !32, line: 531, type: !961, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !26, !26}
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_pair", scope: !33, file: !32, line: 522, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !964, identifier: "_ZTSN6Halide7Runtime8Internal15Synchronization11bucket_pairE")
!964 = !{!965, !966, !967}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !963, file: !32, line: 523, baseType: !909, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !963, file: !32, line: 524, baseType: !909, size: 64, offset: 64)
!967 = !DISubprogram(name: "bucket_pair", scope: !963, file: !32, line: 526, type: !968, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !970, !909, !909}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!971 = !{!972, !973, !974, !975, !976, !979, !982, !983, !985}
!972 = !DILocalVariable(name: "addr_from", arg: 1, scope: !960, file: !32, line: 531, type: !26)
!973 = !DILocalVariable(name: "addr_to", arg: 2, scope: !960, file: !32, line: 531, type: !26)
!974 = !DILocalVariable(name: "hash_from", scope: !960, file: !32, line: 533, type: !26)
!975 = !DILocalVariable(name: "hash_to", scope: !960, file: !32, line: 534, type: !26)
!976 = !DILocalVariable(name: "first", scope: !977, file: !32, line: 542, type: !909)
!977 = distinct !DILexicalBlock(scope: !978, file: !32, line: 541, column: 31)
!978 = distinct !DILexicalBlock(scope: !960, file: !32, line: 541, column: 9)
!979 = !DILocalVariable(name: "first", scope: !980, file: !32, line: 546, type: !909)
!980 = distinct !DILexicalBlock(scope: !981, file: !32, line: 545, column: 37)
!981 = distinct !DILexicalBlock(scope: !978, file: !32, line: 545, column: 16)
!982 = !DILocalVariable(name: "second", scope: !980, file: !32, line: 547, type: !909)
!983 = !DILocalVariable(name: "first", scope: !984, file: !32, line: 552, type: !909)
!984 = distinct !DILexicalBlock(scope: !981, file: !32, line: 551, column: 12)
!985 = !DILocalVariable(name: "second", scope: !984, file: !32, line: 553, type: !909)
!986 = !DILocation(line: 0, scope: !960)
!987 = !DILocation(line: 0, scope: !916, inlinedAt: !988)
!988 = distinct !DILocation(line: 533, column: 27, scope: !960)
!989 = !DILocation(line: 503, column: 22, scope: !925, inlinedAt: !988)
!990 = !DILocation(line: 503, column: 55, scope: !925, inlinedAt: !988)
!991 = !DILocation(line: 0, scope: !916, inlinedAt: !992)
!992 = distinct !DILocation(line: 534, column: 25, scope: !960)
!993 = !DILocation(line: 503, column: 22, scope: !925, inlinedAt: !992)
!994 = !DILocation(line: 503, column: 55, scope: !925, inlinedAt: !992)
!995 = !DILocation(line: 541, column: 19, scope: !978)
!996 = !DILocation(line: 541, column: 9, scope: !960)
!997 = !DILocation(line: 542, column: 30, scope: !977)
!998 = !DILocation(line: 0, scope: !977)
!999 = !DILocation(line: 0, scope: !930, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 543, column: 21, scope: !977)
!1001 = !DILocation(line: 292, column: 26, scope: !930, inlinedAt: !1000)
!1002 = !DILocation(line: 0, scope: !938, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 292, column: 9, scope: !930, inlinedAt: !1000)
!1004 = !DILocation(line: 57, column: 5, scope: !938, inlinedAt: !1003)
!1005 = !DILocation(line: 297, column: 47, scope: !944, inlinedAt: !1000)
!1006 = !DILocation(line: 0, scope: !647, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 297, column: 14, scope: !944, inlinedAt: !1000)
!1008 = !DILocation(line: 192, column: 12, scope: !647, inlinedAt: !1007)
!1009 = !DILocation(line: 297, column: 13, scope: !930, inlinedAt: !1000)
!1010 = !DILocation(line: 543, column: 15, scope: !977)
!1011 = !DILocation(line: 298, column: 13, scope: !951, inlinedAt: !1000)
!1012 = !DILocation(line: 299, column: 9, scope: !951, inlinedAt: !1000)
!1013 = !DILocation(line: 545, column: 26, scope: !981)
!1014 = !DILocation(line: 545, column: 16, scope: !978)
!1015 = !DILocation(line: 546, column: 30, scope: !980)
!1016 = !DILocation(line: 0, scope: !980)
!1017 = !DILocation(line: 547, column: 31, scope: !980)
!1018 = !DILocation(line: 0, scope: !930, inlinedAt: !1019)
!1019 = distinct !DILocation(line: 548, column: 21, scope: !980)
!1020 = !DILocation(line: 292, column: 26, scope: !930, inlinedAt: !1019)
!1021 = !DILocation(line: 0, scope: !938, inlinedAt: !1022)
