; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cache.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cache.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_mutex = type { [1 x i32] }
%"struct.Halide::Runtime::Internal::CacheEntry" = type { %"struct.Halide::Runtime::Internal::CacheEntry"*, %"struct.Halide::Runtime::Internal::CacheEntry"*, %"struct.Halide::Runtime::Internal::CacheEntry"*, i8*, i32, i8*, i32, i32, i32, i32, %struct.halide_dimension_t*, %struct.halide_buffer_t*, i64, i8 }
%struct.halide_dimension_t = type { i32, i32, i32, i32 }
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "memoization_lock", linkageName: "_ZN6Halide7Runtime8Internal16memoization_lockE", scope: !2, file: !5, line: 196, type: !6, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Internal", scope: !3)
!3 = !DINamespace(name: "Runtime", scope: !4)
!4 = !DINamespace(name: "Halide", scope: null)
!5 = !DIFile(filename: "src/runtime/cache.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !7, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !8, identifier: "_ZTS12halide_mutex")
!7 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !6, file: !7, line: 121, baseType: !10, size: 32)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !15)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 68, baseType: !13)
!12 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 12, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16}
!16 = !DISubrange(count: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "cache_entries", linkageName: "_ZN6Halide7Runtime8Internal13cache_entriesE", scope: !2, file: !5, line: 200, type: !19, isLocal: false, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, elements: !226)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CacheEntry", scope: !2, file: !5, line: 70, size: 512, flags: DIFlagTypePassByValue, elements: !22, identifier: "_ZTSN6Halide7Runtime8Internal10CacheEntryE")
!22 = !{!23, !24, !25, !26, !30, !32, !33, !34, !35, !36, !39, !63, !208, !209, !210, !219, !222}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !5, line: 71, baseType: !20, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "more_recent", scope: !21, file: !5, line: 72, baseType: !20, size: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "less_recent", scope: !21, file: !5, line: 73, baseType: !20, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_storage", scope: !21, file: !5, line: 74, baseType: !27, size: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 16, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !21, file: !5, line: 75, baseType: !31, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 27, baseType: !14)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !21, file: !5, line: 76, baseType: !27, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !21, file: !5, line: 77, baseType: !13, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "in_use_count", scope: !21, file: !5, line: 78, baseType: !13, size: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tuple_count", scope: !21, file: !5, line: 79, baseType: !13, size: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !21, file: !5, line: 81, baseType: !37, size: 32, offset: 288)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !12, line: 11, baseType: !38)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "computed_bounds", scope: !21, file: !5, line: 82, baseType: !40, size: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !7, line: 1409, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !7, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !43, identifier: "_ZTS18halide_dimension_t")
!43 = !{!44, !45, !46, !47, !48, !52, !55, !62}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !42, file: !7, line: 1383, baseType: !37, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !42, file: !7, line: 1383, baseType: !37, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !42, file: !7, line: 1383, baseType: !37, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !7, line: 1386, baseType: !13, size: 32, offset: 96)
!48 = !DISubprogram(name: "halide_dimension_t", scope: !42, file: !7, line: 1388, type: !49, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!52 = !DISubprogram(name: "halide_dimension_t", scope: !42, file: !7, line: 1389, type: !53, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !51, !37, !37, !37, !13}
!55 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !42, file: !7, line: 1393, type: !56, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !59, !61}
!58 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!61 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !60, size: 32)
!62 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !42, file: !7, line: 1400, type: !56, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !21, file: !5, line: 84, baseType: !64, size: 32, offset: 352)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !7, line: 1550, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !7, line: 1423, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !67, identifier: "_ZTS15halide_buffer_t")
!67 = !{!68, !71, !125, !126, !127, !167, !168, !169, !170, !179, !183, !186, !187, !190, !191, !194, !197, !198, !199, !204, !207}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !66, file: !7, line: 1425, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 10, baseType: !70)
!70 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !66, file: !7, line: 1428, baseType: !72, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !7, line: 723, size: 512, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTS25halide_device_interface_t")
!75 = !{!76, !82, !86, !87, !91, !92, !93, !94, !95, !99, !105, !109, !110, !114, !115, !120}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !74, file: !7, line: 724, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = !DISubroutineType(types: !79)
!79 = !{!38, !80, !81, !72}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !74, file: !7, line: 726, baseType: !83, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{!38, !80, !81}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !74, file: !7, line: 727, baseType: !83, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !74, file: !7, line: 728, baseType: !88, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !80, !72}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !74, file: !7, line: 730, baseType: !83, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !74, file: !7, line: 731, baseType: !77, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !74, file: !7, line: 733, baseType: !77, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !74, file: !7, line: 735, baseType: !83, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !74, file: !7, line: 736, baseType: !96, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DISubroutineType(types: !98)
!98 = !{!38, !80, !81, !72, !81}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !74, file: !7, line: 738, baseType: !100, size: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DISubroutineType(types: !102)
!102 = !{!38, !80, !103, !81}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !74, file: !7, line: 740, baseType: !106, size: 32, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!38, !80, !103, !38, !38, !81}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !74, file: !7, line: 742, baseType: !83, size: 32, offset: 352)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !74, file: !7, line: 743, baseType: !111, size: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DISubroutineType(types: !113)
!113 = !{!38, !80, !81, !69, !72}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !74, file: !7, line: 745, baseType: !83, size: 32, offset: 416)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !74, file: !7, line: 746, baseType: !116, size: 32, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DISubroutineType(types: !118)
!118 = !{!38, !80, !119, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !74, file: !7, line: 747, baseType: !121, size: 32, offset: 480)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !124, line: 10, size: 512, flags: DIFlagFwdDecl, identifier: "_ZTS30halide_device_interface_impl_t")
!124 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !66, file: !7, line: 1433, baseType: !27, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !7, line: 1436, baseType: !69, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !7, line: 1439, baseType: !128, size: 32, offset: 192)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !7, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !129, identifier: "_ZTS13halide_type_t")
!129 = !{!130, !139, !140, !143, !147, !150, !155, !159, !160, !161, !164}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !128, file: !7, line: 434, baseType: !131, size: 8, align: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !7, line: 413, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !7, line: 403, baseType: !28, size: 8, elements: !133, identifier: "_ZTS18halide_type_code_t")
!133 = !{!134, !135, !136, !137, !138}
!134 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!135 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!138 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !128, file: !7, line: 442, baseType: !28, size: 8, align: 8, offset: 8)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !128, file: !7, line: 446, baseType: !141, size: 16, align: 16, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 14, baseType: !142)
!142 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!143 = !DISubprogram(name: "halide_type_t", scope: !128, file: !7, line: 453, type: !144, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146, !131, !28, !141}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!147 = !DISubprogram(name: "halide_type_t", scope: !128, file: !7, line: 459, type: !148, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !146}
!150 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !128, file: !7, line: 463, type: !151, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DISubroutineType(types: !152)
!152 = !{!128, !153, !141}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!155 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !128, file: !7, line: 468, type: !156, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DISubroutineType(types: !157)
!157 = !{!58, !153, !158}
!158 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !154, size: 32)
!159 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !128, file: !7, line: 472, type: !156, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !128, file: !7, line: 476, type: !156, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!161 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !128, file: !7, line: 481, type: !162, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DISubroutineType(types: !163)
!163 = !{!38, !153}
!164 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !128, file: !7, line: 485, type: !165, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DISubroutineType(types: !166)
!166 = !{!13, !153}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !66, file: !7, line: 1442, baseType: !37, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !66, file: !7, line: 1446, baseType: !40, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !66, file: !7, line: 1449, baseType: !80, size: 32, offset: 288)
!170 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !66, file: !7, line: 1454, type: !171, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!171 = !DISubroutineType(types: !172)
!172 = !{!58, !173, !174}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !7, line: 1416, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 1415, baseType: !14, size: 32, elements: !176, identifier: "_ZTS19halide_buffer_flags")
!176 = !{!177, !178}
!177 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!178 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!179 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !66, file: !7, line: 1458, type: !180, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !182, !174, !58}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!183 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !66, file: !7, line: 1466, type: !184, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubroutineType(types: !185)
!185 = !{!58, !173}
!186 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !66, file: !7, line: 1470, type: !184, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!187 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !66, file: !7, line: 1474, type: !188, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !182, !58}
!190 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !66, file: !7, line: 1478, type: !188, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!191 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !66, file: !7, line: 1485, type: !192, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{!31, !173}
!194 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !66, file: !7, line: 1495, type: !195, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubroutineType(types: !196)
!196 = !{!27, !173}
!197 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !66, file: !7, line: 1506, type: !195, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !66, file: !7, line: 1518, type: !192, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !66, file: !7, line: 1523, type: !200, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{!27, !173, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!204 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !66, file: !7, line: 1534, type: !205, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!205 = !DISubroutineType(types: !206)
!206 = !{!38, !182, !80}
!207 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !66, file: !7, line: 1545, type: !184, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "eviction_key", scope: !21, file: !5, line: 85, baseType: !69, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "has_eviction_key", scope: !21, file: !5, line: 86, baseType: !58, size: 8, offset: 448)
!210 = !DISubprogram(name: "init", linkageName: "_ZN6Halide7Runtime8Internal10CacheEntry4initEPKhjjPK15halide_buffer_tiPPS5_by", scope: !21, file: !5, line: 88, type: !211, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{!58, !213, !214, !31, !13, !216, !37, !218, !58, !69}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!219 = !DISubprogram(name: "destroy", linkageName: "_ZN6Halide7Runtime8Internal10CacheEntry7destroyEv", scope: !21, file: !5, line: 93, type: !220, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !213}
!222 = !DISubprogram(name: "buffer", linkageName: "_ZN6Halide7Runtime8Internal10CacheEntry6bufferEi", scope: !21, file: !5, line: 94, type: !223, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !213, !37}
!225 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !65, size: 32)
!226 = !{!227}
!227 = !DISubrange(count: 256)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "most_recently_used", linkageName: "_ZN6Halide7Runtime8Internal18most_recently_usedE", scope: !2, file: !5, line: 202, type: !20, isLocal: false, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "least_recently_used", linkageName: "_ZN6Halide7Runtime8Internal19least_recently_usedE", scope: !2, file: !5, line: 203, type: !20, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "max_cache_size", linkageName: "_ZN6Halide7Runtime8Internal14max_cache_sizeE", scope: !2, file: !5, line: 206, type: !234, isLocal: false, isDefinition: true)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !12, line: 9, baseType: !235)
!235 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "current_cache_size", linkageName: "_ZN6Halide7Runtime8Internal18current_cache_sizeE", scope: !2, file: !5, line: 207, type: !234, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !239, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !240, retainedTypes: !241, globals: !329, imports: !336, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cache.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!240 = !{!132, !175}
!241 = !{!80, !242, !69, !323, !27, !64, !40, !31, !13, !20, !328, !248}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !244, file: !243, line: 203, baseType: !245)
!243 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!244 = !DINamespace(scope: !2)
!245 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !244, file: !243, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !246, templateParams: !320)
!246 = !{!247, !250, !251, !252, !253, !254, !256, !260, !266, !269, !272, !275, !278, !282, !286, !291, !295, !298, !302, !305, !308, !313, !314, !317, !318, !319}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !243, line: 32, baseType: !248, size: 32, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !245, file: !243, line: 32, baseType: !248, size: 32, offset: 32, flags: DIFlagPublic)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !245, file: !243, line: 32, baseType: !248, size: 32, offset: 64, flags: DIFlagPublic)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !245, file: !243, line: 33, baseType: !80, size: 32, offset: 96, flags: DIFlagPublic)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !245, file: !243, line: 34, baseType: !58, size: 8, offset: 128, flags: DIFlagPublic)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !245, file: !243, line: 35, baseType: !255, size: 8, offset: 136, flags: DIFlagPublic)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 8, elements: !15)
!256 = !DISubprogram(name: "Printer", scope: !245, file: !243, line: 37, type: !257, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259, !80, !248}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!260 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !245, file: !243, line: 57, type: !261, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !259, !264}
!263 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !245, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!266 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !245, file: !243, line: 67, type: !267, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!267 = !DISubroutineType(types: !268)
!268 = !{!263, !259, !234}
!269 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !245, file: !243, line: 72, type: !270, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!263, !259, !37}
!272 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !245, file: !243, line: 77, type: !273, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!273 = !DISubroutineType(types: !274)
!274 = !{!263, !259, !69}
!275 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !245, file: !243, line: 82, type: !276, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DISubroutineType(types: !277)
!277 = !{!263, !259, !13}
!278 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !245, file: !243, line: 87, type: !279, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!279 = !DISubroutineType(types: !280)
!280 = !{!263, !259, !281}
!281 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!282 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !245, file: !243, line: 92, type: !283, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!263, !259, !285}
!285 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!286 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !245, file: !243, line: 97, type: !287, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!287 = !DISubroutineType(types: !288)
!288 = !{!263, !259, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!291 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !245, file: !243, line: 102, type: !292, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!292 = !DISubroutineType(types: !293)
!293 = !{!263, !259, !294}
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!295 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !245, file: !243, line: 108, type: !296, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DISubroutineType(types: !297)
!297 = !{!263, !259, !158}
!298 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !245, file: !243, line: 113, type: !299, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!299 = !DISubroutineType(types: !300)
!300 = !{!263, !259, !301}
!301 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !217, size: 32)
!302 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !245, file: !243, line: 119, type: !303, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!264, !259}
!305 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !245, file: !243, line: 131, type: !306, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !259}
!308 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !245, file: !243, line: 139, type: !309, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DISubroutineType(types: !310)
!310 = !{!69, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!313 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !245, file: !243, line: 143, type: !309, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !245, file: !243, line: 148, type: !315, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !259, !38}
!317 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !245, file: !243, line: 158, type: !303, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !245, file: !243, line: 162, type: !306, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubprogram(name: "~Printer", scope: !245, file: !243, line: 166, type: !306, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !{!321, !322}
!321 = !DITemplateValueParameter(name: "type", type: !38, value: i32 0)
!322 = !DITemplateValueParameter(name: "length", type: !70, value: i64 1024)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CacheBlockHeader", scope: !2, file: !5, line: 97, size: 64, flags: DIFlagTypePassByValue, elements: !325, identifier: "_ZTSN6Halide7Runtime8Internal16CacheBlockHeaderE")
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !324, file: !5, line: 98, baseType: !20, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !324, file: !5, line: 99, baseType: !13, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !12, line: 28, baseType: !38)
!329 = !{!0, !17, !228, !230, !232, !236, !330, !333}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!331 = distinct !DIGlobalVariable(name: "kHashTableSize", scope: !2, file: !5, line: 198, type: !332, isLocal: true, isDefinition: true)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression(DW_OP_constu, 1048576, DW_OP_stack_value))
!334 = distinct !DIGlobalVariable(name: "kDefaultCacheSize", scope: !2, file: !5, line: 205, type: !335, isLocal: true, isDefinition: true)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!336 = !{!337}
!337 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !238, entity: !2, file: !12, line: 225)
!338 = !{i32 7, !"Dwarf Version", i32 4}
!339 = !{i32 2, !"Debug Info Version", i32 3}
!340 = !{i32 1, !"wchar_size", i32 4}
!341 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!342 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !2, file: !343, line: 47, type: !344, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !238, retainedNodes: !360)
!343 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346, !38, !234, !234}
!346 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !2, file: !343, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !349, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!349 = !{!350, !351, !352, !353, !357, !358, !359}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !348, file: !343, line: 35, baseType: !69, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !348, file: !343, line: 35, baseType: !69, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !348, file: !343, line: 37, baseType: !69, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !348, file: !343, line: 39, baseType: !354, size: 1024, offset: 192)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1024, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 16)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !348, file: !343, line: 41, baseType: !354, size: 1024, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !348, file: !343, line: 42, baseType: !354, size: 1024, offset: 2240)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !348, file: !343, line: 44, baseType: !69, size: 64, offset: 3264)
!360 = !{!361, !362, !363, !364, !365, !368, !369}
!361 = !DILocalVariable(name: "copy", arg: 1, scope: !342, file: !343, line: 47, type: !346)
!362 = !DILocalVariable(name: "d", arg: 2, scope: !342, file: !343, line: 47, type: !38)
!363 = !DILocalVariable(name: "src_off", arg: 3, scope: !342, file: !343, line: 47, type: !234)
!364 = !DILocalVariable(name: "dst_off", arg: 4, scope: !342, file: !343, line: 47, type: !234)
!365 = !DILocalVariable(name: "from", scope: !366, file: !343, line: 54, type: !289)
!366 = distinct !DILexicalBlock(scope: !367, file: !343, line: 53, column: 18)
!367 = distinct !DILexicalBlock(scope: !342, file: !343, line: 53, column: 9)
!368 = !DILocalVariable(name: "to", scope: !366, file: !343, line: 55, type: !80)
!369 = !DILocalVariable(name: "i", scope: !370, file: !343, line: 58, type: !69)
!370 = distinct !DILexicalBlock(scope: !371, file: !343, line: 58, column: 9)
!371 = distinct !DILexicalBlock(scope: !367, file: !343, line: 57, column: 12)
!372 = !DILocation(line: 0, scope: !342)
!373 = !DILocation(line: 49, column: 14, scope: !342)
!374 = !DILocation(line: 49, column: 19, scope: !342)
!375 = !DILocation(line: 49, column: 22, scope: !342)
!376 = !{!377, !377, i64 0}
!377 = !{!"long long", !378, i64 0}
!378 = !{!"omnipotent char", !379, i64 0}
!379 = !{!"Simple C++ TBAA"}
!380 = !DILocation(line: 49, column: 37, scope: !342)
!381 = !DILocation(line: 49, column: 5, scope: !342)
!382 = !DILocation(line: 50, column: 10, scope: !383)
!383 = distinct !DILexicalBlock(scope: !342, file: !343, line: 49, column: 43)
!384 = distinct !{!384, !381, !385, !386}
!385 = !DILocation(line: 51, column: 5, scope: !342)
!386 = !{!"llvm.loop.mustprogress"}
!387 = !DILocation(line: 53, column: 11, scope: !367)
!388 = !DILocation(line: 53, column: 9, scope: !342)
!389 = !DILocation(line: 0, scope: !370)
!390 = !DILocation(line: 58, column: 34, scope: !391)
!391 = distinct !DILexicalBlock(scope: !370, file: !343, line: 58, column: 9)
!392 = !DILocation(line: 58, column: 32, scope: !391)
!393 = !DILocation(line: 58, column: 9, scope: !370)
!394 = !DILocation(line: 54, column: 42, scope: !366)
!395 = !{!396, !377, i64 0}
!396 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !377, i64 0, !377, i64 8, !377, i64 16, !378, i64 24, !378, i64 152, !378, i64 280, !377, i64 408}
!397 = !DILocation(line: 54, column: 46, scope: !366)
!398 = !DILocation(line: 54, column: 28, scope: !366)
!399 = !DILocation(line: 0, scope: !366)
!400 = !DILocation(line: 55, column: 34, scope: !366)
!401 = !{!396, !377, i64 8}
!402 = !DILocation(line: 55, column: 38, scope: !366)
!403 = !DILocation(line: 55, column: 20, scope: !366)
!404 = !DILocation(line: 56, column: 31, scope: !366)
!405 = !{!396, !377, i64 408}
!406 = !DILocation(line: 56, column: 26, scope: !366)
!407 = !DILocation(line: 56, column: 9, scope: !366)
!408 = !DILocation(line: 57, column: 5, scope: !366)
!409 = !DILocation(line: 59, column: 13, scope: !410)
!410 = distinct !DILexicalBlock(scope: !391, file: !343, line: 58, column: 55)
!411 = !DILocation(line: 60, column: 24, scope: !410)
!412 = !DILocation(line: 60, column: 21, scope: !410)
!413 = !DILocation(line: 61, column: 24, scope: !410)
!414 = !DILocation(line: 61, column: 21, scope: !410)
!415 = !DILocation(line: 58, column: 51, scope: !391)
!416 = distinct !{!416, !393, !417, !386}
!417 = !DILocation(line: 62, column: 9, scope: !370)
!418 = !DILocation(line: 64, column: 1, scope: !342)
!419 = !DISubprogram(name: "memcpy", scope: !12, file: !12, line: 94, type: !420, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{!80, !80, !289, !14}
!422 = !{}
