; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cuda.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cuda.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::Cuda::CUctx_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUmod_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUfunc_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUDA_MEMCPY3D_st" = type { i64, i64, i64, i64, i32, i8*, i64, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i64, i64, i64, i64, i64, i64, i32, i8*, i64, %"struct.Halide::Runtime::Internal::Cuda::CUarray_st"*, i8*, i64, i64, i64, i64, i64 }
%"struct.Halide::Runtime::Internal::Cuda::CUarray_st" = type opaque
%"struct.Halide::Runtime::Internal::Cuda::CUstream_st" = type opaque
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Runtime::Internal::Cuda::FreeListItem" = type { i64, %"struct.Halide::Runtime::Internal::Cuda::CUctx_st"*, %"struct.Halide::Runtime::Internal::Cuda::CUstream_st"*, i64, %"struct.Halide::Runtime::Internal::Cuda::FreeListItem"* }
%"class.Halide::Internal::GPUCompilationCache" = type { %struct.halide_mutex, i32, %"struct.Halide::Internal::GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *, Halide::Runtime::Internal::Cuda::CUmod_st *>::CachedCompilation"*, i32, i32 }

!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "CUstream_st", scope: !2, file: !11, line: 25, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6Halide7Runtime8Internal4Cuda11CUstream_stE")
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "cuCtxSynchronize", linkageName: "_ZN6Halide7Runtime8Internal4Cuda16cuCtxSynchronizeE", scope: !2, file: !6, line: 41, type: !215, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "cuCtxPushCurrent", linkageName: "_ZN6Halide7Runtime8Internal4Cuda16cuCtxPushCurrentE", scope: !2, file: !6, line: 43, type: !210, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "cuCtxPopCurrent", linkageName: "_ZN6Halide7Runtime8Internal4Cuda15cuCtxPopCurrentE", scope: !2, file: !6, line: 44, type: !329, isLocal: false, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!10, !204}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "cuPointerGetAttribute", linkageName: "_ZN6Halide7Runtime8Internal4Cuda21cuPointerGetAttributeE", scope: !2, file: !6, line: 46, type: !334, isLocal: false, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!10, !261, !76, !284}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "cuStreamSynchronize", linkageName: "_ZN6Halide7Runtime8Internal4Cuda19cuStreamSynchronizeE", scope: !2, file: !6, line: 48, type: !339, isLocal: false, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!10, !320}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "lib_cuda", linkageName: "_ZN6Halide7Runtime8Internal4Cuda8lib_cudaE", scope: !2, file: !344, line: 31, type: !261, isLocal: false, isDefinition: true)
!344 = !DIFile(filename: "src/runtime/cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "lib_cuda_lock", linkageName: "_ZN6Halide7Runtime8Internal4Cuda13lib_cuda_lockE", scope: !2, file: !344, line: 32, type: !347, isLocal: false, isDefinition: true)
!347 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !350, file: !349, line: 11, baseType: !189)
!349 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !349, line: 9, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !351, identifier: "_ZTSN6Halide7Runtime8Internal14ScopedSpinLockE")
!351 = !{!352, !355, !359}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !349, line: 13, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!355 = !DISubprogram(name: "ScopedSpinLock", scope: !350, file: !349, line: 15, type: !356, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358, !354}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!359 = !DISubprogram(name: "~ScopedSpinLock", scope: !350, file: !349, line: 22, type: !360, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !358}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "context", linkageName: "_ZN6Halide7Runtime8Internal4Cuda7contextE", scope: !2, file: !344, line: 106, type: !205, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "context_lock", linkageName: "_ZN6Halide7Runtime8Internal4Cuda12context_lockE", scope: !2, file: !344, line: 108, type: !366, isLocal: false, isDefinition: true)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !367, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !368, identifier: "_ZTS12halide_mutex")
!367 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !366, file: !367, line: 121, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 64, elements: !373)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !197, line: 61, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !197, line: 10, baseType: !285)
!373 = !{!374}
!374 = !DISubrange(count: 1)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "free_list", linkageName: "_ZN6Halide7Runtime8Internal4Cuda9free_listE", scope: !2, file: !344, line: 117, type: !377, isLocal: false, isDefinition: true)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreeListItem", scope: !2, file: !344, line: 111, size: 320, flags: DIFlagTypePassByValue, elements: !379, identifier: "_ZTSN6Halide7Runtime8Internal4Cuda12FreeListItemE")
!379 = !{!380, !381, !382, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !378, file: !344, line: 112, baseType: !284, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !378, file: !344, line: 113, baseType: !205, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !378, file: !344, line: 114, baseType: !320, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !344, line: 115, baseType: !196, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !344, line: 116, baseType: !377, size: 64, offset: 256)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "free_list_lock", linkageName: "_ZN6Halide7Runtime8Internal4Cuda14free_list_lockE", scope: !2, file: !344, line: 118, type: !366, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "_ZN6Halide7Runtime8Internal4Cuda17compilation_cacheE", scope: !2, file: !344, line: 248, type: !389, isLocal: false, isDefinition: true)
!389 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<Halide::Runtime::Internal::Cuda::CUctx_st *, Halide::Runtime::Internal::Cuda::CUmod_st *>", scope: !391, file: !390, line: 8, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !392, templateParams: !443, identifier: "_ZTSN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEEE")
!390 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!391 = !DINamespace(name: "Internal", scope: !5)
!392 = !{!393, !394, !397, !399, !400, !413, !414, !416, !417, !418, !421, !428, !433, !437, !440}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !389, file: !390, line: 22, baseType: !366, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !389, file: !390, line: 24, baseType: !395, flags: DIFlagStaticMember, extraData: float 5.000000e-01)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !389, file: !390, line: 25, baseType: !398, flags: DIFlagStaticMember, extraData: i32 7)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !389, file: !390, line: 26, baseType: !76, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !389, file: !390, line: 27, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !389, file: !390, line: 9, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !403, identifier: "_ZTSN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE17CachedCompilationE")
!403 = !{!404, !405, !406, !408, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !402, file: !390, line: 10, baseType: !206, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !402, file: !390, line: 11, baseType: !236, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !402, file: !390, line: 12, baseType: !407, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !197, line: 12, baseType: !13)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !402, file: !390, line: 13, baseType: !407, size: 32, offset: 160)
!409 = !DISubprogram(name: "CachedCompilation", scope: !402, file: !390, line: 15, type: !410, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412, !206, !236, !407, !407}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !389, file: !390, line: 28, baseType: !76, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !389, file: !390, line: 30, baseType: !415, flags: DIFlagStaticMember, extraData: i32 0)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !389, file: !390, line: 31, baseType: !415, flags: DIFlagStaticMember, extraData: i32 1)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !389, file: !390, line: 33, baseType: !407, size: 32, offset: 224)
!418 = !DISubprogram(name: "kernel_hash", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE11kernel_hashES6_jj", scope: !389, file: !390, line: 36, type: !419, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!371, !206, !407, !407}
!421 = !DISubprogram(name: "insert", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE6insertERKNS9_17CachedCompilationE", scope: !389, file: !390, line: 47, type: !422, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !425, !426}
!424 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!426 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!428 = !DISubprogram(name: "find_internal", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE13find_internalES6_jRPS8_i", scope: !389, file: !390, line: 73, type: !429, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{!424, !425, !206, !407, !431, !76}
!431 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!433 = !DISubprogram(name: "lookup", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE6lookupES6_PvRS8_", scope: !389, file: !390, line: 97, type: !434, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!424, !425, !206, !261, !436}
!436 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !236, size: 64)
!437 = !DISubprogram(name: "resize_table", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE12resize_tableEi", scope: !389, file: !390, line: 108, type: !438, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{!424, !425, !76}
!440 = !DISubprogram(name: "release_hold", linkageName: "_ZN6Halide8Internal19GPUCompilationCacheIPNS_7Runtime8Internal4Cuda8CUctx_stEPNS4_8CUmod_stEE12release_holdEPvS6_SA_", scope: !389, file: !390, line: 211, type: !441, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !425, !261, !206, !261}
!443 = !{!444, !445}
!444 = !DITemplateTypeParameter(name: "ContextT", type: !206)
!445 = !DITemplateTypeParameter(name: "ModuleStateT", type: !236)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "cuda_allocation_pool", scope: !3, file: !344, line: 569, type: !448, isLocal: false, isDefinition: true)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_allocation_pool", file: !367, line: 1887, size: 128, flags: DIFlagTypePassByValue, elements: !449, identifier: "_ZTS29halide_device_allocation_pool")
!449 = !{!450, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "release_unused", scope: !448, file: !367, line: 1888, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!76, !261}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !367, line: 1889, baseType: !455, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "cuda_device_interface", linkageName: "_ZN6Halide7Runtime8Internal4Cuda21cuda_device_interfaceE", scope: !2, file: !344, line: 1405, type: !458, isLocal: false, isDefinition: true)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !367, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !459, identifier: "_ZTS25halide_device_interface_t")
!459 = !{!460, !580, !584, !585, !589, !590, !591, !592, !593, !597, !602, !606, !607, !611, !612, !616}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !458, file: !367, line: 724, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!76, !261, !464, !469}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !367, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !466, identifier: "_ZTS15halide_buffer_t")
!466 = !{!467, !468, !471, !475, !476, !516, !518, !541, !542, !552, !556, !559, !560, !563, !564, !567, !570, !571, !572, !576, !579}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !465, file: !367, line: 1425, baseType: !372, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !465, file: !367, line: 1428, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !465, file: !367, line: 1433, baseType: !472, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !197, line: 16, baseType: !474)
!474 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !367, line: 1436, baseType: !372, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !367, line: 1439, baseType: !477, size: 32, offset: 256)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !367, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !478, identifier: "_ZTS13halide_type_t")
!478 = !{!479, !488, !489, !492, !496, !499, !504, !508, !509, !510, !513}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !477, file: !367, line: 434, baseType: !480, size: 8, align: 8)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !367, line: 413, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !367, line: 403, baseType: !473, size: 8, elements: !482, identifier: "_ZTS18halide_type_code_t")
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!484 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!485 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!486 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!487 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !477, file: !367, line: 442, baseType: !473, size: 8, align: 8, offset: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !477, file: !367, line: 446, baseType: !490, size: 16, align: 16, offset: 16)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !197, line: 14, baseType: !491)
!491 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!492 = !DISubprogram(name: "halide_type_t", scope: !477, file: !367, line: 453, type: !493, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495, !480, !473, !490}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!496 = !DISubprogram(name: "halide_type_t", scope: !477, file: !367, line: 459, type: !497, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !495}
!499 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !477, file: !367, line: 463, type: !500, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!477, !502, !490}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!504 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !477, file: !367, line: 468, type: !505, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!505 = !DISubroutineType(types: !506)
!506 = !{!424, !502, !507}
!507 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !503, size: 64)
!508 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !477, file: !367, line: 472, type: !505, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !477, file: !367, line: 476, type: !505, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !477, file: !367, line: 481, type: !511, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!511 = !DISubroutineType(types: !512)
!512 = !{!76, !502}
!513 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !477, file: !367, line: 485, type: !514, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!514 = !DISubroutineType(types: !515)
!515 = !{!407, !502}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !465, file: !367, line: 1442, baseType: !517, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !197, line: 11, baseType: !76)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !465, file: !367, line: 1446, baseType: !519, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !367, line: 1409, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !367, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !522, identifier: "_ZTS18halide_dimension_t")
!522 = !{!523, !524, !525, !526, !527, !531, !534, !540}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !521, file: !367, line: 1383, baseType: !517, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !521, file: !367, line: 1383, baseType: !517, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !521, file: !367, line: 1383, baseType: !517, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !521, file: !367, line: 1386, baseType: !407, size: 32, offset: 96)
!527 = !DISubprogram(name: "halide_dimension_t", scope: !521, file: !367, line: 1388, type: !528, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!531 = !DISubprogram(name: "halide_dimension_t", scope: !521, file: !367, line: 1389, type: !532, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !530, !517, !517, !517, !407}
!534 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !521, file: !367, line: 1393, type: !535, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubroutineType(types: !536)
!536 = !{!424, !537, !539}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!539 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !538, size: 64)
!540 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !521, file: !367, line: 1400, type: !535, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !465, file: !367, line: 1449, baseType: !261, size: 64, offset: 384)
!542 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !465, file: !367, line: 1454, type: !543, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubroutineType(types: !544)
!544 = !{!424, !545, !547}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !367, line: 1416, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !367, line: 1415, baseType: !13, size: 32, elements: !549, identifier: "_ZTS19halide_buffer_flags")
!549 = !{!550, !551}
!550 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!551 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!552 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !465, file: !367, line: 1458, type: !553, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !555, !547, !424}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!556 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !465, file: !367, line: 1466, type: !557, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(types: !558)
!558 = !{!424, !545}
!559 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !465, file: !367, line: 1470, type: !557, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !465, file: !367, line: 1474, type: !561, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !555, !424}
!563 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !465, file: !367, line: 1478, type: !561, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !465, file: !367, line: 1485, type: !565, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DISubroutineType(types: !566)
!566 = !{!196, !545}
!567 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !465, file: !367, line: 1495, type: !568, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!568 = !DISubroutineType(types: !569)
!569 = !{!472, !545}
!570 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !465, file: !367, line: 1506, type: !568, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !465, file: !367, line: 1518, type: !565, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !465, file: !367, line: 1523, type: !573, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubroutineType(types: !574)
!574 = !{!472, !545, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!576 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !465, file: !367, line: 1534, type: !577, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubroutineType(types: !578)
!578 = !{!76, !555, !261}
!579 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !465, file: !367, line: 1545, type: !557, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !458, file: !367, line: 726, baseType: !581, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!76, !261, !464}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !458, file: !367, line: 727, baseType: !581, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !458, file: !367, line: 728, baseType: !586, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !261, !469}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !458, file: !367, line: 730, baseType: !581, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !458, file: !367, line: 731, baseType: !461, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !458, file: !367, line: 733, baseType: !461, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !458, file: !367, line: 735, baseType: !581, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !458, file: !367, line: 736, baseType: !594, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!76, !261, !464, !469, !464}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !458, file: !367, line: 738, baseType: !598, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!76, !261, !601, !464}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !458, file: !367, line: 740, baseType: !603, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!76, !261, !601, !76, !76, !464}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !458, file: !367, line: 742, baseType: !581, size: 64, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !458, file: !367, line: 743, baseType: !608, size: 64, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!76, !261, !464, !372, !469}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !458, file: !367, line: 745, baseType: !581, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !458, file: !367, line: 746, baseType: !613, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!76, !261, !75, !75}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !458, file: !367, line: 747, baseType: !617, size: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !620, line: 10, size: 1024, flags: DIFlagTypePassByValue, elements: !621, identifier: "_ZTS30halide_device_interface_impl_t")
!620 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!621 = !{!622, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !643}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !619, file: !620, line: 16, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !619, file: !620, line: 17, baseType: !623, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !619, file: !620, line: 18, baseType: !581, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !619, file: !620, line: 19, baseType: !581, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !619, file: !620, line: 20, baseType: !581, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !619, file: !620, line: 21, baseType: !451, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !619, file: !620, line: 22, baseType: !581, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !619, file: !620, line: 23, baseType: !581, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !619, file: !620, line: 24, baseType: !581, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !619, file: !620, line: 25, baseType: !581, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !619, file: !620, line: 26, baseType: !594, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !619, file: !620, line: 28, baseType: !598, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !619, file: !620, line: 31, baseType: !603, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !619, file: !620, line: 35, baseType: !581, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !619, file: !620, line: 37, baseType: !640, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!76, !261, !464, !372}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !619, file: !620, line: 38, baseType: !581, size: 64, offset: 960)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "cuda_device_interface_impl", linkageName: "_ZN6Halide7Runtime8Internal4Cuda26cuda_device_interface_implE", scope: !2, file: !344, line: 1386, type: !619, isLocal: false, isDefinition: true)
!646 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !647, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !648, retainedTypes: !696, globals: !926, imports: !927, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/cuda.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!648 = !{!481, !548, !12, !90, !247, !649}
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !367, line: 990, baseType: !76, size: 32, elements: !650, identifier: "_ZTS19halide_error_code_t")
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!651 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!652 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!653 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!654 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!655 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!656 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!657 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!658 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!659 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!660 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!661 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!662 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!663 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!664 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!665 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!666 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!667 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!668 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!669 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!670 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!671 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!672 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!673 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!674 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!675 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!676 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!677 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!678 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!679 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!680 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!681 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!682 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!683 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!684 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!685 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!686 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!687 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!688 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!689 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!690 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!691 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!692 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!693 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!694 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!695 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!696 = !{!261, !697, !372, !775, !76, !371, !284, !377, !260, !842, !843, !196, !844, !720, !188, !846, !849, !852, !855, !858, !861, !865, !869, !872, !875, !878, !881, !885, !888, !892, !896, !899, !902, !905, !908, !913, !916, !919, !922, !925, !401, !407, !389}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !699, file: !698, line: 203, baseType: !700)
!698 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!699 = !DINamespace(scope: !3)
!700 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !699, file: !698, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !701, templateParams: !772)
!701 = !{!702, !703, !704, !705, !706, !707, !709, !713, !717, !722, !725, !728, !731, !735, !738, !741, !745, !748, !754, !757, !760, !765, !766, !769, !770, !771}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !700, file: !698, line: 32, baseType: !188, size: 64, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !700, file: !698, line: 32, baseType: !188, size: 64, offset: 64, flags: DIFlagPublic)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !700, file: !698, line: 32, baseType: !188, size: 64, offset: 128, flags: DIFlagPublic)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !700, file: !698, line: 33, baseType: !261, size: 64, offset: 192, flags: DIFlagPublic)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !700, file: !698, line: 34, baseType: !424, size: 8, offset: 256, flags: DIFlagPublic)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !700, file: !698, line: 35, baseType: !708, size: 8, offset: 264, flags: DIFlagPublic)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !373)
!709 = !DISubprogram(name: "Printer", scope: !700, file: !698, line: 37, type: !710, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712, !261, !188}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!713 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !700, file: !698, line: 57, type: !714, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !712, !276}
!716 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !700, size: 64)
!717 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !700, file: !698, line: 67, type: !718, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!718 = !DISubroutineType(types: !719)
!719 = !{!716, !712, !720}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !197, line: 9, baseType: !721)
!721 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!722 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !700, file: !698, line: 72, type: !723, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DISubroutineType(types: !724)
!724 = !{!716, !712, !517}
!725 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !700, file: !698, line: 77, type: !726, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!726 = !DISubroutineType(types: !727)
!727 = !{!716, !712, !372}
!728 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !700, file: !698, line: 82, type: !729, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!729 = !DISubroutineType(types: !730)
!730 = !{!716, !712, !407}
!731 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !700, file: !698, line: 87, type: !732, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!732 = !DISubroutineType(types: !733)
!733 = !{!716, !712, !734}
!734 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!735 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !700, file: !698, line: 92, type: !736, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DISubroutineType(types: !737)
!737 = !{!716, !712, !396}
!738 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !700, file: !698, line: 97, type: !739, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubroutineType(types: !740)
!740 = !{!716, !712, !238}
!741 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !700, file: !698, line: 102, type: !742, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{!716, !712, !744}
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!745 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !700, file: !698, line: 108, type: !746, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!746 = !DISubroutineType(types: !747)
!747 = !{!716, !712, !507}
!748 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !700, file: !698, line: 113, type: !749, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!716, !712, !751}
!751 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !367, line: 1550, baseType: !465)
!754 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !700, file: !698, line: 119, type: !755, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{!276, !712}
!757 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !700, file: !698, line: 131, type: !758, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !712}
!760 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !700, file: !698, line: 139, type: !761, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!761 = !DISubroutineType(types: !762)
!762 = !{!372, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!765 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !700, file: !698, line: 143, type: !761, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !700, file: !698, line: 148, type: !767, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !712, !76}
!769 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !700, file: !698, line: 158, type: !755, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !700, file: !698, line: 162, type: !758, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DISubprogram(name: "~Printer", scope: !700, file: !698, line: 166, type: !758, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!772 = !{!773, !774}
!773 = !DITemplateValueParameter(name: "type", type: !76, value: i32 0)
!774 = !DITemplateValueParameter(name: "length", type: !285, value: i64 1024)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !699, file: !698, line: 199, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1, 1024>", scope: !699, file: !698, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !777, templateParams: !840)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !788, !792, !795, !798, !801, !804, !807, !810, !813, !816, !819, !822, !825, !828, !833, !834, !837, !838, !839}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !776, file: !698, line: 32, baseType: !188, size: 64, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !776, file: !698, line: 32, baseType: !188, size: 64, offset: 64, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !776, file: !698, line: 32, baseType: !188, size: 64, offset: 128, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !776, file: !698, line: 33, baseType: !261, size: 64, offset: 192, flags: DIFlagPublic)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !776, file: !698, line: 34, baseType: !424, size: 8, offset: 256, flags: DIFlagPublic)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !776, file: !698, line: 35, baseType: !708, size: 8, offset: 264, flags: DIFlagPublic)
!784 = !DISubprogram(name: "Printer", scope: !776, file: !698, line: 37, type: !785, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !787, !261, !188}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!788 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKc", scope: !776, file: !698, line: 57, type: !789, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!791, !787, !276}
!791 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !776, size: 64)
!792 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEx", scope: !776, file: !698, line: 67, type: !793, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!791, !787, !720}
!795 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEi", scope: !776, file: !698, line: 72, type: !796, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DISubroutineType(types: !797)
!797 = !{!791, !787, !517}
!798 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEy", scope: !776, file: !698, line: 77, type: !799, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DISubroutineType(types: !800)
!800 = !{!791, !787, !372}
!801 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEj", scope: !776, file: !698, line: 82, type: !802, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!802 = !DISubroutineType(types: !803)
!803 = !{!791, !787, !407}
!804 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEd", scope: !776, file: !698, line: 87, type: !805, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DISubroutineType(types: !806)
!806 = !{!791, !787, !734}
!807 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEf", scope: !776, file: !698, line: 92, type: !808, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{!791, !787, !396}
!810 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsEPKv", scope: !776, file: !698, line: 97, type: !811, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!811 = !DISubroutineType(types: !812)
!812 = !{!791, !787, !238}
!813 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE23write_float16_from_bitsEt", scope: !776, file: !698, line: 102, type: !814, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubroutineType(types: !815)
!815 = !{!791, !787, !744}
!816 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK13halide_type_t", scope: !776, file: !698, line: 108, type: !817, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!817 = !DISubroutineType(types: !818)
!818 = !{!791, !787, !507}
!819 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EElsERK15halide_buffer_t", scope: !776, file: !698, line: 113, type: !820, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{!791, !787, !751}
!822 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE3strEv", scope: !776, file: !698, line: 119, type: !823, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DISubroutineType(types: !824)
!824 = !{!276, !787}
!825 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5clearEv", scope: !776, file: !698, line: 131, type: !826, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !787}
!828 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE4sizeEv", scope: !776, file: !698, line: 139, type: !829, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!829 = !DISubroutineType(types: !830)
!830 = !{!372, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!833 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE8capacityEv", scope: !776, file: !698, line: 143, type: !829, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!834 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE5eraseEi", scope: !776, file: !698, line: 148, type: !835, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !787, !76}
!837 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE16allocation_errorEv", scope: !776, file: !698, line: 158, type: !823, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi1ELy1024EE28msan_annotate_is_initializedEv", scope: !776, file: !698, line: 162, type: !826, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DISubprogram(name: "~Printer", scope: !776, file: !698, line: 166, type: !826, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!840 = !{!841, !774}
!841 = !DITemplateValueParameter(name: "type", type: !76, value: i32 1)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !197, line: 28, baseType: !845)
!845 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!12, !13}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!12, !75}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!12, !75, !76}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!12, !75, !90, !76}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!12, !188, !76, !76}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!12, !864, !76}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!12, !868, !13, !76}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!12, !206}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!12}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!12, !206, !223}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!12, !432, !238}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!12, !432, !238, !13, !884, !260}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!12, !236}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!12, !891, !236, !276}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!12, !895, !198}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!12, !285}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!12, !285, !238, !198}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!12, !261, !285, !198}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!12, !285, !285, !198}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!12, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!12, !274, !13, !13, !13, !13, !13, !13, !13, !321, !260, !260}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!12, !868}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!12, !261, !76, !285}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!12, !321}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!926 = !{!0, !70, !77, !84, !183, !190, !199, !208, !213, !218, !224, !229, !240, !262, !267, !278, !286, !291, !296, !301, !306, !315, !323, !325, !327, !332, !337, !342, !345, !362, !364, !375, !385, !387, !446, !644, !456}
!927 = !{!928, !929, !930}
!928 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !646, entity: !3, file: !197, line: 225)
!929 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !646, entity: !3, file: !344, line: 125)
!930 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !646, entity: !2, file: !344, line: 126)
!931 = !{i32 7, !"Dwarf Version", i32 4}
!932 = !{i32 2, !"Debug Info Version", i32 3}
!933 = !{i32 1, !"wchar_size", i32 4}
!934 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!935 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !3, file: !936, line: 47, type: !937, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !953)
!936 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!937 = !DISubroutineType(types: !938)
!938 = !{null, !939, !76, !720, !720}
!939 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !936, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !942, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!942 = !{!943, !944, !945, !946, !950, !951, !952}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !941, file: !936, line: 35, baseType: !372, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !941, file: !936, line: 35, baseType: !372, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !941, file: !936, line: 37, baseType: !372, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !941, file: !936, line: 39, baseType: !947, size: 1024, offset: 192)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1024, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 16)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !941, file: !936, line: 41, baseType: !947, size: 1024, offset: 1216)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !941, file: !936, line: 42, baseType: !947, size: 1024, offset: 2240)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !941, file: !936, line: 44, baseType: !372, size: 64, offset: 3264)
!953 = !{!954, !955, !956, !957, !958, !961, !962}
!954 = !DILocalVariable(name: "copy", arg: 1, scope: !935, file: !936, line: 47, type: !939)
!955 = !DILocalVariable(name: "d", arg: 2, scope: !935, file: !936, line: 47, type: !76)
!956 = !DILocalVariable(name: "src_off", arg: 3, scope: !935, file: !936, line: 47, type: !720)
!957 = !DILocalVariable(name: "dst_off", arg: 4, scope: !935, file: !936, line: 47, type: !720)
!958 = !DILocalVariable(name: "from", scope: !959, file: !936, line: 54, type: !238)
!959 = distinct !DILexicalBlock(scope: !960, file: !936, line: 53, column: 18)
!960 = distinct !DILexicalBlock(scope: !935, file: !936, line: 53, column: 9)
!961 = !DILocalVariable(name: "to", scope: !959, file: !936, line: 55, type: !261)
!962 = !DILocalVariable(name: "i", scope: !963, file: !936, line: 58, type: !372)
!963 = distinct !DILexicalBlock(scope: !964, file: !936, line: 58, column: 9)
!964 = distinct !DILexicalBlock(scope: !960, file: !936, line: 57, column: 12)
!965 = !DILocation(line: 0, scope: !935)
!966 = !DILocation(line: 49, column: 14, scope: !935)
!967 = !DILocation(line: 49, column: 19, scope: !935)
!968 = !DILocation(line: 49, column: 22, scope: !935)
!969 = !{!970, !970, i64 0}
!970 = !{!"long long", !971, i64 0}
!971 = !{!"omnipotent char", !972, i64 0}
!972 = !{!"Simple C++ TBAA"}
!973 = !DILocation(line: 49, column: 37, scope: !935)
!974 = !DILocation(line: 49, column: 5, scope: !935)
!975 = !DILocation(line: 50, column: 10, scope: !976)
!976 = distinct !DILexicalBlock(scope: !935, file: !936, line: 49, column: 43)
!977 = distinct !{!977, !974, !978, !979}
!978 = !DILocation(line: 51, column: 5, scope: !935)
!979 = !{!"llvm.loop.mustprogress"}
!980 = !DILocation(line: 53, column: 11, scope: !960)
!981 = !DILocation(line: 53, column: 9, scope: !935)
!982 = !DILocation(line: 0, scope: !963)
!983 = !DILocation(line: 58, column: 34, scope: !984)
!984 = distinct !DILexicalBlock(scope: !963, file: !936, line: 58, column: 9)
!985 = !DILocation(line: 58, column: 32, scope: !984)
!986 = !DILocation(line: 58, column: 9, scope: !963)
!987 = !DILocation(line: 54, column: 42, scope: !959)
!988 = !{!989, !970, i64 0}
!989 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !970, i64 0, !970, i64 8, !970, i64 16, !971, i64 24, !971, i64 152, !971, i64 280, !970, i64 408}
!990 = !DILocation(line: 54, column: 46, scope: !959)
!991 = !DILocation(line: 54, column: 28, scope: !959)
!992 = !DILocation(line: 0, scope: !959)
!993 = !DILocation(line: 55, column: 34, scope: !959)
!994 = !{!989, !970, i64 8}
!995 = !DILocation(line: 55, column: 38, scope: !959)
!996 = !DILocation(line: 55, column: 20, scope: !959)
!997 = !DILocation(line: 56, column: 31, scope: !959)
!998 = !{!989, !970, i64 408}
!999 = !DILocation(line: 56, column: 9, scope: !959)
!1000 = !DILocation(line: 57, column: 5, scope: !959)
!1001 = !DILocation(line: 59, column: 13, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !984, file: !936, line: 58, column: 55)
!1003 = !DILocation(line: 60, column: 24, scope: !1002)
!1004 = !DILocation(line: 60, column: 21, scope: !1002)
!1005 = !DILocation(line: 61, column: 24, scope: !1002)
!1006 = !DILocation(line: 61, column: 21, scope: !1002)
!1007 = !DILocation(line: 58, column: 51, scope: !984)
!1008 = distinct !{!1008, !986, !1009, !979}
!1009 = !DILocation(line: 62, column: 9, scope: !963)
!1010 = !DILocation(line: 64, column: 1, scope: !935)
!1011 = !DISubprogram(name: "memcpy", scope: !197, file: !197, line: 94, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1014)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!261, !261, !238, !198}
!1014 = !{}
!1015 = distinct !DISubprogram(name: "copy_memory", linkageName: "_ZN6Halide7Runtime8Internal11copy_memoryERKNS1_11device_copyEPv", scope: !3, file: !936, line: 66, type: !1016, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1018)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !939, !261}
!1018 = !{!1019, !1020}
!1019 = !DILocalVariable(name: "copy", arg: 1, scope: !1015, file: !936, line: 66, type: !939)
!1020 = !DILocalVariable(name: "user_context", arg: 2, scope: !1015, file: !936, line: 66, type: !261)
!1021 = !DILocation(line: 0, scope: !1015)
!1022 = !DILocation(line: 68, column: 14, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1015, file: !936, line: 68, column: 9)
!1024 = !DILocation(line: 68, column: 26, scope: !1023)
!1025 = !DILocation(line: 68, column: 18, scope: !1023)
!1026 = !DILocation(line: 68, column: 9, scope: !1015)
!1027 = !DILocation(line: 69, column: 58, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !936, line: 68, column: 31)
!1029 = !{!989, !970, i64 16}
!1030 = !DILocation(line: 69, column: 9, scope: !1028)
!1031 = !DILocation(line: 70, column: 5, scope: !1028)
!1032 = !DILocalVariable(name: "this", arg: 1, scope: !1033, type: !1037, flags: DIFlagArtificial | DIFlagObjectPointer)
!1033 = distinct !DISubprogram(name: "Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EEC2EPvPc", scope: !700, file: !698, line: 37, type: !710, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !709, retainedNodes: !1034)
!1034 = !{!1032, !1035, !1036}
!1035 = !DILocalVariable(name: "ctx", arg: 2, scope: !1033, file: !698, line: 37, type: !261)
!1036 = !DILocalVariable(name: "mem", arg: 3, scope: !1033, file: !698, line: 37, type: !188)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!1038 = !DILocation(line: 0, scope: !1033, inlinedAt: !1039)
!1039 = distinct !DILocation(line: 71, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1023, file: !936, line: 70, column: 12)
!1041 = !DILocation(line: 44, column: 27, scope: !1042, inlinedAt: !1039)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !698, line: 43, column: 16)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !698, line: 41, column: 20)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !698, line: 39, column: 13)
!1045 = distinct !DILexicalBlock(scope: !1033, file: !698, line: 38, column: 54)
!1046 = !DILocation(line: 48, column: 13, scope: !1047, inlinedAt: !1039)
!1047 = distinct !DILexicalBlock(scope: !1045, file: !698, line: 48, column: 13)
!1048 = !DILocation(line: 48, column: 13, scope: !1045, inlinedAt: !1039)
!1049 = !DILocalVariable(name: "this", arg: 1, scope: !1050, type: !1037, flags: DIFlagArtificial | DIFlagObjectPointer)
!1050 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !700, file: !698, line: 57, type: !714, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !713, retainedNodes: !1051)
!1051 = !{!1049, !1052}
!1052 = !DILocalVariable(name: "arg", arg: 2, scope: !1050, file: !698, line: 57, type: !276)
!1053 = !DILocation(line: 0, scope: !1050, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 71, column: 29, scope: !1040)
!1055 = !DILocation(line: 62, column: 19, scope: !1056, inlinedAt: !1054)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !698, line: 61, column: 16)
!1057 = distinct !DILexicalBlock(scope: !1050, file: !698, line: 59, column: 13)
!1058 = !DILocalVariable(name: "this", arg: 1, scope: !1059, type: !1037, flags: DIFlagArtificial | DIFlagObjectPointer)
!1059 = distinct !DISubprogram(name: "~Printer", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EED2Ev", scope: !700, file: !698, line: 166, type: !758, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !771, retainedNodes: !1060)
!1060 = !{!1058}
!1061 = !DILocation(line: 0, scope: !1059, inlinedAt: !1062)
!1062 = distinct !DILocation(line: 71, column: 9, scope: !1040)
!1063 = !DILocation(line: 168, column: 13, scope: !1064, inlinedAt: !1062)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !698, line: 167, column: 19)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !698, line: 167, column: 13)
!1066 = distinct !DILexicalBlock(scope: !1059, file: !698, line: 166, column: 16)
!1067 = !DILocation(line: 169, column: 9, scope: !1064, inlinedAt: !1062)
!1068 = !DILocation(line: 49, column: 23, scope: !1069, inlinedAt: !1039)
!1069 = distinct !DILexicalBlock(scope: !1047, file: !698, line: 48, column: 18)
!1070 = !DILocation(line: 50, column: 18, scope: !1069, inlinedAt: !1039)
!1071 = !{!971, !971, i64 0}
!1072 = !DILocalVariable(name: "this", arg: 1, scope: !1073, type: !1037, flags: DIFlagArtificial | DIFlagObjectPointer)
!1073 = distinct !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !700, file: !698, line: 162, type: !758, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !770, retainedNodes: !1074)
!1074 = !{!1072}
!1075 = !DILocation(line: 0, scope: !1073, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 170, column: 13, scope: !1077, inlinedAt: !1062)
!1077 = distinct !DILexicalBlock(scope: !1065, file: !698, line: 169, column: 16)
!1078 = !DILocation(line: 163, column: 81, scope: !1073, inlinedAt: !1076)
!1079 = !DILocation(line: 163, column: 87, scope: !1073, inlinedAt: !1076)
!1080 = !DILocation(line: 163, column: 15, scope: !1073, inlinedAt: !1076)
!1081 = !DILocation(line: 174, column: 17, scope: !1082, inlinedAt: !1062)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !698, line: 173, column: 46)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !698, line: 173, column: 24)
!1084 = distinct !DILexicalBlock(scope: !1077, file: !698, line: 171, column: 17)
!1085 = !DILocation(line: 181, column: 13, scope: !1086, inlinedAt: !1062)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !698, line: 180, column: 40)
!1087 = distinct !DILexicalBlock(scope: !1066, file: !698, line: 180, column: 13)
!1088 = !DILocation(line: 73, column: 1, scope: !1015)
!1089 = distinct !DISubprogram(name: "make_buffer_copy", linkageName: "_ZN6Halide7Runtime8Internal16make_buffer_copyEPK15halide_buffer_tbS4_b", scope: !3, file: !936, line: 76, type: !1090, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1093)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!941, !1092, !424, !1092, !424}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1101, !1103, !1106, !1109, !1111, !1114, !1115, !1116, !1118}
!1094 = !DILocalVariable(name: "src", arg: 1, scope: !1089, file: !936, line: 76, type: !1092)
!1095 = !DILocalVariable(name: "src_host", arg: 2, scope: !1089, file: !936, line: 76, type: !424)
!1096 = !DILocalVariable(name: "dst", arg: 3, scope: !1089, file: !936, line: 77, type: !1092)
!1097 = !DILocalVariable(name: "dst_host", arg: 4, scope: !1089, file: !936, line: 77, type: !424)
!1098 = !DILocalVariable(name: "c", scope: !1089, file: !936, line: 79, type: !941)
!1099 = !DILocalVariable(name: "i", scope: !1100, file: !936, line: 83, type: !76)
!1100 = distinct !DILexicalBlock(scope: !1089, file: !936, line: 83, column: 5)
!1101 = !DILocalVariable(name: "i", scope: !1102, file: !936, line: 91, type: !76)
!1102 = distinct !DILexicalBlock(scope: !1089, file: !936, line: 91, column: 5)
!1103 = !DILocalVariable(name: "zero", scope: !1104, file: !936, line: 100, type: !941)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !936, line: 98, column: 42)
!1105 = distinct !DILexicalBlock(scope: !1089, file: !936, line: 96, column: 9)
!1106 = !DILocalVariable(name: "zero", scope: !1107, file: !936, line: 107, type: !941)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !936, line: 104, column: 28)
!1108 = distinct !DILexicalBlock(scope: !1089, file: !936, line: 104, column: 9)
!1109 = !DILocalVariable(name: "i", scope: !1110, file: !936, line: 115, type: !76)
!1110 = distinct !DILexicalBlock(scope: !1089, file: !936, line: 115, column: 5)
!1111 = !DILocalVariable(name: "dst_stride_bytes", scope: !1112, file: !936, line: 117, type: !372)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !936, line: 115, column: 47)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !936, line: 115, column: 5)
!1114 = !DILocalVariable(name: "src_stride_bytes", scope: !1112, file: !936, line: 118, type: !372)
!1115 = !DILocalVariable(name: "insert", scope: !1112, file: !936, line: 120, type: !76)
!1116 = !DILocalVariable(name: "j", scope: !1117, file: !936, line: 128, type: !76)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !936, line: 128, column: 9)
!1118 = !DILocalVariable(name: "j", scope: !1119, file: !936, line: 151, type: !76)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !936, line: 151, column: 9)
!1120 = distinct !DILexicalBlock(scope: !1089, file: !936, line: 145, column: 51)
!1121 = !DILocation(line: 0, scope: !1089)
!1122 = !DILocation(line: 79, column: 5, scope: !1089)
!1123 = !DILocation(line: 79, column: 17, scope: !1089)
!1124 = !DILocation(line: 80, column: 13, scope: !1089)
!1125 = !DILocation(line: 80, column: 39, scope: !1089)
!1126 = !{!1127, !1128, i64 16}
!1127 = !{!"_ZTS15halide_buffer_t", !970, i64 0, !1128, i64 8, !1128, i64 16, !970, i64 24, !1129, i64 32, !1132, i64 36, !1128, i64 40, !1128, i64 48}
!1128 = !{!"any pointer", !971, i64 0}
!1129 = !{!"_ZTS13halide_type_t", !1130, i64 0, !971, i64 1, !1131, i64 2}
!1130 = !{!"_ZTS18halide_type_code_t", !971, i64 0}
!1131 = !{!"short", !971, i64 0}
!1132 = !{!"int", !971, i64 0}
!1133 = !DILocation(line: 80, column: 24, scope: !1089)
!1134 = !DILocation(line: 80, column: 51, scope: !1089)
!1135 = !{!1127, !970, i64 0}
!1136 = !DILocation(line: 80, column: 7, scope: !1089)
!1137 = !DILocation(line: 80, column: 11, scope: !1089)
!1138 = !DILocation(line: 81, column: 13, scope: !1089)
!1139 = !DILocation(line: 81, column: 39, scope: !1089)
!1140 = !DILocation(line: 81, column: 24, scope: !1089)
!1141 = !DILocation(line: 81, column: 51, scope: !1089)
!1142 = !DILocation(line: 81, column: 7, scope: !1089)
!1143 = !DILocation(line: 81, column: 11, scope: !1089)
!1144 = !DILocalVariable(name: "this", arg: 1, scope: !1145, type: !1147, flags: DIFlagArtificial | DIFlagObjectPointer)
!1145 = distinct !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !477, file: !367, line: 481, type: !511, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !510, retainedNodes: !1146)
!1146 = !{!1144}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!1148 = !DILocation(line: 0, scope: !1145, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 82, column: 30, scope: !1089)
!1150 = !DILocation(line: 482, column: 17, scope: !1145, inlinedAt: !1149)
!1151 = !{!1129, !971, i64 1}
!1152 = !DILocation(line: 482, column: 22, scope: !1145, inlinedAt: !1149)
!1153 = !DILocation(line: 482, column: 27, scope: !1145, inlinedAt: !1149)
!1154 = !DILocation(line: 82, column: 20, scope: !1089)
!1155 = !DILocation(line: 82, column: 7, scope: !1089)
!1156 = !DILocation(line: 82, column: 18, scope: !1089)
!1157 = !DILocation(line: 0, scope: !1100)
!1158 = !DILocation(line: 84, column: 9, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !936, line: 83, column: 45)
!1160 = distinct !DILexicalBlock(scope: !1100, file: !936, line: 83, column: 5)
!1161 = !DILocation(line: 84, column: 21, scope: !1159)
!1162 = !DILocation(line: 85, column: 9, scope: !1159)
!1163 = !DILocation(line: 85, column: 31, scope: !1159)
!1164 = !DILocation(line: 86, column: 9, scope: !1159)
!1165 = !DILocation(line: 86, column: 31, scope: !1159)
!1166 = !DILocation(line: 90, column: 7, scope: !1089)
!1167 = !DILocation(line: 0, scope: !1102)
!1168 = !DILocation(line: 91, column: 30, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1102, file: !936, line: 91, column: 5)
!1170 = !{!1127, !1132, i64 36}
!1171 = !DILocation(line: 91, column: 23, scope: !1169)
!1172 = !DILocation(line: 91, column: 5, scope: !1102)
!1173 = !{!1127, !1128, i64 40}
!1174 = !DILocation(line: 94, column: 17, scope: !1089)
!1175 = !DILocation(line: 94, column: 22, scope: !1089)
!1176 = !DILocation(line: 96, column: 33, scope: !1105)
!1177 = !DILocation(line: 96, column: 25, scope: !1105)
!1178 = !DILocation(line: 96, column: 44, scope: !1105)
!1179 = !DILocation(line: 92, column: 46, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1169, file: !936, line: 91, column: 47)
!1181 = !{!1182, !1132, i64 8}
!1182 = !{!"_ZTS18halide_dimension_t", !1132, i64 0, !1132, i64 4, !1132, i64 8, !1132, i64 12}
!1183 = !DILocation(line: 92, column: 34, scope: !1180)
!1184 = !DILocation(line: 92, column: 68, scope: !1180)
!1185 = !{!1182, !1132, i64 0}
!1186 = !DILocation(line: 92, column: 86, scope: !1180)
!1187 = !DILocation(line: 92, column: 72, scope: !1180)
!1188 = !DILocation(line: 92, column: 55, scope: !1180)
!1189 = !DILocation(line: 92, column: 53, scope: !1180)
!1190 = !DILocation(line: 92, column: 21, scope: !1180)
!1191 = !DILocation(line: 91, column: 43, scope: !1169)
!1192 = distinct !{!1192, !1172, !1193, !979}
!1193 = !DILocation(line: 93, column: 5, scope: !1102)
!1194 = !DILocation(line: 0, scope: !1145, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 97, column: 19, scope: !1105)
!1196 = !DILocation(line: 0, scope: !1145, inlinedAt: !1197)
!1197 = distinct !DILocation(line: 97, column: 40, scope: !1105)
!1198 = !DILocation(line: 482, column: 17, scope: !1145, inlinedAt: !1197)
!1199 = !DILocation(line: 482, column: 22, scope: !1145, inlinedAt: !1197)
!1200 = !DILocation(line: 482, column: 27, scope: !1145, inlinedAt: !1197)
!1201 = !DILocation(line: 97, column: 27, scope: !1105)
!1202 = !DILocation(line: 97, column: 48, scope: !1105)
!1203 = !DILocation(line: 100, column: 21, scope: !1104)
!1204 = !DILocation(line: 101, column: 9, scope: !1104)
!1205 = !DILocation(line: 104, column: 22, scope: !1108)
!1206 = !DILocation(line: 104, column: 9, scope: !1089)
!1207 = !DILocation(line: 0, scope: !1110)
!1208 = !DILocation(line: 115, column: 5, scope: !1110)
!1209 = !DILocation(line: 115, column: 23, scope: !1113)
!1210 = !DILocation(line: 107, column: 21, scope: !1107)
!1211 = !DILocation(line: 108, column: 9, scope: !1107)
!1212 = !DILocation(line: 144, column: 14, scope: !1089)
!1213 = !DILocation(line: 144, column: 28, scope: !1089)
!1214 = !DILocation(line: 144, column: 25, scope: !1089)
!1215 = !DILocation(line: 144, column: 50, scope: !1089)
!1216 = !DILocation(line: 145, column: 28, scope: !1089)
!1217 = !DILocation(line: 117, column: 59, scope: !1112)
!1218 = !DILocation(line: 117, column: 47, scope: !1112)
!1219 = !DILocation(line: 0, scope: !1145, inlinedAt: !1220)
!1220 = distinct !DILocation(line: 117, column: 78, scope: !1112)
!1221 = !DILocation(line: 117, column: 66, scope: !1112)
!1222 = !DILocation(line: 0, scope: !1112)
!1223 = !DILocation(line: 118, column: 59, scope: !1112)
!1224 = !DILocation(line: 118, column: 47, scope: !1112)
!1225 = !DILocation(line: 0, scope: !1145, inlinedAt: !1226)
!1226 = distinct !DILocation(line: 118, column: 78, scope: !1112)
!1227 = !DILocation(line: 118, column: 66, scope: !1112)
!1228 = !DILocation(line: 121, column: 33, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1230, file: !936, line: 121, column: 9)
!1230 = distinct !DILexicalBlock(scope: !1112, file: !936, line: 121, column: 9)
!1231 = !DILocation(line: 121, column: 9, scope: !1230)
!1232 = !DILocation(line: 128, column: 27, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1117, file: !936, line: 128, column: 9)
!1234 = !DILocation(line: 124, column: 36, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !936, line: 124, column: 17)
!1236 = distinct !DILexicalBlock(scope: !1229, file: !936, line: 121, column: 48)
!1237 = !DILocation(line: 124, column: 34, scope: !1235)
!1238 = !DILocation(line: 124, column: 63, scope: !1235)
!1239 = !DILocation(line: 121, column: 44, scope: !1229)
!1240 = distinct !{!1240, !1231, !1241, !979}
!1241 = !DILocation(line: 127, column: 9, scope: !1230)
!1242 = !DILocation(line: 0, scope: !1230)
!1243 = !DILocation(line: 0, scope: !1117)
!1244 = !DILocation(line: 128, column: 9, scope: !1117)
!1245 = !DILocation(line: 133, column: 40, scope: !1112)
!1246 = !{!1182, !1132, i64 4}
!1247 = !DILocation(line: 133, column: 28, scope: !1112)
!1248 = !DILocation(line: 133, column: 9, scope: !1112)
!1249 = !DILocation(line: 133, column: 26, scope: !1112)
!1250 = !DILocation(line: 135, column: 9, scope: !1112)
!1251 = !DILocation(line: 135, column: 36, scope: !1112)
!1252 = !DILocation(line: 136, column: 9, scope: !1112)
!1253 = !DILocation(line: 136, column: 36, scope: !1112)
!1254 = !DILocation(line: 115, column: 43, scope: !1113)
!1255 = distinct !{!1255, !1208, !1256, !979}
!1256 = !DILocation(line: 137, column: 5, scope: !1110)
!1257 = !DILocation(line: 129, column: 38, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1233, file: !936, line: 128, column: 42)
!1259 = !DILocation(line: 129, column: 27, scope: !1258)
!1260 = !DILocation(line: 129, column: 13, scope: !1258)
!1261 = !DILocation(line: 129, column: 25, scope: !1258)
!1262 = !DILocation(line: 130, column: 37, scope: !1258)
!1263 = !DILocation(line: 130, column: 13, scope: !1258)
!1264 = !DILocation(line: 130, column: 35, scope: !1258)
!1265 = !DILocation(line: 131, column: 37, scope: !1258)
!1266 = !DILocation(line: 131, column: 13, scope: !1258)
!1267 = !DILocation(line: 131, column: 35, scope: !1258)
!1268 = distinct !{!1268, !1244, !1269, !979}
!1269 = !DILocation(line: 132, column: 9, scope: !1117)
!1270 = !DILocation(line: 145, column: 25, scope: !1089)
!1271 = !DILocation(line: 144, column: 5, scope: !1089)
!1272 = !DILocation(line: 147, column: 25, scope: !1120)
!1273 = !DILocation(line: 147, column: 22, scope: !1120)
!1274 = !DILocation(line: 0, scope: !1119)
!1275 = !DILocation(line: 152, column: 31, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1277, file: !936, line: 151, column: 49)
!1277 = distinct !DILexicalBlock(scope: !1119, file: !936, line: 151, column: 9)
!1278 = !DILocation(line: 152, column: 29, scope: !1276)
!1279 = !DILocation(line: 153, column: 41, scope: !1276)
!1280 = !DILocation(line: 153, column: 39, scope: !1276)
!1281 = !DILocation(line: 154, column: 41, scope: !1276)
!1282 = !DILocation(line: 154, column: 39, scope: !1276)
!1283 = !DILocation(line: 156, column: 37, scope: !1120)
!1284 = !DILocation(line: 157, column: 47, scope: !1120)
!1285 = !DILocation(line: 158, column: 47, scope: !1120)
!1286 = distinct !{!1286, !1271, !1287, !979}
!1287 = !DILocation(line: 159, column: 5, scope: !1089)
!1288 = !DILocation(line: 160, column: 12, scope: !1089)
!1289 = !{i64 0, i64 8, !969, i64 8, i64 8, !969, i64 16, i64 8, !969, i64 24, i64 128, !1071, i64 152, i64 128, !1071, i64 280, i64 128, !1071, i64 408, i64 8, !969}
!1290 = !DILocation(line: 160, column: 5, scope: !1089)
!1291 = !DILocation(line: 161, column: 1, scope: !1089)
!1292 = distinct !DISubprogram(name: "make_host_to_device_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_host_to_device_copyEPK15halide_buffer_t", scope: !3, file: !936, line: 163, type: !1293, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1295)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!941, !1092}
!1295 = !{!1296}
!1296 = !DILocalVariable(name: "buf", arg: 1, scope: !1292, file: !936, line: 163, type: !1092)
!1297 = !DILocation(line: 0, scope: !1292)
!1298 = !DILocation(line: 164, column: 12, scope: !1292)
!1299 = !DILocation(line: 164, column: 5, scope: !1292)
!1300 = distinct !DISubprogram(name: "make_device_to_host_copy", linkageName: "_ZN6Halide7Runtime8Internal24make_device_to_host_copyEPK15halide_buffer_t", scope: !3, file: !936, line: 167, type: !1293, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1301)
!1301 = !{!1302}
!1302 = !DILocalVariable(name: "buf", arg: 1, scope: !1300, file: !936, line: 167, type: !1092)
!1303 = !DILocation(line: 0, scope: !1300)
!1304 = !DILocation(line: 168, column: 12, scope: !1300)
!1305 = !DILocation(line: 168, column: 5, scope: !1300)
!1306 = distinct !DISubprogram(name: "halide_cuda_get_symbol", scope: !344, file: !344, line: 34, type: !1307, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1309)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!261, !261, !276}
!1309 = !{!1310, !1311, !1312, !1313, !1317}
!1310 = !DILocalVariable(name: "user_context", arg: 1, scope: !1306, file: !344, line: 34, type: !261)
!1311 = !DILocalVariable(name: "name", arg: 2, scope: !1306, file: !344, line: 34, type: !276)
!1312 = !DILocalVariable(name: "symbol", scope: !1306, file: !344, line: 38, type: !261)
!1313 = !DILocalVariable(name: "lib_names", scope: !1306, file: !344, line: 43, type: !1314)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 192, elements: !1315)
!1315 = !{!1316}
!1316 = !DISubrange(count: 3)
!1317 = !DILocalVariable(name: "i", scope: !1318, file: !344, line: 52, type: !196)
!1318 = distinct !DILexicalBlock(scope: !1306, file: !344, line: 52, column: 5)
!1319 = !DILocation(line: 0, scope: !1306)
!1320 = !DILocation(line: 38, column: 46, scope: !1306)
!1321 = !{!1128, !1128, i64 0}
!1322 = !DILocation(line: 38, column: 20, scope: !1306)
!1323 = !DILocation(line: 39, column: 9, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1306, file: !344, line: 39, column: 9)
!1325 = !DILocation(line: 39, column: 9, scope: !1306)
!1326 = !DILocation(line: 0, scope: !1318)
!1327 = !DILocation(line: 53, column: 20, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1329, file: !344, line: 52, column: 75)
!1329 = distinct !DILexicalBlock(scope: !1318, file: !344, line: 52, column: 5)
!1330 = !DILocation(line: 53, column: 18, scope: !1328)
!1331 = !DILocation(line: 54, column: 13, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1328, file: !344, line: 54, column: 13)
!1333 = !DILocation(line: 54, column: 13, scope: !1328)
!1334 = !DILocation(line: 53, column: 40, scope: !1328)
!1335 = !DILocation(line: 0, scope: !1033, inlinedAt: !1336)
!1336 = distinct !DILocation(line: 55, column: 13, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1332, file: !344, line: 54, column: 23)
!1338 = !DILocation(line: 44, column: 27, scope: !1042, inlinedAt: !1336)
!1339 = !DILocation(line: 48, column: 13, scope: !1047, inlinedAt: !1336)
!1340 = !DILocation(line: 48, column: 13, scope: !1045, inlinedAt: !1336)
!1341 = !DILocation(line: 49, column: 23, scope: !1069, inlinedAt: !1336)
!1342 = !DILocation(line: 50, column: 18, scope: !1069, inlinedAt: !1336)
!1343 = !DILocation(line: 51, column: 9, scope: !1069, inlinedAt: !1336)
!1344 = !DILocation(line: 0, scope: !1047, inlinedAt: !1336)
!1345 = !DILocation(line: 0, scope: !1050, inlinedAt: !1346)
!1346 = distinct !DILocation(line: 55, column: 33, scope: !1337)
!1347 = !DILocation(line: 62, column: 19, scope: !1056, inlinedAt: !1346)
!1348 = !DILocation(line: 0, scope: !1050, inlinedAt: !1349)
!1349 = distinct !DILocation(line: 55, column: 72, scope: !1337)
!1350 = !DILocation(line: 62, column: 19, scope: !1056, inlinedAt: !1349)
!1351 = !DILocation(line: 0, scope: !1050, inlinedAt: !1352)
!1352 = distinct !DILocation(line: 55, column: 88, scope: !1337)
!1353 = !DILocation(line: 62, column: 19, scope: !1056, inlinedAt: !1352)
!1354 = !DILocation(line: 0, scope: !1059, inlinedAt: !1355)
!1355 = distinct !DILocation(line: 55, column: 13, scope: !1337)
!1356 = !DILocation(line: 167, column: 13, scope: !1066, inlinedAt: !1355)
!1357 = !DILocation(line: 168, column: 13, scope: !1064, inlinedAt: !1355)
!1358 = !DILocation(line: 169, column: 9, scope: !1064, inlinedAt: !1355)
!1359 = !DILocation(line: 0, scope: !1073, inlinedAt: !1360)
!1360 = distinct !DILocation(line: 170, column: 13, scope: !1077, inlinedAt: !1355)
!1361 = !DILocation(line: 163, column: 81, scope: !1073, inlinedAt: !1360)
!1362 = !DILocation(line: 163, column: 87, scope: !1073, inlinedAt: !1360)
!1363 = !DILocation(line: 163, column: 15, scope: !1073, inlinedAt: !1360)
!1364 = !DILocation(line: 174, column: 17, scope: !1082, inlinedAt: !1355)
!1365 = !DILocation(line: 181, column: 13, scope: !1086, inlinedAt: !1355)
!1366 = !DILocation(line: 60, column: 38, scope: !1306)
!1367 = !DILocation(line: 56, column: 13, scope: !1337)
!1368 = !DILocation(line: 60, column: 12, scope: !1306)
!1369 = !DILocation(line: 61, column: 1, scope: !1306)
!1370 = !DISubprogram(name: "halide_get_library_symbol", scope: !367, file: !367, line: 377, type: !1307, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1014)
!1371 = !DISubprogram(name: "halide_load_library", scope: !367, file: !367, line: 376, type: !1372, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1014)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!261, !276}
!1374 = distinct !DISubprogram(name: "load_libcuda", linkageName: "_ZN6Halide7Runtime8Internal4Cuda12load_libcudaEPv", scope: !2, file: !344, line: 73, type: !1375, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, retainedNodes: !1377)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{null, !261}
!1377 = !{!1378}
!1378 = !DILocalVariable(name: "user_context", arg: 1, scope: !1374, file: !344, line: 73, type: !261)
!1379 = !DILocation(line: 0, scope: !1374)
!1380 = !DILocation(line: 0, scope: !1033, inlinedAt: !1381)
!1381 = distinct !DILocation(line: 74, column: 5, scope: !1374)
!1382 = !DILocation(line: 44, column: 27, scope: !1042, inlinedAt: !1381)
!1383 = !DILocation(line: 48, column: 13, scope: !1047, inlinedAt: !1381)
!1384 = !DILocation(line: 48, column: 13, scope: !1045, inlinedAt: !1381)
!1385 = !DILocation(line: 49, column: 23, scope: !1069, inlinedAt: !1381)
!1386 = !DILocation(line: 50, column: 18, scope: !1069, inlinedAt: !1381)
!1387 = !DILocation(line: 51, column: 9, scope: !1069, inlinedAt: !1381)
!1388 = !DILocation(line: 0, scope: !1047, inlinedAt: !1381)
!1389 = !DILocation(line: 0, scope: !1050, inlinedAt: !1390)
!1390 = distinct !DILocation(line: 74, column: 25, scope: !1374)
!1391 = !DILocation(line: 62, column: 19, scope: !1056, inlinedAt: !1390)
!1392 = !DILocalVariable(name: "this", arg: 1, scope: !1393, type: !1037, flags: DIFlagArtificial | DIFlagObjectPointer)
!1393 = distinct !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !700, file: !698, line: 97, type: !739, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !646, declaration: !738, retainedNodes: !1394)
!1394 = !{!1392, !1395}
!1395 = !DILocalVariable(name: "arg", arg: 2, scope: !1393, file: !698, line: 97, type: !238)
!1396 = !DILocation(line: 0, scope: !1393, inlinedAt: !1397)
!1397 = distinct !DILocation(line: 74, column: 63, scope: !1374)
!1398 = !DILocation(line: 98, column: 15, scope: !1393, inlinedAt: !1397)
!1399 = !DILocation(line: 0, scope: !1050, inlinedAt: !1400)
!1400 = distinct !DILocation(line: 74, column: 79, scope: !1374)
!1401 = !DILocation(line: 62, column: 19, scope: !1056, inlinedAt: !1400)
!1402 = !DILocation(line: 0, scope: !1059, inlinedAt: !1403)
!1403 = distinct !DILocation(line: 74, column: 5, scope: !1374)
!1404 = !DILocation(line: 167, column: 13, scope: !1066, inlinedAt: !1403)
!1405 = !DILocation(line: 168, column: 13, scope: !1064, inlinedAt: !1403)
!1406 = !DILocation(line: 169, column: 9, scope: !1064, inlinedAt: !1403)
!1407 = !DILocation(line: 0, scope: !1073, inlinedAt: !1408)
!1408 = distinct !DILocation(line: 170, column: 13, scope: !1077, inlinedAt: !1403)
!1409 = !DILocation(line: 163, column: 81, scope: !1073, inlinedAt: !1408)
!1410 = !DILocation(line: 163, column: 87, scope: !1073, inlinedAt: !1408)
!1411 = !DILocation(line: 163, column: 15, scope: !1073, inlinedAt: !1408)
!1412 = !DILocation(line: 174, column: 17, scope: !1082, inlinedAt: !1403)
!1413 = !DILocation(line: 181, column: 13, scope: !1086, inlinedAt: !1403)
!1414 = !DILocation(line: 75, column: 5, scope: !1415)
!1415 = distinct !DILexicalBlock(scope: !1416, file: !344, line: 75, column: 5)
!1416 = distinct !DILexicalBlock(scope: !1374, file: !344, line: 75, column: 5)
!1417 = !DILocation(line: 75, column: 5, scope: !1416)
!1418 = !DILocation(line: 75, column: 5, scope: !1419)
!1419 = distinct !DILexicalBlock(scope: !1415, file: !344, line: 75, column: 5)
!1420 = !DILocalVariable(name: "user_context", arg: 1, scope: !1421, file: !344, line: 64, type: !261)
!1421 = distinct !DISubprogram(name: "get_cuda_symbol<Halide::Runtime::Internal::Cuda::CUresult (*)(unsigned int)>", linkageName: "_ZN6Halide7Runtime8Internal4Cuda15get_cuda_symbolIPFNS2_8CUresultEjEEET_PvPKcb", scope: !2, file: !344, line: 64, type: !1422, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !646, templateParams: !1428, retainedNodes: !1424)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!846, !261, !276, !424}
!1424 = !{!1420, !1425, !1426, !1427}
!1425 = !DILocalVariable(name: "name", arg: 2, scope: !1421, file: !344, line: 64, type: !276)
!1426 = !DILocalVariable(name: "optional", arg: 3, scope: !1421, file: !344, line: 64, type: !424)
!1427 = !DILocalVariable(name: "s", scope: !1421, file: !344, line: 65, type: !846)
!1428 = !{!1429}
!1429 = !DITemplateTypeParameter(name: "T", type: !846)
!1430 = !DILocation(line: 0, scope: !1421, inlinedAt: !1431)
!1431 = distinct !DILocation(line: 19, column: 1, scope: !1432)
!1432 = !DILexicalBlockFile(scope: !1374, file: !6, discriminator: 0)
!1433 = !DILocation(line: 65, column: 14, scope: !1421, inlinedAt: !1431)
!1434 = !DILocation(line: 66, column: 19, scope: !1435, inlinedAt: !1431)
!1435 = distinct !DILexicalBlock(scope: !1421, file: !344, line: 66, column: 9)
!1436 = !DILocalVariable(name: "this", arg: 1, scope: !1437, type: !1441, flags: DIFlagArtificial | DIFlagObjectPointer)
