; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp"
target datalayout = "e-p:32:32-i64:64"
target triple = "le32-unknown-nacl-unknown"

%struct.halide_profiler_state = type { %struct.halide_mutex, i32, i32, i32, i32, %struct.halide_profiler_pipeline_stats*, void (i32*, i32*)*, %struct.halide_thread* }
%struct.halide_mutex = type { [1 x i32] }
%struct.halide_profiler_pipeline_stats = type { i64, i64, i64, i64, i64, i64, i8*, %struct.halide_profiler_func_stats*, i8*, i32, i32, i32, i32, i32 }
%struct.halide_profiler_func_stats = type { i64, i64, i64, i64, i64, i64, i64, i8*, i32 }
%struct.halide_thread = type opaque
%"struct.Halide::Runtime::Internal::ScopedMutexLock" = type { %struct.halide_mutex* }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [2 x i8] }>

@_ZZ25halide_profiler_get_stateE1s = internal global %struct.halide_profiler_state { %struct.halide_mutex zeroinitializer, i32 1, i32 0, i32 0, i32 0, %struct.halide_profiler_pipeline_stats* null, void (i32*, i32*)* null, %struct.halide_thread* null }, align 4, !dbg !0
@.str = private unnamed_addr constant [114 x i8] c"/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp:207 Assert failed: p_stats != nullptr\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "s", scope: !2, file: !3, line: 12, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "halide_profiler_get_state", scope: !3, file: !3, line: 11, type: !4, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !94)
!3 = !DIFile(filename: "src/runtime/profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_state", file: !8, line: 1766, size: 256, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS21halide_profiler_state")
!8 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!9 = !{!10, !21, !23, !24, !25, !26, !62, !67}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !7, file: !8, line: 1770, baseType: !11, size: 32)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !8, line: 120, size: 32, flags: DIFlagTypePassByValue, elements: !12, identifier: "_ZTS12halide_mutex")
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !11, file: !8, line: 121, baseType: !14, size: 32)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, elements: !19)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 68, baseType: !17)
!16 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 12, baseType: !18)
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20}
!20 = !DISubrange(count: 1)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_time", scope: !7, file: !8, line: 1774, baseType: !22, size: 32, offset: 32)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "first_free_id", scope: !7, file: !8, line: 1777, baseType: !22, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "current_func", scope: !7, file: !8, line: 1781, baseType: !22, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads", scope: !7, file: !8, line: 1784, baseType: !22, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pipelines", scope: !7, file: !8, line: 1787, baseType: !27, size: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_pipeline_stats", file: !8, line: 1721, size: 640, flags: DIFlagTypePassByValue, elements: !29, identifier: "_ZTS30halide_profiler_pipeline_stats")
!29 = !{!30, !33, !34, !35, !36, !37, !38, !42, !55, !57, !58, !59, !60, !61}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !28, file: !8, line: 1723, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 10, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !28, file: !8, line: 1726, baseType: !31, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !28, file: !8, line: 1729, baseType: !31, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !28, file: !8, line: 1732, baseType: !31, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !28, file: !8, line: 1736, baseType: !31, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !28, file: !8, line: 1736, baseType: !31, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !8, line: 1739, baseType: !39, size: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !28, file: !8, line: 1742, baseType: !43, size: 32, offset: 416)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_profiler_func_stats", file: !8, line: 1693, size: 512, flags: DIFlagTypePassByValue, elements: !45, identifier: "_ZTS26halide_profiler_func_stats")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !44, file: !8, line: 1695, baseType: !31, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "memory_current", scope: !44, file: !8, line: 1698, baseType: !31, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "memory_peak", scope: !44, file: !8, line: 1701, baseType: !31, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "memory_total", scope: !44, file: !8, line: 1704, baseType: !31, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "stack_peak", scope: !44, file: !8, line: 1707, baseType: !31, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_numerator", scope: !44, file: !8, line: 1710, baseType: !31, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "active_threads_denominator", scope: !44, file: !8, line: 1710, baseType: !31, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !8, line: 1713, baseType: !39, size: 32, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !44, file: !8, line: 1716, baseType: !22, size: 32, offset: 480)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !8, line: 1746, baseType: !56, size: 32, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "num_funcs", scope: !28, file: !8, line: 1749, baseType: !22, size: 32, offset: 480)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "first_func_id", scope: !28, file: !8, line: 1752, baseType: !22, size: 32, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "runs", scope: !28, file: !8, line: 1755, baseType: !22, size: 32, offset: 544)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !28, file: !8, line: 1758, baseType: !22, size: 32, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "num_allocs", scope: !28, file: !8, line: 1761, baseType: !22, size: 32, offset: 608)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "get_remote_profiler_state", scope: !7, file: !8, line: 1792, baseType: !63, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_thread", scope: !7, file: !8, line: 1795, baseType: !68, size: 32, offset: 224)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_thread", file: !8, line: 312, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13halide_thread")
!70 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !71, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72, retainedTypes: !86, globals: !88, imports: !89, splitDebugInlining: false, nameTableKind: None)
!71 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/profiler.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!72 = !{!73, !77}
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 1799, baseType: !22, size: 32, elements: !74)
!74 = !{!75, !76}
!75 = !DIEnumerator(name: "halide_profiler_outside_of_halide", value: -1)
!76 = !DIEnumerator(name: "halide_profiler_please_stop", value: -2)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !8, line: 403, baseType: !78, size: 8, elements: !80, identifier: "_ZTS18halide_type_code_t")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 16, baseType: !79)
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!86 = !{!27, !43, !39, !6, !87, !31}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!88 = !{!0}
!89 = !{!90}
!90 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !70, entity: !91, file: !16, line: 225)
!91 = !DINamespace(name: "Internal", scope: !92)
!92 = !DINamespace(name: "Runtime", scope: !93)
!93 = !DINamespace(name: "Halide", scope: null)
!94 = !{}
!95 = !{i32 7, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 4}
!98 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!99 = !DILocation(line: 13, column: 5, scope: !2)
!100 = distinct !DISubprogram(name: "find_or_create_pipeline", linkageName: "_ZN6Halide7Runtime8Internal23find_or_create_pipelineEPKciPKy", scope: !91, file: !3, line: 21, type: !101, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !105)
!101 = !DISubroutineType(types: !102)
!102 = !{!27, !39, !22, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!105 = !{!106, !107, !108, !109, !110, !112, !113}
!106 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !100, file: !3, line: 21, type: !39)
!107 = !DILocalVariable(name: "num_funcs", arg: 2, scope: !100, file: !3, line: 21, type: !22)
!108 = !DILocalVariable(name: "func_names", arg: 3, scope: !100, file: !3, line: 21, type: !103)
!109 = !DILocalVariable(name: "s", scope: !100, file: !3, line: 22, type: !6)
!110 = !DILocalVariable(name: "p", scope: !111, file: !3, line: 24, type: !27)
!111 = distinct !DILexicalBlock(scope: !100, file: !3, line: 24, column: 5)
!112 = !DILocalVariable(name: "p", scope: !100, file: !3, line: 34, type: !27)
!113 = !DILocalVariable(name: "i", scope: !114, file: !3, line: 57, type: !22)
!114 = distinct !DILexicalBlock(scope: !100, file: !3, line: 57, column: 5)
!115 = !DILocation(line: 0, scope: !100)
!116 = !DILocation(line: 22, column: 32, scope: !100)
!117 = !DILocation(line: 24, column: 49, scope: !111)
!118 = !DILocation(line: 0, scope: !111)
!119 = !{!120, !120, i64 0}
!120 = !{!"any pointer", !121, i64 0}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C++ TBAA"}
!123 = !DILocation(line: 24, column: 60, scope: !124)
!124 = distinct !DILexicalBlock(scope: !111, file: !3, line: 24, column: 5)
!125 = !DILocation(line: 24, column: 5, scope: !111)
!126 = !DILocation(line: 28, column: 16, scope: !127)
!127 = distinct !DILexicalBlock(scope: !128, file: !3, line: 28, column: 13)
!128 = distinct !DILexicalBlock(scope: !124, file: !3, line: 25, column: 59)
!129 = !{!130, !120, i64 48}
!130 = !{!"_ZTS30halide_profiler_pipeline_stats", !131, i64 0, !131, i64 8, !131, i64 16, !131, i64 24, !131, i64 32, !131, i64 40, !120, i64 48, !120, i64 52, !120, i64 56, !132, i64 60, !132, i64 64, !132, i64 68, !132, i64 72, !132, i64 76}
!131 = !{!"long long", !121, i64 0}
!132 = !{!"int", !121, i64 0}
!133 = !DILocation(line: 28, column: 21, scope: !127)
!134 = !DILocation(line: 28, column: 38, scope: !127)
!135 = !DILocation(line: 29, column: 16, scope: !127)
!136 = !{!130, !132, i64 60}
!137 = !DILocation(line: 29, column: 26, scope: !127)
!138 = !DILocation(line: 28, column: 13, scope: !128)
!139 = !DILocation(line: 25, column: 52, scope: !124)
!140 = distinct !{!140, !125, !141, !142}
!141 = !DILocation(line: 32, column: 5, scope: !111)
!142 = !{!"llvm.loop.mustprogress"}
!143 = !DILocation(line: 35, column: 43, scope: !100)
!144 = !DILocation(line: 35, column: 9, scope: !100)
!145 = !DILocation(line: 36, column: 10, scope: !146)
!146 = distinct !DILexicalBlock(scope: !100, file: !3, line: 36, column: 9)
!147 = !DILocation(line: 36, column: 9, scope: !100)
!148 = !DILocation(line: 39, column: 18, scope: !100)
!149 = !{!150, !120, i64 20}
!150 = !{!"_ZTS21halide_profiler_state", !151, i64 0, !132, i64 4, !132, i64 8, !132, i64 12, !132, i64 16, !120, i64 20, !120, i64 24, !120, i64 28}
!151 = !{!"_ZTS12halide_mutex", !121, i64 0}
!152 = !DILocation(line: 39, column: 8, scope: !100)
!153 = !DILocation(line: 39, column: 13, scope: !100)
!154 = !{!130, !120, i64 56}
!155 = !DILocation(line: 40, column: 8, scope: !100)
!156 = !DILocation(line: 40, column: 13, scope: !100)
!157 = !DILocation(line: 41, column: 27, scope: !100)
!158 = !{!150, !132, i64 8}
!159 = !DILocation(line: 41, column: 8, scope: !100)
!160 = !DILocation(line: 41, column: 22, scope: !100)
!161 = !{!130, !132, i64 64}
!162 = !DILocation(line: 42, column: 8, scope: !100)
!163 = !DILocation(line: 42, column: 18, scope: !100)
!164 = !DILocation(line: 43, column: 8, scope: !100)
!165 = !DILocation(line: 43, column: 13, scope: !100)
!166 = !{!130, !132, i64 68}
!167 = !DILocation(line: 44, column: 8, scope: !100)
!168 = !DILocation(line: 44, column: 13, scope: !100)
!169 = !{!130, !131, i64 0}
!170 = !DILocation(line: 45, column: 8, scope: !100)
!171 = !DILocation(line: 45, column: 16, scope: !100)
!172 = !{!130, !132, i64 72}
!173 = !DILocation(line: 46, column: 8, scope: !100)
!174 = !DILocation(line: 46, column: 23, scope: !100)
!175 = !{!130, !131, i64 8}
!176 = !DILocation(line: 47, column: 8, scope: !100)
!177 = !DILocation(line: 47, column: 20, scope: !100)
!178 = !{!130, !131, i64 16}
!179 = !DILocation(line: 48, column: 8, scope: !100)
!180 = !DILocation(line: 48, column: 21, scope: !100)
!181 = !{!130, !131, i64 24}
!182 = !DILocation(line: 49, column: 8, scope: !100)
!183 = !DILocation(line: 49, column: 19, scope: !100)
!184 = !{!130, !132, i64 76}
!185 = !DILocation(line: 50, column: 8, scope: !100)
!186 = !DILocation(line: 50, column: 33, scope: !100)
!187 = !{!130, !131, i64 32}
!188 = !DILocation(line: 51, column: 8, scope: !100)
!189 = !DILocation(line: 51, column: 35, scope: !100)
!190 = !{!130, !131, i64 40}
!191 = !DILocation(line: 52, column: 63, scope: !100)
!192 = !DILocation(line: 52, column: 46, scope: !100)
!193 = !DILocation(line: 52, column: 8, scope: !100)
!194 = !DILocation(line: 52, column: 14, scope: !100)
!195 = !{!130, !120, i64 52}
!196 = !DILocation(line: 53, column: 10, scope: !197)
!197 = distinct !DILexicalBlock(scope: !100, file: !3, line: 53, column: 9)
!198 = !DILocation(line: 53, column: 9, scope: !100)
!199 = !DILocation(line: 0, scope: !114)
!200 = !DILocation(line: 57, column: 23, scope: !201)
!201 = distinct !DILexicalBlock(scope: !114, file: !3, line: 57, column: 5)
!202 = !DILocation(line: 57, column: 5, scope: !114)
!203 = !DILocation(line: 54, column: 9, scope: !204)
!204 = distinct !DILexicalBlock(scope: !197, file: !3, line: 53, column: 20)
!205 = !DILocation(line: 55, column: 9, scope: !204)
!206 = !DILocation(line: 68, column: 22, scope: !100)
!207 = !DILocation(line: 69, column: 18, scope: !100)
!208 = !DILocation(line: 70, column: 5, scope: !100)
!209 = !DILocation(line: 58, column: 21, scope: !210)
!210 = distinct !DILexicalBlock(scope: !201, file: !3, line: 57, column: 41)
!211 = !DILocation(line: 58, column: 26, scope: !210)
!212 = !{!213, !131, i64 0}
!213 = !{!"_ZTS26halide_profiler_func_stats", !131, i64 0, !131, i64 8, !131, i64 16, !131, i64 24, !131, i64 32, !131, i64 40, !131, i64 48, !120, i64 56, !132, i64 60}
!214 = !DILocation(line: 59, column: 43, scope: !210)
!215 = !{!131, !131, i64 0}
!216 = !DILocation(line: 59, column: 28, scope: !210)
!217 = !DILocation(line: 59, column: 21, scope: !210)
!218 = !DILocation(line: 59, column: 26, scope: !210)
!219 = !{!213, !120, i64 56}
!220 = !DILocation(line: 60, column: 21, scope: !210)
!221 = !DILocation(line: 60, column: 36, scope: !210)
!222 = !{!213, !131, i64 8}
!223 = !DILocation(line: 61, column: 21, scope: !210)
!224 = !DILocation(line: 61, column: 33, scope: !210)
!225 = !{!213, !131, i64 16}
!226 = !DILocation(line: 62, column: 21, scope: !210)
!227 = !DILocation(line: 62, column: 34, scope: !210)
!228 = !{!213, !131, i64 24}
!229 = !DILocation(line: 63, column: 21, scope: !210)
!230 = !DILocation(line: 63, column: 32, scope: !210)
!231 = !{!213, !132, i64 60}
!232 = !DILocation(line: 64, column: 21, scope: !210)
!233 = !DILocation(line: 64, column: 32, scope: !210)
!234 = !{!213, !131, i64 32}
!235 = !DILocation(line: 65, column: 21, scope: !210)
!236 = !DILocation(line: 65, column: 46, scope: !210)
!237 = !{!213, !131, i64 40}
!238 = !DILocation(line: 66, column: 21, scope: !210)
!239 = !DILocation(line: 66, column: 48, scope: !210)
!240 = !{!213, !131, i64 48}
!241 = !DILocation(line: 57, column: 37, scope: !201)
!242 = distinct !{!242, !202, !243, !142}
!243 = !DILocation(line: 67, column: 5, scope: !114)
!244 = !DILocation(line: 71, column: 1, scope: !100)
!245 = !DISubprogram(name: "malloc", scope: !16, file: !16, line: 87, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!246 = !DISubroutineType(types: !247)
!247 = !{!56, !18}
!248 = !DISubprogram(name: "free", scope: !16, file: !16, line: 86, type: !249, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !56}
!251 = distinct !DISubprogram(name: "bill_func", linkageName: "_ZN6Halide7Runtime8Internal9bill_funcEP21halide_profiler_stateiyi", scope: !91, file: !3, line: 73, type: !252, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !6, !22, !31, !22}
!254 = !{!255, !256, !257, !258, !259, !260, !262}
!255 = !DILocalVariable(name: "s", arg: 1, scope: !251, file: !3, line: 73, type: !6)
!256 = !DILocalVariable(name: "func_id", arg: 2, scope: !251, file: !3, line: 73, type: !22)
!257 = !DILocalVariable(name: "time", arg: 3, scope: !251, file: !3, line: 73, type: !31)
!258 = !DILocalVariable(name: "active_threads", arg: 4, scope: !251, file: !3, line: 73, type: !22)
!259 = !DILocalVariable(name: "p_prev", scope: !251, file: !3, line: 74, type: !27)
!260 = !DILocalVariable(name: "p", scope: !261, file: !3, line: 75, type: !27)
!261 = distinct !DILexicalBlock(scope: !251, file: !3, line: 75, column: 5)
!262 = !DILocalVariable(name: "f", scope: !263, file: !3, line: 84, type: !43)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 77, column: 87)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 77, column: 13)
!265 = distinct !DILexicalBlock(scope: !266, file: !3, line: 76, column: 59)
!266 = distinct !DILexicalBlock(scope: !261, file: !3, line: 75, column: 5)
!267 = !DILocation(line: 0, scope: !251)
!268 = !DILocation(line: 75, column: 49, scope: !261)
!269 = !DILocation(line: 0, scope: !261)
!270 = !DILocation(line: 75, column: 60, scope: !266)
!271 = !DILocation(line: 75, column: 5, scope: !261)
!272 = !DILocation(line: 77, column: 27, scope: !264)
!273 = !DILocation(line: 77, column: 21, scope: !264)
!274 = !DILocation(line: 77, column: 41, scope: !264)
!275 = !DILocation(line: 77, column: 76, scope: !264)
!276 = !DILocation(line: 77, column: 71, scope: !264)
!277 = !DILocation(line: 77, column: 52, scope: !264)
!278 = !DILocation(line: 77, column: 13, scope: !265)
!279 = !DILocation(line: 78, column: 17, scope: !280)
!280 = distinct !DILexicalBlock(scope: !263, file: !3, line: 78, column: 17)
!281 = !DILocation(line: 78, column: 17, scope: !263)
!282 = !DILocation(line: 80, column: 70, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !3, line: 78, column: 25)
!284 = !DILocation(line: 80, column: 25, scope: !283)
!285 = !DILocation(line: 80, column: 30, scope: !283)
!286 = !DILocation(line: 81, column: 25, scope: !283)
!287 = !DILocation(line: 82, column: 30, scope: !283)
!288 = !DILocation(line: 83, column: 13, scope: !283)
!289 = !DILocation(line: 84, column: 48, scope: !263)
!290 = !DILocation(line: 84, column: 54, scope: !263)
!291 = !DILocation(line: 84, column: 64, scope: !263)
!292 = !DILocation(line: 0, scope: !263)
!293 = !DILocation(line: 85, column: 16, scope: !263)
!294 = !DILocation(line: 85, column: 21, scope: !263)
!295 = !DILocation(line: 86, column: 44, scope: !263)
!296 = !DILocation(line: 86, column: 16, scope: !263)
!297 = !DILocation(line: 86, column: 41, scope: !263)
!298 = !DILocation(line: 87, column: 16, scope: !263)
!299 = !DILocation(line: 87, column: 43, scope: !263)
!300 = !DILocation(line: 88, column: 16, scope: !263)
!301 = !DILocation(line: 88, column: 21, scope: !263)
!302 = !DILocation(line: 89, column: 16, scope: !263)
!303 = !DILocation(line: 89, column: 23, scope: !263)
!304 = !DILocation(line: 90, column: 16, scope: !263)
!305 = !DILocation(line: 90, column: 41, scope: !263)
!306 = !DILocation(line: 91, column: 16, scope: !263)
!307 = !DILocation(line: 91, column: 43, scope: !263)
!308 = !DILocation(line: 76, column: 52, scope: !266)
!309 = distinct !{!309, !271, !310, !142}
!310 = !DILocation(line: 95, column: 5, scope: !261)
!311 = !DILocation(line: 97, column: 1, scope: !251)
!312 = distinct !DISubprogram(name: "sampling_profiler_thread", linkageName: "_ZN6Halide7Runtime8Internal24sampling_profiler_threadEPv", scope: !91, file: !3, line: 99, type: !249, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !313)
!313 = !{!314, !315, !316, !318, !319, !321, !322, !323}
!314 = !DILocalVariable(arg: 1, scope: !312, file: !3, line: 99, type: !56)
!315 = !DILocalVariable(name: "s", scope: !312, file: !3, line: 100, type: !6)
!316 = !DILocalVariable(name: "t1", scope: !317, file: !3, line: 107, type: !31)
!317 = distinct !DILexicalBlock(scope: !312, file: !3, line: 105, column: 60)
!318 = !DILocalVariable(name: "t", scope: !317, file: !3, line: 108, type: !31)
!319 = !DILocalVariable(name: "func", scope: !320, file: !3, line: 110, type: !22)
!320 = distinct !DILexicalBlock(scope: !317, file: !3, line: 109, column: 22)
!321 = !DILocalVariable(name: "active_threads", scope: !320, file: !3, line: 110, type: !22)
!322 = !DILocalVariable(name: "t_now", scope: !320, file: !3, line: 119, type: !31)
!323 = !DILocalVariable(name: "sleep_ms", scope: !320, file: !3, line: 130, type: !22)
!324 = !DILocation(line: 0, scope: !312)
!325 = !DILocation(line: 100, column: 32, scope: !312)
!326 = !DILocation(line: 103, column: 27, scope: !312)
!327 = !DILocation(line: 103, column: 5, scope: !312)
!328 = !DILocation(line: 105, column: 15, scope: !312)
!329 = !{!150, !132, i64 12}
!330 = !DILocation(line: 105, column: 28, scope: !312)
!331 = !DILocation(line: 105, column: 5, scope: !312)
!332 = !DILocation(line: 0, scope: !317)
!333 = !DILocation(line: 134, column: 9, scope: !317)
!334 = distinct !{!334, !331, !335, !142}
!335 = !DILocation(line: 135, column: 5, scope: !312)
!336 = !DILocation(line: 107, column: 23, scope: !317)
!337 = !DILocation(line: 109, column: 9, scope: !317)
!338 = !DILocation(line: 108, column: 18, scope: !317)
!339 = !DILocation(line: 110, column: 13, scope: !320)
!340 = !DILocation(line: 111, column: 20, scope: !341)
!341 = distinct !DILexicalBlock(scope: !320, file: !3, line: 111, column: 17)
!342 = !{!150, !120, i64 24}
!343 = !DILocation(line: 111, column: 17, scope: !341)
!344 = !DILocation(line: 111, column: 17, scope: !320)
!345 = !DILocation(line: 0, scope: !320)
!346 = !DILocation(line: 114, column: 17, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !3, line: 111, column: 47)
!348 = !DILocation(line: 115, column: 13, scope: !347)
!349 = !DILocation(line: 116, column: 27, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !3, line: 115, column: 20)
!351 = !DILocation(line: 116, column: 22, scope: !350)
!352 = !{!132, !132, i64 0}
!353 = !DILocation(line: 117, column: 37, scope: !350)
!354 = !{!150, !132, i64 16}
!355 = !DILocation(line: 117, column: 32, scope: !350)
!356 = !DILocation(line: 119, column: 30, scope: !320)
!357 = !DILocation(line: 120, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !320, file: !3, line: 120, column: 17)
!359 = !DILocation(line: 120, column: 22, scope: !358)
!360 = !DILocation(line: 120, column: 17, scope: !320)
!361 = !DILocation(line: 122, column: 29, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !3, line: 122, column: 24)
!363 = !DILocation(line: 122, column: 24, scope: !358)
!364 = !DILocation(line: 125, column: 42, scope: !365)
!365 = distinct !DILexicalBlock(scope: !362, file: !3, line: 122, column: 35)
!366 = !DILocation(line: 125, column: 47, scope: !365)
!367 = !DILocation(line: 125, column: 17, scope: !365)
!368 = !DILocation(line: 126, column: 13, scope: !365)
!369 = !DILocation(line: 130, column: 31, scope: !320)
!370 = !{!150, !132, i64 4}
!371 = !DILocation(line: 131, column: 13, scope: !320)
!372 = !DILocation(line: 132, column: 13, scope: !320)
!373 = !DILocation(line: 133, column: 13, scope: !320)
!374 = !DILocation(line: 137, column: 5, scope: !312)
!375 = !DILocation(line: 138, column: 1, scope: !312)
!376 = !DISubprogram(name: "halide_mutex_lock", scope: !8, file: !8, line: 133, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!380 = !DISubprogram(name: "halide_current_time_ns", scope: !16, file: !16, line: 136, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !56}
!383 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!384 = !DISubprogram(name: "halide_mutex_unlock", scope: !8, file: !8, line: 134, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!385 = !DISubprogram(name: "halide_sleep_ms", scope: !16, file: !16, line: 137, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !56, !22}
!388 = distinct !DISubprogram(name: "halide_profiler_get_pipeline_state", scope: !3, file: !3, line: 162, type: !389, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!27, !39}
!391 = !{!392, !393, !394, !406}
!392 = !DILocalVariable(name: "pipeline_name", arg: 1, scope: !388, file: !3, line: 162, type: !39)
!393 = !DILocalVariable(name: "s", scope: !388, file: !3, line: 163, type: !6)
!394 = !DILocalVariable(name: "lock", scope: !388, file: !3, line: 165, type: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedMutexLock", scope: !91, file: !396, line: 11, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !397, identifier: "_ZTSN6Halide7Runtime8Internal15ScopedMutexLockE")
!396 = !DIFile(filename: "src/runtime/scoped_mutex_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!397 = !{!398, !399, !403}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !395, file: !396, line: 12, baseType: !379, size: 32)
!399 = !DISubprogram(name: "ScopedMutexLock", scope: !395, file: !396, line: 14, type: !400, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !402, !379}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!403 = !DISubprogram(name: "~ScopedMutexLock", scope: !395, file: !396, line: 19, type: !404, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !402}
!406 = !DILocalVariable(name: "p", scope: !407, file: !3, line: 167, type: !27)
!407 = distinct !DILexicalBlock(scope: !388, file: !3, line: 167, column: 5)
!408 = !DILocation(line: 0, scope: !388)
!409 = !DILocation(line: 163, column: 32, scope: !388)
!410 = !DILocation(line: 165, column: 30, scope: !388)
!411 = !DILocalVariable(name: "this", arg: 1, scope: !412, type: !415, flags: DIFlagArtificial | DIFlagObjectPointer)
!412 = distinct !DISubprogram(name: "ScopedMutexLock", linkageName: "_ZN6Halide7Runtime8Internal15ScopedMutexLockC2EP12halide_mutex", scope: !395, file: !396, line: 14, type: !400, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, declaration: !399, retainedNodes: !413)
!413 = !{!411, !414}
!414 = !DILocalVariable(name: "mutex", arg: 2, scope: !412, file: !396, line: 14, type: !379)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!416 = !DILocation(line: 0, scope: !412, inlinedAt: !417)
!417 = distinct !DILocation(line: 165, column: 21, scope: !388)
!418 = !DILocation(line: 16, column: 9, scope: !419, inlinedAt: !417)
!419 = distinct !DILexicalBlock(scope: !412, file: !396, line: 15, column: 24)
!420 = !DILocation(line: 167, column: 49, scope: !407)
!421 = !DILocation(line: 0, scope: !407)
!422 = !DILocation(line: 167, column: 60, scope: !423)
!423 = distinct !DILexicalBlock(scope: !407, file: !3, line: 167, column: 5)
!424 = !DILocation(line: 167, column: 5, scope: !407)
!425 = !DILocation(line: 171, column: 16, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !3, line: 171, column: 13)
!427 = distinct !DILexicalBlock(scope: !423, file: !3, line: 168, column: 59)
!428 = !DILocation(line: 171, column: 21, scope: !426)
!429 = !DILocation(line: 171, column: 13, scope: !427)
!430 = !DILocation(line: 168, column: 52, scope: !423)
!431 = distinct !{!431, !424, !432, !142}
!432 = !DILocation(line: 174, column: 5, scope: !407)
!433 = !DILocalVariable(name: "this", arg: 1, scope: !434, type: !415, flags: DIFlagArtificial | DIFlagObjectPointer)
!434 = distinct !DISubprogram(name: "~ScopedMutexLock", linkageName: "_ZN6Halide7Runtime8Internal15ScopedMutexLockD2Ev", scope: !395, file: !396, line: 19, type: !404, scopeLine: 19, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, declaration: !403, retainedNodes: !435)
!435 = !{!433}
!436 = !DILocation(line: 0, scope: !434, inlinedAt: !437)
!437 = distinct !DILocation(line: 176, column: 1, scope: !388)
!438 = !DILocation(line: 20, column: 9, scope: !439, inlinedAt: !437)
!439 = distinct !DILexicalBlock(scope: !434, file: !396, line: 19, column: 38)
!440 = !DILocation(line: 176, column: 1, scope: !388)
!441 = distinct !DISubprogram(name: "halide_profiler_pipeline_start", scope: !3, file: !3, line: 179, type: !442, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!22, !56, !39, !22, !103}
!444 = !{!445, !446, !447, !448, !449, !450, !451}
!445 = !DILocalVariable(name: "user_context", arg: 1, scope: !441, file: !3, line: 179, type: !56)
!446 = !DILocalVariable(name: "pipeline_name", arg: 2, scope: !441, file: !3, line: 180, type: !39)
!447 = !DILocalVariable(name: "num_funcs", arg: 3, scope: !441, file: !3, line: 181, type: !22)
!448 = !DILocalVariable(name: "func_names", arg: 4, scope: !441, file: !3, line: 182, type: !103)
!449 = !DILocalVariable(name: "s", scope: !441, file: !3, line: 183, type: !6)
!450 = !DILocalVariable(name: "lock", scope: !441, file: !3, line: 185, type: !395)
!451 = !DILocalVariable(name: "p", scope: !441, file: !3, line: 192, type: !27)
!452 = !DILocation(line: 0, scope: !441)
!453 = !DILocation(line: 183, column: 32, scope: !441)
!454 = !DILocation(line: 185, column: 30, scope: !441)
!455 = !DILocation(line: 0, scope: !412, inlinedAt: !456)
!456 = distinct !DILocation(line: 185, column: 21, scope: !441)
!457 = !DILocation(line: 16, column: 9, scope: !419, inlinedAt: !456)
!458 = !DILocation(line: 187, column: 13, scope: !459)
!459 = distinct !DILexicalBlock(scope: !441, file: !3, line: 187, column: 9)
!460 = !{!150, !120, i64 28}
!461 = !DILocation(line: 187, column: 10, scope: !459)
!462 = !DILocation(line: 187, column: 9, scope: !441)
!463 = !DILocation(line: 188, column: 9, scope: !464)
!464 = distinct !DILexicalBlock(scope: !459, file: !3, line: 187, column: 30)
!465 = !DILocation(line: 189, column: 30, scope: !464)
!466 = !DILocation(line: 189, column: 28, scope: !464)
!467 = !DILocation(line: 190, column: 5, scope: !464)
!468 = !DILocation(line: 193, column: 9, scope: !441)
!469 = !DILocation(line: 194, column: 10, scope: !470)
!470 = distinct !DILexicalBlock(scope: !441, file: !3, line: 194, column: 9)
!471 = !DILocation(line: 194, column: 9, scope: !441)
!472 = !DILocation(line: 196, column: 16, scope: !473)
!473 = distinct !DILexicalBlock(scope: !470, file: !3, line: 194, column: 13)
!474 = !DILocation(line: 196, column: 9, scope: !473)
!475 = !DILocation(line: 198, column: 8, scope: !441)
!476 = !DILocation(line: 198, column: 12, scope: !441)
!477 = !DILocation(line: 200, column: 15, scope: !441)
!478 = !DILocation(line: 200, column: 5, scope: !441)
!479 = !DILocation(line: 0, scope: !434, inlinedAt: !480)
!480 = distinct !DILocation(line: 201, column: 1, scope: !441)
!481 = !DILocation(line: 20, column: 9, scope: !439, inlinedAt: !480)
!482 = !DILocation(line: 201, column: 1, scope: !441)
!483 = !DISubprogram(name: "halide_start_clock", scope: !16, file: !16, line: 135, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!484 = !DISubroutineType(types: !485)
!485 = !{!22, !56}
!486 = !DISubprogram(name: "halide_spawn_thread", scope: !8, file: !8, line: 317, type: !487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!487 = !DISubroutineType(types: !488)
!488 = !{!68, !489, !56}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!490 = !DISubprogram(name: "halide_error_out_of_memory", scope: !8, file: !8, line: 1227, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!491 = distinct !DISubprogram(name: "halide_profiler_stack_peak_update", scope: !3, file: !3, line: 203, type: !492, scopeLine: 205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !495)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !56, !56, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!495 = !{!496, !497, !498, !499, !500}
!496 = !DILocalVariable(name: "user_context", arg: 1, scope: !491, file: !3, line: 203, type: !56)
!497 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !491, file: !3, line: 204, type: !56)
!498 = !DILocalVariable(name: "f_values", arg: 3, scope: !491, file: !3, line: 205, type: !494)
!499 = !DILocalVariable(name: "p_stats", scope: !491, file: !3, line: 206, type: !27)
!500 = !DILocalVariable(name: "i", scope: !501, file: !3, line: 216, type: !22)
!501 = distinct !DILexicalBlock(scope: !491, file: !3, line: 216, column: 5)
!502 = !DILocation(line: 0, scope: !491)
!503 = !DILocation(line: 207, column: 5, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 207, column: 5)
!505 = distinct !DILexicalBlock(scope: !491, file: !3, line: 207, column: 5)
!506 = !DILocation(line: 207, column: 5, scope: !505)
!507 = !DILocation(line: 207, column: 5, scope: !508)
!508 = distinct !DILexicalBlock(scope: !504, file: !3, line: 207, column: 5)
!509 = !DILocation(line: 0, scope: !501)
!510 = !DILocation(line: 216, column: 34, scope: !511)
!511 = distinct !DILexicalBlock(scope: !501, file: !3, line: 216, column: 5)
!512 = !DILocation(line: 216, column: 23, scope: !511)
!513 = !DILocation(line: 216, column: 5, scope: !501)
!514 = !DILocation(line: 221, column: 1, scope: !491)
!515 = !DILocation(line: 217, column: 13, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 217, column: 13)
!517 = distinct !DILexicalBlock(scope: !511, file: !3, line: 216, column: 50)
!518 = !DILocation(line: 217, column: 25, scope: !516)
!519 = !DILocation(line: 217, column: 13, scope: !517)
!520 = !DILocation(line: 218, column: 50, scope: !521)
!521 = distinct !DILexicalBlock(scope: !516, file: !3, line: 217, column: 31)
!522 = !DILocation(line: 218, column: 60, scope: !521)
!523 = !DILocalVariable(name: "ptr", arg: 1, scope: !524, file: !3, line: 147, type: !528)
!524 = distinct !DISubprogram(name: "sync_compare_max_and_swap<unsigned long long>", linkageName: "_ZN12_GLOBAL__N_125sync_compare_max_and_swapIyEEvPT_S1_", scope: !525, file: !3, line: 147, type: !526, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, templateParams: !534, retainedNodes: !529)
!525 = !DINamespace(scope: null)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528, !32}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!529 = !{!523, !530, !531, !532}
!530 = !DILocalVariable(name: "val", arg: 2, scope: !524, file: !3, line: 147, type: !32)
!531 = !DILocalVariable(name: "old_val", scope: !524, file: !3, line: 148, type: !32)
!532 = !DILocalVariable(name: "temp", scope: !533, file: !3, line: 150, type: !32)
!533 = distinct !DILexicalBlock(scope: !524, file: !3, line: 149, column: 27)
!534 = !{!535}
!535 = !DITemplateTypeParameter(name: "T", type: !32)
!536 = !DILocation(line: 0, scope: !524, inlinedAt: !537)
!537 = distinct !DILocation(line: 218, column: 13, scope: !521)
!538 = !DILocation(line: 148, column: 17, scope: !524, inlinedAt: !537)
!539 = !DILocation(line: 149, column: 5, scope: !524, inlinedAt: !537)
!540 = !DILocation(line: 149, column: 16, scope: !524, inlinedAt: !537)
!541 = !DILocation(line: 0, scope: !533, inlinedAt: !537)
!542 = !DILocation(line: 151, column: 19, scope: !533, inlinedAt: !537)
!543 = !DILocation(line: 152, column: 18, scope: !544, inlinedAt: !537)
!544 = distinct !DILexicalBlock(scope: !533, file: !3, line: 152, column: 13)
!545 = distinct !{!545, !539, !546, !142}
!546 = !DILocation(line: 155, column: 5, scope: !524, inlinedAt: !537)
!547 = !DILocation(line: 216, column: 45, scope: !511)
!548 = distinct !{!548, !513, !549, !142}
!549 = !DILocation(line: 220, column: 5, scope: !501)
!550 = !DISubprogram(name: "halide_print", scope: !8, file: !8, line: 97, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !56, !39}
!553 = !DISubprogram(name: "abort", scope: !16, file: !16, line: 108, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !94)
!554 = !DISubroutineType(types: !555)
!555 = !{null}
!556 = distinct !DISubprogram(name: "halide_profiler_memory_allocate", scope: !3, file: !3, line: 223, type: !557, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !56, !56, !22, !31}
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567}
!560 = !DILocalVariable(name: "user_context", arg: 1, scope: !556, file: !3, line: 223, type: !56)
!561 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !556, file: !3, line: 224, type: !56)
!562 = !DILocalVariable(name: "func_id", arg: 3, scope: !556, file: !3, line: 225, type: !22)
!563 = !DILocalVariable(name: "incr", arg: 4, scope: !556, file: !3, line: 226, type: !31)
!564 = !DILocalVariable(name: "p_stats", scope: !556, file: !3, line: 233, type: !27)
!565 = !DILocalVariable(name: "f_stats", scope: !556, file: !3, line: 238, type: !43)
!566 = !DILocalVariable(name: "p_mem_current", scope: !556, file: !3, line: 249, type: !31)
!567 = !DILocalVariable(name: "f_mem_current", scope: !556, file: !3, line: 255, type: !31)
!568 = !DILocation(line: 0, scope: !556)
!569 = !DILocation(line: 229, column: 14, scope: !570)
!570 = distinct !DILexicalBlock(scope: !556, file: !3, line: 229, column: 9)
!571 = !DILocation(line: 229, column: 9, scope: !556)
!572 = !DILocation(line: 234, column: 5, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 234, column: 5)
!574 = distinct !DILexicalBlock(scope: !556, file: !3, line: 234, column: 5)
!575 = !DILocation(line: 234, column: 5, scope: !574)
!576 = !DILocation(line: 234, column: 5, scope: !577)
!577 = distinct !DILexicalBlock(scope: !573, file: !3, line: 234, column: 5)
!578 = !DILocation(line: 235, column: 5, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 235, column: 5)
!580 = distinct !DILexicalBlock(scope: !556, file: !3, line: 235, column: 5)
!581 = !DILocation(line: 235, column: 5, scope: !580)
!582 = !DILocation(line: 235, column: 5, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !3, line: 235, column: 5)
!584 = !DILocation(line: 236, column: 5, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !3, line: 236, column: 5)
!586 = distinct !DILexicalBlock(scope: !556, file: !3, line: 236, column: 5)
!587 = !DILocation(line: 236, column: 5, scope: !586)
!588 = !DILocation(line: 236, column: 5, scope: !589)
!589 = distinct !DILexicalBlock(scope: !585, file: !3, line: 236, column: 5)
!590 = !DILocation(line: 238, column: 53, scope: !556)
!591 = !DILocation(line: 247, column: 36, scope: !556)
!592 = !DILocation(line: 247, column: 5, scope: !556)
!593 = !DILocation(line: 248, column: 36, scope: !556)
!594 = !DILocation(line: 248, column: 5, scope: !556)
!595 = !DILocation(line: 249, column: 61, scope: !556)
!596 = !DILocation(line: 249, column: 30, scope: !556)
!597 = !DILocation(line: 250, column: 41, scope: !556)
!598 = !DILocation(line: 0, scope: !524, inlinedAt: !599)
!599 = distinct !DILocation(line: 250, column: 5, scope: !556)
!600 = !DILocation(line: 148, column: 17, scope: !524, inlinedAt: !599)
!601 = !DILocation(line: 149, column: 5, scope: !524, inlinedAt: !599)
!602 = !DILocation(line: 149, column: 16, scope: !524, inlinedAt: !599)
!603 = !DILocation(line: 0, scope: !533, inlinedAt: !599)
!604 = !DILocation(line: 151, column: 19, scope: !533, inlinedAt: !599)
!605 = !DILocation(line: 152, column: 18, scope: !544, inlinedAt: !599)
!606 = distinct !{!606, !601, !607, !142}
!607 = !DILocation(line: 155, column: 5, scope: !524, inlinedAt: !599)
!608 = !DILocation(line: 253, column: 36, scope: !556)
!609 = !DILocation(line: 253, column: 5, scope: !556)
!610 = !DILocation(line: 254, column: 36, scope: !556)
!611 = !DILocation(line: 254, column: 5, scope: !556)
!612 = !DILocation(line: 255, column: 61, scope: !556)
!613 = !DILocation(line: 255, column: 30, scope: !556)
!614 = !DILocation(line: 256, column: 41, scope: !556)
!615 = !DILocation(line: 0, scope: !524, inlinedAt: !616)
!616 = distinct !DILocation(line: 256, column: 5, scope: !556)
!617 = !DILocation(line: 148, column: 17, scope: !524, inlinedAt: !616)
!618 = !DILocation(line: 149, column: 5, scope: !524, inlinedAt: !616)
!619 = !DILocation(line: 149, column: 16, scope: !524, inlinedAt: !616)
!620 = !DILocation(line: 0, scope: !533, inlinedAt: !616)
!621 = !DILocation(line: 151, column: 19, scope: !533, inlinedAt: !616)
!622 = !DILocation(line: 152, column: 18, scope: !544, inlinedAt: !616)
!623 = distinct !{!623, !618, !624, !142}
!624 = !DILocation(line: 155, column: 5, scope: !524, inlinedAt: !616)
!625 = !DILocation(line: 257, column: 1, scope: !556)
!626 = distinct !DISubprogram(name: "halide_profiler_memory_free", scope: !3, file: !3, line: 259, type: !557, scopeLine: 262, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !627)
!627 = !{!628, !629, !630, !631, !632, !633}
!628 = !DILocalVariable(name: "user_context", arg: 1, scope: !626, file: !3, line: 259, type: !56)
!629 = !DILocalVariable(name: "pipeline_state", arg: 2, scope: !626, file: !3, line: 260, type: !56)
!630 = !DILocalVariable(name: "func_id", arg: 3, scope: !626, file: !3, line: 261, type: !22)
!631 = !DILocalVariable(name: "decr", arg: 4, scope: !626, file: !3, line: 262, type: !31)
!632 = !DILocalVariable(name: "p_stats", scope: !626, file: !3, line: 269, type: !27)
!633 = !DILocalVariable(name: "f_stats", scope: !626, file: !3, line: 274, type: !43)
!634 = !DILocation(line: 0, scope: !626)
!635 = !DILocation(line: 265, column: 14, scope: !636)
!636 = distinct !DILexicalBlock(scope: !626, file: !3, line: 265, column: 9)
!637 = !DILocation(line: 265, column: 9, scope: !626)
!638 = !DILocation(line: 270, column: 5, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !3, line: 270, column: 5)
!640 = distinct !DILexicalBlock(scope: !626, file: !3, line: 270, column: 5)
!641 = !DILocation(line: 270, column: 5, scope: !640)
!642 = !DILocation(line: 270, column: 5, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !3, line: 270, column: 5)
!644 = !DILocation(line: 271, column: 5, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !3, line: 271, column: 5)
!646 = distinct !DILexicalBlock(scope: !626, file: !3, line: 271, column: 5)
!647 = !DILocation(line: 271, column: 5, scope: !646)
!648 = !DILocation(line: 271, column: 5, scope: !649)
!649 = distinct !DILexicalBlock(scope: !645, file: !3, line: 271, column: 5)
!650 = !DILocation(line: 272, column: 5, scope: !651)
!651 = distinct !DILexicalBlock(scope: !652, file: !3, line: 272, column: 5)
!652 = distinct !DILexicalBlock(scope: !626, file: !3, line: 272, column: 5)
!653 = !DILocation(line: 272, column: 5, scope: !652)
!654 = !DILocation(line: 272, column: 5, scope: !655)
!655 = distinct !DILexicalBlock(scope: !651, file: !3, line: 272, column: 5)
!656 = !DILocation(line: 274, column: 53, scope: !626)
!657 = !DILocation(line: 283, column: 36, scope: !626)
!658 = !DILocation(line: 283, column: 5, scope: !626)
!659 = !DILocation(line: 286, column: 36, scope: !626)
!660 = !DILocation(line: 286, column: 5, scope: !626)
!661 = !DILocation(line: 287, column: 1, scope: !626)
!662 = distinct !DISubprogram(name: "halide_profiler_report_unlocked", scope: !3, file: !3, line: 289, type: !663, scopeLine: 289, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !56, !6}
!665 = !{!666, !667, !668, !672, !787, !789, !792, !793, !794, !795, !796, !800, !803, !807, !811, !812, !813, !814, !817}
!666 = !DILocalVariable(name: "user_context", arg: 1, scope: !662, file: !3, line: 289, type: !56)
!667 = !DILocalVariable(name: "s", arg: 2, scope: !662, file: !3, line: 289, type: !6)
!668 = !DILocalVariable(name: "line_buf", scope: !662, file: !3, line: 291, type: !669)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 1024)
!672 = !DILocalVariable(name: "sstr", scope: !662, file: !3, line: 292, type: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 1024>", scope: !675, file: !674, line: 30, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !676, templateParams: !784)
!674 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!675 = !DINamespace(scope: !91)
!676 = !{!677, !678, !679, !680, !681, !683, !685, !689, !693, !697, !701, !704, !707, !711, !715, !720, !726, !759, !766, !769, !772, !777, !778, !781, !782, !783}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !673, file: !674, line: 32, baseType: !87, size: 32, flags: DIFlagPublic)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !673, file: !674, line: 32, baseType: !87, size: 32, offset: 32, flags: DIFlagPublic)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !673, file: !674, line: 32, baseType: !87, size: 32, offset: 64, flags: DIFlagPublic)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !673, file: !674, line: 33, baseType: !56, size: 32, offset: 96, flags: DIFlagPublic)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !673, file: !674, line: 34, baseType: !682, size: 8, offset: 128, flags: DIFlagPublic)
!682 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !673, file: !674, line: 35, baseType: !684, size: 8, offset: 136, flags: DIFlagPublic)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !19)
!685 = !DISubprogram(name: "Printer", scope: !673, file: !674, line: 37, type: !686, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !688, !56, !87}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!689 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKc", scope: !673, file: !674, line: 57, type: !690, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !688, !39}
!692 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !673, size: 32)
!693 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEx", scope: !673, file: !674, line: 67, type: !694, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!694 = !DISubroutineType(types: !695)
!695 = !{!692, !688, !696}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 9, baseType: !383)
!697 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEi", scope: !673, file: !674, line: 72, type: !698, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!698 = !DISubroutineType(types: !699)
!699 = !{!692, !688, !700}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !16, line: 11, baseType: !22)
!701 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEy", scope: !673, file: !674, line: 77, type: !702, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!702 = !DISubroutineType(types: !703)
!703 = !{!692, !688, !31}
!704 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEj", scope: !673, file: !674, line: 82, type: !705, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!705 = !DISubroutineType(types: !706)
!706 = !{!692, !688, !17}
!707 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEd", scope: !673, file: !674, line: 87, type: !708, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!708 = !DISubroutineType(types: !709)
!709 = !{!692, !688, !710}
!710 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!711 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEf", scope: !673, file: !674, line: 92, type: !712, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!712 = !DISubroutineType(types: !713)
!713 = !{!692, !688, !714}
!714 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!715 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsEPKv", scope: !673, file: !674, line: 97, type: !716, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!716 = !DISubroutineType(types: !717)
!717 = !{!692, !688, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!720 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE23write_float16_from_bitsEt", scope: !673, file: !674, line: 102, type: !721, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!721 = !DISubroutineType(types: !722)
!722 = !{!692, !688, !723}
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 14, baseType: !725)
!725 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!726 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK13halide_type_t", scope: !673, file: !674, line: 108, type: !727, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!727 = !DISubroutineType(types: !728)
!728 = !{!692, !688, !729}
!729 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !8, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !732, identifier: "_ZTS13halide_type_t")
!732 = !{!733, !735, !736, !737, !741, !744, !748, !751, !752, !753, !756}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !731, file: !8, line: 434, baseType: !734, size: 8, align: 8)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !8, line: 413, baseType: !77)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !731, file: !8, line: 442, baseType: !78, size: 8, align: 8, offset: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !731, file: !8, line: 446, baseType: !724, size: 16, align: 16, offset: 16)
!737 = !DISubprogram(name: "halide_type_t", scope: !731, file: !8, line: 453, type: !738, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !740, !734, !78, !724}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!741 = !DISubprogram(name: "halide_type_t", scope: !731, file: !8, line: 459, type: !742, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !740}
!744 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !731, file: !8, line: 463, type: !745, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!745 = !DISubroutineType(types: !746)
!746 = !{!731, !747, !724}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!748 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !731, file: !8, line: 468, type: !749, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!682, !747, !729}
!751 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !731, file: !8, line: 472, type: !749, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!752 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !731, file: !8, line: 476, type: !749, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!753 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !731, file: !8, line: 481, type: !754, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(types: !755)
!755 = !{!22, !747}
!756 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !731, file: !8, line: 485, type: !757, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!757 = !DISubroutineType(types: !758)
!758 = !{!17, !747}
!759 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EElsERK15halide_buffer_t", scope: !673, file: !674, line: 113, type: !760, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubroutineType(types: !761)
!761 = !{!692, !688, !762}
!762 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !8, line: 1550, baseType: !765)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !8, line: 1423, size: 320, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15halide_buffer_t")
!766 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE3strEv", scope: !673, file: !674, line: 119, type: !767, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!767 = !DISubroutineType(types: !768)
!768 = !{!39, !688}
!769 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE5clearEv", scope: !673, file: !674, line: 131, type: !770, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !688}
!772 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy1024EE4sizeEv", scope: !673, file: !674, line: 139, type: !773, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!773 = !DISubroutineType(types: !774)
!774 = !{!31, !775}
