; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/tracing.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/tracing.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"class.Halide::Runtime::Internal::TraceBuffer" = type { %"class.Halide::Runtime::Internal::SharedExclusiveSpinLock", i32, i32, [1048576 x i8] }
%"class.Halide::Runtime::Internal::SharedExclusiveSpinLock" = type { i32 }
%struct.halide_trace_event_t = type <{ i8*, i8*, i32*, i8*, %struct.halide_type_t, i32, i32, i32, i32, [4 x i8] }>
%struct.halide_type_t = type { i8, i8, i16 }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer.0" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>
%struct.halide_trace_packet_t = type { i32, i32, %struct.halide_type_t, i32, i32, i32, i32 }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>
%"struct.Halide::Runtime::Internal::ScopedSpinLock" = type { i8* }

@_ZN6Halide7Runtime8Internal19halide_trace_bufferE = weak dso_local local_unnamed_addr global %"class.Halide::Runtime::Internal::TraceBuffer"* null, align 8, !dbg !0
@_ZN6Halide7Runtime8Internal17halide_trace_fileE = weak dso_local local_unnamed_addr global i32 -1, align 4, !dbg !157
@_ZN6Halide7Runtime8Internal22halide_trace_file_lockE = weak dso_local global i8 0, align 1, !dbg !159

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "halide_trace_buffer", linkageName: "_ZN6Halide7Runtime8Internal19halide_trace_bufferE", scope: !2, file: !5, line: 148, type: !6, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "Internal", scope: !3)
!3 = !DINamespace(name: "Runtime", scope: !4)
!4 = !DINamespace(name: "Halide", scope: null)
!5 = !DIFile(filename: "src/runtime/tracing.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "TraceBuffer", scope: !2, file: !5, line: 78, size: 8388704, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !8, identifier: "_ZTSN6Halide7Runtime8Internal11TraceBufferE")
!8 = !{!9, !30, !31, !32, !38, !144, !147, !150, !153, !156}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !7, file: !5, line: 79, baseType: !10, size: 32)
!10 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SharedExclusiveSpinLock", scope: !2, file: !5, line: 19, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !11, identifier: "_ZTSN6Halide7Runtime8Internal23SharedExclusiveSpinLockE")
!11 = !{!12, !17, !19, !20, !21, !25, !26, !27, !28, !29}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !10, file: !5, line: 20, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 12, baseType: !16)
!15 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive_held_mask", scope: !10, file: !5, line: 26, baseType: !18, flags: DIFlagStaticMember, extraData: i32 -2147483648)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive_waiting_mask", scope: !10, file: !5, line: 31, baseType: !18, flags: DIFlagStaticMember, extraData: i32 1073741824)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "shared_mask", scope: !10, file: !5, line: 36, baseType: !18, flags: DIFlagStaticMember, extraData: i32 1073741823)
!21 = !DISubprogram(name: "acquire_shared", linkageName: "_ZN6Halide7Runtime8Internal23SharedExclusiveSpinLock14acquire_sharedEv", scope: !10, file: !5, line: 39, type: !22, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!25 = !DISubprogram(name: "release_shared", linkageName: "_ZN6Halide7Runtime8Internal23SharedExclusiveSpinLock14release_sharedEv", scope: !10, file: !5, line: 48, type: !22, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!26 = !DISubprogram(name: "acquire_exclusive", linkageName: "_ZN6Halide7Runtime8Internal23SharedExclusiveSpinLock17acquire_exclusiveEv", scope: !10, file: !5, line: 52, type: !22, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!27 = !DISubprogram(name: "release_exclusive", linkageName: "_ZN6Halide7Runtime8Internal23SharedExclusiveSpinLock17release_exclusiveEv", scope: !10, file: !5, line: 65, type: !22, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!28 = !DISubprogram(name: "init", linkageName: "_ZN6Halide7Runtime8Internal23SharedExclusiveSpinLock4initEv", scope: !10, file: !5, line: 69, type: !22, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!29 = !DISubprogram(name: "SharedExclusiveSpinLock", scope: !10, file: !5, line: 73, type: !22, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !7, file: !5, line: 80, baseType: !14, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "overage", scope: !7, file: !5, line: 80, baseType: !14, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !7, file: !5, line: 81, baseType: !33, size: 8388608, offset: 96)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8388608, elements: !36)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 16, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37}
!37 = !DISubrange(count: 1048576)
!38 = !DISubprogram(name: "try_acquire_packet", linkageName: "_ZN6Halide7Runtime8Internal11TraceBuffer18try_acquire_packetEPvj", scope: !7, file: !5, line: 85, type: !39, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !143, !130, !14}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_trace_packet_t", file: !43, line: 601, size: 224, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !44, identifier: "_ZTS21halide_trace_packet_t")
!43 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!44 = !{!45, !46, !49, !90, !104, !105, !106, !107, !111, !118, !122, !127, !131, !137, !141, !142}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !43, line: 605, baseType: !14, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !43, line: 608, baseType: !47, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !15, line: 11, baseType: !48)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !43, line: 612, baseType: !50, size: 32, offset: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !43, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !51, identifier: "_ZTS13halide_type_t")
!51 = !{!52, !61, !62, !65, !69, !72, !77, !82, !83, !84, !87}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !50, file: !43, line: 434, baseType: !53, size: 8, align: 8)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !43, line: 413, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !43, line: 403, baseType: !34, size: 8, elements: !55, identifier: "_ZTS18halide_type_code_t")
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !50, file: !43, line: 442, baseType: !34, size: 8, align: 8, offset: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !50, file: !43, line: 446, baseType: !63, size: 16, align: 16, offset: 16)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 14, baseType: !64)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DISubprogram(name: "halide_type_t", scope: !50, file: !43, line: 453, type: !66, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !53, !34, !63}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!69 = !DISubprogram(name: "halide_type_t", scope: !50, file: !43, line: 459, type: !70, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !68}
!72 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !50, file: !43, line: 463, type: !73, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!73 = !DISubroutineType(types: !74)
!74 = !{!50, !75, !63}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!77 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !50, file: !43, line: 468, type: !78, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !75, !81}
!80 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!81 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !76, size: 64)
!82 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !50, file: !43, line: 472, type: !78, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!83 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !50, file: !43, line: 476, type: !78, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!84 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !50, file: !43, line: 481, type: !85, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{!48, !75}
!87 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !50, file: !43, line: 485, type: !88, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubroutineType(types: !89)
!89 = !{!14, !75}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !42, file: !43, line: 613, baseType: !91, size: 32, offset: 96)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_trace_event_code_t", file: !43, line: 493, baseType: !16, size: 32, elements: !92, identifier: "_ZTS25halide_trace_event_code_t")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!93 = !DIEnumerator(name: "halide_trace_load", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "halide_trace_store", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "halide_trace_begin_realization", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "halide_trace_end_realization", value: 3, isUnsigned: true)
!97 = !DIEnumerator(name: "halide_trace_produce", value: 4, isUnsigned: true)
!98 = !DIEnumerator(name: "halide_trace_end_produce", value: 5, isUnsigned: true)
!99 = !DIEnumerator(name: "halide_trace_consume", value: 6, isUnsigned: true)
!100 = !DIEnumerator(name: "halide_trace_end_consume", value: 7, isUnsigned: true)
!101 = !DIEnumerator(name: "halide_trace_begin_pipeline", value: 8, isUnsigned: true)
!102 = !DIEnumerator(name: "halide_trace_end_pipeline", value: 9, isUnsigned: true)
!103 = !DIEnumerator(name: "halide_trace_tag", value: 10, isUnsigned: true)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "parent_id", scope: !42, file: !43, line: 614, baseType: !47, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value_index", scope: !42, file: !43, line: 615, baseType: !47, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !42, file: !43, line: 616, baseType: !47, size: 32, offset: 192)
!107 = !DISubprogram(name: "halide_trace_packet_t", scope: !42, file: !43, line: 622, type: !108, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!111 = !DISubprogram(name: "coordinates", linkageName: "_ZNK21halide_trace_packet_t11coordinatesEv", scope: !42, file: !43, line: 627, type: !112, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !116}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!118 = !DISubprogram(name: "coordinates", linkageName: "_ZN21halide_trace_packet_t11coordinatesEv", scope: !42, file: !43, line: 631, type: !119, scopeLine: 631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !110}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!122 = !DISubprogram(name: "value", linkageName: "_ZNK21halide_trace_packet_t5valueEv", scope: !42, file: !43, line: 638, type: !123, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !116}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!127 = !DISubprogram(name: "value", linkageName: "_ZN21halide_trace_packet_t5valueEv", scope: !42, file: !43, line: 642, type: !128, scopeLine: 642, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !110}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DISubprogram(name: "func", linkageName: "_ZNK21halide_trace_packet_t4funcEv", scope: !42, file: !43, line: 648, type: !132, scopeLine: 648, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !116}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !DISubprogram(name: "func", linkageName: "_ZN21halide_trace_packet_t4funcEv", scope: !42, file: !43, line: 652, type: !138, scopeLine: 652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !110}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!141 = !DISubprogram(name: "trace_tag", linkageName: "_ZNK21halide_trace_packet_t9trace_tagEv", scope: !42, file: !43, line: 659, type: !132, scopeLine: 659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubprogram(name: "trace_tag", linkageName: "_ZN21halide_trace_packet_t9trace_tagEv", scope: !42, file: !43, line: 668, type: !138, scopeLine: 668, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!144 = !DISubprogram(name: "flush", linkageName: "_ZN6Halide7Runtime8Internal11TraceBuffer5flushEPvi", scope: !7, file: !5, line: 105, type: !145, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !143, !130, !48}
!147 = !DISubprogram(name: "acquire_packet", linkageName: "_ZN6Halide7Runtime8Internal11TraceBuffer14acquire_packetEPvij", scope: !7, file: !5, line: 123, type: !148, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{!41, !143, !130, !48, !14}
!150 = !DISubprogram(name: "release_packet", linkageName: "_ZN6Halide7Runtime8Internal11TraceBuffer14release_packetEP21halide_trace_packet_t", scope: !7, file: !5, line: 133, type: !151, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !143, !41}
!153 = !DISubprogram(name: "init", linkageName: "_ZN6Halide7Runtime8Internal11TraceBuffer4initEv", scope: !7, file: !5, line: 139, type: !154, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !143}
!156 = !DISubprogram(name: "TraceBuffer", scope: !7, file: !5, line: 145, type: !154, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "halide_trace_file", linkageName: "_ZN6Halide7Runtime8Internal17halide_trace_fileE", scope: !2, file: !5, line: 149, type: !48, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "halide_trace_file_lock", linkageName: "_ZN6Halide7Runtime8Internal22halide_trace_file_lockE", scope: !2, file: !5, line: 150, type: !161, isLocal: false, isDefinition: true)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !163, file: !162, line: 11, baseType: !136)
!162 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !2, file: !162, line: 9, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !164, identifier: "_ZTSN6Halide7Runtime8Internal14ScopedSpinLockE")
!164 = !{!165, !169, !173}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !162, line: 13, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!169 = !DISubprogram(name: "ScopedSpinLock", scope: !163, file: !162, line: 15, type: !170, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !172, !167}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!173 = !DISubprogram(name: "~ScopedSpinLock", scope: !163, file: !162, line: 22, type: !174, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !172}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "halide_trace_file_initialized", linkageName: "_ZN6Halide7Runtime8Internal29halide_trace_file_initializedE", scope: !2, file: !5, line: 151, type: !80, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "halide_trace_file_internally_opened", linkageName: "_ZN6Halide7Runtime8Internal35halide_trace_file_internally_openedE", scope: !2, file: !5, line: 152, type: !130, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "ids", scope: !182, file: !5, line: 161, type: !47, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "halide_default_trace", scope: !5, file: !5, line: 160, type: !183, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !203, retainedNodes: !314)
!183 = !DISubroutineType(types: !184)
!184 = !{!47, !130, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_trace_event_t", file: !43, line: 505, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !188, identifier: "_ZTS20halide_trace_event_t")
!188 = !{!189, !190, !191, !193, !194, !195, !196, !197, !198, !199}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !187, file: !43, line: 507, baseType: !134, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !187, file: !43, line: 513, baseType: !130, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !187, file: !43, line: 525, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "trace_tag", scope: !187, file: !43, line: 530, baseType: !134, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !43, line: 534, baseType: !50, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !187, file: !43, line: 537, baseType: !91, size: 32, offset: 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parent_id", scope: !187, file: !43, line: 541, baseType: !47, size: 32, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "value_index", scope: !187, file: !43, line: 545, baseType: !47, size: 32, offset: 352)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !187, file: !43, line: 548, baseType: !47, size: 32, offset: 384)
!199 = !DISubprogram(name: "halide_trace_event_t", scope: !187, file: !43, line: 553, type: !200, scopeLine: 553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !204, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !205, retainedTypes: !206, globals: !305, imports: !312, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/tracing.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!205 = !{!54, !91}
!206 = !{!14, !207, !130, !140, !291, !294, !192, !297, !298, !299, !300, !301, !302, !303, !304, !134, !6, !41, !121, !10}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "print", scope: !209, file: !208, line: 198, baseType: !210)
!208 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!209 = !DINamespace(scope: !2)
!210 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !209, file: !208, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !211, templateParams: !288)
!211 = !{!212, !213, !214, !215, !216, !217, !221, !225, !229, !234, !237, !242, !245, !249, !253, !256, !260, !263, !270, !273, !276, !281, !282, !285, !286, !287}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !210, file: !208, line: 32, baseType: !140, size: 64, flags: DIFlagPublic)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !210, file: !208, line: 32, baseType: !140, size: 64, offset: 64, flags: DIFlagPublic)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !210, file: !208, line: 32, baseType: !140, size: 64, offset: 128, flags: DIFlagPublic)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !210, file: !208, line: 33, baseType: !130, size: 64, offset: 192, flags: DIFlagPublic)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !210, file: !208, line: 34, baseType: !80, size: 8, offset: 256, flags: DIFlagPublic)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !210, file: !208, line: 35, baseType: !218, size: 8, offset: 264, flags: DIFlagPublic)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 1)
!221 = !DISubprogram(name: "Printer", scope: !210, file: !208, line: 37, type: !222, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224, !130, !140}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!225 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !210, file: !208, line: 57, type: !226, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !224, !134}
!228 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !210, size: 64)
!229 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !210, file: !208, line: 67, type: !230, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubroutineType(types: !231)
!231 = !{!228, !224, !232}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !15, line: 9, baseType: !233)
!233 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!234 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !210, file: !208, line: 72, type: !235, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!235 = !DISubroutineType(types: !236)
!236 = !{!228, !224, !47}
!237 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !210, file: !208, line: 77, type: !238, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubroutineType(types: !239)
!239 = !{!228, !224, !240}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 10, baseType: !241)
!241 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!242 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !210, file: !208, line: 82, type: !243, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!228, !224, !14}
!245 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !210, file: !208, line: 87, type: !246, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!228, !224, !248}
!248 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!249 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !210, file: !208, line: 92, type: !250, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!228, !224, !252}
!252 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!253 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !210, file: !208, line: 97, type: !254, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubroutineType(types: !255)
!255 = !{!228, !224, !125}
!256 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !210, file: !208, line: 102, type: !257, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!257 = !DISubroutineType(types: !258)
!258 = !{!228, !224, !259}
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!260 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !210, file: !208, line: 108, type: !261, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubroutineType(types: !262)
!262 = !{!228, !224, !81}
!263 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !210, file: !208, line: 113, type: !264, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!228, !224, !266}
!266 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !43, line: 1550, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !43, line: 1423, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS15halide_buffer_t")
!270 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !210, file: !208, line: 119, type: !271, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{!134, !224}
!273 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !210, file: !208, line: 131, type: !274, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !224}
!276 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !210, file: !208, line: 139, type: !277, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!277 = !DISubroutineType(types: !278)
!278 = !{!240, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!281 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !210, file: !208, line: 143, type: !277, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!282 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !210, file: !208, line: 148, type: !283, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !224, !48}
!285 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !210, file: !208, line: 158, type: !271, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !210, file: !208, line: 162, type: !274, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!287 = !DISubprogram(name: "~Printer", scope: !210, file: !208, line: 166, type: !274, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!288 = !{!289, !290}
!289 = !DITemplateValueParameter(name: "type", type: !48, value: i32 0)
!290 = !DITemplateValueParameter(name: "length", type: !241, value: i64 1024)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !15, line: 15, baseType: !293)
!293 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !15, line: 13, baseType: !296)
!296 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!305 = !{!0, !157, !159, !176, !178, !180, !306, !310}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "halide_custom_trace", linkageName: "_ZN6Halide7Runtime8Internal19halide_custom_traceE", scope: !2, file: !5, line: 327, type: !308, isLocal: false, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_fn", file: !5, line: 7, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_constu, 1048576, DW_OP_stack_value))
!311 = distinct !DIGlobalVariable(name: "buffer_size", scope: !2, file: !5, line: 76, type: !115, isLocal: true, isDefinition: true)
!312 = !{!313}
!313 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !203, entity: !2, file: !15, line: 225)
!314 = !{!315, !316, !317, !318, !319, !322, !323, !324, !325, !326, !327, !328, !329, !334, !402, !403, !407, !408, !410, !414}
!315 = !DILocalVariable(name: "user_context", arg: 1, scope: !182, file: !5, line: 160, type: !130)
!316 = !DILocalVariable(name: "e", arg: 2, scope: !182, file: !5, line: 160, type: !185)
!317 = !DILocalVariable(name: "my_id", scope: !182, file: !5, line: 163, type: !47)
!318 = !DILocalVariable(name: "fd", scope: !182, file: !5, line: 166, type: !48)
!319 = !DILocalVariable(name: "value_bytes", scope: !320, file: !5, line: 169, type: !14)
!320 = distinct !DILexicalBlock(scope: !321, file: !5, line: 167, column: 17)
!321 = distinct !DILexicalBlock(scope: !182, file: !5, line: 167, column: 9)
!322 = !DILocalVariable(name: "header_bytes", scope: !320, file: !5, line: 170, type: !14)
!323 = !DILocalVariable(name: "coords_bytes", scope: !320, file: !5, line: 171, type: !14)
!324 = !DILocalVariable(name: "name_bytes", scope: !320, file: !5, line: 172, type: !14)
!325 = !DILocalVariable(name: "trace_tag_bytes", scope: !320, file: !5, line: 173, type: !14)
!326 = !DILocalVariable(name: "total_size_without_padding", scope: !320, file: !5, line: 174, type: !14)
!327 = !DILocalVariable(name: "total_size", scope: !320, file: !5, line: 175, type: !14)
!328 = !DILocalVariable(name: "packet", scope: !320, file: !5, line: 178, type: !41)
!329 = !DILocalVariable(name: "buffer", scope: !330, file: !5, line: 211, type: !331)
!330 = distinct !DILexicalBlock(scope: !321, file: !5, line: 210, column: 12)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32768, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 4096)
!334 = !DILocalVariable(name: "ss", scope: !330, file: !5, line: 212, type: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<2, 4096>", scope: !209, file: !208, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !336, templateParams: !399)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !347, !351, !354, !357, !360, !363, !366, !369, !372, !375, !378, !381, !384, !387, !392, !393, !396, !397, !398}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !335, file: !208, line: 32, baseType: !140, size: 64, flags: DIFlagPublic)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !335, file: !208, line: 32, baseType: !140, size: 64, offset: 64, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !335, file: !208, line: 32, baseType: !140, size: 64, offset: 128, flags: DIFlagPublic)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !335, file: !208, line: 33, baseType: !130, size: 64, offset: 192, flags: DIFlagPublic)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !335, file: !208, line: 34, baseType: !80, size: 8, offset: 256, flags: DIFlagPublic)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !335, file: !208, line: 35, baseType: !218, size: 8, offset: 264, flags: DIFlagPublic)
!343 = !DISubprogram(name: "Printer", scope: !335, file: !208, line: 37, type: !344, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346, !130, !140}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!347 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEPKc", scope: !335, file: !208, line: 57, type: !348, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !346, !134}
!350 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !335, size: 64)
!351 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEx", scope: !335, file: !208, line: 67, type: !352, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DISubroutineType(types: !353)
!353 = !{!350, !346, !232}
!354 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEi", scope: !335, file: !208, line: 72, type: !355, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{!350, !346, !47}
!357 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEy", scope: !335, file: !208, line: 77, type: !358, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!350, !346, !240}
!360 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEj", scope: !335, file: !208, line: 82, type: !361, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubroutineType(types: !362)
!362 = !{!350, !346, !14}
!363 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEd", scope: !335, file: !208, line: 87, type: !364, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DISubroutineType(types: !365)
!365 = !{!350, !346, !248}
!366 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEf", scope: !335, file: !208, line: 92, type: !367, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!350, !346, !252}
!369 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsEPKv", scope: !335, file: !208, line: 97, type: !370, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!370 = !DISubroutineType(types: !371)
!371 = !{!350, !346, !125}
!372 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EE23write_float16_from_bitsEt", scope: !335, file: !208, line: 102, type: !373, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!350, !346, !259}
!375 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi2ELy4096EElsERK13halide_type_t", scope: !335, file: !208, line: 108, type: !376, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!376 = !DISubroutineType(types: !377)
!377 = !{!350, !346, !81}
