; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/msan.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/msan.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-unknown-unknown"

%"struct.Halide::Runtime::Internal::device_copy" = type { i64, i64, i64, [16 x i64], [16 x i64], [16 x i64], i64 }
%"class.Halide::Runtime::Internal::(anonymous namespace)::Printer" = type <{ i8*, i8*, i8*, i8*, i8, [1 x i8], [6 x i8] }>
%struct.halide_buffer_t = type { i64, %struct.halide_device_interface_t*, i8*, i64, %struct.halide_type_t, i32, %struct.halide_dimension_t*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !1, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, imports: !272, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/msan.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!2 = !{!3, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !4, line: 403, baseType: !5, size: 8, elements: !8, identifier: "_ZTS18halide_type_code_t")
!4 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 16, baseType: !7)
!6 = !DIFile(filename: "src/runtime/runtime_internal.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1415, baseType: !15, size: 32, elements: !16, identifier: "_ZTS19halide_buffer_flags")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2, isUnsigned: true)
!19 = !{!20, !21, !64, !233, !270, !60, !271, !30}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !23, file: !22, line: 203, baseType: !27)
!22 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!23 = !DINamespace(scope: !24)
!24 = !DINamespace(name: "Internal", scope: !25)
!25 = !DINamespace(name: "Runtime", scope: !26)
!26 = !DINamespace(name: "Halide", scope: null)
!27 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0, 1024>", scope: !23, file: !22, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !28, templateParams: !267)
!28 = !{!29, !32, !33, !34, !35, !37, !41, !45, !51, !56, !61, !66, !70, !74, !78, !83, !89, !122, !249, !252, !255, !260, !261, !264, !265, !266}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !27, file: !22, line: 32, baseType: !30, size: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !27, file: !22, line: 32, baseType: !30, size: 64, offset: 64, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !27, file: !22, line: 32, baseType: !30, size: 64, offset: 128, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !27, file: !22, line: 33, baseType: !20, size: 64, offset: 192, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !27, file: !22, line: 34, baseType: !36, size: 8, offset: 256, flags: DIFlagPublic)
!36 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !27, file: !22, line: 35, baseType: !38, size: 8, offset: 264, flags: DIFlagPublic)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DISubprogram(name: "Printer", scope: !27, file: !22, line: 37, type: !42, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44, !20, !30}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!45 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKc", scope: !27, file: !22, line: 57, type: !46, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !44, !49}
!48 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !27, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!51 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEx", scope: !27, file: !22, line: 67, type: !52, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!52 = !DISubroutineType(types: !53)
!53 = !{!48, !44, !54}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !6, line: 9, baseType: !55)
!55 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!56 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEi", scope: !27, file: !22, line: 72, type: !57, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!48, !44, !59}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !6, line: 11, baseType: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEy", scope: !27, file: !22, line: 77, type: !62, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!62 = !DISubroutineType(types: !63)
!63 = !{!48, !44, !64}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !6, line: 10, baseType: !65)
!65 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEj", scope: !27, file: !22, line: 82, type: !67, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!67 = !DISubroutineType(types: !68)
!68 = !{!48, !44, !69}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 12, baseType: !15)
!70 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEd", scope: !27, file: !22, line: 87, type: !71, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubroutineType(types: !72)
!72 = !{!48, !44, !73}
!73 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!74 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEf", scope: !27, file: !22, line: 92, type: !75, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!75 = !DISubroutineType(types: !76)
!76 = !{!48, !44, !77}
!77 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!78 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsEPKv", scope: !27, file: !22, line: 97, type: !79, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!79 = !DISubroutineType(types: !80)
!80 = !{!48, !44, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!83 = !DISubprogram(name: "write_float16_from_bits", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE23write_float16_from_bitsEt", scope: !27, file: !22, line: 102, type: !84, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!84 = !DISubroutineType(types: !85)
!85 = !{!48, !44, !86}
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 14, baseType: !88)
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK13halide_type_t", scope: !27, file: !22, line: 108, type: !90, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!90 = !DISubroutineType(types: !91)
!91 = !{!48, !44, !92}
!92 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !4, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !95, identifier: "_ZTS13halide_type_t")
!95 = !{!96, !98, !99, !100, !104, !107, !111, !114, !115, !116, !119}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !94, file: !4, line: 434, baseType: !97, size: 8, align: 8)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !4, line: 413, baseType: !3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !94, file: !4, line: 442, baseType: !5, size: 8, align: 8, offset: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !94, file: !4, line: 446, baseType: !87, size: 16, align: 16, offset: 16)
!100 = !DISubprogram(name: "halide_type_t", scope: !94, file: !4, line: 453, type: !101, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103, !97, !5, !87}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!104 = !DISubprogram(name: "halide_type_t", scope: !94, file: !4, line: 459, type: !105, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !103}
!107 = !DISubprogram(name: "with_lanes", linkageName: "_ZNK13halide_type_t10with_lanesEt", scope: !94, file: !4, line: 463, type: !108, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{!94, !110, !87}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!111 = !DISubprogram(name: "operator==", linkageName: "_ZNK13halide_type_teqERKS_", scope: !94, file: !4, line: 468, type: !112, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!112 = !DISubroutineType(types: !113)
!113 = !{!36, !110, !92}
!114 = !DISubprogram(name: "operator!=", linkageName: "_ZNK13halide_type_tneERKS_", scope: !94, file: !4, line: 472, type: !112, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!115 = !DISubprogram(name: "operator<", linkageName: "_ZNK13halide_type_tltERKS_", scope: !94, file: !4, line: 476, type: !112, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!116 = !DISubprogram(name: "bytes", linkageName: "_ZNK13halide_type_t5bytesEv", scope: !94, file: !4, line: 481, type: !117, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubroutineType(types: !118)
!118 = !{!60, !110}
!119 = !DISubprogram(name: "as_u32", linkageName: "_ZNK13halide_type_t6as_u32Ev", scope: !94, file: !4, line: 485, type: !120, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!120 = !DISubroutineType(types: !121)
!121 = !{!69, !110}
!122 = !DISubprogram(name: "operator<<", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EElsERK15halide_buffer_t", scope: !27, file: !22, line: 113, type: !123, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{!48, !44, !125}
!125 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !4, line: 1550, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !4, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !129, identifier: "_ZTS15halide_buffer_t")
!129 = !{!130, !131, !184, !186, !187, !188, !189, !212, !213, !218, !222, !225, !226, !229, !230, !235, !238, !239, !240, !245, !248}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !128, file: !4, line: 1425, baseType: !64, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !128, file: !4, line: 1428, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !4, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !135, identifier: "_ZTS25halide_device_interface_t")
!135 = !{!136, !141, !145, !146, !150, !151, !152, !153, !154, !158, !164, !168, !169, !173, !174, !179}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !134, file: !4, line: 724, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!60, !20, !140, !132}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !134, file: !4, line: 726, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!60, !20, !140}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !134, file: !4, line: 727, baseType: !142, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !134, file: !4, line: 728, baseType: !147, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !20, !132}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !134, file: !4, line: 730, baseType: !142, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !134, file: !4, line: 731, baseType: !137, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !134, file: !4, line: 733, baseType: !137, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !134, file: !4, line: 735, baseType: !142, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !134, file: !4, line: 736, baseType: !155, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!60, !20, !140, !132, !140}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !134, file: !4, line: 738, baseType: !159, size: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!60, !20, !162, !140}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !134, file: !4, line: 740, baseType: !165, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!60, !20, !162, !60, !60, !140}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !134, file: !4, line: 742, baseType: !142, size: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !134, file: !4, line: 743, baseType: !170, size: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!60, !20, !140, !64, !132}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !134, file: !4, line: 745, baseType: !142, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !134, file: !4, line: 746, baseType: !175, size: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!60, !20, !178, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !134, file: !4, line: 747, baseType: !180, size: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !183, line: 10, size: 1024, flags: DIFlagFwdDecl, identifier: "_ZTS30halide_device_interface_impl_t")
!183 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !128, file: !4, line: 1433, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !128, file: !4, line: 1436, baseType: !64, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !4, line: 1439, baseType: !94, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !128, file: !4, line: 1442, baseType: !59, size: 32, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !128, file: !4, line: 1446, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !4, line: 1409, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !4, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !193, identifier: "_ZTS18halide_dimension_t")
!193 = !{!194, !195, !196, !197, !198, !202, !205, !211}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !192, file: !4, line: 1383, baseType: !59, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !192, file: !4, line: 1383, baseType: !59, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !192, file: !4, line: 1383, baseType: !59, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !4, line: 1386, baseType: !69, size: 32, offset: 96)
!198 = !DISubprogram(name: "halide_dimension_t", scope: !192, file: !4, line: 1388, type: !199, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!202 = !DISubprogram(name: "halide_dimension_t", scope: !192, file: !4, line: 1389, type: !203, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !201, !59, !59, !59, !69}
!205 = !DISubprogram(name: "operator==", linkageName: "_ZNK18halide_dimension_teqERKS_", scope: !192, file: !4, line: 1393, type: !206, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{!36, !208, !210}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !209, size: 64)
!211 = !DISubprogram(name: "operator!=", linkageName: "_ZNK18halide_dimension_tneERKS_", scope: !192, file: !4, line: 1400, type: !206, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !128, file: !4, line: 1449, baseType: !20, size: 64, offset: 384)
!213 = !DISubprogram(name: "get_flag", linkageName: "_ZNK15halide_buffer_t8get_flagE19halide_buffer_flags", scope: !128, file: !4, line: 1454, type: !214, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DISubroutineType(types: !215)
!215 = !{!36, !216, !217}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !4, line: 1416, baseType: !14)
!218 = !DISubprogram(name: "set_flag", linkageName: "_ZN15halide_buffer_t8set_flagE19halide_buffer_flagsb", scope: !128, file: !4, line: 1458, type: !219, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !217, !36}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!222 = !DISubprogram(name: "host_dirty", linkageName: "_ZNK15halide_buffer_t10host_dirtyEv", scope: !128, file: !4, line: 1466, type: !223, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!223 = !DISubroutineType(types: !224)
!224 = !{!36, !216}
!225 = !DISubprogram(name: "device_dirty", linkageName: "_ZNK15halide_buffer_t12device_dirtyEv", scope: !128, file: !4, line: 1470, type: !223, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!226 = !DISubprogram(name: "set_host_dirty", linkageName: "_ZN15halide_buffer_t14set_host_dirtyEb", scope: !128, file: !4, line: 1474, type: !227, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !221, !36}
!229 = !DISubprogram(name: "set_device_dirty", linkageName: "_ZN15halide_buffer_t16set_device_dirtyEb", scope: !128, file: !4, line: 1478, type: !227, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubprogram(name: "number_of_elements", linkageName: "_ZNK15halide_buffer_t18number_of_elementsEv", scope: !128, file: !4, line: 1485, type: !231, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !216}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 27, baseType: !234)
!234 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!235 = !DISubprogram(name: "begin", linkageName: "_ZNK15halide_buffer_t5beginEv", scope: !128, file: !4, line: 1495, type: !236, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!236 = !DISubroutineType(types: !237)
!237 = !{!185, !216}
!238 = !DISubprogram(name: "end", linkageName: "_ZNK15halide_buffer_t3endEv", scope: !128, file: !4, line: 1506, type: !236, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DISubprogram(name: "size_in_bytes", linkageName: "_ZNK15halide_buffer_t13size_in_bytesEv", scope: !128, file: !4, line: 1518, type: !231, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubprogram(name: "address_of", linkageName: "_ZNK15halide_buffer_t10address_ofEPKi", scope: !128, file: !4, line: 1523, type: !241, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!241 = !DISubroutineType(types: !242)
!242 = !{!185, !216, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!245 = !DISubprogram(name: "device_sync", linkageName: "_ZN15halide_buffer_t11device_syncEPv", scope: !128, file: !4, line: 1534, type: !246, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!60, !221, !20}
!248 = !DISubprogram(name: "is_bounds_query", linkageName: "_ZNK15halide_buffer_t15is_bounds_queryEv", scope: !128, file: !4, line: 1545, type: !223, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DISubprogram(name: "str", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE3strEv", scope: !27, file: !22, line: 119, type: !250, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!49, !44}
!252 = !DISubprogram(name: "clear", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5clearEv", scope: !27, file: !22, line: 131, type: !253, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !44}
!255 = !DISubprogram(name: "size", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE4sizeEv", scope: !27, file: !22, line: 139, type: !256, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!64, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!260 = !DISubprogram(name: "capacity", linkageName: "_ZNK6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE8capacityEv", scope: !27, file: !22, line: 143, type: !256, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DISubprogram(name: "erase", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE5eraseEi", scope: !27, file: !22, line: 148, type: !262, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !44, !60}
!264 = !DISubprogram(name: "allocation_error", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE16allocation_errorEv", scope: !27, file: !22, line: 158, type: !250, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "_ZN6Halide7Runtime8Internal12_GLOBAL__N_17PrinterILi0ELy1024EE28msan_annotate_is_initializedEv", scope: !27, file: !22, line: 162, type: !253, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DISubprogram(name: "~Printer", scope: !27, file: !22, line: 166, type: !253, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!267 = !{!268, !269}
!268 = !DITemplateValueParameter(name: "type", type: !60, value: i32 0)
!269 = !DITemplateValueParameter(name: "length", type: !65, value: i64 1024)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "print", scope: !23, file: !22, line: 198, baseType: !27)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!272 = !{!273}
!273 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !24, file: !6, line: 225)
!274 = !{i32 7, !"Dwarf Version", i32 4}
!275 = !{i32 2, !"Debug Info Version", i32 3}
!276 = !{i32 1, !"wchar_size", i32 4}
!277 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!278 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "_ZN6Halide7Runtime8Internal18copy_memory_helperERKNS1_11device_copyEixx", scope: !24, file: !279, line: 47, type: !280, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !296)
!279 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde")
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282, !60, !54, !54}
!282 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !24, file: !279, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !285, identifier: "_ZTSN6Halide7Runtime8Internal11device_copyE")
!285 = !{!286, !287, !288, !289, !293, !294, !295}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !284, file: !279, line: 35, baseType: !64, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !284, file: !279, line: 35, baseType: !64, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !284, file: !279, line: 37, baseType: !64, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !284, file: !279, line: 39, baseType: !290, size: 1024, offset: 192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !284, file: !279, line: 41, baseType: !290, size: 1024, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !284, file: !279, line: 42, baseType: !290, size: 1024, offset: 2240)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !284, file: !279, line: 44, baseType: !64, size: 64, offset: 3264)
!296 = !{!297, !298, !299, !300, !301, !304, !305}
!297 = !DILocalVariable(name: "copy", arg: 1, scope: !278, file: !279, line: 47, type: !282)
!298 = !DILocalVariable(name: "d", arg: 2, scope: !278, file: !279, line: 47, type: !60)
!299 = !DILocalVariable(name: "src_off", arg: 3, scope: !278, file: !279, line: 47, type: !54)
!300 = !DILocalVariable(name: "dst_off", arg: 4, scope: !278, file: !279, line: 47, type: !54)
!301 = !DILocalVariable(name: "from", scope: !302, file: !279, line: 54, type: !81)
!302 = distinct !DILexicalBlock(scope: !303, file: !279, line: 53, column: 18)
!303 = distinct !DILexicalBlock(scope: !278, file: !279, line: 53, column: 9)
!304 = !DILocalVariable(name: "to", scope: !302, file: !279, line: 55, type: !20)
!305 = !DILocalVariable(name: "i", scope: !306, file: !279, line: 58, type: !64)
!306 = distinct !DILexicalBlock(scope: !307, file: !279, line: 58, column: 9)
!307 = distinct !DILexicalBlock(scope: !303, file: !279, line: 57, column: 12)
!308 = !DILocation(line: 0, scope: !278)
!309 = !DILocation(line: 49, column: 14, scope: !278)
!310 = !DILocation(line: 49, column: 19, scope: !278)
!311 = !DILocation(line: 49, column: 22, scope: !278)
!312 = !{!313, !313, i64 0}
!313 = !{!"long long", !314, i64 0}
!314 = !{!"omnipotent char", !315, i64 0}
!315 = !{!"Simple C++ TBAA"}
!316 = !DILocation(line: 49, column: 37, scope: !278)
!317 = !DILocation(line: 49, column: 5, scope: !278)
!318 = !DILocation(line: 50, column: 10, scope: !319)
!319 = distinct !DILexicalBlock(scope: !278, file: !279, line: 49, column: 43)
!320 = distinct !{!320, !317, !321, !322}
!321 = !DILocation(line: 51, column: 5, scope: !278)
!322 = !{!"llvm.loop.mustprogress"}
!323 = !DILocation(line: 53, column: 11, scope: !303)
!324 = !DILocation(line: 53, column: 9, scope: !278)
!325 = !DILocation(line: 0, scope: !306)
!326 = !DILocation(line: 58, column: 34, scope: !327)
!327 = distinct !DILexicalBlock(scope: !306, file: !279, line: 58, column: 9)
!328 = !DILocation(line: 58, column: 32, scope: !327)
!329 = !DILocation(line: 58, column: 9, scope: !306)
!330 = !DILocation(line: 54, column: 42, scope: !302)
!331 = !{!332, !313, i64 0}
!332 = !{!"_ZTSN6Halide7Runtime8Internal11device_copyE", !313, i64 0, !313, i64 8, !313, i64 16, !314, i64 24, !314, i64 152, !314, i64 280, !313, i64 408}
!333 = !DILocation(line: 54, column: 46, scope: !302)
!334 = !DILocation(line: 54, column: 28, scope: !302)
!335 = !DILocation(line: 0, scope: !302)
!336 = !DILocation(line: 55, column: 34, scope: !302)
!337 = !{!332, !313, i64 8}
!338 = !DILocation(line: 55, column: 38, scope: !302)
!339 = !DILocation(line: 55, column: 20, scope: !302)
!340 = !DILocation(line: 56, column: 31, scope: !302)
!341 = !{!332, !313, i64 408}
!342 = !DILocation(line: 56, column: 9, scope: !302)
!343 = !DILocation(line: 57, column: 5, scope: !302)
!344 = !DILocation(line: 59, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !327, file: !279, line: 58, column: 55)
!346 = !DILocation(line: 60, column: 24, scope: !345)
!347 = !DILocation(line: 60, column: 21, scope: !345)
!348 = !DILocation(line: 61, column: 24, scope: !345)
!349 = !DILocation(line: 61, column: 21, scope: !345)
!350 = !DILocation(line: 58, column: 51, scope: !327)
!351 = distinct !{!351, !329, !352, !322}
!352 = !DILocation(line: 62, column: 9, scope: !306)
!353 = !DILocation(line: 64, column: 1, scope: !278)
!354 = !DISubprogram(name: "memcpy", scope: !6, file: !6, line: 94, type: !355, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!20, !20, !81, !234}
!357 = !{}
