; ModuleID = '/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_opencl.cpp'
source_filename = "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_opencl.cpp"
target datalayout = "e-m:e-v128:32-v16:16-v32:32-v96:32-n8:16:32:64-S128"
target triple = "le64-unknown-windows-msvc19.11.0"

%struct._cl_platform_id = type opaque
%struct._cl_device_id = type opaque
%struct._cl_context = type opaque
%struct._cl_command_queue = type opaque
%struct._cl_mem = type opaque
%struct._cl_image_format = type { i32, i32 }
%struct._cl_image_desc = type { i32, [4 x i8], i64, i64, i64, i64, i64, i64, i32, i32, %struct._cl_mem* }
%struct._cl_program = type opaque
%struct._cl_kernel = type opaque
%struct._cl_event = type opaque
%"class.Halide::Internal::GPUCompilationCache" = type { %struct.halide_mutex, i32, %"struct.Halide::Internal::GPUCompilationCache<_cl_context *, _cl_program *>::CachedCompilation"*, i32, i32 }
%struct.halide_mutex = type { [1 x i64] }
%"struct.Halide::Internal::GPUCompilationCache<_cl_context *, _cl_program *>::CachedCompilation" = type { %struct._cl_context*, %struct._cl_program*, i32, i32 }

!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!10, !76}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "clReleaseContext", linkageName: "?clReleaseContext@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_context@@@ZEA", scope: !2, file: !6, line: 76, type: !100, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "clGetContextInfo", linkageName: "?clGetContextInfo@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_context@@IKPEAXPEAK@ZEA", scope: !2, file: !6, line: 79, type: !107, isLocal: false, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!10, !76, !110, !29, !31, !32}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_context_info", file: !11, line: 79, baseType: !15)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "clCreateCommandQueue", linkageName: "?clCreateCommandQueue@OpenCL@Internal@Runtime@Halide@@3P6APEAU_cl_command_queue@@PEAU_cl_context@@PEAU_cl_device_id@@_KPEAH@ZEA", scope: !2, file: !6, line: 87, type: !113, isLocal: false, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !76, !44, !119, !92}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_command_queue", file: !11, line: 58, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_command_queue", file: !11, line: 58, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_command_queue@@")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_command_queue_properties", file: !11, line: 74, baseType: !39)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "clRetainCommandQueue", linkageName: "?clRetainCommandQueue@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@@ZEA", scope: !2, file: !6, line: 93, type: !122, isLocal: false, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!10, !116}
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "clReleaseCommandQueue", linkageName: "?clReleaseCommandQueue@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@@ZEA", scope: !2, file: !6, line: 96, type: !122, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "clGetCommandQueueInfo", linkageName: "?clGetCommandQueueInfo@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@IKPEAXPEAK@ZEA", scope: !2, file: !6, line: 99, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!10, !116, !132, !29, !31, !32}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_command_queue_info", file: !11, line: 80, baseType: !15)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "clCreateBuffer", linkageName: "?clCreateBuffer@OpenCL@Internal@Runtime@Halide@@3P6APEAU_cl_mem@@PEAU_cl_context@@_KKPEAXPEAH@ZEA", scope: !2, file: !6, line: 107, type: !135, isLocal: false, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !76, !141, !29, !31, !92}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem", file: !11, line: 59, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_mem", file: !11, line: 59, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_mem@@")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem_flags", file: !11, line: 83, baseType: !39)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "clCreateSubBuffer", linkageName: "?clCreateSubBuffer@OpenCL@Internal@Runtime@Halide@@3P6APEAU_cl_mem@@PEAU5@_KIPEBXPEAH@ZEA", scope: !2, file: !6, line: 114, type: !144, isLocal: false, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!138, !138, !141, !147, !90, !92}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_buffer_create_type", file: !11, line: 88, baseType: !15)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "clCreateImage", linkageName: "?clCreateImage@OpenCL@Internal@Runtime@Halide@@3P6APEAU_cl_mem@@PEAU_cl_context@@_KPEBU_cl_image_format@@PEBU_cl_image_desc@@PEAXPEAH@ZEA", scope: !2, file: !6, line: 121, type: !150, isLocal: false, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!138, !76, !141, !153, !162, !31, !92}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_image_format", file: !11, line: 110, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_image_format", file: !11, line: 107, size: 64, flags: DIFlagTypePassByValue, elements: !157, identifier: ".?AU_cl_image_format@@")
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "image_channel_order", scope: !156, file: !11, line: 108, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_channel_order", file: !11, line: 81, baseType: !15)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "image_channel_data_type", scope: !156, file: !11, line: 109, baseType: !161, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_channel_type", file: !11, line: 82, baseType: !15)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_image_desc", file: !11, line: 123, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_image_desc", file: !11, line: 112, size: 576, flags: DIFlagTypePassByValue, elements: !166, identifier: ".?AU_cl_image_desc@@")
!166 = !{!167, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "image_type", scope: !165, file: !11, line: 113, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem_object_type", file: !11, line: 84, baseType: !15)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !165, file: !11, line: 114, baseType: !29, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !165, file: !11, line: 115, baseType: !29, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "image_depth", scope: !165, file: !11, line: 116, baseType: !29, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "image_array_size", scope: !165, file: !11, line: 117, baseType: !29, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "image_row_pitch", scope: !165, file: !11, line: 118, baseType: !29, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "image_slice_pitch", scope: !165, file: !11, line: 119, baseType: !29, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_mip_levels", scope: !165, file: !11, line: 120, baseType: !15, size: 32, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "num_samples", scope: !165, file: !11, line: 121, baseType: !15, size: 32, offset: 480)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !165, file: !11, line: 122, baseType: !138, size: 64, offset: 512)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "clRetainMemObject", linkageName: "?clRetainMemObject@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_mem@@@ZEA", scope: !2, file: !6, line: 129, type: !180, isLocal: false, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!10, !138}
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "clReleaseMemObject", linkageName: "?clReleaseMemObject@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_mem@@@ZEA", scope: !2, file: !6, line: 132, type: !180, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "clGetSupportedImageFormats", linkageName: "?clGetSupportedImageFormats@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_context@@_KIIPEAU_cl_image_format@@PEAI@ZEA", scope: !2, file: !6, line: 135, type: !187, isLocal: false, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!10, !76, !141, !168, !15, !190, !22}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "clGetMemObjectInfo", linkageName: "?clGetMemObjectInfo@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_mem@@IKPEAXPEAK@ZEA", scope: !2, file: !6, line: 143, type: !193, isLocal: false, isDefinition: true)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!10, !138, !196, !29, !31, !32}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_mem_info", file: !11, line: 85, baseType: !15)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "clGetImageInfo", linkageName: "?clGetImageInfo@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_mem@@IKPEAXPEAK@ZEA", scope: !2, file: !6, line: 150, type: !199, isLocal: false, isDefinition: true)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!10, !138, !202, !29, !31, !32}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_image_info", file: !11, line: 87, baseType: !15)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "clSetMemObjectDestructorCallback", linkageName: "?clSetMemObjectDestructorCallback@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_mem@@P6AX0PEAX@Z1@ZEA", scope: !2, file: !6, line: 157, type: !205, isLocal: false, isDefinition: true)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!10, !138, !208, !31}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !138, !31}
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "clCreateProgramWithSource", linkageName: "?clCreateProgramWithSource@OpenCL@Internal@Runtime@Halide@@3P6APEAU_cl_program@@PEAU_cl_context@@IPEAPEBDPEBKPEAH@ZEA", scope: !2, file: !6, line: 163, type: !213, isLocal: false, isDefinition: true)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !76, !15, !219, !220, !92}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_program", file: !11, line: 60, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_program", file: !11, line: 60, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_program@@")
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "clRetainProgram", linkageName: "?clRetainProgram@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_program@@@ZEA", scope: !2, file: !6, line: 169, type: !224, isLocal: false, isDefinition: true)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!10, !216}
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "clReleaseProgram", linkageName: "?clReleaseProgram@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_program@@@ZEA", scope: !2, file: !6, line: 172, type: !224, isLocal: false, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "clBuildProgram", linkageName: "?clBuildProgram@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_program@@IPEBQEAU_cl_device_id@@PEBDP6AX0PEAX@Z3@ZEA", scope: !2, file: !6, line: 175, type: !231, isLocal: false, isDefinition: true)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!10, !216, !15, !82, !87, !234, !31}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !216, !31}
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "clGetProgramBuildInfo", linkageName: "?clGetProgramBuildInfo@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_program@@PEAU_cl_device_id@@IKPEAXPEAK@ZEA", scope: !2, file: !6, line: 183, type: !239, isLocal: false, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!10, !216, !44, !242, !29, !31, !32}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_program_build_info", file: !11, line: 94, baseType: !15)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "clCreateKernel", linkageName: "?clCreateKernel@OpenCL@Internal@Runtime@Halide@@3P6APEAU_cl_kernel@@PEAU_cl_program@@PEBDPEAH@ZEA", scope: !2, file: !6, line: 192, type: !245, isLocal: false, isDefinition: true)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !216, !87, !92}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_kernel", file: !11, line: 61, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_kernel", file: !11, line: 61, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_kernel@@")
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "clRetainKernel", linkageName: "?clRetainKernel@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_kernel@@@ZEA", scope: !2, file: !6, line: 197, type: !253, isLocal: false, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!10, !248}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "clReleaseKernel", linkageName: "?clReleaseKernel@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_kernel@@@ZEA", scope: !2, file: !6, line: 200, type: !253, isLocal: false, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "clSetKernelArg", linkageName: "?clSetKernelArg@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_kernel@@IKPEBX@ZEA", scope: !2, file: !6, line: 203, type: !260, isLocal: false, isDefinition: true)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!10, !248, !15, !29, !90}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "clFlush", linkageName: "?clFlush@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@@ZEA", scope: !2, file: !6, line: 210, type: !122, isLocal: false, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "clFinish", linkageName: "?clFinish@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@@ZEA", scope: !2, file: !6, line: 213, type: !122, isLocal: false, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "clEnqueueReadBuffer", linkageName: "?clEnqueueReadBuffer@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@IKKPEAXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 217, type: !269, isLocal: false, isDefinition: true)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!10, !116, !138, !272, !29, !29, !31, !15, !273, !278}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_bool", file: !11, line: 65, baseType: !15)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_event", file: !11, line: 62, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cl_event", file: !11, line: 62, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: ".?AU_cl_event@@")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "clEnqueueReadBufferRect", linkageName: "?clEnqueueReadBufferRect@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@IPEBK22KKKKPEAXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 228, type: !281, isLocal: false, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!10, !116, !138, !272, !220, !220, !220, !29, !29, !29, !29, !31, !15, !273, !278}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "clEnqueueWriteBuffer", linkageName: "?clEnqueueWriteBuffer@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@IKKPEBXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 244, type: !286, isLocal: false, isDefinition: true)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!10, !116, !138, !272, !29, !29, !90, !15, !273, !278}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "clEnqueueWriteBufferRect", linkageName: "?clEnqueueWriteBufferRect@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@IPEBK22KKKKPEBXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 255, type: !291, isLocal: false, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!10, !116, !138, !272, !220, !220, !220, !29, !29, !29, !29, !90, !15, !273, !278}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "clEnqueueCopyBuffer", linkageName: "?clEnqueueCopyBuffer@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@1KKKIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 272, type: !296, isLocal: false, isDefinition: true)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!10, !116, !138, !138, !29, !29, !29, !15, !273, !278}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "clEnqueueReadImage", linkageName: "?clEnqueueReadImage@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@IPEBK2KKPEAXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 283, type: !301, isLocal: false, isDefinition: true)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!10, !116, !138, !272, !220, !220, !29, !29, !31, !15, !273, !278}
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "clEnqueueWriteImage", linkageName: "?clEnqueueWriteImage@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@IPEBK2KKPEBXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 296, type: !306, isLocal: false, isDefinition: true)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!10, !116, !138, !272, !220, !220, !29, !29, !90, !15, !273, !278}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "clEnqueueMapBuffer", linkageName: "?clEnqueueMapBuffer@OpenCL@Internal@Runtime@Halide@@3P6APEAXPEAU_cl_command_queue@@PEAU_cl_mem@@I_KKKIPEBQEAU_cl_event@@PEAPEAU7@PEAH@ZEA", scope: !2, file: !6, line: 309, type: !311, isLocal: false, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!31, !116, !138, !272, !314, !29, !29, !15, !273, !278, !92}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "cl_map_flags", file: !11, line: 92, baseType: !39)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "clEnqueueMapImage", linkageName: "?clEnqueueMapImage@OpenCL@Internal@Runtime@Halide@@3P6APEAXPEAU_cl_command_queue@@PEAU_cl_mem@@I_KPEBK3PEAK4IPEBQEAU_cl_event@@PEAPEAU7@PEAH@ZEA", scope: !2, file: !6, line: 321, type: !317, isLocal: false, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!31, !116, !138, !272, !314, !220, !220, !32, !32, !15, !273, !278, !92}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "clEnqueueUnmapMemObject", linkageName: "?clEnqueueUnmapMemObject@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_mem@@PEAXIPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 335, type: !322, isLocal: false, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!10, !116, !138, !31, !15, !273, !278}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "clEnqueueNDRangeKernel", linkageName: "?clEnqueueNDRangeKernel@OpenCL@Internal@Runtime@Halide@@3P6AHPEAU_cl_command_queue@@PEAU_cl_kernel@@IPEBK22IPEBQEAU_cl_event@@PEAPEAU7@@ZEA", scope: !2, file: !6, line: 343, type: !327, isLocal: false, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!10, !116, !248, !15, !220, !220, !220, !15, !273, !278}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "lib_opencl", linkageName: "?lib_opencl@OpenCL@Internal@Runtime@Halide@@3PEAXEA", scope: !2, file: !332, line: 26, type: !31, isLocal: false, isDefinition: true)
!332 = !DIFile(filename: "src/runtime/opencl.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a2eaa692364ff55491af6d94d2d38fe2")
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "context", linkageName: "?context@OpenCL@Internal@Runtime@Halide@@3PEAU_cl_context@@EA", scope: !2, file: !332, line: 86, type: !76, isLocal: false, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "command_queue", linkageName: "?command_queue@OpenCL@Internal@Runtime@Halide@@3PEAU_cl_command_queue@@EA", scope: !2, file: !332, line: 87, type: !116, isLocal: false, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "thread_lock", linkageName: "?thread_lock@OpenCL@Internal@Runtime@Halide@@3DC", scope: !2, file: !332, line: 88, type: !339, isLocal: false, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomicFlag", scope: !342, file: !341, line: 11, baseType: !89)
!341 = !DIFile(filename: "src/runtime/scoped_spin_lock.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "5cf5ff4091fc972c00e0f2f3144d40ad")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedSpinLock", scope: !3, file: !341, line: 9, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !343, identifier: ".?AUScopedSpinLock@Internal@Runtime@Halide@@")
!343 = !{!340, !344, !347, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !341, line: 13, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!347 = !DISubprogram(name: "ScopedSpinLock", scope: !342, file: !341, line: 15, type: !348, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350, !346}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!351 = !DISubprogram(name: "~ScopedSpinLock", scope: !342, file: !341, line: 22, type: !352, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !350}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "platform_name", linkageName: "?platform_name@OpenCL@Internal@Runtime@Halide@@3PADA", scope: !2, file: !332, line: 90, type: !356, isLocal: false, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 256)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "platform_name_lock", linkageName: "?platform_name_lock@OpenCL@Internal@Runtime@Halide@@3DA", scope: !2, file: !332, line: 91, type: !340, isLocal: false, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "platform_name_initialized", linkageName: "?platform_name_initialized@OpenCL@Internal@Runtime@Halide@@3_NA", scope: !2, file: !332, line: 92, type: !363, isLocal: false, isDefinition: true)
!363 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "device_type", linkageName: "?device_type@OpenCL@Internal@Runtime@Halide@@3PADA", scope: !2, file: !332, line: 94, type: !356, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "device_type_lock", linkageName: "?device_type_lock@OpenCL@Internal@Runtime@Halide@@3DA", scope: !2, file: !332, line: 95, type: !340, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "device_type_initialized", linkageName: "?device_type_initialized@OpenCL@Internal@Runtime@Halide@@3_NA", scope: !2, file: !332, line: 96, type: !363, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "build_options", linkageName: "?build_options@OpenCL@Internal@Runtime@Halide@@3PADA", scope: !2, file: !332, line: 98, type: !372, isLocal: false, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 1024)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "build_options_lock", linkageName: "?build_options_lock@OpenCL@Internal@Runtime@Halide@@3DA", scope: !2, file: !332, line: 99, type: !340, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "build_options_initialized", linkageName: "?build_options_initialized@OpenCL@Internal@Runtime@Halide@@3_NA", scope: !2, file: !332, line: 100, type: !363, isLocal: false, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "compilation_cache", linkageName: "?compilation_cache@OpenCL@Internal@Runtime@Halide@@3V?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@24@A", scope: !2, file: !332, line: 298, type: !381, isLocal: false, isDefinition: true)
!381 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GPUCompilationCache<_cl_context *,_cl_program *>", scope: !383, file: !382, line: 8, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !384, templateParams: !441, identifier: ".?AV?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@")
!382 = !DIFile(filename: "src/runtime/gpu_context_common.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "24284584ab13511a21d3d0444c1ab74f")
!383 = !DINamespace(name: "Internal", scope: !5)
!384 = !{!385, !395, !404, !407, !409, !410, !412, !413, !415, !416, !417, !420, !426, !431, !435, !438}
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CachedCompilation", scope: !381, file: !382, line: 9, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !386, identifier: ".?AUCachedCompilation@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@")
!386 = !{!387, !388, !389, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !385, file: !382, line: 10, baseType: !77, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "module_state", scope: !385, file: !382, line: 11, baseType: !217, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_id", scope: !385, file: !382, line: 12, baseType: !16, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "use_count", scope: !385, file: !382, line: 13, baseType: !16, size: 32, offset: 160)
!391 = !DISubprogram(name: "CachedCompilation", scope: !385, file: !382, line: 15, type: !392, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394, !77, !217, !16, !16}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !381, file: !382, line: 22, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_mutex", file: !397, line: 120, size: 64, flags: DIFlagTypePassByValue, elements: !398, identifier: ".?AUhalide_mutex@@")
!397 = !DIFile(filename: "src/runtime/HalideRuntime.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "b7ab0d29491f0813a909553a9435c0e2")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !396, file: !397, line: 121, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 64, elements: !402)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 61, baseType: !41)
!402 = !{!403}
!403 = !DISubrange(count: 1)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "kLoadFactor", scope: !381, file: !382, line: 24, baseType: !405, flags: DIFlagStaticMember)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!406 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "kInitialTableBits", scope: !381, file: !382, line: 25, baseType: !408, flags: DIFlagStaticMember)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "log2_compilations_size", scope: !381, file: !382, line: 26, baseType: !14, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "compilations", scope: !381, file: !382, line: 27, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !381, file: !382, line: 28, baseType: !14, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "kInvalidId", scope: !381, file: !382, line: 30, baseType: !414, flags: DIFlagStaticMember)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "kDeletedId", scope: !381, file: !382, line: 31, baseType: !414, flags: DIFlagStaticMember)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !381, file: !382, line: 33, baseType: !16, size: 32, offset: 224)
!417 = !DISubprogram(name: "kernel_hash", linkageName: "?kernel_hash@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@SA_KPEAU_cl_context@@II@Z", scope: !381, file: !382, line: 36, type: !418, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!418 = !DISubroutineType(types: !419)
!419 = !{!401, !77, !16, !16}
!420 = !DISubprogram(name: "insert", linkageName: "?insert@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@QEAA_NAEBUCachedCompilation@123@@Z", scope: !381, file: !382, line: 47, type: !421, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{!363, !423, !424}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!424 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!426 = !DISubprogram(name: "find_internal", linkageName: "?find_internal@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@QEAA_NPEAU_cl_context@@IAEAPEAPEAU_cl_program@@H@Z", scope: !381, file: !382, line: 73, type: !427, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DISubroutineType(types: !428)
!428 = !{!363, !423, !77, !16, !429, !14}
!429 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!431 = !DISubprogram(name: "lookup", linkageName: "?lookup@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@QEAA_NPEAU_cl_context@@PEAXAEAPEAU_cl_program@@@Z", scope: !381, file: !382, line: 97, type: !432, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!432 = !DISubroutineType(types: !433)
!433 = !{!363, !423, !77, !31, !434}
!434 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !217, size: 64)
!435 = !DISubprogram(name: "resize_table", linkageName: "?resize_table@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@QEAA_NH@Z", scope: !381, file: !382, line: 108, type: !436, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DISubroutineType(types: !437)
!437 = !{!363, !423, !14}
!438 = !DISubprogram(name: "release_hold", linkageName: "?release_hold@?$GPUCompilationCache@PEAU_cl_context@@PEAU_cl_program@@@Internal@Halide@@QEAAXPEAXPEAU_cl_context@@0@Z", scope: !381, file: !382, line: 211, type: !439, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !423, !31, !77, !31}
!441 = !{!442, !443}
!442 = !DITemplateTypeParameter(name: "ContextT", type: !77)
!443 = !DITemplateTypeParameter(name: "ModuleStateT", type: !217)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "opencl_device_interface", linkageName: "?opencl_device_interface@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_t@@A", scope: !2, file: !332, line: 1516, type: !446, isLocal: false, isDefinition: true)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_t", file: !397, line: 723, size: 1024, flags: DIFlagTypePassByValue, elements: !447, identifier: ".?AUhalide_device_interface_t@@")
!447 = !{!448, !567, !571, !572, !576, !577, !578, !579, !580, !584, !589, !593, !594, !598, !599, !604}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !446, file: !397, line: 724, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!14, !31, !452, !457}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_buffer_t", file: !397, line: 1423, size: 448, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !454, identifier: ".?AUhalide_buffer_t@@")
!454 = !{!455, !456, !459, !463, !464, !504, !505, !528, !529, !539, !543, !546, !547, !550, !551, !554, !557, !558, !559, !563, !566}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !453, file: !397, line: 1425, baseType: !41, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "device_interface", scope: !453, file: !397, line: 1428, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !453, file: !397, line: 1433, baseType: !460, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 16, baseType: !462)
!462 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !453, file: !397, line: 1436, baseType: !41, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !397, line: 1439, baseType: !465, size: 32, offset: 256)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_type_t", file: !397, line: 430, size: 32, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !466, identifier: ".?AUhalide_type_t@@")
!466 = !{!467, !476, !477, !480, !484, !487, !492, !496, !497, !498, !501}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !465, file: !397, line: 434, baseType: !468, size: 8, align: 8)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_type_code_t", file: !397, line: 413, baseType: !469)
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_type_code_t", file: !397, line: 403, baseType: !461, size: 8, elements: !470, identifier: ".?AW4halide_type_code_t@@")
!470 = !{!471, !472, !473, !474, !475}
!471 = !DIEnumerator(name: "halide_type_int", value: 0, isUnsigned: true)
!472 = !DIEnumerator(name: "halide_type_uint", value: 1, isUnsigned: true)
!473 = !DIEnumerator(name: "halide_type_float", value: 2, isUnsigned: true)
!474 = !DIEnumerator(name: "halide_type_handle", value: 3, isUnsigned: true)
!475 = !DIEnumerator(name: "halide_type_bfloat", value: 4, isUnsigned: true)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !465, file: !397, line: 442, baseType: !461, size: 8, align: 8, offset: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lanes", scope: !465, file: !397, line: 446, baseType: !478, size: 16, align: 16, offset: 16)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 14, baseType: !479)
!479 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!480 = !DISubprogram(name: "halide_type_t", scope: !465, file: !397, line: 453, type: !481, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !483, !468, !461, !478}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!484 = !DISubprogram(name: "halide_type_t", scope: !465, file: !397, line: 459, type: !485, scopeLine: 459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !483}
!487 = !DISubprogram(name: "with_lanes", linkageName: "?with_lanes@halide_type_t@@QEBA?AU1@G@Z", scope: !465, file: !397, line: 463, type: !488, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DISubroutineType(types: !489)
!489 = !{!465, !490, !478}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!492 = !DISubprogram(name: "operator==", linkageName: "??8halide_type_t@@QEBA_NAEBU0@@Z", scope: !465, file: !397, line: 468, type: !493, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{!363, !490, !495}
!495 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !491, size: 64)
!496 = !DISubprogram(name: "operator!=", linkageName: "??9halide_type_t@@QEBA_NAEBU0@@Z", scope: !465, file: !397, line: 472, type: !493, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DISubprogram(name: "operator<", linkageName: "??Mhalide_type_t@@QEBA_NAEBU0@@Z", scope: !465, file: !397, line: 476, type: !493, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubprogram(name: "bytes", linkageName: "?bytes@halide_type_t@@QEBAHXZ", scope: !465, file: !397, line: 481, type: !499, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(types: !500)
!500 = !{!14, !490}
!501 = !DISubprogram(name: "as_u32", linkageName: "?as_u32@halide_type_t@@QEBAIXZ", scope: !465, file: !397, line: 485, type: !502, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!502 = !DISubroutineType(types: !503)
!503 = !{!16, !490}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dimensions", scope: !453, file: !397, line: 1442, baseType: !12, size: 32, offset: 288)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !453, file: !397, line: 1446, baseType: !506, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_dimension_t", file: !397, line: 1409, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_dimension_t", file: !397, line: 1381, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !509, identifier: ".?AUhalide_dimension_t@@")
!509 = !{!510, !511, !512, !513, !514, !518, !521, !527}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !508, file: !397, line: 1383, baseType: !12, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !508, file: !397, line: 1383, baseType: !12, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !508, file: !397, line: 1383, baseType: !12, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !397, line: 1386, baseType: !16, size: 32, offset: 96)
!514 = !DISubprogram(name: "halide_dimension_t", scope: !508, file: !397, line: 1388, type: !515, scopeLine: 1388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!518 = !DISubprogram(name: "halide_dimension_t", scope: !508, file: !397, line: 1389, type: !519, scopeLine: 1389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !517, !12, !12, !12, !16}
!521 = !DISubprogram(name: "operator==", linkageName: "??8halide_dimension_t@@QEBA_NAEBU0@@Z", scope: !508, file: !397, line: 1393, type: !522, scopeLine: 1393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!522 = !DISubroutineType(types: !523)
!523 = !{!363, !524, !526}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!526 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !525, size: 64)
!527 = !DISubprogram(name: "operator!=", linkageName: "??9halide_dimension_t@@QEBA_NAEBU0@@Z", scope: !508, file: !397, line: 1400, type: !522, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !453, file: !397, line: 1449, baseType: !31, size: 64, offset: 384)
!529 = !DISubprogram(name: "get_flag", linkageName: "?get_flag@halide_buffer_t@@QEBA_NW4halide_buffer_flags@@@Z", scope: !453, file: !397, line: 1454, type: !530, scopeLine: 1454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DISubroutineType(types: !531)
!531 = !{!363, !532, !534}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_flags", file: !397, line: 1416, baseType: !535)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 1415, baseType: !14, size: 32, elements: !536, identifier: ".?AW4halide_buffer_flags@@")
!536 = !{!537, !538}
!537 = !DIEnumerator(name: "halide_buffer_flag_host_dirty", value: 1)
!538 = !DIEnumerator(name: "halide_buffer_flag_device_dirty", value: 2)
!539 = !DISubprogram(name: "set_flag", linkageName: "?set_flag@halide_buffer_t@@QEAAXW4halide_buffer_flags@@_N@Z", scope: !453, file: !397, line: 1458, type: !540, scopeLine: 1458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542, !534, !363}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!543 = !DISubprogram(name: "host_dirty", linkageName: "?host_dirty@halide_buffer_t@@QEBA_NXZ", scope: !453, file: !397, line: 1466, type: !544, scopeLine: 1466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DISubroutineType(types: !545)
!545 = !{!363, !532}
!546 = !DISubprogram(name: "device_dirty", linkageName: "?device_dirty@halide_buffer_t@@QEBA_NXZ", scope: !453, file: !397, line: 1470, type: !544, scopeLine: 1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DISubprogram(name: "set_host_dirty", linkageName: "?set_host_dirty@halide_buffer_t@@QEAAX_N@Z", scope: !453, file: !397, line: 1474, type: !548, scopeLine: 1474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !542, !363}
!550 = !DISubprogram(name: "set_device_dirty", linkageName: "?set_device_dirty@halide_buffer_t@@QEAAX_N@Z", scope: !453, file: !397, line: 1478, type: !548, scopeLine: 1478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubprogram(name: "number_of_elements", linkageName: "?number_of_elements@halide_buffer_t@@QEBAKXZ", scope: !453, file: !397, line: 1485, type: !552, scopeLine: 1485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(types: !553)
!553 = !{!29, !532}
!554 = !DISubprogram(name: "begin", linkageName: "?begin@halide_buffer_t@@QEBAPEAEXZ", scope: !453, file: !397, line: 1495, type: !555, scopeLine: 1495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubroutineType(types: !556)
!556 = !{!460, !532}
!557 = !DISubprogram(name: "end", linkageName: "?end@halide_buffer_t@@QEBAPEAEXZ", scope: !453, file: !397, line: 1506, type: !555, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!558 = !DISubprogram(name: "size_in_bytes", linkageName: "?size_in_bytes@halide_buffer_t@@QEBAKXZ", scope: !453, file: !397, line: 1518, type: !552, scopeLine: 1518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DISubprogram(name: "address_of", linkageName: "?address_of@halide_buffer_t@@QEBAPEAEPEBH@Z", scope: !453, file: !397, line: 1523, type: !560, scopeLine: 1523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!560 = !DISubroutineType(types: !561)
!561 = !{!460, !532, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!563 = !DISubprogram(name: "device_sync", linkageName: "?device_sync@halide_buffer_t@@QEAAHPEAX@Z", scope: !453, file: !397, line: 1534, type: !564, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DISubroutineType(types: !565)
!565 = !{!14, !542, !31}
!566 = !DISubprogram(name: "is_bounds_query", linkageName: "?is_bounds_query@halide_buffer_t@@QEBA_NXZ", scope: !453, file: !397, line: 1545, type: !544, scopeLine: 1545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !446, file: !397, line: 726, baseType: !568, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!14, !31, !452}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !446, file: !397, line: 727, baseType: !568, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !446, file: !397, line: 728, baseType: !573, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !31, !457}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !446, file: !397, line: 730, baseType: !568, size: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !446, file: !397, line: 731, baseType: !449, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !446, file: !397, line: 733, baseType: !449, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !446, file: !397, line: 735, baseType: !568, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !446, file: !397, line: 736, baseType: !581, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!14, !31, !452, !457, !452}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !446, file: !397, line: 738, baseType: !585, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!14, !31, !588, !452}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !446, file: !397, line: 740, baseType: !590, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!14, !31, !588, !14, !14, !452}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !446, file: !397, line: 742, baseType: !568, size: 64, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !446, file: !397, line: 743, baseType: !595, size: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!14, !31, !452, !41, !457}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !446, file: !397, line: 745, baseType: !568, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "compute_capability", scope: !446, file: !397, line: 746, baseType: !600, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!14, !31, !603, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !446, file: !397, line: 747, baseType: !605, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "halide_device_interface_impl_t", file: !608, line: 10, size: 1024, flags: DIFlagTypePassByValue, elements: !609, identifier: ".?AUhalide_device_interface_impl_t@@")
!608 = !DIFile(filename: "src/runtime/device_interface.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "973e1c360c8f9d0d9344920815b6525d")
!609 = !{!610, !614, !615, !616, !617, !618, !622, !623, !624, !625, !626, !627, !628, !629, !630, !634}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "use_module", scope: !607, file: !608, line: 16, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "release_module", scope: !607, file: !608, line: 17, baseType: !611, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "device_malloc", scope: !607, file: !608, line: 18, baseType: !568, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "device_free", scope: !607, file: !608, line: 19, baseType: !568, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "device_sync", scope: !607, file: !608, line: 20, baseType: !568, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "device_release", scope: !607, file: !608, line: 21, baseType: !619, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!14, !31}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_host", scope: !607, file: !608, line: 22, baseType: !568, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to_device", scope: !607, file: !608, line: 23, baseType: !568, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_malloc", scope: !607, file: !608, line: 24, baseType: !568, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "device_and_host_free", scope: !607, file: !608, line: 25, baseType: !568, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_copy", scope: !607, file: !608, line: 26, baseType: !581, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "device_crop", scope: !607, file: !608, line: 28, baseType: !585, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "device_slice", scope: !607, file: !608, line: 31, baseType: !590, size: 64, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "device_release_crop", scope: !607, file: !608, line: 35, baseType: !568, size: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_native", scope: !607, file: !608, line: 37, baseType: !631, size: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!14, !31, !452, !41}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "detach_native", scope: !607, file: !608, line: 38, baseType: !568, size: 64, offset: 960)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "opencl_image_device_interface", linkageName: "?opencl_image_device_interface@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_t@@A", scope: !2, file: !332, line: 1908, type: !446, isLocal: false, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "opencl_device_interface_impl", linkageName: "?opencl_device_interface_impl@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_impl_t@@A", scope: !2, file: !332, line: 1497, type: !607, isLocal: false, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "opencl_image_device_interface_impl", linkageName: "?opencl_image_device_interface_impl@OpenCL@Internal@Runtime@Halide@@3Uhalide_device_interface_impl_t@@A", scope: !2, file: !332, line: 1889, type: !607, isLocal: false, isDefinition: true)
!641 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !642, producer: "Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !643, retainedTypes: !691, globals: !988, imports: !1013, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde/src/runtime/windows_opencl.cpp", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "06f9b16887f2917afcaaf7cdb8c0b33d")
!643 = !{!469, !535, !644}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "halide_error_code_t", file: !397, line: 990, baseType: !14, size: 32, elements: !645, identifier: ".?AW4halide_error_code_t@@")
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!646 = !DIEnumerator(name: "halide_error_code_success", value: 0)
!647 = !DIEnumerator(name: "halide_error_code_generic_error", value: -1)
!648 = !DIEnumerator(name: "halide_error_code_explicit_bounds_too_small", value: -2)
!649 = !DIEnumerator(name: "halide_error_code_bad_type", value: -3)
!650 = !DIEnumerator(name: "halide_error_code_access_out_of_bounds", value: -4)
!651 = !DIEnumerator(name: "halide_error_code_buffer_allocation_too_large", value: -5)
!652 = !DIEnumerator(name: "halide_error_code_buffer_extents_too_large", value: -6)
!653 = !DIEnumerator(name: "halide_error_code_constraints_make_required_region_smaller", value: -7)
!654 = !DIEnumerator(name: "halide_error_code_constraint_violated", value: -8)
!655 = !DIEnumerator(name: "halide_error_code_param_too_small", value: -9)
!656 = !DIEnumerator(name: "halide_error_code_param_too_large", value: -10)
!657 = !DIEnumerator(name: "halide_error_code_out_of_memory", value: -11)
!658 = !DIEnumerator(name: "halide_error_code_buffer_argument_is_null", value: -12)
!659 = !DIEnumerator(name: "halide_error_code_debug_to_file_failed", value: -13)
!660 = !DIEnumerator(name: "halide_error_code_copy_to_host_failed", value: -14)
!661 = !DIEnumerator(name: "halide_error_code_copy_to_device_failed", value: -15)
!662 = !DIEnumerator(name: "halide_error_code_device_malloc_failed", value: -16)
!663 = !DIEnumerator(name: "halide_error_code_device_sync_failed", value: -17)
!664 = !DIEnumerator(name: "halide_error_code_device_free_failed", value: -18)
!665 = !DIEnumerator(name: "halide_error_code_no_device_interface", value: -19)
!666 = !DIEnumerator(name: "halide_error_code_matlab_init_failed", value: -20)
!667 = !DIEnumerator(name: "halide_error_code_matlab_bad_param_type", value: -21)
!668 = !DIEnumerator(name: "halide_error_code_internal_error", value: -22)
!669 = !DIEnumerator(name: "halide_error_code_device_run_failed", value: -23)
!670 = !DIEnumerator(name: "halide_error_code_unaligned_host_ptr", value: -24)
!671 = !DIEnumerator(name: "halide_error_code_bad_fold", value: -25)
!672 = !DIEnumerator(name: "halide_error_code_fold_factor_too_small", value: -26)
!673 = !DIEnumerator(name: "halide_error_code_requirement_failed", value: -27)
!674 = !DIEnumerator(name: "halide_error_code_buffer_extents_negative", value: -28)
!675 = !DIEnumerator(name: "halide_error_code_unused_29", value: -29)
!676 = !DIEnumerator(name: "halide_error_code_unused_30", value: -30)
!677 = !DIEnumerator(name: "halide_error_code_specialize_fail", value: -31)
!678 = !DIEnumerator(name: "halide_error_code_device_wrap_native_failed", value: -32)
!679 = !DIEnumerator(name: "halide_error_code_device_detach_native_failed", value: -33)
!680 = !DIEnumerator(name: "halide_error_code_host_is_null", value: -34)
!681 = !DIEnumerator(name: "halide_error_code_bad_extern_fold", value: -35)
!682 = !DIEnumerator(name: "halide_error_code_device_interface_no_device", value: -36)
!683 = !DIEnumerator(name: "halide_error_code_host_and_device_dirty", value: -37)
!684 = !DIEnumerator(name: "halide_error_code_buffer_is_null", value: -38)
!685 = !DIEnumerator(name: "halide_error_code_device_buffer_copy_failed", value: -39)
!686 = !DIEnumerator(name: "halide_error_code_device_crop_unsupported", value: -40)
!687 = !DIEnumerator(name: "halide_error_code_device_crop_failed", value: -41)
!688 = !DIEnumerator(name: "halide_error_code_incompatible_device_interface", value: -42)
!689 = !DIEnumerator(name: "halide_error_code_bad_dimensions", value: -43)
!690 = !DIEnumerator(name: "halide_error_code_device_dirty_with_no_device_support", value: -44)
!691 = !{!31, !692, !41, !769, !774, !14, !81, !138, !29, !841, !842, !843, !401, !844, !62, !698, !846, !851, !855, !859, !862, !867, !870, !878, !881, !884, !887, !890, !893, !896, !899, !902, !909, !912, !916, !919, !925, !930, !933, !939, !942, !945, !948, !951, !957, !960, !963, !966, !969, !972, !975, !978, !981, !984, !987, !411, !16, !381}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "debug", scope: !694, file: !693, line: 203, baseType: !695)
!693 = !DIFile(filename: "src/runtime/printer.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "a97d2909b01229a33f8a6f2cb0fa6ab8")
!694 = !DINamespace(scope: !3)
!695 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<0,1024>", scope: !694, file: !693, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !696, templateParams: !766, identifier: ".?AV?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@")
!696 = !{!697, !699, !700, !701, !702, !703, !705, !709, !713, !716, !719, !722, !725, !729, !732, !735, !739, !742, !748, !751, !754, !759, !760, !763, !764, !765}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !695, file: !693, line: 32, baseType: !698, size: 64, flags: DIFlagPublic)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !695, file: !693, line: 32, baseType: !698, size: 64, offset: 64, flags: DIFlagPublic)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !695, file: !693, line: 32, baseType: !698, size: 64, offset: 128, flags: DIFlagPublic)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !695, file: !693, line: 33, baseType: !31, size: 64, offset: 192, flags: DIFlagPublic)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !695, file: !693, line: 34, baseType: !363, size: 8, offset: 256, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !695, file: !693, line: 35, baseType: !704, size: 8, offset: 264, flags: DIFlagPublic)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !402)
!705 = !DISubprogram(name: "Printer", scope: !695, file: !693, line: 37, type: !706, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !708, !31, !698}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!709 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@PEBD@Z", scope: !695, file: !693, line: 57, type: !710, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !708, !87}
!712 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !695, size: 64)
!713 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@_J@Z", scope: !695, file: !693, line: 67, type: !714, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!714 = !DISubroutineType(types: !715)
!715 = !{!712, !708, !62}
!716 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@H@Z", scope: !695, file: !693, line: 72, type: !717, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!717 = !DISubroutineType(types: !718)
!718 = !{!712, !708, !12}
!719 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@_K@Z", scope: !695, file: !693, line: 77, type: !720, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!720 = !DISubroutineType(types: !721)
!721 = !{!712, !708, !41}
!722 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@I@Z", scope: !695, file: !693, line: 82, type: !723, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DISubroutineType(types: !724)
!724 = !{!712, !708, !16}
!725 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@N@Z", scope: !695, file: !693, line: 87, type: !726, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!726 = !DISubroutineType(types: !727)
!727 = !{!712, !708, !728}
!728 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!729 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@M@Z", scope: !695, file: !693, line: 92, type: !730, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!730 = !DISubroutineType(types: !731)
!731 = !{!712, !708, !406}
!732 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@PEBX@Z", scope: !695, file: !693, line: 97, type: !733, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DISubroutineType(types: !734)
!734 = !{!712, !708, !90}
!735 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV1?A0xEE9BEA30@234@G@Z", scope: !695, file: !693, line: 102, type: !736, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DISubroutineType(types: !737)
!737 = !{!712, !708, !738}
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!739 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@AEBUhalide_type_t@@@Z", scope: !695, file: !693, line: 108, type: !740, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!740 = !DISubroutineType(types: !741)
!741 = !{!712, !708, !495}
!742 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@AEBUhalide_buffer_t@@@Z", scope: !695, file: !693, line: 113, type: !743, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DISubroutineType(types: !744)
!744 = !{!712, !708, !745}
!745 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "halide_buffer_t", file: !397, line: 1550, baseType: !453)
!748 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !695, file: !693, line: 119, type: !749, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!87, !708}
!751 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAXXZ", scope: !695, file: !693, line: 131, type: !752, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !708}
!754 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEBA_KXZ", scope: !695, file: !693, line: 139, type: !755, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{!41, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!759 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEBA_KXZ", scope: !695, file: !693, line: 143, type: !755, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAXH@Z", scope: !695, file: !693, line: 148, type: !761, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !708, !14}
!763 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !695, file: !693, line: 158, type: !749, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!764 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$0A@$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAXXZ", scope: !695, file: !693, line: 162, type: !752, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubprogram(name: "~Printer", scope: !695, file: !693, line: 166, type: !752, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!766 = !{!767, !768}
!767 = !DITemplateValueParameter(name: "type", type: !14, value: i32 0)
!768 = !DITemplateValueParameter(name: "length", type: !42, value: i64 1024)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_handle", scope: !2, file: !332, line: 290, size: 128, flags: DIFlagTypePassByValue, elements: !771, identifier: ".?AUdevice_handle@OpenCL@Internal@Runtime@Halide@@")
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !770, file: !332, line: 294, baseType: !41, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !770, file: !332, line: 295, baseType: !138, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", scope: !694, file: !693, line: 199, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Printer<1,1024>", scope: !694, file: !693, line: 30, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !776, templateParams: !839, identifier: ".?AV?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@")
!776 = !{!777, !778, !779, !780, !781, !782, !783, !787, !791, !794, !797, !800, !803, !806, !809, !812, !815, !818, !821, !824, !827, !832, !833, !836, !837, !838}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !775, file: !693, line: 32, baseType: !698, size: 64, flags: DIFlagPublic)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !775, file: !693, line: 32, baseType: !698, size: 64, offset: 64, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !775, file: !693, line: 32, baseType: !698, size: 64, offset: 128, flags: DIFlagPublic)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "user_context", scope: !775, file: !693, line: 33, baseType: !31, size: 64, offset: 192, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "own_mem", scope: !775, file: !693, line: 34, baseType: !363, size: 8, offset: 256, flags: DIFlagPublic)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !775, file: !693, line: 35, baseType: !704, size: 8, offset: 264, flags: DIFlagPublic)
!783 = !DISubprogram(name: "Printer", scope: !775, file: !693, line: 37, type: !784, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !786, !31, !698}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!787 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@PEBD@Z", scope: !775, file: !693, line: 57, type: !788, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!788 = !DISubroutineType(types: !789)
!789 = !{!790, !786, !87}
!790 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !775, size: 64)
!791 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@_J@Z", scope: !775, file: !693, line: 67, type: !792, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!790, !786, !62}
!794 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@H@Z", scope: !775, file: !693, line: 72, type: !795, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!795 = !DISubroutineType(types: !796)
!796 = !{!790, !786, !12}
!797 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@_K@Z", scope: !775, file: !693, line: 77, type: !798, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!798 = !DISubroutineType(types: !799)
!799 = !{!790, !786, !41}
!800 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@I@Z", scope: !775, file: !693, line: 82, type: !801, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DISubroutineType(types: !802)
!802 = !{!790, !786, !16}
!803 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@N@Z", scope: !775, file: !693, line: 87, type: !804, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!804 = !DISubroutineType(types: !805)
!805 = !{!790, !786, !728}
!806 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@M@Z", scope: !775, file: !693, line: 92, type: !807, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubroutineType(types: !808)
!808 = !{!790, !786, !406}
!809 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@PEBX@Z", scope: !775, file: !693, line: 97, type: !810, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubroutineType(types: !811)
!811 = !{!790, !786, !90}
!812 = !DISubprogram(name: "write_float16_from_bits", linkageName: "?write_float16_from_bits@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV1?A0xEE9BEA30@234@G@Z", scope: !775, file: !693, line: 102, type: !813, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!813 = !DISubroutineType(types: !814)
!814 = !{!790, !786, !738}
!815 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@AEBUhalide_type_t@@@Z", scope: !775, file: !693, line: 108, type: !816, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(types: !817)
!817 = !{!790, !786, !495}
!818 = !DISubprogram(name: "operator<<", linkageName: "??6?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAAEAV0?A0xEE9BEA30@123@AEBUhalide_buffer_t@@@Z", scope: !775, file: !693, line: 113, type: !819, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubroutineType(types: !820)
!820 = !{!790, !786, !745}
!821 = !DISubprogram(name: "str", linkageName: "?str@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !775, file: !693, line: 119, type: !822, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!822 = !DISubroutineType(types: !823)
!823 = !{!87, !786}
!824 = !DISubprogram(name: "clear", linkageName: "?clear@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAXXZ", scope: !775, file: !693, line: 131, type: !825, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !786}
!827 = !DISubprogram(name: "size", linkageName: "?size@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEBA_KXZ", scope: !775, file: !693, line: 139, type: !828, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!41, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!832 = !DISubprogram(name: "capacity", linkageName: "?capacity@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEBA_KXZ", scope: !775, file: !693, line: 143, type: !828, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubprogram(name: "erase", linkageName: "?erase@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAXH@Z", scope: !775, file: !693, line: 148, type: !834, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !786, !14}
!836 = !DISubprogram(name: "allocation_error", linkageName: "?allocation_error@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAPEBDXZ", scope: !775, file: !693, line: 158, type: !822, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubprogram(name: "msan_annotate_is_initialized", linkageName: "?msan_annotate_is_initialized@?$Printer@$00$0EAA@@?A0xEE9BEA30@Internal@Runtime@Halide@@QEAAXXZ", scope: !775, file: !693, line: 162, type: !825, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!838 = !DISubprogram(name: "~Printer", scope: !775, file: !693, line: 166, type: !825, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !{!840, !768}
!840 = !DITemplateValueParameter(name: "type", type: !14, value: i32 1)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !13, line: 28, baseType: !845)
!845 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!14, !17, !849, !850}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!14, !20, !17, !30, !31, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!14, !20, !42, !17, !858, !850}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!14, !45, !17, !30, !31, !854}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!14, !45, !865, !17, !858, !850}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!14, !45}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!77, !865, !17, !873, !875, !31, !603}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !87, !90, !30, !31}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!77, !865, !42, !875, !31, !603}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!14, !77}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!14, !77, !17, !30, !31, !854}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!117, !77, !45, !42, !603}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!14, !117}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!14, !117, !17, !30, !31, !854}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!139, !77, !42, !30, !31, !603}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!139, !139, !42, !17, !90, !603}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!139, !77, !42, !905, !907, !31, !603}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!14, !139}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!14, !77, !42, !17, !17, !915, !850}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!14, !139, !17, !30, !31, !854}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!14, !139, !922, !31}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !139, !31}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!217, !77, !17, !219, !928, !603}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!14, !217}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!14, !217, !17, !873, !87, !936, !31}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !217, !31}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!14, !217, !45, !17, !30, !31, !854}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!249, !217, !87, !603}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!14, !249}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!14, !249, !17, !30, !90}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!14, !117, !139, !17, !30, !30, !31, !17, !954, !956}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!14, !117, !139, !17, !928, !928, !928, !30, !30, !30, !30, !31, !17, !954, !956}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!14, !117, !139, !17, !30, !30, !90, !17, !954, !956}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!14, !117, !139, !17, !928, !928, !928, !30, !30, !30, !30, !90, !17, !954, !956}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!14, !117, !139, !139, !30, !30, !30, !17, !954, !956}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!14, !117, !139, !17, !928, !928, !30, !30, !31, !17, !954, !956}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!14, !117, !139, !17, !928, !928, !30, !30, !90, !17, !954, !956}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!31, !117, !139, !17, !42, !30, !30, !17, !954, !956, !603}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!31, !117, !139, !17, !42, !928, !928, !854, !854, !17, !954, !956, !603}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!14, !117, !139, !31, !17, !954, !956}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!14, !117, !249, !17, !928, !928, !928, !17, !954, !956}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!988 = !{!0, !23, !33, !47, !53, !64, !69, !71, !93, !98, !103, !105, !111, !120, !125, !127, !133, !142, !148, !178, !183, !185, !191, !197, !203, !211, !222, !227, !229, !237, !243, !251, !256, !258, !263, !265, !267, !279, !284, !289, !294, !299, !304, !309, !315, !320, !325, !330, !333, !335, !337, !354, !359, !361, !364, !366, !368, !370, !375, !377, !379, !989, !991, !993, !637, !444, !995, !997, !999, !1001, !1003, !1005, !1007, !639, !635, !1009, !1011}
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression(DW_OP_constu, 18446744073709551615, DW_OP_stack_value))
!990 = distinct !DIGlobalVariable(name: "halide_error_code_generic_error", scope: !641, file: !397, line: 995, type: !644, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression(DW_OP_constu, 18446744073709551574, DW_OP_stack_value))
!992 = distinct !DIGlobalVariable(name: "halide_error_code_incompatible_device_interface", scope: !641, file: !397, line: 1164, type: !644, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression(DW_OP_constu, 18446744073709551605, DW_OP_stack_value))
!994 = distinct !DIGlobalVariable(name: "halide_error_code_out_of_memory", scope: !641, file: !397, line: 1035, type: !644, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!996 = distinct !DIGlobalVariable(name: "halide_type_int", scope: !641, file: !397, line: 408, type: !469, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!998 = distinct !DIGlobalVariable(name: "halide_type_uint", scope: !641, file: !397, line: 409, type: !469, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!1000 = distinct !DIGlobalVariable(name: "halide_type_float", scope: !641, file: !397, line: 410, type: !469, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression(DW_OP_constu, 18446744073709551600, DW_OP_stack_value))
!1002 = distinct !DIGlobalVariable(name: "halide_error_code_device_malloc_failed", scope: !641, file: !397, line: 1057, type: !644, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression(DW_OP_constu, 18446744073709551577, DW_OP_stack_value))
!1004 = distinct !DIGlobalVariable(name: "halide_error_code_device_buffer_copy_failed", scope: !641, file: !397, line: 1150, type: !644, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression(DW_OP_constu, 18446744073709551584, DW_OP_stack_value))
!1006 = distinct !DIGlobalVariable(name: "halide_error_code_device_wrap_native_failed", scope: !641, file: !397, line: 1118, type: !644, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression(DW_OP_constu, 18446744073709551576, DW_OP_stack_value))
!1008 = distinct !DIGlobalVariable(name: "halide_error_code_device_crop_unsupported", scope: !641, file: !397, line: 1154, type: !644, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!1010 = distinct !DIGlobalVariable(name: "halide_buffer_flag_device_dirty", scope: !641, file: !397, line: 1416, type: !535, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!1012 = distinct !DIGlobalVariable(name: "halide_buffer_flag_host_dirty", scope: !641, file: !397, line: 1415, type: !535, isLocal: true, isDefinition: true)
!1013 = !{!1014, !1015}
!1014 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !641, entity: !3, file: !13, line: 225)
!1015 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !641, entity: !2, file: !332, line: 107)
!1016 = !{i32 2, !"CodeView", i32 1}
!1017 = !{i32 2, !"Debug Info Version", i32 3}
!1018 = !{i32 1, !"wchar_size", i32 4}
!1019 = !{!"Ubuntu clang version 12.0.0-++20210305074957+d24e102ba266-1~exp1~20210305185701.56"}
!1020 = distinct !DISubprogram(name: "copy_memory_helper", linkageName: "?copy_memory_helper@Internal@Runtime@Halide@@YAXAEBUdevice_copy@123@H_J1@Z", scope: !3, file: !1021, line: 47, type: !1022, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !641, retainedNodes: !1038)
!1021 = !DIFile(filename: "src/runtime/device_buffer_utils.h", directory: "/media/maaz/Data/Repos/rake/Halide-master-d48fbde", checksumkind: CSK_MD5, checksum: "01ded04610775bfbd39cee48a3f67c54")
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !1024, !14, !62, !62}
!1024 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_copy", scope: !3, file: !1021, line: 33, size: 3328, flags: DIFlagTypePassByValue, elements: !1027, identifier: ".?AUdevice_copy@Internal@Runtime@Halide@@")
!1027 = !{!1028, !1029, !1030, !1031, !1035, !1036, !1037}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1026, file: !1021, line: 35, baseType: !41, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !1026, file: !1021, line: 35, baseType: !41, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "src_begin", scope: !1026, file: !1021, line: 37, baseType: !41, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !1026, file: !1021, line: 39, baseType: !1032, size: 1024, offset: 192)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1024, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 16)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "src_stride_bytes", scope: !1026, file: !1021, line: 41, baseType: !1032, size: 1024, offset: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dst_stride_bytes", scope: !1026, file: !1021, line: 42, baseType: !1032, size: 1024, offset: 2240)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1026, file: !1021, line: 44, baseType: !41, size: 64, offset: 3264)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1046, !1047}
!1039 = !DILocalVariable(name: "dst_off", arg: 4, scope: !1020, file: !1021, line: 47, type: !62)
!1040 = !DILocalVariable(name: "src_off", arg: 3, scope: !1020, file: !1021, line: 47, type: !62)
!1041 = !DILocalVariable(name: "d", arg: 2, scope: !1020, file: !1021, line: 47, type: !14)
!1042 = !DILocalVariable(name: "copy", arg: 1, scope: !1020, file: !1021, line: 47, type: !1024)
!1043 = !DILocalVariable(name: "from", scope: !1044, file: !1021, line: 54, type: !90)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !1021, line: 53)
!1045 = distinct !DILexicalBlock(scope: !1020, file: !1021, line: 53)
!1046 = !DILocalVariable(name: "to", scope: !1044, file: !1021, line: 55, type: !31)
!1047 = !DILocalVariable(name: "i", scope: !1048, file: !1021, line: 58, type: !41)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !1021, line: 58)
!1049 = distinct !DILexicalBlock(scope: !1045, file: !1021, line: 57)
!1050 = !DILocation(line: 0, scope: !1020)
!1051 = !DILocation(line: 49, scope: !1020)
!1052 = !{!1053, !1053, i64 0}
!1053 = !{!"long long", !1054, i64 0}
!1054 = !{!"omnipotent char", !1055, i64 0}
!1055 = !{!"Simple C++ TBAA"}
!1056 = !DILocation(line: 50, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1020, file: !1021, line: 49)
!1058 = distinct !{!1058, !1051, !1059, !1060}
!1059 = !DILocation(line: 51, scope: !1020)
!1060 = !{!"llvm.loop.mustprogress"}
!1061 = !DILocation(line: 53, scope: !1020)
!1062 = !DILocation(line: 0, scope: !1048)
!1063 = !DILocation(line: 58, scope: !1048)
!1064 = !DILocation(line: 54, scope: !1044)
!1065 = !{!1066, !1053, i64 0}
!1066 = !{!"?AUdevice_copy@Internal@Runtime@Halide@@", !1053, i64 0, !1053, i64 8, !1053, i64 16, !1054, i64 24, !1054, i64 152, !1054, i64 280, !1053, i64 408}
!1067 = !DILocation(line: 0, scope: !1044)
!1068 = !DILocation(line: 55, scope: !1044)
!1069 = !{!1066, !1053, i64 8}
!1070 = !DILocation(line: 56, scope: !1044)
!1071 = !{!1066, !1053, i64 408}
!1072 = !DILocation(line: 57, scope: !1044)
!1073 = !DILocation(line: 59, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !1021, line: 58)
!1075 = distinct !DILexicalBlock(scope: !1048, file: !1021, line: 58)
!1076 = !DILocation(line: 60, scope: !1074)
!1077 = !DILocation(line: 61, scope: !1074)
!1078 = !DILocation(line: 58, scope: !1075)
!1079 = distinct !{!1079, !1063, !1080, !1060}
!1080 = !DILocation(line: 62, scope: !1048)
!1081 = !DILocation(line: 64, scope: !1020)
!1082 = distinct !DISubprogram(name: "copy_memory", linkageName: "?copy_memory@Internal@Runtime@Halide@@YAXAEBUdevice_copy@123@PEAX@Z", scope: !3, file: !1021, line: 66, type: !1083, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !641, retainedNodes: !1085)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1024, !31}
!1085 = !{!1086, !1087}
!1086 = !DILocalVariable(name: "user_context", arg: 2, scope: !1082, file: !1021, line: 66, type: !31)
!1087 = !DILocalVariable(name: "copy", arg: 1, scope: !1082, file: !1021, line: 66, type: !1024)
!1088 = !DILocation(line: 0, scope: !1082)
!1089 = !DILocation(line: 68, scope: !1082)
!1090 = !DILocation(line: 69, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !1021, line: 68)
!1092 = distinct !DILexicalBlock(scope: !1082, file: !1021, line: 68)
!1093 = !{!1066, !1053, i64 16}
!1094 = !DILocation(line: 70, scope: !1091)
